["If you want to know about the brain it's in thought word and deed and the lord's prayer our Father who art in heaven is the stars and each star is each man's father and the star of bethlehem is the sun thats my father and light and I realised my dreams are China in ur hand like song by 80s pop group tpau and that's why it's for me to sleep in heavenly peace  cos my star is closest to earth and their are 100 billion brain cells and it would take a few thousand years to use them and the fruit of knowledge is the brain  and if you eat of it you will know a lot which is normal cos u have to learn and it's not my fault I was called andrew in this lifetime and if the shroud of turin is proved to be from the 12th century I was probably caught again and yes I'm real and i woke up spiritualy in 1988 and as I said each star is each man's father and the star of bethlehem is the sun thats my father and light and I don't like revealing myself cos you might crucify me again and I'm only human too wen I'm on earth from andy in Liverpool England UK", "What about ambidextrous people?? There are things I can do with both hands equally and sometimes favor my Left Hand even though I am Right Handed...", "Food  he eat  ...not  enough  sleep  toomuch  thinking  ..plus worry", "You mean religion isn't a cure for mental illness?", "Brain is the steering wheel of a soul. Train your brain, free your soul from incapabilities. Use Neurofeedback mental fitness training", "As usual I'm in the middle.", "Yes this is what I had told y'all. When I said I felt connected in a way I couldn't explain", "hhhhh now like i go STUF MARKET", "Simple. Music denotes our passing age, and it also punctuates the memorable events that occurred in our lives since our youth. Today I cannot bear to listen to what is IN, or HIP. Preferring the old hits that are more intelligible. But I am far more partial to instrumental Jazz Fusion.", "So????  It is not news that someone would have 'no use' for the soul.  It is just simply very, very sad.", "Because we hear beats for 9 months Der.", "Of COURSE!  You didn't need a study to figure that out.", "As a researcher of the internet for over 10 years my professional opinion is that my shoe has a soul. Unfortunately my soul can not be upgraded unlike my shoe soul.", "and we're still stupid. go figure", "This study shows that people will believe anything on Facebook lol", "Positive mental health should be taught in schools from the early years on.", "Zor Adith --+ tudlo e ninyu ug Japanese ug Spanish hahahaha", "What do you think Janie Durbin?", "Whole brain, whole brain, whole brain!", "You would think psychology would make room for the notion that the physical mind produces consciousness which then constructs its own mental reality in order to make sense of itself and in some cases that construct includes a soul.  But sure, in the duality context... NO SOUL FOR YOU!", "Anupriya Sivakumar this is ironic because many people go into psychology for soul searching purposes--hoping to learn something about themselves. I've felt like psychology has repeated time after time the external and chemical factors that make us who we are. There is no soul in that sense.", "A lot of philosophers very pissed off with you right now", "Hi everyone , for what it's worth this way of looking at the brain is not accepted by most studies .", "Music is an instrument of the soul. To mend where the soul is rent. To warm where the soul is cold. To pierce where the soul is stone. The soul speaks thru music, which springs from the soul.", "\"dyslexic are teople poo\" was the best t-shirt i've ever seen.", "one thing I know..because society is built along right handed norms-scissors, writing, turning a door handle, etc, lefties learn to use both hands better than righties do. Being left handed was also a great advantage in sports-righties don't know what to do with you,  Lefties also die younger, but that's probably because righties suck  :)", "because our brain will never shut up and stop producing crazy ass stuff", "Oh my god, you're posting this one again!? Of all the posts you're choosing this one?!...The rest of the Psychological community moved on from this kind of utter  nonsense year's ago, please guys, it is not the 1950s! Catch up...", "Shaminder Cheema. Gets the best of us. x", "Oh, you mean it's not witchery?", "So that's what is wrong with him, I've been wondering why he was all for Hillary Clinton winning the presidency, had no idea that he was a socialist, sorry, but I use to love his music, but not loving the socialist ideology, hope he gets the help he needs, he has plenty of money so he can get the best doctors unlike the rest of the population that doesn't have such great health coverage", "Latest studies on this do not support the distinctions between left & right hemispheres. There is no such.", "lyrics, better learn what behind the words that can fit", "Sounds like a really good read. Being a musician though, having to balance the stressful challenges that are faced personally and professionally with the sheer joy and experience of creating music (which may deteriorate over time because of the stressors), can often be a challenge. I'm interested in exploring this path more sometime...Anyone into \"musican\" psychology?", "Women are not good when it comes to  global solutions....", "Ha  ha  ha  nose  ....eyes  tell  everything  ...", "The brain is to complex to have \"evolved.\"", "Snails are a delicacy. We need a rich pop artist to do it first before e everyone else jumps in. If that piece of garbage rapper lil Wayne did it I bet the rest of the united states will too.", "The existence of a \"soul\" was discredited years ago.", "Et Victor Hugo a dit : \"La musique c du bruit qui pense..\"", "If you construct a brain that works, I will believe you, but until you have proof by a reproducible procedure, you are just one more Godless person crying out in your lifeless world that ends at physical death.", "The doctor already said  do not think negative think positive", "Health is like Money,we never have a true idea of its value until we lose it. Follow us to get healthy tips everyday.", "This is a good article for the holidays.", "According to  me meaning  of research  is to concentrate on things, psychology  goes on pyramid theory and many more but go and give check  swami rammana  personality  traits  wat  category  he comes in", "Success does not equate to the absence of criminality. These two things are not mutually exclusive.  In fact, they are likely loosely correlated.", "Yes God was making every thing it is to complex  for evolded . But human do not want believe in God . He made us . And have to explane us anything . To difficult for human being too difficult to understand. Example the brains", "I love death metal cuz it's very relaxing for me", "No really? The marvels of modern psychology.", "It can be explained well but", "The most beautiful people you'll ever meet aren't always the ones who catch your eyes first. No, the most beautiful are the ones that can never be figured out. The one you could talk with for many hours and still have a million things to ask. The people who have mind so lovely and special, you can help but fall in love with them.\tfollow us", "My handwriting was changed from left to right by the nuns back in 55 so which side of my brain do I use??..", "and monkeys fly out of psychopaths asses too....", "We use both of them to function properly ,thus this is an unproven myth which mustn't be spread all over the internet ,since the majority believe abstract psychological theories .", "Elinor Raw-Rees just in case it's useful? xx", "I was left-handed when I started grammar school and now I'm ambidextrous .\nI think it helped in my case.", "Hahahahaa \"over many hundreds of millions of years\"... Says who? Is that even testable? See? Evolution is a fairy tale. There's no evidence at all.", "There is nothing left for the soul to do but survive death", "The reaction of people knowing they are being monitored is extremely revealing...and that is the real reason for the monitoring.", "The word science for me is equal to 'maybe', 'suppose', 'presume', 'for the moment', 'it is possible'. Science is very far from the truth and also very stupid to confirm things without facts, proof and real knowledge.", "Cristyna Murray much vocabulary Read it.", "This is depend on our own Mind what would u learnt..", "NeurOptimal Neurofeedback Systems can free you also from alcohol addiction, with a high success rate", "Thats dumb, now they'll just smoke more cigs to make up for the loss", "Soul, in my observation, is a terminology for Consciousness. Consider then, what happens to us when we lose consciousness to sleep each night. Yes, our brain is responsible for the dreams or nightmares, but what about during surgery under GA; how does one see one's own body from the ceiling down, and knows to follow it when one's body is being carted out of the OR into the recovery room? What is that then? I also ask, where did the 5v electrical energy come from in order that our brain functions. Is it not Life's Energy? Aren't souls, consciousness, and electrons in the atomic and subatomic level and beyond the size of molecular cellular realm?", "This was painfully stupid the first time you posted it.  Same result today.", "Why do you keep saying this? Do you have evidence? Not heckling you...just curious cuz I hope you do", "in a society that praises the egotist, sure.", "Both hemispheres communicate while while performing pretty much all of those tasks.", "Metaphorically speaking, I have a soul, an aura, and very good karma. Scientifically speaking, I know it's just neurotransmitters and nerves that control my body including heart - but science does not make good poetry.", "John Perry here's another idea - I have relevant data here :)", "I can't say that I find his arguments very convincing. Music may well have the effects he describes, but it's a big jump from that to suggest that that's its purpose.  His comment on language is frankly naive.", "Like zombies walking around with friggen earphones in staring stupidly into phones,where's a gun when ya need one?", "And all the gay comments come out. The mind is not that difficult to understand. Its how it's thought about.", "Because many monkeys make a living off riding the backs of climbers.  My father always made sure I knew that.  Citizenship is the ultimate monkey trap.", "psychology stopped being a science with freud.  pick what you want and work backwards til you get it.  not scientific in the least", "To be fleshed out with time.", "Jim Thompson didn't read that but could be interesting for your ideas (music and the self, conflict theory)", "Science much? I can use data while ignoring other data to prove any point, if i want.", "No such thing as being left or right brained.", "Its an very large defination to explain", "Amanda Lea - related to what we were discussing last night", "Well, someone needs to give 'em a hug, a participation trophy, and a swift kick in the ass.", "In next week's headlines: How Catering to an Internet Audience Undermines the Credibility of Scholarly Sources.", "The best way to help autism is using Neurofeedback mental fitness training.", "it's also called reapeated thoughts or repeated behaviour???", "My Autistic son is mostly left handed. Writes, catches with his left hand, but eats and reaches for things with his right. He is non verbal but pretty smart.", "cause of dementia is unknown but predispose factor are underlying cause like over cousinmption of alcohol for long period of time, smoking,", "I agree that both hemisheres work simultaneously in coordination. However, lesion or affliction in certain hemisphere does affect specific motor and cognitive capacities. For example, thrombosis or clotting in the left side influences verbal and linguistic capacities.", "Not in my case.  If they gun me down, they gun me down  I don't have bad intentions towards society in the first place", "True either you listen natural music when tree making sounds by its flexibly and birds singing along with sounds", "I don't suck up, but I have seen it play out many, many times.", "But the bad thing is that it will make it hard for them to speak", "Let's all learn the symptoms of mental illness.", "how about stop giving girls pink and boys blue when they are little, how about stop telling boys to stop being whinny little girls, how about just letting kids grow up playing with and wearing what they want rather than what you the parents want, how about stop calling girls who like to get dirty and fix things tomboys, how about allowing them the privilege of being who they wish to be rather than what you the parents push upon them, I find that works", "Handedness displays a complex inheritance pattern. A large study of twins from 25,732 families by Medland et al. (2006) has indicated that the heritability of handedness is roughly 24%. So the environment  weight   the parent education , play a very important rule ( 76%).", "Show the school Claire Wilson hahaha xxx", "I studies Psychology, animal Psychology and Metaphysics and must say that I very much disagree with this article. I have seen, heard and felt spirits since I was 3 years old. I got messages from beyond so strongly that actually helped me to avoid dangerous situations. Only those who have never been so fortunate can say there is no soul. I studies Science in Psychology and found that science go so far, and not further....there is a existence after death, and we do have a soul.....I have contact with many of the souls that passed...both human and animals.....", "I think this may be interesting to you, Vitor Stipanich.", "The trolls on here are amazing!!", "We know why we dream. Bit old this now.", "Is this going to benefit humanity or our mental and general health in some way? That is what psychology should be asking. Otherwise the industry people are entrusting to help them manage their optimal mental health is guiding them towards behaviors and technologies that will in fact contribute to harming them or preventing them from that optimal level of health they're seeking.", "I can't listen to Andy Williams,or the 50's, I'm more into industrial, and I do listen to jazz...but the so called oldies, no...", "Yes I am left handed .feeling proud ...", "Yes he is,  no evolve believe him , look to the stars and how everything is complicated , everything has a maker, when board truien in the air there no house is heard. Nothing comes from it self .", "I have schizo affective disorder. Exercise gives me hypomania.Meds increase weight. What the heck can I do?Very irritated.", "I love music just not very good at it lol", "I guess it depends on who's invested in the memory.", "Wow sir ! Books are real and true friend of humans", "I didn't read this yet, but I've read that using your non-dominant hand can strengthen connections in your brain between hemispheres. In doing so, you might even prevent or slow the onset of Alzheimer's Disease. I'm somewhat ambidextrous, enough that I can draw steadily with my \"non-dominant\" hand.", "Lol, the brain, which is the most complex thing known to man,which man is struggling to fathom, gets credited to having evolved. Brilliant scientists, it was created. A product of intelligent design by our marvellous creator. Testimony to his supreme power. Ps 83:18.", "do you know, why the majority of. research isn't problems solving ?", "Not everyone may have a soul; some people need to be able to see, test, or measure something to believe it exist.  Thank goodness some of our greatest scientist where able to move ahead without first having so-called proof...", "Yes, and it will take another few hundred million more years, for Religion to be evolved out of people's brains.", "Don't miss next week's post: Are Geminis more creative than Scorpios?...\n...ffs....", "As a researcher in psychology and Neurology for 20 years that's rubbish. 90% of the function and neuroplastcity is based on measurable psychological physics that can't be explained by neuroscience. Absolutely tripe.", "Bogaert Pascal I think you will like this haha", "guess, it's oversimplified. probably a myth", "Music is sound to which you like listening to music is everywhere if you listen closely the first beat in life you hear is it your mothers heart or yours", "the mental illness called liberalism is what we need to fight", "I'm ambidextrous I write with my left and draw with my right both are interchangeable and I can even draw the same picture with both hands how does this study affect people like me?", "Left and right side hemispheres have been disproven. As a psychology page, you should know better.", "That's obviously a picture of a man's brain because look - there's a penis inside it.... and that's some of my psychology right there.", "Cameron Bowman William Thomas Piccirillo Danny Kreucher", "The title is completely wrong! Psychology have never studied the \"soul\" (if that thing exists). Psychology is the scientific study of BEHAVIOR.", "music is a needed for human beings in the life b/c for the refresh of the mind and for resting", "the soul is the electrical impulses of the brain...when the body and brain die these electrical pulses are set free to the cosmos", "People have a right to privacy. What one does at home on thier private servers and on thier facebook, etc is thier business. People keep a proffessional personna at work just as you would do in church. When people get home they should be allowed to say or do as they please in Thier own homes. I'm not perfect and I cuss like a sailor but I get my point across. However, I know not to do it in a professional setting. With that being said, I pay for my damned internet and I'll use it as I see fit.", "most am anxious about creating a conversation and it's been hard to allow my own brother to enter my world we hardly talk when we are together at time it can take two days without seeing him in the same house, he is up and away for work and am up in my room he comes home late and am asleep am usually new out to speak about anything", "The other senses are marked with similar capabilities...", "Teen agers should be knowledgable , about the danger and the effect of drinking alcohol , and thats why in USA , only people above twenty one are allowed to purchase and drink alcohol . The law protects the younger . Once someone is old enough , to decide for himself , he is allowed to drink alcohol , but , what I think not every one knows the risks and the dangers of over drinking . Thank you for sharing this valuable information . Wish it will help lots of people with issues of drinking .", "..and can cause a form of Dementia. .which leads to many, many more priblems..", "Read the excellent novel by Sevarion Nadiradze - \"The way of flour\", Surrealistic wonders, A new word in modern literature, The work, which deserves global solidarity, Those who believe that talent will save the world, click here, it's an amazing book to send to your friends, literary gourmets ...\nhttps://www.amazon.com/politi.../dp/B015WBCD2Y/ref=sr_1_1...", "Finding this or that relationship is not the remedy,  but waste of time and money when there is an ultimate cure like Neurofeedback mental fitness training.", "Im right handed and right brain dominated", "Music is the only brain activity requiring both hemispheres of the brain and despite \"remembering a tune\", the brain cannot store musical data, it has to create it again each time.  Comatose people can be \"brought around\" by hearing music they are familiar with as it reactivates, or can, brain activity."]