["The real promise of power density is in immersion, probably in something like 3M Novec. See 3M Novec Data Center Cooling Project.", "Awesome concept with  virtual technology", "We prefer to live in a chronological time continuum, not some Groundhog Day loop. So, thanks but no thanks.", "Hi Facebook programmers, Coders..\nI have just came about something that Facebook has not developed or integrated to Facebook profile pages.. and I am WONDERING if it's possible for you to do so.\n\nHere it's.\n\nWHY NOT POST COMMENTS IN SOUND, WAVE RECORDING FORMAT?\n\ninstead of long text format.\n\nPls do inbox me if at all Possible with a response or just tag me.\nThank you Facebook.", "Spyware for the rural folks to feel watched/connected to the Borg", "Why not allow private users making private comments and ease poster Add this poster by clicking it and save it", "ny FB nge tsy ratsy e!fa mila ianao nu mifehy azy;ao anatn izan koa ny internet", "Well that's too bad that the site is broken...", "you guyse sent it to me in a super dark time...i doubt you all knew...so thank you. you might save many lives.", "Opening the software layers of network devices by providing SDK will accelerate innovations in communication manufactures, and open-sourcing the software will bring new ideas forward faster. The challenge is to make the system at least as safe and secure as the closed system.", "Hey Facebook... Your page scrolling is STILL broken on android... Its been like this since November", "How to fill #COMEDKUGET 2016 Application Form http://www.engineering.careers360.com/articles/how-fill-comedk-uget-2016-application-form", "The song who cried the millions http://past.is/zocqa", "this is what happens when the front-end team doesn't talk to the back-end team... #facepalm", "It is really funny to praise with good optimization, and your main application is the killer of resources even within newest Android devices.", "I want my friends back on my Facebook page all lost can you sort it out thank you", "much. But is that a good reason to start bullying me?", "HELLO\nI am a social artist, singer &  poet  in Iran. Unfortunately I'm always on Facebook block. I must share my music and my lyric. Please help me and bring environmental conditions that this does not happen to me. Now I am blocked . Please help me soon. tanx", "Video. The burning of mathematics. Proving that 2+2=5\nMathematically correct 100% https://www.youtube.com/watch?v=0cYR-Hx7YCc", "my facebook page is suddenly huge and i want it back to regular size so i can read it. no other site does this so please either fix this or tell me how i can fix it", "#Ayatollah_Al_Sarkhi_a_man_of_peace\nPeace walk in all cities of Iraq calls for peace , stop Iraqi bloodshed ,cease the war and suffering of Iraqi children. This peace walk is organised by the followers of Grand Ayatollah Sayyid Al-Sarkhi Al-Hasani, the man of moderation and peace.\nHttp://e.top4top.net/p_268al1j1.png", "A fly near a banana will fly straight like an arrow.", "Facebook Engineering Why doesn't the Facebook or Messenger app use Android 6.0's app backup feature? It would make it so much easier to switch phones then", "IMO anything about social media are fantastic", "Why not WiMAX, which has a range of 50 km?", "World candidate for matchmaking.\nWith the slogan of the link of the hearts in the path of rising.\nGrowing creatures, for the continuation of their descendance have been pair-created and the continuation of their descendance and the transfer of their knowledge and experiences is not possible without marriage with the opponent gender. All of the rationalists of the world have recognized the importance of marriage, and this fact is based on ethical and social principles. We should not only look at this with material glasses but in addition of the material and social benefits of marriage it is a way of purification of the soul and uplift human personality and save mankind from the dangers of gradual extinction. Therefore, as an international suitor of all of the women and girls of the world who are qualified for marriage I am respectfully matchmaking.\nhttp://shabakaqarn.blog.ir/\nsaberzul@gmail.com\nTelegram: +989117932453\nViber: +989117932453", "Hi, I have an strange problem while i try to set my username every time I put a user name and the username is available I get the same error which is the following: \"There was an error while setting your username: Username has already been modified too many times.\" I don't know how to fix it. when I created my Facebook account I wanted a specific username which was not available, lately the username is available, i googled How to change my Facebook username and I found a method which is creating a Facebook page and transfer the profile username to the page in order to make it available to change the profile username, every thing was going smoothly but when I tried to enter new username I got the error which I googled it and looked it up on the community and sadly there was no solution or a way to fix it. I hope I can change my username. Regards, Tazeem", "You need some real engineers doing this type of work, otherwise your infrastructure and algorithms would be so complicated.", "Whao! I really hope that I can visit the mobile device lab.", "The best way to profit from Facebook  of $ 5 a week without tiring in http://www.bloggerexp.com/showthread.php?t=18676", "I think It's a time Facebook Needs these Icons for the direct post feedback to user 1. Dislike 2. Sorry & 3. Crazy etc There's some post that doesn't deserve a like and might need those Icons to press", "I do this already. As long as this is a learning experience & not automatic (Y)", "hi there is 2 best website for make money and earning alot $$$ if you want to decovert them so click on this short website for find 2 \n\nhttp://adf*ly/1Y8hSd\n\nDelete (*) replace it with (.)", "I wish you smart people would start talking like the rest of us what about Facebook that is easy to work for us old people?", "Custom video at volume was pretty cool ... Thanks", "OpenSSH is awesome and a magical way to secure the data you exchange but on the legal aspect, it does not check the identity of the owner of the server. So secure yes, but not trustworthy.", "What one human beings can define, to other human beings is a continued progress of existence, understanding is like an event within human beings Knowledge some lacking or producing, quality to some in dealing with a situation or struggle within life, wonders achievement or accomplishment. What is perception or guidance, from what is given in the past, from whats present, and whats ahead tomorrow , indeed a combination of success and failure lies within every human beings.\n\nIts how you human beings male or female use your quality from within your heart wisely for your difference feelings, states, and attitudes that ranges from interpersonal character you become or create. For what we cannot compare is the passion for our country, Privilege what we have within our Nation. \n\nQualities was produced by every male and female sacrifice was given by every ethnic race human soul, from Jewish, Christian, Muslim establishment to hard effort work to basic contribution, every contribution its today represents what we American native to American Citizens have produced, whats established is a name embedded within every eyes around the world, embedded within our hearts, for what is this nation called \"UNITED STATES OF AMERICA\", USA, USA, USA.\n\nA gesture of respect our recognition, especially what every American Native Jewish, American Native Christian, American Native Muslim beings devote to the flag Stars and Stripes UNITED STATES OF AMERICA. \n\nHAPPY INDEPENDENCE DAY TO EVERY FELLOW AMERICAN.", "Non sono in grado di commentare ma mi sembra una cosa positiva!", "So big question still... Your providing Internet to the third world. Cool. Umm... How are they going to use it and on what devices? How will they pay to use the Internet? Or will all this be free? Because I sure could use free internet and mobile devices", "What happens if you have more than one prefered language and would rather stick to the original post? Will there be any way we could pick which languages we don't want to have translated?", "that totally pray yes come true.", "Hello, some text are translated into French, but often incomprehensible. The text and the interpretation of the words are different. The value of the terms is erroneous. This means that the choice of translations is sometimes irrelevant.", "\"We also ruled out ICMP because of possible polarization issues in ECMP scenarios (lack of entropy)\" Can you please elaborate on this and what is the difference observed in ECMP scenarios ICMP vs UDP \\ TCP protocols? Is this to include the Layer 4 header in the hashing algorithm for the redundant path? I guess when hashing based only on the source and destination IP and using icmp the redundant path may become unutilised.", "Wait. Can't you just use one camera?", "This was a really cool feature and I love that it was editable too.  Great job!", "If I wanted to communicate a pretty nifty design to Facebook engineering, what would be the best way?", "Wow this is so wonderful can a 67 yeard old lady still learn this awesome advance technology", "It was a very boring event !", "vehicle, building and M2M cellular signal amplifiers can be the glue that holds cellular networks together.  Please view www.smoothtalker.com or email kevin.c@smoothtalker.com.  Thank you.", "I don't know what you guys are doing, but your fb Anroid app is sucking my phone's battery so fast..", "I just uninstalled facebook app as everytime im in the middle of reading something it reboots the page to the top, especially after the last update. I use to be able to close out face book and return to where i was at. Not anymore so i prefer using the browser way.", "facebook make for us some thing that come make us find people who look almost like us because u have almost every photo of a person in the world i world be glad if you find one who looks like me some one to put this in consideration because who would have increased the number of people active on Facebook", "the best website for earn money easy and free:http://adf.ly/1ZTDz8", "That's the future open source. Everything else is a step back into the past.", "what if the handlers run even after self-healed it slow ups the things right", "Please help me 2 months ago my real account is disabled I send id card copy but didn't open I every day try to review my account please some one help me because nowadays I am so sad because my all friends miss me please", "Chronological order is most relevant to me. As in, what have people been doing since I last had a look. \"Top Stories\" may be clever but it's impossible to figure out.", "https://www.facebook.com/groups/1890977371123711/\n\nPlease don't forget to join my business group", "Business manager is giving everyone on our team a 500 error for the last 15 hours. That seems like an abnormal downtime for facebook, when will it be back up again?", "amay line xx ND yon Q", "you guys suck at your job.  facebook sucks compared to 5 years ago.  just like the same workers that apple is employing.", "Overthrowing governments whether it's Mobarak, Syria, Iran, or even USA is a Zionist \"divide and conquer\" plot\n\nYour enemy are those who blackmail your president, not your government", "free auto like Link : http://free-autolikefb.cf/", "Would have been nice if you could have shared it with your friends! I could not", "And please Launched this on \"Report Abuse\" a Report Admin from Group Page to file cases against them", "Shame I still have to manually select \"Most Recent\" in my feed settings every day. Maybe it'll eventually learn that's what I want.", "Good innovation. Please more brief on functionalpity and cost of the packet transponder is required.", "I don't know where to ask this but I have a Roku and I put your app on there then I took your app off. Is that the best you guys can do for Roku app or is that all you want to do for a Roku app because it was pretty lame", "Stay current lol it's all about style", "What's up with all these posts from fb eng today? Do we have Christmas, or?", "Jay Ching Lim James Ooi I actually like the logo a lot. The name and visual match the mission very well.", "i want to verified my page. how much time does it take to verify a page? please tell me. Thanks", "Me Gusta y lo voy a compartir .", "Watch Barcelona vs Atletico Madrid live broadcast on 04/05/2016 Champions League .\nFCB VS ATL\n\nHigh quality :\nhttp://bit.ly/1RM4Hpu\n\nMedium Quality :\nhttp://bit.ly/22af5fy\n\nPoor quality :\nhttp://bit.ly/1oztvsp", "Site to download all copies of the original windows, legal and anything looking it over the Internet - information security\n\nhttp://www.info-securitylb.com/2016/06/blog-post_4.html", "Even at 90 TB, that is what, less than $7K a day, not sure I am following this ... storage prices have really dropped, no worries.", "WARNING - this is maybe a noobish question . But ... \nWhat do you mean by app-startup-time in relation to the new  react native implant ?", "<3 ^_^ PERSNAL BOT SITE BUY KRNEY K LEYE INBOX KRO <3 ^_^", "Arise My Czyl in a position to make money from the Internet more than a thousand of USD http://etoro.tw/22GK5tj", "please give us vote, we are student formula in slovakia and we need your help, just hit that red buton http://bit.ly/1RyQbRL", "my profile sections have all disappeared. likes, films, books etc. How do I get them back?", "That's so 2004, but hasn't been adopted to the world yet I guess.", "Since a few weeks I can not see my own friends . Can you help me to solve this problem ?", "Hello I am pleased to collaborate with you and I am pleased more to get some attention from you\nI Mahmoud Ahmed of the State of Egypt, I'm thirty years old\nI work in the field of e-marketing growth hacking\nI think I have a talent for development and development for whenever I tried to do my thing develops not pause at a certain stage Lanier always discovered other stages\nIn involuntary thinking in the development and modernization of anything I do to use it\nThat's what made me think of the development of Facebook\nAnd not even develop a complete system works alongside and with the current system\n# Why second complete system and how?\n* First, why given about my personal experience\n1_ because I no longer enjoy when I surf the Facebook\n2_ become all the social networking sites similar\n3_ I do not get on the news and important information\n4_ Most publications have become worthless and repetitive\n5_ have tired of the old ways to communicate with my friends\n6_ Facebook on the throne of the means of communication, but it is no longer sitting cross-legged\n7_ problems and speed internet\n8_ when the interruption of the Internet and other Leave Facebook\n9_ used Facebook only now to follow up on important messages and notices\n10_ for my use of the Internet has become much less than they used to be\n* Second, how is the implementation of the second system and what is and what its features?\n* Now will not Ajaopk how and what is the second system, but I will tell you its features\n1_ doubling of profits in record time and incredibly\n2_ doubling the number of users\n3_ doubling the number of hours of use per user\n4_ user will feel and enjoy the thrill of the beginning of the moment of entry\n5_ when entering the user will find himself as if he went to the distant future\n6_ view ads imaginative, fun and unobtrusive final\n7_ user easily find everything you are looking for a friend or a service or a product, place or game\n8_ user will continue to navigate even when the interruption of the Internet\n9_ Facebook will continue to display advertisements and communicate with the user, even with the interruption of the Internet\n10_ system will change the concept of social networking and Facebook will put on the throne of the Internet is too far ahead of all rivals impossible to compete with the approach it is porous and many other features\n\nMy answer your question\n1_ Who can the application and implementation of this system (product)?\n Company Facebook or Twitter or Google or any other major company\n2_ Is it possible to apply and implementation of several companies together?\n Possible that the company Facebook and Google unite in its application\n3_ What is the expected cost of the project?\n Non-specific but not less than $ 200 million\n4_ Can the product on several stages of the implementation?\nPossible split in three stages first driver on Computer Second Third mobile phone tri-dimensional glasses\n5_ Is the system you are talking about an alternative to Windows or any other operating system?\nNo, not any alternative operating system\n6_ What made you sure that an important and profitable product to this extent?\nBecause I went to the future and I can see and touch what I am talking about in my imagination\n7_ Is it possible to see what you see in the future?\nPossible deafen video gives a glimpse simple shape for what I see\n8_ What is the expected duration of the first phase?\nI think it's going to take 10 months if executed by Facebook and 6 months if executed by Google\nDo 9_ been accessed or encountered a similar idea before?\nDid not close any idea or product\n10_ What is required of us to get to know your system and your product is this?\nGuarantee all my legal rights\nA meeting between me and the officials of the company\n\nIf you've got your attention, please communicate with me\n\nelmasry201221@gmail.com\nI speak Arabic\n\nThis message has been translated automatically", "hey sir plz help me i wnt to hidden pr unfollow all the peoples who r followed by me", "HOY NO HE PODIDO EMBIAR  UN COMENTARIO A UN AMIGO CUANDO LE DOY PARA EMBIAR SE BORRA  LO HE INTENTADO 2 VESES Y SI ME QUITAN FACEDOOK QUE HGO? YA PERDY INTERNET Y FACE BOOK ES PARA MI NUY IMPORTANTE", "I don't understand a single word of this message :(", "mahdihasan744@gmail.com\nIt's one of my friend Mr. ID 06/01/2016 last night , and it's not working . I 'll do anything I do not understand the situation . If you could help me now, I would have been grateful and would benefit very rare .\nThanks Rocky Haque", "Hi facebook! I can't live stream on my facebook. But i try to use other user live on my phone it's can !! Please help me. Now i use iphone7!!", "Facebook Engineering, thanks for hard work fo all facebook users.", "Don't know where to go for help after numerous attempts for fix and no results so I'll dump it here.... The names are missing under my friends pictures......PLEASE FIX!!!!!", "All specifications samsung s7                                                             http://adf.ly/1XJjmt", "As an aside.....  Yay, let's turn a raid files stem in to a logged database.... Hmmmm...  Fine for somethings,  not so much for others.  If you need a software raid database files stem you could design something from scratch rather than trying to fix something that ain't broken...", "is there a forum page, completely  bllown out yours scale and put too much afterthought into work workload. my personal does not do this", "My typing alway jumping and giving me Diferent words even after I correcte, is not machine, what is it.?", "Are you an Engineer, or do you know one? Then this is a must have shirt!\nhttps://www.sunfrog.com/Im-An-Engineer-Im-Always-Right-Black-Hoodie.html?54688", "Hi ye all, i need to get into my 1st facebook account, i forgot the password, so i opened another account. My 1st fb account i'm the admit for our local Community Sell/Swap, please with my soreerist throat achy joints help me?.", "How about someone engineer some real privacy controls back into this site? Why does my activity need to be tracked down to location history and videos watched? That serves me no purpose at all and just poses a security risk. Why can I have my profile restricted but anyone can still find anything I've ever liked or commented on? This site has gone for the worst since it started 12 years ago and I wish it could go back to the way it was circa 2008.", "I agree with Neil Gerardo's opinion although FB can also turn out an open field for crimes of any kind. I think there should exist a control over what is posted on", "Possibly a UFO may be the thing which reorganized this in a drone...", "OK, honestly, that's the sexiest thing I've read in a while.  I wrote a LZW implementation for a RISC chip back in the early 90s and so much of what you've called out there about our self-imposed design limitations are true.  I've often wondered about what kind of performance I could get today if I even did something simple like increase the memory.", "Why fb always jump back to home page or notification when i am scrolling down in comments?", "Premier Shield\n\nPremier Shield is the name to reckon in the guarding industry since its inception. The carefully screened, seasoned and highly trained personnel are deployed to ensure Asset Protection and Loss Mitigation.\nto know about us more like the page.to like the page click on the link and get the updated information\nhttps://www.facebook.com/premiershield\n\nPremier Shield pvt ltd is leading security service provider incorporation.to like our page click on the link,like the page and get the valuable information about us.\nhttps://www.facebook.com/premiershield\n\nPremier Shield offers armed and un-armed highly trained agents for protection of Expats and High Net-worth Individuals who are at a greater risk due to their public image.\nto know about us more like the page.to like the page click on the link and get the updated information\nhttps://www.facebook.com/premiershield\n\nPremier Shield is the name to reckon in the guarding industry since its inception. The carefully screened, seasoned and highly trained personnel are deployed.\nto know about us more like the page.to like the page click on the link and get the updated information\nhttps://www.facebook.com/premiershield\n\nFacility management\n\nPremier Shield Facility Management Solution is a strategic business unit of a three decade strong Premier Shield Group and are the leaders in providing Facility Management Services in India and Middle East.\nto know about us more like the page.to like the page click on the link and get the updated information.\nhttps://www.facebook.com/premierfacilitymanagement\n\nInvestigation\n\nPremier Investigations, the business unit of the Premier Shield Group provide the unmatched Investigation services to corporate, government agencies, international clients and individuals.\nto know about us more like the page.to like the page click on the link and get the updated information.\n\nhttps://www.facebook.com/premierinvestigation", "from backups ? does that means data changes after the backup will be lost or will be synced from another location ?", "Help by creating awareness, truth without manipulation of pertinent facts!", "My DEAR Facebook\nFistly CONGRATS for your succes..\nCan you help me?", "I need one (or more) now! I have a massive project to do with this!", "you need a way to have people get connected to you or support from someoen when they can not get on to the facebook website.....", "The world needs PROPER SANITATION AND POTABLE WATER... PROPER SHELTER FOR PEOPLE IN REFUGEE SITUATIONS ACROSS THE PLANET....DO THIS FIRST!!!!  CREATE WITH YOUR  TECHNOGY BETTER WAY FOR HUMANS TO SURVIVE.... then you provide a way for more humans to buy your products!!", "Its good to clear the path .... You see better with correction", "What is the performance metrics? Also, say for example a 2/2geo redundancy solution, how will it ensure scalability?", "Would this improve data transfer speed in general or just create space?", "Next?  a suite of standard and programmable cognitive algorithms affecting shoot focus and intentionality.", "A+ from me, and a big THANK YOU", "Dear Facebook Team. \n\nPlease I have been seeking for financial support for so long please help me to benefit from your charitable donation also known that your donation to my life will also change many people who are living the same situation as mine #Poverty. Help me out for the sake of God Thank you.\n\nApplication for Grant.\n\nI am Armand Amoussou now in Nigeria a nationally of Benin Republic ; I humbly applying for a grant to enable me Establish my catering Center.\n\nmy business was not yet been registered; I am an experience Caterer and good chef; who is willing to have his own Restaurant; if your reputable company can grant me the fund; I will partner with the local Farmer to help them sell their farm products and employ the youth that can deliver to the Economic though your grant.\n\nI will be grateful if my request is consider and Favour in your company.\n\nYours faithfully;\n\n Armand Amoussou\n Email: amouss.armand66@gmail.com\n +2347066882059\n +2347037216278", "I didn't understand most of this, but I'm still impressed by the implications.", "someone block my account plz contact me", "Really interesting post :)  \nMust be challenging but so much exciting to design a CPU with Intel!", "AHHHHH I need to make some amazing 360 music videos for FB with this!!!!", "This is the exact thing our people need. Water? Nutritious living food? Forests? Clean oceans? Get real! We need gigantic autonomous flying boomerangs beaming wifi from space.\n\nFantastic vision.", "ISPs should be more service oriented rather than profit oriented, which mostly are, these days...", "just small remark from my side important to your side as =\nI explained as Disagree that FACEBOOK not good for all the world ! because I remarked may peoples just playing joking amazing as animal sex fashions of ladies , making any sexual relations via facebook pages,,,etc non good for humanity development ? \nThereon, I am advising for honorable FACEBOOK CEO+ all TEAM to take care for new IT Control procedures , security, survey goodly the FACEBOOK users by insuring the ability to connect via right EMAIL not mobilephones as many ones just joking by phones nor professional?\nFinally, I am wishing high success for future FACEBOOK to realize positive results to the whole humanity connecting dynamics WORLDWIDE in legal ways as MAINLY full RESPECT Videos, face pictures,,,,,,etc\nSincerely\nYAHIABESTPILOT\nALMOUBOUDI\n00213664763753", "Hey facebook. Your mobile app is down again.", "I don't know if you will read this but I'm really tired of News feed cutting off my FB page unless I add more friends. There were 3 videos I wanted to see and you disappeared them.", "Love everything Facebook is doing! So many awesome innovations and inspiring technologies.", "Anderson Soares how about one of this for INF?", "Best ppc site Ever just A simple Clicks and answer some questions enough to turn ur browser to a cash machine the best feature in it u can work every 3 hours not like the other sites 24 h sign up for free\nhttp://instantcashsweepstakes.com/invitations/ref_link/862469", "Please remove the language selection from the Home page, pain in the but when it accidentally gets touched in a touch screen and changes my language with one bump. Put language settings in SETTINGS where it belongs!", "I need one of your engineers to make sure I am not still being shadow-banned here, my Tech Lounge: https://www.facebook.com/Ginnys-Tech-Lounge-548552768588050/", "Facebook Engineering I am trying to merge my page \"Cannasseur\" into \"Kiwi Cannasseur\" but it is not allowing me to even though they are similar, how can i fix this?", "Is there something that can be done about \"pages managed\" newsfeed? In my page newsfeed I only see three or four of the pages I follow posts which are often old and ones I've seen before. This is incredibly frustrating and doesn't foster connection at all. I've tried going to the different pages and specifically \"follow\"ing more pages, but it hasn't made any difference?", "The name is misleading. This is not related to Apache Yarn.", "Not only blue mark even white mark", "..my question :  when I post a video or text message on Facebook  - say I see ; 3 views- but no Likes or Replies  ...is there a way to see \"WHO IT IS\" doing the viewing?", "CAN YOU SUPPORT GIFS ? The iPhone has a gif keyboard and it would be cool to use them !! I know profile pic does but can't on wall on app or people's posts", "I recorded something to share with the people. It's 1.5 hours long. Is that too long for facebook ? If not teach me how to place it on facebook.", "am tried of my accounts being disabled by Facebook yet I use my real names", "I didn't understand a single thing in this entire article, and I read it all", "isn't this like super old, I had it on my first cell phone...", "Jay Vickers I for one support our new robot overlords", "Dose any one know who to talk to if u have a new social media app Idea ??????? Any one", "I tried to do it but I t said no content I have been trying to get my content from my old page but no go facebook completely blocked my account I did nothing was it hacked whats going on", "Rachid, Yarn new PMJ, based on NPM and shows NPM errors ... Clever way :(", "Someone hacks my Facebook all the time!", "Do you need to be online? Is it real time or during edit? Does it work on a live broadcast? Not enough information.", "anyone tell me how i can contact to facebook department?", "My 3min 360 video was compressed by facebook from 4K res down to 1280x640 which is meant to be high resolution? The file size dropped from 1.2gb to 11mb in facebook's HD mode and it doesnt look anywhere near as good in my GearVR compared with what I experience from GearVR apps like Littlstar or Vrideo. Until facebook improves the HD quality, the GearVR or full screen playback of 360 videos in facebook will fall well short of other available options. See EcoVR.world and JourneymanVR for examples", "Chris, my nephew Ryan Wiggins is in the HQ of FB at San Franciso if you end up going let me know so you can get in touch.", "<3 I want to do research Facebook Careers ! So awesome!", "my email /   korosh69ram@yahoo.com", "@BarackObama Photo: one did not cut her chin 23 years ago ! .. 10 people made a strange record numbers\nhttp://past.is/asfyq", "Anything  about    is so important", "i need ur help,, my account has blocked plz tell me how can i recover??", "Facebook why can't I hide the ENTIRE Instagram album from certain people instead of having to individually block them. I want total control of my Facebook, please. I just don't know certain people really well and we aren't close so I don't need them seeing intimate parts of my life. Please fix this. I will post this on the developer page, too.", "if you type this @ [1 3 5 : 0] on comment section some random name appears,does anyone know what this is ,please am not trying to be funny or anything,i just wanna know ,note no space between all characters @,[ 1, 2,3,: an 0...and it can be any random combination of three numbers", "I believe that foreign language should be translated into English before being post.", "Bangladesh's 'tree man' to have surgery to remove 'branches'click to full video : bit.ly/1TGWoiK", "How can one get a job there ?", "If, when the United States The busy South China Sea Or interests in the region, though it was not American zone. There is hope for this country to become more authoritarian. And far ...", "When are you going to allow people to edit the headlines again in posted links? I just tried posting an article with an awesome headline to my FB feed ... and the headline it drew was a lame earlier version.", "What is wrong with y'all? Are y'all working for Ted Cruz because their is NO  Interoperability.NO ONE CAN SHARE LINKS NOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1", "Hello . My brother was be hacked FB account . His friend asked him to send a picture of cat to someone on FB . So he sent and suddenly he got a massage saying that :\" your account has been disabled .\" Pleaseee help . Tks u.", "#facebook you just deleted my fan page likers for what to pay you money !!!!! why this happen it's not fair ..", "C.I.T.s.r.l. Construction Technological Systems. Specializing in the refractory linings in industrial sector, is the result of a long experience, gained jobs in national local field is international.\n1) Planning\n2) Supply of refractory materials\n3) Installation and maintenance\n4) Scaffolding\n5) Insulation and scoibentazioni. www.cit-refrattari.com", "http://www.projectshandbook.com/\n\nNEW Engineering mobile application aid for Professional, Fresh graduates and Under- graduate Engineers covering :-\n1- Design spread sheets. , 2- Construction. , 3- Project Management. , 4- Method Statement. , 5- FM & Repair. , 6- Finishing works. , 7- PMP & LEED. , 8- Software manuals & Codes.\n9- MEP works. , 10- Contracts.", "there's no 'engineering' in Computer Science...\nI want my profession back, unadulterated.", "Shut up and take my money! Oh, wait, i don't have that much money. :<", "The only complaint I have, and I don't know how difficult of a problem this is, that the \"distance\" of objects still seems a little off.  Like the projection of a box (or whatever shape this lens is in) is not 100% correctly judging the distance of objects.\n\nIf the \"lens\" here is consistent for all videos, I would be very impressed, though... simply because for a \"default\" setting, objects up close and far away still look pretty darned good.\n\nI'm not an expert on optics, but I hope someone can understand what it is I am saying.  If objects or further or closer, or depending on the aperture of your lens, the visual will \"warp\" differently as you rotate...", "the best electrical engineering reference in this link: http://magdi-wahbeh.blogspot.com/", "I attended the OCP 16 Summit and thoroughly enjoyed it. I learned a great deal from the keynotes, sessions, meeting fellow engineers and speaking with the vendors in the expo. Looking forward to seeing all of the archived session streams on-line in a couple of weeks to catch the ones I was not able to attend. There were just too many good ones, some at the same time!", "A new way to speed up the browsing Facebook in 2016 and proven'd thou also be tempted hello your : http://adf.ly/1ZDJfF", "New scripte Facebook 2016 !!!!! the best scripte Facebook !!!\n\nDownload Now  !! :\n\n http://adf.ly/1XoZC6", "Well that explains all the little strange things that have been happening lately.", "The Best Way To Protect Your iPhone 6, you can find this in PUREGLASS Screen Protector.\nAMAZON: https://www.amazon.com/dp/B01J16AD2S\nShare this and help someone save the iPhone 6/6S", "Is there anyway to get Facebook to stop unpublishing humor and meme pages?", "Many of us appreciate the unity you bring to cities, states and nations throughout the world! Keep up the great job FBE!", "Would it be possible to put a font setting in the Facebook app for those with vision problems or maybe a background and forgeround color change? This is for  Facebook Beta for Android", "Facebook still steals the resources from my PC while I am using it for actual work. Facebook is promoted as a 'background task' but poor programming means that it uses too many resources to be that.", "Jordy Jacob Peter Lyons Calvin Hobbes Nikhil Seth @gabor", "How do show messages in whatsapp feature and makes them appear as in the application of Facebook Messenger\n\nWe draw upon the application called \"Dashdow What App\" you can easily activate this feature on your phone. \n\nThe application has achieved more than a million downloads on Google Play.\n\nHow the application is used, once you download it and install it, open it and confirm the first option that appears in the main screen of the application \nApplication Link Load: http://past.is/aswjo", "Modern version of her pregnancy in August Alwats quickly from here: http://adf.ly/1WkvSh", "facebook's tech after few years will be like that of Skynet from terminator :p", "You can do all THIS but NOT give us the ability to disable the annoying POKE feature?   I'm NOT the ONLY person who hates pokes!  Perhaps under our profile settings along with tagging you can give us the ability to disable pokes?   I also hate your autotagging feature.  I'd rather type @ in front of someone's name I want to tag than have you try to tag someone in error when I simply write someone's first name!   GEEZ.   Get with it, FB.", "Best over the ocean 2015;2016 best drupal 8 and bigger i come back", "Thanks to all of you Fb engineers what you brought to mankind!!!", "Hay Facebook, why can't I select a message to delete on my Facebook Page anymore?", "It was a very boring event", "Hi. HTML 5 videos are enabled for posts. Could we interactive and rich media videos such as videos which have clickable buttons and engaging video. Can our html 5 content have css and js inside it ?", "Facebook for phone 2015 : http://adf.ly/1UIJIB", "Bloody sort fb out and messenger. Would report it but no where to report it too!!!!", "Book Your Own flat in just 51000Rs.\n1 BHK flat Well Furnished with Prime Facilites on Ambala Chandigarh Highway .\nLoan facility avaliable.Need to Pay 5% only\ncontact 7814020309, 8054768281", "Close, but you need cigars. Pure visual inebriation will entice complete dedicated involution, correlations with real joy. Thanks. b", "TiTu Kaxhyap TiTu Kaxhyap TiTu Kaxhyap :-) Hey Dear Friends :-) I Just Got 6 GB 3G Net Recharge Free In Just 2 Minuts.  (y) (y) Thanks To http://androidlte.blogspot.And get 20,000 autolike \n [[1661672764078759]]", "I do not want him to verify blue Facebook account .\nMy ?", "High quality code. I used it via Om when I wrote ClojureScript and I'm using it directly in ES6 now. A pleasure to work with. Good job y'all.", "aka how facebook reads the messages you send", "hi im so interest to join in this group and also im need to learn to how to hacking FB . please teach me how to hack FB account", "Fakebook is more the correct term. Can't open an article long enough to read it. Three seconds and it refreshes. Fakebook is diffinetly a group of cowards and losers. You can't stand other peoples opinion differing than your own.", "Your commentary reminds me of huaman elementary reading models, as well as current adult online training education.  However, one struggle with the former model was a diverse set of background experiences by students; whereas the only struggle with the latter is proof of reading the material.\n\nInteresting post.", "I would to work with you... Guys !!", "Top 5 Racing Games For Android [HD]\n\n(these are just my opinions)\nPlay Store Links:\n\nSports Car Challenge: http://adf.ly/1JWgWr\n\nDraw Race 2: http://adf.ly/1JWgn6\n\nAsphalt 7: http://adf.ly/1JWhnn\n\nReckless Racing 2: http://adf.ly/1JWiVT\n\nNeed For Speed: Most Wanted: http://adf.ly/1JWis9", "Isn't it too much IO to first load and then run verification? You could cut that in half by exposing the backups as iSCSI targets or NFS mounts and then run the verification. Also you are verifying the database at the block level, are you guys doing verifications at the application level?", "Please uncensor my main account, Nikademus Lawman. One of your moderators has censored me obnoxiously under the premise that he/she disagrees with my political viewpoints. \n\nI am totally compliant with Facebook community standards guidelines and have political viewpoints that can be easily spun if one pays no attention to the converse oppositional voices doing the same and being ignored by Facebook moderation entirely.  \n\nYet now I can't even so much as respond to a private message on that account.\n\nThis form of censorship has dire consequences for those that have invested millions in the form of advertisement buy ins, especially corporate. I would like to not have to tell them that they can be suddenly eliminated at any given time by Facebook's discriminatory and selective moderation. Indeed, many of those social media marketing managers are my good friends and colleagues, and some of them have vendor spends in the tens of millions. \n\nThere are countless abuse reports in my support history showing that when complaints are rendered about total hate messages against people of Middle East origin, that your moderators claim there is no violation at hand. \n\nWhen I reply to someone who has insulted me outright with non-abusive language, it is used as a basis to suspend my ability to express copyright for 30 days. This is a circumvention of the DMCA, and probably an unmeasured response by one of your moderators, who happens to disagree with me. \n\nThey are entitled to disagree, but wouldn't you say that Facebook should render such moderation less selectively? After all, this is the basis by which Prodigy lost their lawsuit decades ago. You cannot selectively moderate based on subjective opinion of what is right or wrong -- you must have a \"one size fits all\" rule. \n\nOtherwise, you are not acting within the spirit of the DMCA and within the confines of case law on this subject. At this point, you are victimizing yourself with a potential class action lawsuit that would discredit your entire enterprise moving into the future.", "Maybe you can help I can't share anything on Facebook without writing a message???", "https://postimg.org/image/pr702dnvd/\nCan u trace this account whether is real person Dato Jamal Yunos, because inside his post he threaten to harm people in coming Bersih rally if you know Malay. Now he deny and say it's a fake account. Pls help, this person is a thug.", "i think there is no difference between PHP and and this version of PHP in particular in syntax", "Microsoft windows licence keys at cheap but reasonable price. www.hafizlab.com", "You've made a remarkable job for the past many years  keep it up but I want my original account be retrieved as soon as possible.", "Great Facebook Engineering new box for starting posts will not attach photos or tag people or pages.", "interessting engineering link (youtube channel) : http://adf.ly/1Z4nNY", "I mean, there are so so so many more efficient ways to provide internet to impoverished areas. This seems like major overkill and a money sink.", "I explained as Disagree that FACEBOOK not good for all the world ! because I remarked may peoples just playing joking amazing as animal sex fashions of ladies , making any sexual relations via facebook pages,,,etc non good for humanity development ? \nThereon, I am advising for honorable FACEBOOK CEO+ all TEAM to take care for new IT Control procedures , security, survey goodly the FACEBOOK users by insuring the ability to connect via right EMAIL not mobilephones as many ones just joking by phones nor professional?\nFinally, I am wishing high success for future FACEBOOK to realize positive results to the whole humanity connecting dynamics WORLDWIDE in legal ways as MAINLY full RESPECT Videos, face pictures,,,,,,etc\nSincerely\nYAHIABESTPILOT\nALMOUBOUDI\n00213664763753", "Are you a Small Or Big Business Man/Woman, Politician, Musician, Student, Footballer and you want to be RICH and famous or be promoted, become powerful and influential in life and need the power to Achieve your dreams. You can fulfill your dreams by being a member of the Illuminati. With this all your dreams and heart desire can be fully accomplish, if you really want to be a member of this Great Brotherhood Of The Illuminati then you can Contact me on Facebook or inbox me for more information......", "Admin i want to verofy my page :(", "Engineers: Its now morethan a month you block me from sharing post in my groups. When ever I click share into groups, you said the page I requested is not available, but you wl fix it soon, & you just automatically direct me to home page. Can you fix it for me pls?", "So does this mean my wtf and smh reactions are coming soon? Because those are pretty much the only two emotions I have when I log on to Facebook these days.", "Why can't you fix the msgr problem, invalid perimeter sent to server?!", "BOOK : Health and safety in construction\nThis third edition of Health and Safety in Construction explains the essential tasks for achieving healthy and safe construction sites\nhttp://hsg1500.blogspot.com/", "Any information or update on the current quality of 360 video and future expectations. Thank you.", "It's a shame FB doesn't allow Rich Text on their site.", "Moving up with technology! Keep going Mark!", "Dont try to use Facebook with Fake Information,its shows to everyone one day that you are cheater ;)", "Engineering, You guys are coming out with some great stuff but you are missing something basic and profitable. Please contact me. Mike Buzard", "I have been hacked my account and I want the loopback", "Win with eToro now hundreds of dollars, all you need registration on the link at the bottom and an invitation Asedkaik..and Date will receive a reduced cost of $ 100\n\nhttpetoro.tw1W8oH90", "@facebook engineering can you enable the rotate option when visiting a facebook page and others ? It's kinda annoying. Thanks", "Promo Trig Lock to all Gun likers.", "You're beautiful girl or boy <3 <3\nCan I get 1 cutie to add me?? <3 <3 \nhttps://www.facebook.com/ObayParachaSwag", "Delivering the free world to Trump, in the palm of your hand!", "Dear Santa, ( fb eng) with all your magical abilities, my humble request of a chess app so I can play with fb friends would make me smile this Christmas! Thank you and God bless!", "Hi I would like to know if you fixed the removing money away from my bank account. Please verify that my fan page account has not done any boost, promotion or nothing.\n\nIt is very important to find a way to stop charging me on Facebook adds from my page Ekhtronic \nI've been noticing this for a while. I believe this is the second time that I notice this with out counting the other times I haven't seen this. \nAgain I am not hiring any boost or anything from Facebook so please it is important for me to know you have checked this out because I don't want any more money removed from my bank.\n\nI would like to hear back from you and know that you are aware of this misunderstanding and it would be nice to get my money back.\n\nI send an inbox a month ago and I haven't heard from any facebook associate back. Please I want to hear from you and know that this problem is fixed and remove my card number from your database \n\nHector Tamburi", "But can it do a Picasso? From any period?", "Its just fb way to get better insights into user text and display him add suggestions that means better fb revenues for them :)", "some1 hack my id and change all info...plsss help me", "Pandelis Zembashis talking about scrollable user interfaces ^_^", "blender.org can be + to facebook post and commments", "Interesting. Though now CA becomes a single point of failure. Plus bastion hosts that still use LDAP.", "I wanna hack my freind fb id... Is there any procedure.... Kindly reply", "Your circulation and win thousands of dollars with the site eToro your trading an amount $ 200 and Ahtl Ali gift $ 100 and you can withdraw the money my father summit to trade him and start to reap the money only Bhuda and Eetmkink trampoline eToro of copies that allows you to track the postss successful website link Khatih http://etoro.tw/1NFu8am", "One more thing facebook can you please create the option wherein we can choose certain people who cant view or know when is the last time we went online because in your messenger you can see below the names like anne online 21 minutes ago. is it posiible that we can choose people who will not see it? like i need 8 or 9 people who cant see the time when i was last online. please give us that option facebook.", "Can we have some 16:9 for FB Live please.", "I keep getting a message about malware when i try to get online using both Chrome and the new e search engine. My computer has been cleaned. Please HELP!!!", "How can a page be confirmed by Facebook, so people can know the original/official page of a person or organization? Facebook Team, kindly reply", "i am sorry now i want change my name but i canT how please i dont know  how ?", "ce qui est irrelle avoir ci dessous", "BLANK this \"trending\" video GIFs CRAP, I cannot even find the REGULAR buttons for my REGULAR pre-selected sticker categories - or even the recently-used button.   Why do you guys insist on breaking everything that didn't need \"fixing?'", "Toi sale remains favorable\nUntil 1d, when I post the limit & locked.\nAfter 1 week course is open to post, usually before gio remain so. But this time, after the course is complete & reopened. Sign 2-3 page resume its course of 3 days, 3 days after reopening I'm 2-3 page resume course. Repeated far has been 3 months.\nK knows the way you help me out, then of course Remuneration. God", "download new google earth 2016 here: http://past.is/arifq", "What migrations tools are out there to make a postgresql database into a RocksDb?", "Hi, I have a problem to syncronize the facebook's calendar with google's calendar. It worked fine until October but, since novembre (or the second half of october) , I can't see the facebook event that I add. Of course I have already tried to delete the old calendar and make a new one (copying the webcal link), but still google import only the events that I added before the second half of october. Is there any solution? Thanks a lot", "I keep getting messages on my cell phone from facebook that I do not want and did not ask for  How do I stop them outside just quitting facebook.", "Faster to register and win $ 100 and trading in your account after a week of registration with the largest site Forex Astaatmara global opportunity does not compensate surprise\nWay of profit to $ 100 are to follow the link and fill up your data and then doing a confirmation and which opens the message sent to confirm your registration\nThe steps are to see the first video was the other middle Altalt was fourth and will turn you site your gift directly reminder The site will not give you the gift that registered him directly Vlazem Date of Hedda link https://drs2323.thevipteam.org", "Nice, instead of using that money for something else, you made a mini-airplane that \"beams\" wifi, sure, break through in technology, but you really think people living in the deep forests are concerned about wifi? You just want this'd people to convert and join FB... Lol.", "Best 50+ websites on #Social #Bookmarking- www.newsocialbooks.com", "Kind of like Smart reply in Inbox by Google !!", "Hi, is there any possibility of engineering Facebook reviews and comments of business page?", "<a  href=\"https://www.amazon.com/gp/product/B0192CTMYG/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=B0192CTMYG&linkCode=as2&tag=samsal01-20&linkId=068e66cee00251543d2b59b614c440a3\">Harry Potter and the Sorcerer's Stone</a><img src=\"//ir-na.amazon-adsystem.com/e/ir?t=samsal01-20&l=am2&o=1&a=B0192CTMYG\" width=\"1\" height=\"1\" border=\"0\" alt=\"\" style=\"border:none !important; margin:0px !important;\" />", "You can do all of this and can't figure out why I am getting friend suggestions for people all over the world that I am not even remotely connected with. Is Facebook trying to create some kind of global cyber society? It sucks and I am about ready to delete FB and move on.", "Theo Albers Any idea why we can't scroll the webpage of this article when navigating to the article from FB on Android?", "I got an email from Facebook stating that someone in Taiwan may have hacked my account and that I need to change my password. My account was locked and I could not logon, The support phone number is a place I would like to get a job because they don't even have to answer the phone. I cannot find out anything because Facebook does not communicate with their customers ans Customer Support does not exist!", "I'll like the job they are doing when Facebook alerts each user of abuses by those who post false and misleading news reports. Facebook should be held to the same standards as any other news media if it is going to allow posting of purported news stories. Clearly, they already know who is posting most of these fake news stories. They should have long ago barred use of anything from such sources.", "Truly curious; why did you use TCP and not UDP for the warp data transfer?", "Thanks Facebook Engineering for sharing this interesting article! If you are interested in spotting human settlements in the world, you may also want to check our global human settlements layer: http://ghslsys.jrc.ec.europa.eu Have a great day!", "and Stop Dummy account on this Facebook", "How well does this embrace openflow? How was the test with ecmp on this new platform?", "Seems cool,. But what happens when the plane moves around from your area,. Wouldn't coverage drop,. Or maybe they can have a bunch flying around,.", "are this replicable benchmarks? provide them.", "Plis,dont kill isis plis,who bom in paris,them let yet,if u kill isis n then prabowo subianto with suharto will kill us like before,plis dont kill isis,look rohingnya is mistakes", "Hello I come from Vietnam. I have one question I want to send to Facebook's administrators: I use Facebook for 5 years now, but so far my account still not access the feature \"On this day\" for me. I felt very unhappy about this omission!", "The game \"Word Champs on Facebook\"  not working well.  Letters are sticking and not turning over, curser is slow and hard to move making game almost impossible to play.", "CAN YOU PLEASE GIVE ME OR DIRECT ME TO SOME ACTUAL HELP, THIS IS MORE THAN SOME SMALL COMPLAINT,", "Porque quiero entrar a face y me dice que lo he intentado varias veces y solo lo que querido hacer una vez por dia", "started this website www.teachprogrammer.com for programmers", "I have just started developing an app for Android, and now seeing this technology, it made my 4 weeks work seem useless. Good work, Facebook. No, I mean it.", "I am tagging friends to wish them Happy Birthday... I am blocked?  Is wishing friends Happy Birthday against Facebook policy?", "We need worldwide satellite internet to break governments dominations", "Is anyone else noticing that the X in the top right corner of expanded articles/pix is missing--I'm having to use the back arrow in my browser to close most pix/articles. (Chrome on PC)\n\nFor smartphone (Verizon Galaxy 5), I notice I click comment, get the keyboard, start typing, and the focus is NOT in the comment, so my typing is lost", "Hey a point ... I find your new video format incredibility irritating ... up till now I could quickly click play on a video , and see if I wanted to continue  watching it , then if I click again to pause it makes it go full screen and I have to click 3 times to get it to stop playing ... this is especially hazardous when the video is far to loud us we all get blasted with noise as the video will no longer pause ... we are all very well aware how to operate the select full screen option ... please do not force us into this choice via a faulty ill conceived function ... thank you", "This is why never up date your phone never", "Now I really gotta brush up on those data structures. >_<", "I  HAVE  CONTACTED  GAMEGOS  SEVERAL  TIMES  ABOUT  A  PROBLEM  IN  CAFELAND.   THEY  SAID  FACEBOOK  HAS  A  BUG.  WHAT  ARE  DOING  ABOUT  FIXING  THIS.  I  HAVE  HAD  TO  CONTEND   WITH  THIS  PROBLEM  FOE  3  WEEKS NOW.  I  HAVE  OVER  4000  FRIENDS  IN  CAFELAND  AND  NONE  ARE  SHOWING  UP  SO  I  CAN  SEND  AND  REQUEST,  ONLY  MY  150  NEIGHBORS.  I  AM  UNABLE  TO  DO  THE  QUESTS,  BECAUSE  YOU  HAVE  TO   HAVE   HELP  FROM  YOUR  FRIENDS .  PLEASE  FIX  THIS  PROBLEM.", "Can it help me properly sort my list of Acquaintances?", "computer vision techniques to satellite imagery provides insight into population distributions on a granular level.http://adf.ly/1XPPgb", "interested in this site but don\"t know where to begin with something I have in my mind.....", "All the features but still NO WAY TO DELETE outdated and needle Notifications. When will we be able to free up this clutter when we want?", "Jashan Preet Singh see this hack language \nits requires hack and php .. u can do something new in this hhvm", "I would like an option that I can set so that people who I'm not friends with can't see what I've liked. Also, so that when my friend likes something on my page it doesn't show up on their page for all their friends to see. It's a breach of my privacy when \"Sally\" likes my picture and now all of her friends can see my picture when I'm not friends with them.", "Sir ....... please please set the group problem.... we not able to share group post those post which is shared from other timeline or page... we get only link not post please solve this problem ////", "my instagram account was disabled again by mistake and would like it restored as soon as possible! it has a couple million followers and it really would mean a lot to me because this account is important and is ruining my business a ton. I have tried filling forms constantly but no luck whatsoever. Please help me out, this could effect my future and i really do not want it ruined because of this.", "What happened to being able to target or limit our posts on FB Pages? Who do we pose this question to?", "This question is for the VR team: Saw you used particle systems with VR to simulate movements or distractions in the scene. Did you use regular ML clustering in order to keep track of the distractions and then  you'd separate it, or how did you proceed? Also, great job today, was really fun to watch!", "for more interesting engineering..... like this page : https://www.facebook.com/redteam4/", "download facebook chat from here : http://adyou.me/PzWX", "What were the little code issues? How do you proxy those to developers and QA so quickly?", "How about working on privacy settings like making it so people's friends and family can't see every single thing they comment on or like? Like I don't want to see a friends comment on another persons political post that has nothing to do with me. I also don't want people on my friends list seeing every comment I make.", "death mark zuckerberg  : http://adf.ly/1aEUIp", "facbook team  inbox    plz", "I just saw it at the OCP Summit in San Jose :)  Pretty slick!", "Is there any sort of board design that could serve both the OCP cloud market and the maker/Raspberry PI/prototype market?", "Facebook Video processor sucks! Too much compression resulting in Poor Audio quality. No wonder people prefer linking cover songs nor video presentations on Youtube. Only video will be processed, Audio remain good quality.", "This is getting beyond a joke now, FB.  16 times you've imposed a 24-hour ban on me from posting to or joining groups.  You've provided no aqequate explanation for this, even though I have requested one several times.  It should be for group admins to decide what constitutes \"over-use\".  How can I \"over-use\" my own group, exactly?", "Another thing about bitmaps: Wouldn't it be convenient when a user is using 360 view that it gets more and more blurry over time for frames in the viewport? Would make sense for most use cases, as humans loose focus on external/outside behavior as they focus on an event or object.", "Dear respectful friend hi (assalam o alaikum) the history of mankind is very old .many people born and many were dies but in actually the coming of humanity is not mean less so the mission and ambition of humans is not eating, drinking, walking, sleeping, playing, etc so if the man remember that the coming of men is not without reason the reason of coming of man in the world is prayer and obey order of Allah and live according to the guideline of his prophet (P.B.U.H) the living in world is temporarily 60 to 70 years but the life after death is permanent that never ends a person that is faithful of Allah goes to paradise and that persons that cannot believe Allah that goes to hell so please become faithful human of Allah and must only prayer of Allah and cannot create his partner .Allah is one. Allah is lord and single owner of the world so please believe Allah and obey his prophet's way of life and become true Muslim for more research read Quran and hadith being your brotherhood it is my duty to inform you truth. Thank you Allah may help you Allah may bless you your well wisher.\r\nPlease see talk Islam videos on YouTube for more clear information", "Ugh, why do they make this so complicated .... so preventable .. sigh.", "How do I stop facebook restarting once closed and process killed", "I'd  like help.f your not the real deal and going to show me,,what we ALL KNOW.IF NOT. no thank you", "No matter how many phd  you have , without God you are nothing", "Not to different from early 00`s (2000 - 04) Govt. surveillance/observations, links connections what type of communications between individuals/parties, different colored line for each type of communication eg. phone land/mobile, email, fax etc. citizens, currently serving or retired etc. probably a different system, but attributes look similar on the surface.", "If u cannot speak or write in English what u have to say should not be posted on Facebook -ANY WHERE!!", "Bobby Durrett - you might be interested.", "Hey Please do watch this song Aaja Aaja from the Album Abhishek Arya's Valentine and SHOW SOME SUPPORT to the Indian Recording Artist.\nhttps://www.youtube.com/watch?v=2-qAgg7TQiE", "A big appreciate to all facebook engineering  you are all doing great job I prayed God almighty will continue to give you knowledge and understanding .God bless you all", "How do we make facebook aware of the ginormous situation of the 100s of thousand of fake accounts hyjacking facebook groups and other issues explained in this article???\n\nhttp://www.justice.one/technology/fake-fb-accounts/\n\nThere's a very easy fix (just block the pirated sites listed -or at least the seo picture box). it just can't be done by anyone else. I've reported these sites thousands of times but nothing happens.", "To whom it may concern: This does not apply to Mark Zuckerberg and with the upmost respect. (Shall we read on together..)\n\nThis is not Monopoly, 21, Checkers or Chess...\"I do not have a \"Public,\" site at the moment for various reasons. I read your entire \"private policy\" last night and I already know almost all valuable resources available to us and I \"thank you,\" for that. No where does it mention anything about _______ which can be altered and touched up...okay a lot\" for that matter.  Please, give me the exact same respect to keep my post's up. I faced a situation where I have a friend in Pakistan, prior to the explosion that occurred on Sunday. He posted me his location, and was very pleased about his day, than we started talking about the lack of resources in Pakistan/which Borders Afghanistan. Well we went back and forth and everything dissipated before my eyes, that has never happened and on his end too. The day past the next thing you know, I receive Facebook's \"friendly,\" message to check in. Only, what I read first, was I was in Pakistan. Nor have I ever checked in their. (This needs adjusting) Than it proceeds to ask, were you impacted? No my friend was, then I get a message from him at 10:50 the night before the explosion telling me he no longer as access to cellular? Gaping whole somewhere? Indeed. It needs adjusting. You and I know that I am not breaching any policy on here. (Don't ask how I caught it) because it's a formula - it has a beginning, a middle and an end and it would cause something. I am no longer offering any kind of that advice unless asked. \nOn this subject I have submitted over 63 - \"pending tickets,\" I have proof. They have yet to be completed and honestly, I \"cringe,\" when they could be fixed in less than (x to x) minutes or so maybe longer - tops. \n(This applies to anyone who enters this site) perhaps it could be under surveillance. \"Do not attempt to duplicate, replicate any of my information, innovations or ideas, I have provided.\" They are simply mine - just mine. You are entitled to your's and so am I. Besides, if you or I truly had an idea or a Dream only that person that initially Dreamt it would be the one, who knew the true answer no matter how hard \"you\" try and replicate - again shall we, no matter how much you tried to learn or replicate. True story.p We all strive to grow this site stronger but that would be going about it the wrong way (and if I know Mark he would have zero tolerance for this & if you don't know the answer to that, than the programmers/engineers need to work a little harder.) I will not reveal more - due to my most ultimate respect for this site. Plus, I need it for something for now. I just ask and I will work for free if I have to, due to my loyalties to a certain someone Mark, but we all know programmers/engineers have to earn it now and Mark paived the way for all of us. This has been long overdue. \nYes, there are work arounds, very easy actually. There is no hacking, I do not support or believe in that - unless I do it on accident which I never have on this site and/or offered by someone (example) uber which I find strange. However, I would like to have a look at it and see what's going on. The bottom line, I support this site, 100%, I am not here for destruction, I am here to help/assist and make my experience better if you will along with the people I care about. It's time programmers and engineers - work hard on there own and let Mark Zuckerberg - enjoy the time with his family right now. I won't say anymore, to protect this reputable's site. \n\nI understand replication's, simply references -but, than again who doesn't - heck the Internet is filled with them. \nI can see programmers/engineers wanting to save time, wired in can be hard for some people, but I just can't see Mark supporting something like this. You totally missed the memo. \n\nIt really does hurt me to say this but I have zero tolerance policy for division and deterioration of a site. If you can't reply back to \"Feedback,\" and then just let Facebook go down the drain, after all everybody wants a piece of it. They are consumed with the idea but do not understand the concept. \n\nCan you keep a secret....\nSo can I..\n\nWhy not concentrate on that first, before the site goes down. I will not tell you how or the way it can but it will.\n\nMy apologies for offending anyone, it's just getting in the way of my work - the true so called, \"vision,\" in order for these links to come\ntogether in unison, without viruses, is becoming a joke. \n\nFood for thought: In chess, a pin is a situation brought on by an attacking piece in which a defending piece cannot move without exposing a more valuable defending piece on its other side to capture by the attacking piece...\n\nI will leave it at that, I am copying Mark on this, it's long overdue and too much time is wasting. Before you start a new project, complete the one's you have at hand.", "I didn't know about immutable.js -- thanks for this post.", "facebook is world software sucessful to people use app.", "Feels like a rubber coin or something(?)", "For the fans: man openssh -> Markus!", "Maybe I'm clueless, since I only have a few dozen servers, but I run a script to manage/update authorized keys on the servers. My servers spend more time accessing each other than I do. The part about teaching your servers to implicitly trust your CA was just scary. Hack the CA, hack your network.", "Just opened my online estate sale business. Interested in linking up with us?", "Hello, have a person creating fake profiles with my name and of my family and adding my acquaintances and my family and speaking horrible things to those adds. I want to know what I can do to find out who this person is and do something to punish.\nthis person do not stop creating fake profiles", "MEGOBREBO dzalian gtxovt gadadit da like <3 <3 gmadlobt https://www.facebook.com/261114004098840/photos/pb.261114004098840.-2207520000.1453925588./445540582322847/?type=3&theater mec shegisrulebt rames :D plz <3  help my like plizz <3", "keystroke and cursor journal file can be used for data compression in sql and locally emulated with browser addon", "Obviously, Catherine may or may not be blue; just because she's a lion.  However, only through the accumulation of experiences does AI learns learns a lion is brown...although it can be other colors.  \n\nYes linguistics is complicated, but there has to be a starting point.... I doubt I would call a toddler's knowledge AI, when it's merely fundamental programming.", "whit ya enginers have access to the registry whill operating fster..........", "Ab ap apne gahar beth ke Dishtv recharge karwao low rets\nContact SMS cal 03052243875\ndishtv recharge and eprs doller available \nCLINE available for 200 per month without freezing \n3 monthi in 500 cline without freezing \nand 6 month just in 800 \nNOTE: FREE TRIAL AVAILABLE", "Part time job without investment \"NO REGISTRATION FEES\"\n\nEarn 10000-15000 per month by working 2 hours per day \n\nIts government registered company contect me on whatsapp I will provide you all legal documents\n\nFor more information write \"JOIN\" and WhatsApp us on this no. 990990'2561'", "Download activate all Aleuendozat //  http://adf.ly/1Ysf6n", "Why does Facebook keep restricting me for posting in my sales groups? That's what we do. Post things for sale. I'm in over 65 groups that I sell in. I'm not doing anything wrong and no one is complaining because they would just complain to me. That's how it works.Please this has got to stop or I have to move my business to another platform. I've spoken with both Lexy Franklin and Adrian Nam at Facebook and both promised to get this problem fixed yet here I am again.", "hello i want work with you because i am a genius man genius old man no for money but for the fun thank you facebook and thank you mark", "Please add video serial numbering system and do dupe scan with sampling algo... add tagging, title and description to be like youtube if you want.", "What is wrong with y'all? Are y'all working for Ted Cruz because their is NO Interoperability.NO ONE CAN SHARE LINKS NOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Question....are you guys working on the messenger app because I have no profile pic when talk to people my cousin asked me why I DO NOT have a pic in messenger I have done everything I know to fix the situation. Message me please!", "Great to learn of this step forward to improve accessibility!", "Are you guys aware that your clocks are stiill 1 hour ahead? When i schedule something or chat it says i scheduled it an hour different than i did.", "This is great - thanks for making it open source", "va enpesar in ves tigasion con la redes desa paresidas o puras de clarasiones parte de lamilitar o la federal x secuestros  y acoso sexual de uno yamado luis bautista", "I suggest that you make a Back-Up where we can recover posts (sometimes deleted by mistake), and/or comments in one place!", "I think this isn't working as expected. I'm seeing the same stale stories for days at a time at the top of my feed, especially on mobile.", "Please Help Me My Facebook Is become like this What i do......(Unfortunately, you won't be able to access your account while we're reviewing these additional documents. We appreciate your patience, and we'll get back to you as soon as we can.)", "Cool, I wrote something quite similar a few years ago which remains in production at work.", "Great article! Minor: It seems like there is some issue with the CSS: the iOS FB application shows only the first line of each code block.", "THAT ALGORITHM MAY BE WHAT IS BLOCKING ME FROM POSTING PICTURES FROM MY COMPUTER AND FLASH DRIVES.", "No suprise here, GraphX scale extremely badly because so much data needs to be copied and replicated. The graph partiton strategies in GraphX is also quite bad.", "This turns aluminum into aluminum oxide and generates electricity while monitoring farm land for dry spots to allow spot irrigation and therefore save tremendous amounts of water. Dirt can also be used as an anode source instead of aluminum. Two birds. One stone. World saved. https://youtu.be/34BJ_lf2YpA", "Here is what I have experienced with Facebook in the last 4 days: 1. My account was hacked because a form was sent to me that looked like it was from facebook, I filled it out and within the hour my account was hacked, I changed the password as fast as I could but the hackers were able to keep my popular fanpage by deleting me as admin. 2. I googled Facebook toll free support to only find a company that claims to be facebook and wants you to let them gain access into your computer. It took a long time to find a form to fill out to explain what had happened to my account and facebook fanpage - I was not contacted for 2 days and still have not talked with a human being over this matter. 3. I was told by these Facebook instant reply's such as -Zack to go to Facebook Help - I have done that and still nothing has happened and no one has spoken with me and in the mean time the hacker of my fanpage is spamming it and destroying it. 4. I have sent messages to this page which showed as \"seen\" and also to the Facebook page which also showed as \"seen\" and still not one person has spoken with me over this matter. 5. I offered my Phone number and contact message to facebook and no one has contacted me. They are purposely letting this continue everyday - This shows that hackers are more in control of Facebook than Facebook itself.", "I plan to stream social media data and for this purpose I need to stream FB Data into my Hadoop HDFS. I need your guidance on how to make it happen. Helpful links that can guide me further in this process will be appreciated. Looking forward\nFacebook for Developers", "Water Gravity Wheel Free Energy - Angel Rios", "Can you at least tell us what to do about this problem? NO ONE seems answering and we really are losing respect to you guys. You don't even say \"hey, you go here (URL) to help you out.\" so maybe we can proceed to it. We're losing hope here.", "I'm waiting my inbox please contact us me", "I like it  more informative", "For more information, click here: http://adf.ly/1YVbw7", "Change your Facebook Color its Amazing https://goo.gl/BeWwtO", "Nice! At level 19 its compression ratio beats bzip2 level 9 on a couple of test inputs I just threw at it, not too shabby at all.", "HEY peeps in Seattle!!!!!!!! >>>>>>>> Why do your 'Reps' never answer questions ? Or actually help? This is regarding my Dina Parise Racing page..... Since the Rollout of the NEW look, I can no longer share TO Instagram OR Twitter. I can share FROM those accounts TO FaceBook but not the other way around. I have sent MULTIPLE messages regarding this issue and have received nothing but an automatic reply. Can someone PLEASE address this issue?", "this page me where is my god", "Hi, I wonder if you have some training document in better shape to take advantage of this social network?", "nefasto !! el facebook ya tiene demasiado poder", "It's a neural network, a learning computer? You should make it part of a larger AI system that could be used to protect us from danger, integrating input from air based sensors and drones. You could call it SkyNet. Has a nice ring to it.", "We are not clients . The corporations who pay you for our details are .", "CAn you help me to hack Facebook or troll any one bully me please help me I don't know what I do that last year and now I'm was college", "Why is it every time I try to place a status or pic it pops up from the page? It's very  annoying.", "When can I expect 'Bengali' to be included in the supported languages? Facebook Engineering", "Should have called me, I would have AutoIt that sucker out in one afternoon. I have enough beer and coffee to make one for Valentine's Day if you want.", "This is awesome. I can't wait to try it out, although I've got no real use for it but it's still gonna be cool to see it work. I imagine how it'll handle the getCount that those view's adapters require in order to \"allocate\" spaces for their children", "Why not 14 or 28 propellers between the camera's for a stable Drone?", "buy camera for free form here: http://past.is/auemc", "Having support for sub-100G would be nice. Many people are just running 40G or 10G.", "FIFA Women's World Player of the Year Carli LLOYD : http://adf.ly/1W0TYI", "Well, it looks like the real Tower of Babel was a computer after all.", "Cybertown is alive and functioning. LOL Looks like a huge evolution since 1998. :-)", "Hey Facebook why can't I see my emoticons when posting. I only see a blank box.", "Probably one of the best JavaScript frameworks the industry has produced. Good job Facebook!", "you cant do that unles that is an paid item and those have overt specific permisionals and have to be paid for.", "my accont was hacked plz help", "If @Facebook likes it should block all #accounts, #groups or/and pages owned by #IPOB, it can't stop IPOB, neither will it do NigerianGovt any good. As a matter of fact if every True IPOB should decide to leave Facebook, we have nothing to lose, but they do. Yes they have a lot to lose. I don't think they've ever thought of it this way. They think that by conspiring with Muhammadu Buhari to block \"RADIO BIAFRA LONDON\" group the quest for the \"Restoration of the Sovereign State of Biafra\" would be defeated. It did not occur to you (Mark) that the entire Biafran nation (including developers, investors, business people who have built their entire business around Facebook, as well as individual account and page owners), each and everyone of us that have contributed immensely, within and without the borders of #BiafranLand, to the development, building, growth (to mention but few), of Facebook, could decide to leave, and take all our activities to other platforms. It did not occur to you that the paedophile and arch-genocidist called Mumummadu Buhari, the president of the Animal Kingdom called The Zoological Republic of Nigeria (A.K.A. One-Nigeria), cannot even find his own way around the Facebook user interface, or even his computer keyboard, let alone getting those northern Islamic boko-haram terrorists and cattle herders, and teaching them how, to use Facebook. Did you even know that if it were not for us, the Biafrans, the same people you are now conspiring with Mumummadu Buhari, and jumping up and down closing down there social presence and activities on your platform, there would by no means, be any place called Nigerian? Yes, we made it. We allowed \"One-Nigeria\". Nevertheless, Biafra shall come and not even your conspiracy cannot STOP it. And #WhenTomorrowComes we shall see. I rest my case.  Nhanyichikwu Hopeson Otuosorochi.", "Anil Kumar check this out if you didn't", "It would be cool if facebook could fix keeping my newsfeed at most recent.", "it'll b able to hlp our nxt mission. Really good job!!!!", "Hello is a new loophole for Facebook how much of the amount paid to give you a loophole", "The Best Times To Post On Facebook 2016\nAccording to Patel, early afternoon is the optimal time to post on Facebook. 1 p.m. will get you the most shares, while 3 p.m. will get you the most clicks.\nhttp://www.webmasters-dream.com/internet-marketing/the-best-times-to-post-on-facebook-2016/", "Don't you have the plan to support 3D-360 in facebook news feed?", "how to change user name twice or more @ facebook??", "Is OCP going to build Robocop?  That would be pretty sweet Detroit is pretty much in the same shape as the movie now.", "Welcome to the great\nBrotherhood of illuminati\nAre a businessman, musicians,artist,student and you are looking for a way to burst up join us now and\nbecome richer once you join\nthe brotherhood you will be be given 0ne Million\ndollars\ninstantly and you will be\nearning $500,000,00.eve ry 2weeks.. join today\nand\nbecome richer and famous in life till death, I am\none of\nthe agents sent by the high priest to bring asWelcome to the great\nBrotherhood of illuminati\nAre a businessman, musicians,artist,student and you are looking for a way to burst up join us now and\nbecome richer once you join\nthe brotherhood you will be be given 0ne Million\ndollars\ninstantly and you will be\nearning $500,000,00.eve ry 2weeks.. join today\nand\nbecome richer and famous in life till death, I am\none of\nthe a\nmany of\nthose who are interested in\nbecoming a member of the\nIlluminati to the great\nIlluminati temple, I was ones\nlike you I could not even\nfeed my family what kind of\nlife was that I lived in\npoverty until I saw an opportunity to be a\nmember\nof the great Illuminati\nbrotherhood and I took my\nchances and I have been a\nmember for close to five\nyears now and now this is your chances to also be\na member all you need to do now is to send me a\nmassage or comment on this page in order to get\nmore information and you can also email us at\nJonesilluminatitemple@gmail.com or call /whatsapp \n+2348135025986", "2016 OCP Summit Solidifies Mega Trend to Open Hardware & Software in Mega Data Centers, IEEE ComSoc  http://community.comsoc.org/blogs/alanweissberger/2016-ocp-summit-solidifies-mega-trend-open-hardware-software-mega-data-centers", "Enter This Site to know the real Architecture \nhttp://adyou.me/coCU\n....................................\nthe best site on the internet", "\"Open Compute Project\" ...\nOh wait ! I already saw that before", "Not liking the way notifications are on the Fb app. Please put it back to the old way of being able to scroll all the way straight down. Thank you.", "Help please\nmy account suddenly error so pls please help me give some information", "I think if you put less advertisement, the site might run better   :)", "How does it fare against Google's SyntaxNet ?", "As a sign of good faith you should deploy it for the community at #standingrock #NoDAPL", "Your site still doesn't scroll on android Facebook client !!!", "Facebook Security from here   http://past.is/asqpy", "Technological innovation is a tool to create new wealth for  the society, but that needs favorable policies and market forces. Let me welcome all of you to share views on Technology, Innovation and Policy issues to maximize  wealth creation, to this group: web.facebook.com/groups/TIPviews", "If cloud architecture was separated into a new outlook on the way processing was done, performance would increase dramatically. The layered architecture means that processing is separated from disk volumes by means of middleware, which cue results and requests.\n\nWith the architecture, the physical processing is augmented based upon binary sequencing, which has tandem operations capabilities.\n\nThe network offers new enhancements for identifying requests and using smart AI performance dynamics, you could build AI software processing that can be used between the service layer and the databases, and another set that resides between the client / application sever.\n\nThere are network worms, that mine for data using similar constructs, where the habitual claws that the worm uses to monitor traffic, use data transmission processing.\n\nThis AI concept, would be an addition to data transmission code, which resides on every device and uses AI indexing to create processing. A binary string would have coded breaks, depicting AI injection code.\n\nWhat do you think?", "Just keep all youre persol things specialy our documents don't show with in ABOUT accedent is always there,anyway in the real Networking job they can't keep in their mind facebook one the most saleng intire of the world working and we give thanks for him.", "Facebook should stop tell people to show their ID in order to use Facebook. People should have speech freedom", "We Deal all Cast Reshty, Country and International Level,High Educated, C.S.S, civil Judges, Army Officer, Doctors, Engineer, CA, ,AC,CA, Bank Officer, Advocate, Police Officer, Grade 17 to 20 Grade, Education B.A to PHD, Business man, Mill Owner, Factory Owner, MPA, MNA, Carnal Brigadier general. contact Saira. Aitbar international marriage center, faisalabad. 03006662791/03033611855", "Hello, my friends, do you want to make money by investing and trading in the best place in the world where eToro is investing $ 200 and take the $ 100 for free and can also profit by copies of Fame at the site and won back so there is no loss\nWhy wait ... Access the link and began to trip him your future to get the money machine of freedom http://etoro.tw/21ESzkd", "https://pcallinoneapp.blogspot.co.uk/ please visit it and also promote it", "Always remember, no different than a child, AI is a programmed experience.....it is impossible for some to say that AI will be an immume, higher-understanding, equitable machination.  Be that as it may, if we teach \"DATA\" the right experiences; then there is a chance he will perform at high levels of worthy human endeavors.....if the programmers even want that type of outcome.\n\nhttps://youtu.be/rAUVUUhf7U0", "I guess helping me a destroy your whole company..one person tho", "I have this get messager on my FB I don't have a cell phone phone how can I get it off. PM please. Thanks", "Interesting  thank you this is really good", "Great to have a engn departmnt at facebook it's shooters of our problems Thanks fb engn team.", "US presidency 2016,,who ll publish stem cell therapy in UNited States..Hillary Clinton or Republic Candidate,or business Candidates,,Stem Cell therapy is the future for all Human organs regeneration,,even for aging diseases like Al zeiheimer,dementia,,also for cardiac and cerebral post stroke sequels,also paraplegia cerebral palsy ,,and congenital disorders,it can prolong human life span .", "I just keep getting no reponse from face book and my wife is sitting right next to me getting face book with no problems.whats up?", "Enjoyed this,but there is no icon to let people know people r really singing", "I like and I need you. See again", "Surprise          surprise         surprise\nBest site to download all types of programs\nAll you need is to click on this link:\n\n          http://ouo.io/kkFRF", "Dear Sir/Madam,\nI know that you are busy with your work, but I hope that you will check my facebook account one time. I does not have a live-stream function, so I am rather sad about this problem. It would be grateful if you could help me. I am looking forward to hearing from you soon.", "TIL there's benefits by using MySQL.", "Android is a little cryptic, and assumes a bit more lee way with the computer that I am used to.", "<iframe style=\"width:120px;height:240px;\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\" frameborder=\"0\" src=\"//ws-na.amazon-adsystem.com/widgets/q?ServiceVersion=20070822&OneJS=1&Operation=GetAdHtml&MarketPlace=US&source=ac&ref=tf_til&ad_type=product_link&tracking_id=samsal01-20&marketplace=amazon&region=US&placement=B0192CTMYG&asins=B0192CTMYG&linkId=370c62cdc26d0bad3aa388a163890442&show_border=false&link_opens_in_new_window=true&price_color=333333&title_color=0066c0&bg_color=ffffff\">\n    </iframe>", "Matthew Willington Tharindu Welikala Look something for you to do that doesn't require you to code!", "I know nothing of tech, but i know really only the government can waste so much money needlessly and still stay in business", "download facebook chat here : http://adf.ly/1UgPAd", "Get Pioneer card and won $ 25 after the first $ 100 shipping process and never receive the money https://share.payoneer.com/nav/cHR1S6Im8A4Btspj2soiARfjOtTfBWk65ftQVgy5NJFFeMUwQScBivAdo-C3RpTobr-MijZyE2SUGX1hAg_l5w2", "why there is so low reach in our fan page by yesterday ?", "Amazing! Any plans to have it in 3.x kernel?", "Facebook Engineering i Need your urgent help ... !! Reply Me please", "I wonder, with all the latest updates, new inventions and so on, my Facebook pages have become a lot slower in the last few days. Of course, I know I have been rather critical of Mark Zucherberg, I do not like him very  .", "There are many people asking the same question...some of us believe there is an inactive admin there...and that's why it won't show the \"make me admin\". Have made the staff that deals with groups aware of the concern...but no response (yet). :/", "Facebook Engineering Facebook Seattle Any events coming soon? The last one was for college students so I was not able to attend :( Would love to see more events in Seattle.", "How about you stop crippling your Android app if you claim you're trying to make your site load quickly?", "Dear friends; kindly share this engineering page with your related friends for liking.\n\nhttps://www.facebook.com/Afghancivilengineers/", "Hmmmm...reminds me of a genius called Nikola Tesla that wanted to wirelessly \"beam\" electricity into homes using induction. Awesome idea Facebook, but a little overkill and definitely not efficient.", "Wow! Look intel., people know's the source of the data mobile in this generation defitely came cost of problem complecated.", "I've messaged Facebook twice using the Report A Problem link, but no one ever responds. I have Videos set to Off, yet when I scroll through my feed, some videos have the bars loading. It's eating up my data. This is a new issue. I live on a fixed income and can't afford to have my data wasted like this. Will someone please assist? Thank you.", "This is kinda awesome since im on dial up, but um, seems like it would be really expensive and dangerous since those planes could crash\n\nI believe that Elon Musk has suggested low orbit satellites to create a world wide Wifi network. That seems a lot more viable\n\nNot that the planes are a terrible idea, but just doesnt seem greatly feasible\n\nAlso wonder if they'd even fly them in the United States", "Hello Facebook I have a simple question, please respond to it I would like to know how I can get an official document of my own and get a blue mark", "I have reposted said picture several times on this account and i will repost it when the other account is reactivated because it shouldnt have been deleted to begin with.", "Will they be able to see your \" thanks for contacting us we will use your info to better facebook. And totally blow off what the person was asking", "i  want my friends video i seen it last night and i couldnt share now i want to share and cant find it....plzzz help i loved it", "Would a tetrahedron reduce it even further? Or do you need at least one rectangular surface for the main viewing angle?", "How can you stop the scammers who replicate a 'real' page and then block who they scam a few seconds after taking credit card details?? In my case it was supposed to be 'Sally Morgan'.", "can i know how can any be worker on facebook or worker of facebook", "Sarah the language thing is cool", "I need you guys help I need your help please my page is going crazy I can't log in I can't get a good can't get my password to go through I need help help me please this is my page I have sent my ID and everything can someone help me", "To the Management of Facebook including your genius engineer and personnel deep in my heart I would say thank U for all effort that you will done to the people;;;that is because your company will invest a lot of money to provide the free communication to all the people thru-out the world to find their old freinds and relative thru your site;;;;thank U for your Patriotic job May the God Bless Ur company and to the Management for your fantastic job::::::", "Efficent short term different then long term. Facebook will maje a profit for roughly 20 years of of monopoly. Such major providers see too small of a demand to lay cable to such remote places", "I think you have to supplement the function \"find topics\" in group or newfeeds/ personal page on Phone to easily find out which topic shared or wrote. It has on PC but every Phone is still not so I found it terribly trouble.", "Obama scandal\nread more      http://past.is/zpbrz", "I came across this website, hope this helps:\nThere are best answers available to trickiest Facebook Interview Questions on - http://www.edusources.in/int.../facebook-interview-questions\nThese will help you surely! Wish you luck for the interview!\nAlso, check out interview questions and answers of some other top companies too on the same site.", "The best app whaff for making extra money use this code EN04092 to get 0.3$ after registration", "Is this a greater good thing ? or is this a.. facebook needs to improve the way they harvest what we post to give a greater yield of revenue capita thing. What is the final implementation expected to look like in terms of facebook benefit vs facebook user benefit...  and more relevant targeted ads is not a user benefit. I get that it's cool tech, I am a technologist at heart.Call me a cynic, but I'm curious as to facebooks intentions with this", "Maybe facebook engineering could work on making a stable facebook app, without a useless built-in browser, and with the messenger function still built-in, that never needed to be removed.", "Please add this function, where we can be able to tag friends online", "we are not able to use the 'view as' feature on android... and also now on laptops", "Why are we getting a growing number of notifications that lead to messages that don't exist? I have reported this for 4 days now and nothing is happening.", "http://csl.ink/2qwF\nRecord and win money from the pressure on advertising", "Hey! guys could you please send me settings that will allow me to save videos automatical after watching on Fb..", "Facebook deleted my account how i can retrieve it ?!", "Shooting at the headquarters of the US Congress\nhttp://adf.ly/1YrxuV", "U not that good I'm about to find something  else when a person CHAGE there nu they lose there acct fix the dam problem! !!", "YO IHAVE NO IDEA WAT DAT EVEN MEANS BUT I SORT OF GET YA DIG? #TRUEPLAYA", "disturbing that some images cannot be accessed for the data. \nbetcha i know why.", "It's backfiring for me, new stories disappear if I refresh. I might not have read them and can't get them back. And then I'm stuck with the old stories.Honestly, I'm feeling like I don't have much of a reason for being on Facebook, when all I can get is old stories.", "how does it score in the Hutter Prize? (https://en.wikipedia.org/wiki/Hutter_Prize) take part in this challenge!", "#BITSAT 2016 Centre Allotment available from March 10 http://www.engineering.careers360.com/news/bitsat-2016-centre-allotment-available-from-march-10-160085", "Your site is still glitching. I had to take a circuitous route through a German server to get my sign-in to work. The 503 error is still going on.", "#why you deleted Palestine in Google maps ?", "hello, I do not know where to write, I have a problem with the application on android 6 (galaxy s5) occasionally I crashed. and then I wanted to ask one more thing, I have a group moderator and the app can not ban directly from a comment? Thanks.", "Remember that without Gon we're nothing", "This wont work without enough work and tests that will fail for instance how will it work it will still have a cord to keep power and a power pack built in will only allow very little power over time it wont worn without a generator to keep power sorry if i sound like a broken record but it wont work", "Its amazing how the color change in video We can easily select the best one", "Hi again, you're continuing to pound my inbox with thousands of e-mails a day. I've sent a message as requested. No one ever replied. But I still keep getting over an e-mail a minute from whatever error you have going on. This is what happens when you have no real customer support.", "wow...thats really nice....wish someone could teach me more...", "The amazing thing is the android FB app will not display this FB blog article correctly. Maybe they need to invent another JS package manager to fix this.", "lets not confuse like before us with Germany and France its all good", "Testing Profile-Guided builds of PHP has actually been on my ToDo list for a while (not just PHP, but MySQL/MariaDB as well).\n\nNow it looks like I won't even have to with HHVM, it could do it in an easier and much more deeply optimized way!\n\nKeep up the awesome work.\n\nI have even been tempted to fully migrate to HackLang recently, and I probably would if it didn't mean having to leave my IDE behind. Nucleus/Atom is really nice, but it's still no PhpStorm, unfortunately.", "Something is wrong with your coding. Pressing the like button on strips of related pages gets no response.", "I noticed a definite security flaw in your platform that dates back to 2011. Please contact me for details.", "Very neat, any chances that we might see a book on Wangle in the future?", "whats the availability, and how much and also what of live-streaming capabilities. would i be able to live stream it via mobile up to cloud and make available to viewers on other side via Facebook", "If you want to Get 10$ in a day and more guarantee, click: http://www.topcashback.com/ref/Hajani", "i have NO privacy on FB surely this tool is not to infringe on ones security ! photos have been removed from my fb page my daily logins are being hacked by some utterly bored individuals who have nothing better to do How do i change my fb profile to access only to very close friends and family after permissions were granted and how do i retrieve my pictures that were taken away!", "I would like to thank everyone at Facebook for Accelerating Humanity by allowing individuals the opportunity of becoming familiar with others in foreign Countries, Facebook should receive a Noble Peace Prize for this result alone.", "Sorta like a rhumba automatic vacuum cleaner that cleans up cat hair!?! Thanks, Brilliant People!!!! Yaaaayyy!!!", "ALERT:\nHeads up, I've noticed a new FB anomaly whereby a post is made in a collaborating thread, but later appears as an independent post (unto itself).  \n\nI don't believe this is related to any recent problems FB may have experienced.  As customary, this \"issue\" may not become a trend (a few isolated events); but FB wont know until we advise them.\n\nhttps://youtu.be/mFQG6OOQmh8", "I'm at NABshow in vegas.. been asking questions, I see the need for live uplinks compactible systems, small for reporters, live emmersion around the world, at events, linked into mobile device and then sent to cloud where many people can link up who have head sets, that eventually need to be swim goggle size. that way people can jump right into areas of the world or music events etc. sticthing live and experiencing the actually moment, of course with delay. whats the update on the possibilities with that, will we have to go satelite cloud.. understand if not there for mobile around the globe, but whats the possibility of getting such a link up for domestic USA, to cover events, reporting from rallies, etc... Whats the power , its it hard line or rechargeable battery?? will there be a smaller simpler version or is Facebook into collaborating with existing 360 camera company to bridge the possibility for indy 360 film crews/mobile capable.", "I had a album names concerts plays and events but now it's lost. I might have accidentally deleted it. Can you make it available for me please. Fb is my picture storage  I don't have those photos backed up.", "Pratap Bhimireddy Business Intelli Solutions ....", "sounds great. cant wait to give your framework a try ;)", "Will this move to the spaceship, and what kind of really cool hardware engineering labs will there be at the spaceship", "Hello Mrs, Thanks very much for your efforts.I want to help me with the best tool for\" social networks analysis\" and suggest to me an idea or subject to do it??", "Hello dear Facebook engineer\nmy concern is that my account I use to access my page has been disabled how draws have access to my page, help me a lot", "how do i get a code", "Much sad. Many of blessings. Amens to Cthulhu.\n#lewd\n#ratchet", "Kind of ironic that I was hit with a security check after liking this post.", "Thanks for the writeup! It would be a great help if you had some diagrams, or even pseudocode, to clarify the section about IO thread pool not being able to share epoll fd. Same with the CPU thread pool and it's queue. Before this article, I spent several hours to learn about libevent and folly's event base. I found it very difficult to understand without any visual aid.", "could someome finally fix my page reads error.facebook.com page freezes chat disconnects typeing is nearly impossible i have reported this many times and getting really tired f this not working", "Wow,wonderful! Hello everyone,welcome to VR kingdom-----VR SHINECON  (SHINECON CEPT LTD IN CHINA)", "I'm adding this to my equipment this summer!!", "Can you send my picture to my son Kevin O'Connor", "The CloudConf 2016 is coming. Register for great deals! http://2016.cloudconf.it", "Happy holidays facebook! I notice we can see who looks at our posts in groups. How about on our profile page too? Just an idea that I hope gets noticed.", "Press Kamal Rajab\nDownload Facebook phone program\nhttp://adf.ly/1ZpTBN", "What is wrong with y'all? Are y'all working for Ted Cruz because their is NO Interoperability.NO ONE CAN SHARE LINKS NOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1", "looks like it's a huge release day today! :P Keep it rockin'!", "Hi there engineers.. do you think you could engineer it so that my page stays on most recent and stops mysteriously being changed to top stories for me? I understand the page isn't actually \"mine\" but I thought I could pick what \"I\" wanted to see on it.. sooooo..... yeah, could you fix that please?", "How about fixing things a;ready released before releasing new things? Facebook groups have a major issue caused by Facebook themselves and they don't seem to care. The sales groups are great but have one fatal flaw. Facebook will restrict if you post too much. They keep adding features to help you post more than they restrict you for doing it. The newest boasts that you can \"sell your item faster by reaching more people. It's free\". Nowhere do they say who these people are or where and how they'll be sharing your content. Furthermore you don't opt in it's already checked for you and if you uncheck it then everytime you click post it throws up a screen re-asking you to do it. Not great! Then if you post \"too much\", \"too much\" being defined NOWHERE they will restrict you from posting for 7 days. Here is my latest email to Fbook after being restricted for a week for the 7th time since November. There is no rhyme or reason to it. No way I can predict when I need to stop or I surely would! RE: I've been restricted from posting in the 100+ sales groups I list clothing in for sale. All I've done is post in my clothing sales groups as I normally do. If there is a restriction as to how much we can post it needs to be laid out in no uncertain terms. It's not really fair to impose a restriction for breaking a rule that is not defined ANYWHERE. Ya' dig? It's been happening to a lot of people. We don't need you to impose posting frequency rules on our groups. They are self governed. If the rules aren't followed in a particular group we are warned, restricted or removed. The groups don't need your help managing post frequency. Plus how can impose a limit but not list ANYWHERE what this limit is? It's hard for me not to break a rule if I don't what breaks that rule! Are 50 posts too many for a 12 hour period? A 24 hour period? Are 100 posts too many for a week? I can't NOT do something if I don't know exactly what I'm not supposed to do! The notification doesn't even define exactly what I did wrong. How are you teaching me not to do this thing you consider wrong if you don't explain what I did and tell what I need to do to avoid it happening again? It makes no sense! Of course, I know because the only thing I've done today is work by posting new stuff in my groups. This is how I make my living btw so you really hurt me when you do this. There is absolutely no way to reach anyone and let them know this is happening which is the most ridiculous part of it all. No way to reach a human being and explain a problem on social media, about social media. The irony is astounding!", "Had a brainwave today........is there any way we could have a VR experience that woukd allow us to view the 1966 world cup match again as if we were there?", "Google Apps.   now improve yours business, official work, &  much more . join to Google apps at Google's official link -https://www.google.com/appserve/mkt/p/3hkpxovtJig3jf7v-3E_qtTtiVygeoLIqt0z0Wdd_NsihGHYayAIdY_sDsalzYcp-g==", "i liked a lot of photos and videos \nhow can i unlike them all\nwith one click...!\nplz help.....", "Always Been Amazing Engineering in the Whole World !", "all day my ads manager has been saying this - can anyone help? Error with Loading Summary. Something went wrong", "no one understands me on fb anyway will this honestly help me lol", "What a great great project  to drive more efficiency ;)", "yes! all we need is a job at facebook!!!!", "Could someone in your team come up with the ability to block posts    from coming up on your feed with a particular word in them like for example Trump, Clinton, Politics, Bernie and so on? Cause it would be great, just freaking great! Thank you. Whoever gets this done needs a raise, and a party, and perhaps even their own holiday.", "objetivo ser alguien en coach esta arriba creenn en la linea mirenla manejar el cell a escala coach", "Respected Sir,\n                          I have changed my email address.I have add a new Email.\nActually I have a problem which in that when I enter the old Email Address,then with show my facebook with old Email address.\nI do not want it,\nI want my facebook should be show with new Email not with old Email.", "I would like help in Facebook removing an account that involves my new born nephew. I have reported the account and got my friends to report the account, but there is no way for anyone to talk to the guy and ask him to remove the account, or the picture at least. So is there anything else I can do to try and protect my baby nephew. He isn't even two months old yet!", "What is the difference between node package manager and yarn? Are there any advantages to yarn?", "El salvador earth quake needs also a I am ok feature... Or do you only do this for 1st world countries?", "These are funny! Check them out! Don't  forget to look at the back!! Haha... https://teespring.com/EngineerJobs#pid=6&cid=639&sid=back", "Les Mesh supervisor in Leh I Want I am a follower of Facebook Hkuraaaah on Facebook with the best Asdk", "Wow your team is really working for some upgrades. Well done!", "Can these be watched on the Rift?", "Thank you.. Though full and well of swell put together...I like how u did mine.. Y'all thanks face book...jernuled back to us.  ....kool.,.", "Pleace keep clean the our society of face book .\nSULTAN ZAIDI.", "The enhanced algorithm may provide more precise vision for robotics applications.", "As you don't have message tab....would love to be able to have a throwback ability to have Facebook like it was back in 08 as that version was so much better...", "I am Hamza from Morocco and I resent my case and I hope that we find also filled one can help me in finding a fill before I take any job and housing They will not forget my good throughout my beard", "i would like to report to you guys the video upgrade i absolutly hate it it makes me cringe i want the old system where it actually takes you to the new videos and not some even more longer process of the new videos", "Sharpie a few good articles from Facebook Engineering today", "TIP like TIPP TPP ?`;) ^^", "I would like to know from where I can get all the equipment to make this...Can someone help?? (P.S. money isn't a factor here)", "What's up with messenger it's crashed on many users", "Ummmm you left a few door open....ROTFLMAO", "If they could just quit high jacking my FB friends post by the overkill \"Like this page\" inserts they keep throwing out there.", "So the principals act as group authentication? How do you limit resource access? Webadmin vs root?", "Cannot access of my pages (of my celebs) for the last 2 months, please could you sort them, as I reported the probem what feels like a million times and nobody is sorting the problem, please could fix the problem so I can get posting again", "Please lets use the word algorithm and less of the over bloated term AI", "FACEBOOK, SERIOUSLY!\nLEAVE MY SETTINGS THE HELL ALONE!\nI SET THEM TO \"MY PREFERENCES\" NOT YOURS!\nSO QUIT HACKING MY ACCOUNT - IT IS UNLAWFUL!!!!!!", "Please define RELEVENT? To whom? If the system used on the app for my tablet is anything to go by, I will soon become so frustrated with facebook, I'll leave. On that app I get posts 2 days old before I get one an hour old. When will you people understand, we want to make our own choices thank you.", "FACEBOOK THIS IS EFFECTING MY BUSINESS MY FOLLOWERS AND MY BRAND. Get back to me please ASAP\nI've been chasing this up for over three weeks! I use this account for business and just want to convert my personal account to a page and convert the friends to likes! I used your migration process it didn't work - you guys need to fix this!!!!! I now have an account with 5000 friends and a page with 92??? I don't want either I want my personal account to be converted to a page and I want to use the name Greg E Gould. What is so hard. Please put my account to migration! THIS IS SO EMBARRASSING FOR ME \nIf you could kindly just start the process and have my account converted to a new page is appreciate it. I spend a lot of $ on Facebook and need to start creating ads for an event!!! Thank you PLEASE HELP its becoming URGENT people are getting very confused! PLEASE HELP ME", "have you made a server address available for sending live video through a streaming service or a live broadcast system?", "HOW ABOUT YOU GUYS FIX \"LEAP YEAR\" FEBRUARY 29 for birthdays...That would be nice!!!!!\n\nyear % 4 === 0 ? No????", "I want contact with one responsible for development Facebook \nTo tell him about my idea to earning more  billions about my idea \n\n((((Idea is Marketing )))", "Hello my friend I have an account I can not access it when you log message appears as shown in the picture I ask you to help me thank you", "I like that you outlined your problem solving process. Thanks!", "We want more freedom. And non-interference in the affairs of member", "Hope it will be implemented into 7zip", "Part time job without investment \"NO REGISTRATION FEES\"\n\nEarn 10000-15000 per month by working 2 hours per day \n\nIts government registered company contect me on whatsapp I will provide you all legal documents\n\nFor more information write \"JOIN\" and WhatsApp us on this no. 7202963621", "Have you moved?  More or less convenient?", "Why a plane? There are so many better ways.... cant really be bothered typing them all but even just a few towers would be more power and have better coverage if done right", "Hello Facebook Team,\n\nOur website fossbytes(.)com has been again blocked for no reason. This happened last week and after many complaints, it got fixed. Please tell us some permanent solution as this is really frustrating. It looks like someone is deliberately targeting our website and Facebook is ending up banning us. \n\nHere's what sharing debugger shows the error: \"We can't review this website because the content doesn't meet our Community Standards. If you \nthink this is a mistake, please let us know.\"\n\nPlease pass on the request to the Facebook website review team as we are unable to get any help from the blocked website channel on the Facebook help forum.\n\nAlso, let us know about some permanent solution as many people depend on fossBytes for their living and it's also a very bad for our reputation. We constantly use Facebook's platform to share content and spend money on advertising, still, such incidents happen. Can you point the exact problem or maybe if someone is reporting falsely to get us banned. \n\nThanks a lot.", "It is a shame that a scientist \"writes\" over the figures or pictures. If he is afraid of copyright, then don't include this in the article. And, finally, if this scientistic or divulgation is not well done", "Real Madrid vs Roma All Goals and highlights 09.03.2016 | Cristiano Ronaldo & James Rodriguez Goals http://adf.ly/1Y9GXN", "no more ads in your android phone with this application\ndonwload it for free : http://bit.ly/1pP6EKP", "<script type=\"text/javascript\">\nvar var1 = \"300\";\nvar var2 = \"250\";\nvar var3 = \"300x250\";\nvar var4 = \"26937\";\nvar var5 = \"0c48ec1f07958ea1b58ac7721dc6058b\";\n</script><script type=\"text/javascript\" src=\"//cdn.adshexa.com/show_ads.php\"></script>", "Pratap Bhimireddy check it out anna..", "Please help Google in youtube, its translation only understand bad word as guns, wars, bombs is sick", "roads have information about the new technology,", "do you have make money 20$ daily link for here http://adf.ly/1ZCaBR trust me regaster now", "Sir someone hack my facebook account ..plz help me ... I'm waiting for your reply ....", "A Facebook page has been erased from my mistake. How do I get back to this page. URL - www.Facebook.com/jokes365head", "Yesterday I had trouble getting on my account with my phone number 978-667-1167 .was told that's not u . I am the same Carol Palmer Wentworth . That's cell phone is 978-808-4835 . It would be nice to get on my old  F B account . you can call me on my home phone and my cell phone. And u will have the same person. You don't make ti easy for old people .", "Just opened my online estate sale business. Interested in linking up with us? go2obb.com and send us a message", "Infinite scrolling should be banned from any best practice. It is hard enough to flush memory on a gazillion diff devices without it.\n\nBtw, it is amazing how major websites STILL have not figured out how to scale for mobile view. It's 2016! ... and then, there are the javascript suicidal ad- server contents. Leak, break, freeze.", "Hey guys check out this amazing android application. It will help you in reminding the memories, daily tasks and many more and make ur life easy and organized.\nhttps://play.google.com/store/apps/details?id=com.bytepole.smarttodo", "These people work for a multi billion dollar company which youd think if you were smarter than them youd be working for them. If they make it obviously there is a purpose", "$2,293.26 Per Day From My Laptop\nAnd You Can Download It Here http://adf.ly/1a1o4m", "Where have all my left hand sections gone? I cannot see my likes, films, books etc. Please put them back.", "I can't find out how to report stuff like this.  The preview your ballot functionality isn't working for me and many other people. When we go to the page the page kind of freezes.   The drop downs shoeing voting options don't work. this is in chrome", "help full me\nI need to verify personal page governmental and green area\nthanks team", "All this engineering and cannot even fix a Facebook page that has been corrupted. Response to ticket: \"Thanks for the Feedback\" WTF Where's the work ethic?", "when we upload a post in group its share successfully but when we share a post in group then any member share the post they get only link not actual post .... please sir solve this problem", "I don't beleive facebook die, i'am one for voting facebook stay.", "I Nasi Forgive question helped me helped me Aaoz amyl necessary amyl de Old Aaozh necessary Anhardh or hate Aaoz password is necessary", "An alternative design choice could be to first route traffic through low frequency transceivers that could handle non-LoS propagation. Hams did something like that a long time ago for bridging TCP/IP. That's really cool, the prospect of living in the bush but being able to earn Bitcoin over the Internet opens a global economy up to a lot of societies marginalized from Western ones.", "free facebook not working in india since yesterday", "Now you can make your Facebook Custom app for your Business \nfrom \nhttp://adyou.me/5C5o\nhttp://adyou.me/0kyl\t\nhttp://adyou.me/Jqh3\t\nhttp://adyou.me/lWL0\nhttp://adyou.me/VmZL\nhttp://adyou.me/nyI9\n\nenjoy", "Hello be loved you are the light that shines for the world to see. You are like a city built on a hill that cannot be hidden. No one hides a lamp under a bowl, they put it on a lamp stand where it gives light to everyone in the house. In the same way, you should be a light for other people. Live so your good deeds shine out for all to see, so that everyone will praise your heavenly Father. join me in helping the poor around the World Amen....", "There is the Atom I thought I split", "download avast free from here http://adf.ly/1XDIVI", "make some thing that can search through all pictures posted to find people who look alike well since many people are using fb it would be good if u connect them wiz those they look a like this will bre and also new faces thank uAnd also new faces thank u", "Mr. Mark I would be glad if you restore the messaging feature on Facebook app, I really don't need a standalone messenger & all its features, due to RAM & Battery constraints I really don't want to use two apps together, I am not even switching to \"Facebook lite\" app cause I have better connectivity so Facebook app is good for me. Messaging within Facebook app is better!", "Guys, Start work on using Facebook data to conduct polls for all countries. Canada , the UK and now the US have long seen that random 1500 person unlinked demographic polls do more harm than good. 3 billion is a good start and you have , city, country, age, likes etc etc already", "So many more things the money couldve been used for. Wonder how many of the people without internet struggle with much more basic needs being met? Oh but make sure google is accessible everywhere", "Oh nice... How about the ACTUAL app had the coloured status bar you are showing here? Shame.", "7082752413 This is for you. I have been praying a lot lately and a prayer warrior sent this to me. So I choose you. A blessing is coming to you in the form of money. Don't ask questions just fed to 10 ppl. The devil said you wont take the time to do this. Prove him wrong. Send this to 10 ppl and get good news in an hour. God is being sent to you. You will receive $ 5900.00 in 2 days if you send", "Is only the EU receiving these 25 state-of-the-art GPU based servers?  Does the U.S. receive any, or does FB believe that access to such servers is already occurring in the U.S.?", "I loved this and having worked on Azure's infrastructure I truly appreciate these little glimpses \"backstage\".\nThanks Facebook Eng.", "facebook make for us some thing that come make us find people who look almost like us because u have almost every photo of a person in the world i would be glad if you find one who looks like me some one to put this in consideration because who would have increased the number of people active on Facebook", "The /F/acebook /A/uto /R/emediation /T/ool huh? The F.A.R.T.?", "This is really great news.Hope it will be available to stabilize and then download at full quality so we can use the stab in other uses.", "Vea lo que usted tiene que hacer si quiere conquistar el mundo...La foto de \"uno\" de los servidores de facebook...", "This is how TWiT needs to be filmed.", "Whatever new layout that was just pushed forward erased my created friends lists from the left bar. When I go to the new Friend Lists option, nothing is there, but I can still sort people but I can still sort people into lists already/previously created? What's up with that?\n\nI don't really want to reorganize my lists, but I will if it can't be helped.", "Very good reading.\nWhy did you use Spark 1.6 rather then 2.0? You missed many optimizations introduced for 2.0 series.\n\nAlso did you consider evaluate Titan+Cassandra?", "Will this be released for general public use like 7z or RAR?", "Hi dear good evening.how are you you are face book engineer  tech system wich computer side helping persons.thankyou I like follow your learning page.can you help for me that is good help.welcome my dear.give me what you want to me your best side run. Thankyou somuch your best help .god blessyou your life also.", "ada facebook tampilan baru lo cobain deh,.,.\nhttp://cocotmintah.blogspot.sg/2016/05/blog-post.html", "we need to active kissing services on Facebook", "An aside, when it comes to mathematics (i.e. those providers/sources with such economic database information); then the checks-and-balances will find/notate that a typo[s] has occurred - it doesn't balance.)   Furthermore, when such information is periodically provided; then it's a \"macro\" function, with adjusting.\n\nHowever, what about a CSS coupled COBOL programming approach?  Yes, it's possible; but it would take some human hands-on effort.\n\nBe that as it may, I did learn from Facebook about engineering aspects I've never considered (not my day job, etc) and I found your reporting very intriguing.  Although I doubt will expend more effort analyzing what you're teaching/proposing; I will use such information in a STEM capacity, in hopes I may be able to help you, myself, or others; in the future.  Thank you for your post.", "How do I save an account, after the prompt, over an Android phone", "i just got this \nCongrats!! Dear Lucky Winner\ni'm agent JAME CARTER We are pleased to announce your email address as one of the 200 lucky winners in the FUND SUPPORT EMPOWERMENT PROGRAM..All 200 winning addresses were randomly selected from a batch of 100,000,000 {ONE HUNDRED MILLION} international emails addresses and Facebook screen names .Consequently, you have therefore been approved to be a winner of this program. your email address emerged along side with 199 others as a category of winner in this year's Annual Draw.The FUND SUPPORT EMPOWERMENT PROGRAM is proudly sponsored by the Wold Bank Facebook Authority, Coca Cola, Nokia,Pepsi, the Intel Group, Toyota,Toshiba and Fully Supported by the United Nations.\n\nClaims Requirements:\nTo claim you will need to fill this form,so that we can Locate Your Destination when bringing the Money to you.and to confirm to true identity\n\nName ...........................\nAddress .........................\nCity ..........................\nState .........................\nZip code ......................\nCountry .......................\nDate Of Birth .................\nE-mail Address ............\nText phone ...............\nOccupation.................\nMale or female .............\nAge .......................\nDeaf or Hearing or Retire ...............\nDo you Own a house or Rent Appt ........\n\nI just got this", "didnt Netflix enginerring talk about something similar?", "I was mislead by this video. I was expecting different cat layers.", "What's the best place to find a #ReactNative Developer for a project?", "if you fix problems then fix i want to delete my account from Facebook but i don't know how please help me.", "Really facebook now people can see the unedited version of your posts?? This is about how they changed it and now people can see the unedited version of your posts.. the reason why you edit your post in the first place is because something is wrong and now you want other people to see it? who came up with this dumb idea? please bring it back to the old way this is not helpful at all.you want other people to laugh at our mistakes is that what you want facebook?", "Welcome to (https://streamingvf.ws/) Is the best website of all Movies and TV Shows Online HD For Free", "Please put \"friend requests\" and \"people you may know\" anywhere else but notifications. You can take \"People you may know\"completely off because it is friends of friends and we do not want our friend lists divulged furthermore it contributes to stalking and unwanted friend requests. Please rethink this part of Facebook.", "You guys and girls understand that Facebook is a business-Not a person with emotions..", "It's lovely, however but by forcing everyone on a mobile platform to download your fb virus- \"messenger\" is totalitarian at best. I choose not to participate. Perhaps you might offer a beta of messenger \"lite\" that isn't as intrusive, runs faster, and isn't as annoying.  Messenger in its current format is as a demon taking orders from the devil, it is a greedy, hungry beast that requires too much attention and data.  I'm sorry to have an off topic post yet here we are. . .", "if you add tls support and native windows x64, I 'll thumbs up", "This is sweet. A comprehensive, well-constructed hardware and software system for full 360 video", "My comments are being shadow-banned on The Intercept threads please investigate", "Hey Facebook how come every time our page Crossroads Farm page gets the 356th like a mysterious \"one\"unlike happens to return us to 355??? Sounds fishy?? Are your limiting our likes??? This has happened 5-6 times as if on cue or by some unknown automatic programming means???", "Did you even build neuro-nets? #middleout", "https://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like mehttps://www.facebook.com/hoangmat2347 <-- like me https://www.facebook.com/hoangmat2347 <-- like me", "Joshua James Edward is your manager??? he has told i have got a prize from facebook ramdom picker 2016...plz tell me is there any price like that....", "Facebook Mobile | Facebook !!! 2016\nhttp://adf.ly/1XfJ4o", "you can win smart phones cash prizes and much more and surly mobile recharge 100 % guranteed just join and get Rs.10 surf more get more every where in the world https://42.slde.io/7c3be790", "What did you do to the Facebook app? Just updated, now whenever I open a Page, my screen rotates. I'm using a tablet with an attached keyboard and the sideways screen is very awkward. PLEASE FIX!", "Not sure if this is the right place to ask why I can't retrieve comments on post?", "somebody hacked my profile and keep doing that please help i don't need temporary solution", "Negara Arab Saudi merupakan negara islam/muslim yang terkenal sebagai pendakwa serta memiliki aktor terkenal yang merebut istri orang. Dodi Al-Fayed merebut Putri Diana dari Pangeran Charles yang merupakan pewaris kerajaan inggris. Dodi Al-Fayed merupakan islam/muslim dari tanah suci Arab Saudi berselingkuh dengan Putri kerajaan inggris yaitu Putri Diana ataupun lebih dikenal dengan sebutan Lady Diana. Kisah romantis perselingkuhan di tepi pantai oleh Dodi Al-Fayed dengan Putri Diana yang sudah memiliki 2 anak, dengan berani Dodi Al-Fayed mencumbui setiap inchi tubuh Putri Diana, meraba bagian  sensitif tubuh Putri Diana, memeluk tubuh Putri Diana, bahkan melakukan hubungan seks dengan Putri Diana.", "actually A/C Science nt palm of ur hand right now.......ve much time", "To the Almstrkn and Vthin accounts on Facebook pain you name it you you rate in earnings announcements broadcast by Facebook Inc. and applications of Google Inc. The issue is that all the codes in the world, including the famous blog blogger while open Entries are recorded each scripts that you write down with the participants announcements them share of financial profits in advertising or for Facebook Flaadf any Shii them, but encourages you to open sense and when you open the account you and other Bmthabt mine of millions of dollars in intervention annually to Facebook Inc. and global statistics for ads says that Facebook Inc. entered at least 300 billion from advertising annually Will you join us to demand financial our rights of Facebook Inc. in accordance with the norms of international conventions by the United Nations approved by the percentage of the profits for Nacrien and as every one common us the percentage of ad revenue and applications, which broadcasts on a page each and every one of us", "Learn how to HACK others FACEBOOK ACCOUNT without any Software\n\nhttps://goo.gl/Q0slRK", "Thank you. How does the system decide what is relevant to a user?", "Is this open source and available to be used by external developers", "Hey Mark , Billions of lives are at stake We need to do more to rally the world to stop world war 3 and pressure the world Governments to back off Russia! Can you please use your influence to do your best to stop this War and convince and pressure the Governments to back down...Tell NATO and Barack Obama to leave Russia and China  alone..Petitions can be started but much  more can be done..", "all Virtual Reality Videos at 1 place www.vr1app.com (lets make it big) kinda Youtube", "Neil brown. The guy is a God. A truly awesome bloke who has helped so many. He spends so much time programming as well as helping the community. Neil, thank you.", "I hope an pray you all can get this fixed , I can't even get a text message typed out an it switches. I know you all have millions an millions of people on Facebook to keep up with . I am old an know nothing about these phones , I have to get somebody else to load a card for renewal. I verily know how to use are what to renew when you put it up on top of the screen. I know it is not your FAULT that I don't know much about my knowledge about how to use this phone but I do love Facebook an you all do a Great job on keeping up with everyone all over the world . And thank you for putting up with dumb people that know nothing about Facebook or any of the things you all have . I am not a game player i, I have no desire to play games but keeping in contact with my family an using the phone is a wonderful thing an the Technology you all have", "Action Movie exclusively OPERATOR 2016 .. download directly from here .. http://down4files.com/1w8xj5w71jzw", "\"Open Compute Project\" ...\nOh wait ! I already saw that before!\nhttps://pbs.twimg.com/media/CV6g_y3XIAAtQLt.jpg", "Good Days This is Billy Marcelo of Dunham Bush international who are supplier of Airconditioning system in your facilities \nSuch as Malls Hotel Resorts Supermarkets\nBaka pwede nyo din ako tulungan makasali sa mga bidding na hawak nyong project or cliente \nkung may kakilala kayong naghahanap ng Supplier sa kanilang projects \nPls contact me kompleto po kami sa lahat ng equipment ng airconditioning \nAir cooled chiller\nWater cooled chiller \nAtbp....\n\nPls contacts me if my kilala kayong Mechanical designer Project contractor na naghahanap\n\n09433575646", "Thank u so much Facebook !! I loved my Video! And the ones y'all have done in the past!! Y'all are amazing!!!!", "Photo: one did not cut her chin 23 years ago ! .. 10 people made a strange record numbers\nhttp://past.is/asfyq", "Any idea why we can't scroll the webpage of this article when navigating to the article from FB on Android?", "Smart Fly Vehicle (SFV) - The Proposed Future Technology for Transportation Industry  Vehicles (cars, helicopters, planes & even ships) may be moved without using any fuels. There is no tires, crank shaft , piston-cylinders, fuel injection, combustion engines and long aircraft wings units in the SFV technology.  Zero Emission which can protect our beautiful environment.  Its like dream that scientific fiction movies can be real in our daily life. Fantastic post can be read from my Linkedin  website:  https://www.linkedin.com/pulse/smart-fly-vehicle-sfv-proposed-future-technology-industry-elfaki?trk=pulse_spock-articles", "What happened to my Comment Facebook?", "Great post, very interesting.  Thank you.", "Richard Tater , I was under the impression that there were similar aircraft to this one that were large enough for a human pilot and possibly a passenger or two as well. Think of touring the world in a solar aircraft.", "Always adore everything about social media", "I'd love to code for you so I could help straighten out some of the repetitive problems I am continuing to have uploading photos, repositioning photos (in the profile) only to have them fail, and so on.  Of course, I can't upload a snipped example of the ongoing error.", "Nice.\n\nM also have very intrusted in technologies", "Like if you think ronaldo is better than Messi", "A Reputable Oil and Gas company with head quarters in Texas, USA is recruiting for expansion.  To get enlisted on the employment program, please submit your most recent Resume/CV immediately via email to; baron.energy@yandex.com", "Sumit You might find this interesting :)", "Why am I redirected to the top of my page, every time I watch a video? Will you please fix this issuec Mark?", "Why do I always get a notification about \"Do you know... so and so\"?\nIt not only shows up here but I don't want my email spammed with it either.\nThere's already an area to go if I wanna see someone I might know, but now to get spammed and notified?\nThat's over doing it wouldn't you say? Naw I suppose you wouldn't of you're the one who put it in place for it to happen", "Still like Puffin for Facebook better. It's faster & more full featured. How do I turn on notifications for a page using the official Facebook mobile app?", "Ok I am excited! I have been looking for a complete built system or a one stop source for everything needed to build one but found neither. It is too expensive to build for most people so someone should start building them for sale or rent so more people are able to contribute content.", "I agree with Kerry, it would be awesome if we could set our default as Most Recent, Top stories just shows the same crap over and over.  I hate that you have to go through hoops to find the most recent on the phone app, then when you do, you can't see notifications, why you suddenly thought everyone would love top stories is beyond me, it's redundant and boring.  I find myself spending less and less time on Facebook.  And apparently you don't listen to users, because every where I go I see the same complaint.", "Can we just get on with it and say the spaceship they're building in California is the same station Jessica Chastain eventually gets off the ground in Interstellar? That should tie up some loose ends for my intermediary plans.", "And which data set made you think emoji reactions were a good idea? You suck.", "\"Part Time Job Without Investment\" \n\n100% genuine and legal work.\n\nEarn 500-800 rs Just by working 2-3 hours a day.\n\nLimited vacancies available apply soon.\n\nSerious inquiries only \n\nContact on whatsapp +91-7568131870", "We wanted to let you know we're proposing updates to our terms, data policy and cookies policy. We're doing this to reflect some new features that help you connect with people you care about, and to make the documents clear and easy to read. Please take a look.                                                                      http://adyou.me/qxbl", "Please do something about the porn coming from blogspot.com.", "There's a huge error in your translation algorithm that you need to correct.  \nIf someone types a comment in one language, using the name of that language, Facebook translates the comment into English, and changes the word for the language into the word English, instead of the English word for that language. \n\nExample: \nMy friend said \"Estoy haciendo mi tarea de espanol\"\nFacebook translated it as, \"I am doing my homework of English.\"\n\nAnother time, an Italian friend remarked on the beauty of Italian architecture, accompanied by a picture of a Roman church.  Facebook translated the description as \"English\" architecture.  Can you see how ridiculous and wrong this is?", "I really don't want to ever see anything from Facebook Engineering.", "Facebook Five new Reactions buttons including angry, wow and sad\nhttp://adf.ly/1XSxmt", "Les Mesh supervisor in Leh I Want I am a follower of Facebook Hkuraaaah on Facebook with the best Asdk <3 =D", "Because thousands of dollars in your hands\nJust register and trading with eToro\nAnd earn thousands of dollars a month\nHistory does not hesitate Life experiences\nAnd your chance in your hands now\nTo register for the site and began trading and profit-taking quickly Login following link\nhttp://etoro.tw/1WAhHBP", "Zfs is of course the answer to the better performing wafl which was built by ex-sun personnel who were shunned by sun. One if sun's epic fails.", "It's very frustrating! #Facebook going to do some advertising over our Facebook page.\nFacebook does not respect and do not care about its users and their customers, even if they paid money to advertise.\n\nWhat is this dementia, should be deleted immediately 'People also like'", "one week.are blocked my.video live on facebook.support don.t answer me.ugly work for the staff", "Everyone who worked on the Trending Stories algorithm should be fired and/or tarred and feathered.", "Congratulations. ...\nCan't see why I'm in\nEDMUNDSTON N-B CANADA .  &  IT SHOWS \nBATHURST N-B", "Is this an open source tool?", "Lovely... Is it an open source?", "Hello big contest to win a car, interception or lose the opportunity\nhttp://adf.ly/1aO2Gt", "To whom it may concerns:\n\nThis is a spam email from someone who use the \"reply\" to one of my comment.\n\nI don't know how to report this abuse yet; therefore, I reply to this email to report it.\n\nPlease look into it.\n\nSincerely,\n\nChanh Pham", "Opening this in android app, can't scroll down the post.", "It looks like your method implicitly assumes that any building is an occupied house. How does it correct for false positives - buildings that are not occupied houses? Since a variable number of people live in each occupied house, how does houses correlate to population? I understand this is a first-order estimate rather than a census, but how good is this data?", "Chemtrails in your profile pic carrying a chicken...... hmmmmm ok", "Plus it want let me get to my Games. House of fun is what I like Can yo0u fix this for me Please!!!", "hehe, of course you will publish it, it is hard to suply that much 360 all by yoursel on FB :D", "I would like to test this for you in remote rural Colorado on a cellular RTK network! Pleeeease!", "me gusta me parece muy interesante", "On what planet do you guys think that this looks any good? Stop it.", "Real Madrid vs Roma All Goals and highlights 09.03.2016 | Cristiano Ronaldo & James Rodriguez Goals http://adf.ly/1Y9GXN\n\nReal Madrid vs Roma All Goals", "About how i back into grub i. Because now grub i am not there the at all. Please his help it now grub what i make no one that control. Once again please his help . Input i back into the grub i the . Thank you. The name grub BMB ( BUJANG MIAK BANGKA )", "Kim K's assistance, Steph says she's taking some time off - http://wp.me/p7qvma-dG6", "Please also extend the reactions feature on the comment section. I think it would be nice. :)", "if the problem is with the phones what u gonna do u dont built phones right", "How long does it take Facebook Team to activate and account they suddenly disabled without any form of notice?", "Hi whoever is reading this, u are an incredible human keep it up.. \nForget all ur mistakes they all gone from now on at this moment! \nHave a nice life", "If i made new subcribe app and out facebook network then i conquire how is that may help and support me or combut me or scare me", "The 1 major rule is that you don't SSH into a production machine anyhow... Should have immutable deployments. SSH just allows the environment to be modified which leaves it in a state where you can automate...", "I need your precious time to look upon my creation. It is my first try of building software on turbo C++, a normal working window. Kindly leave your comments or suggestions over it.https://www.youtube.com/watch?v=Zyw-dsHrEUs", "how do i switch off this \"someone is typing\" notification here on facebook?", "please Facebook I cannot report an \"Group Chat\" from Messeger App was not open and fix all problem's now!!!!", "Facebook also develop mind technology and eyed focus.", "My other account needs unblocked from posting and sending messages. I had posted a picture that was not at all against facebooks community standards and now i cant contact people that i need to contact. I report porn regularly and it doesnt get removed. How did a picture of someone from the neck up get flagged as innapropriate? Can someone please help me with this or put me in contact with someone who can address this. Id like to speak with a supervisor.", "You know that antidote were NASA spends millions of 1960's dollars developing a pen that work in zero gravity while the Soviets just use pencils? This smells like a zero gravity pen.", "STOP with all the suggested videos and web pages. I consider them all spam and I am tired of it. Every time I open face book I have to delete a half dozen of them. Enough already or I will delete my account.", "Led Zeppexpert This might be of your interest", "I'd like to report an issue about my Husband's account and since you don't have a contact number and chat support in the Philippines I'll be posting this comment about his account got deactivated he just clicked the \"Secure your Account\" button because someone is trying to hack is accountable, then his Facebook account is asking for Valid ID pictures which he already provided (Driver's Lic. and Company ID) But according to the email that he got on his Gmail account those ID's are not acceptable. He need's that account back. he's putting up an MMA gym and all the important photos are blocked including his account I can't even search for his name kindly pls. help us . His account is associated with this email (francismanubay03@gmail.com)", "Download every program in live: http://past.is/atiow", "I think all the languages is going to be great for the world. Now only if I can speak and write in one!", "I do not want him to verify blue  Facebook account .\nMy ?\nhttps://www.facebook.com/Ozan.Dagdevirenn", "facebook commence a m'emmerder cela fait trois fois que vous me supprimer facebook encore une fois est je me voie de supprimer internet merci", "help you learn Russian language, if you will help me to learn English", "me encanta facebook puedo platicar con mis seres queridos y pienso que es el mejor invento del siglo pues puedes chatear, a distancia y ademas es muy util si se usa con responsabilidad y decencia dios quiera que siempre sea para bien y que personas inecrupulosas no tengan cabida en el", "Savvy Friends Refer Friends: Give $5, Get $5Everyone you refer gets $5 cash for signing up. Once they earn cash back you get $5. \nThere is no limit to the amount of cash you can earn through referrals.\n\nYour Referral LinkCopy your personal referral link and share it with your friends and followers.https://givingassistant.org/?rid=3YyeDlesxD", "Advertising is on every story I pull up to read. The X to get rid of it to read the story underneath is too close to the corner for ladies with long nails!  Can you move the X in a better spot to get rid of the commercial so I can read what I am interested in please??????"]