["Evan Lima Jonathon Workman might be a drought for some people, but we still runnin that trap late night bruh", "Actually you did give a fuck because you were and fucked her. Then tried to do it 2 more times...", "Gucci says \"im dead\" he been in prison too long", "man when i was a kid all the kids did this it wasnt to be mean we always were joking... kids dont know better or mean to offend, if someone said thats wrong dont do it, bet most of them would stop", "A sikh turban with Arabic written below.Ignorant fuckin' Americans with half cooked knowledge about the world.", "Cameron Mills Daniel McGee i used to go into the stall and just sit on the toilet and play my phone back at tarshit haha", "AHAHAHAHHHA Tina Persia thats my face when u'll leave for cuba :v :v :v", "I don't even have to do that she got her own txt/ring tone. \nSaves me from needlessly checking my phone lol", "Damn rite its fuckn cold fool now u go put on some shorts since you so cool with this shit...", "More like taking my troubles away LOL", "Aaron Cluney looks like snoop dogg", "Brody Rover I found your twin bro", "The let me get my checkbook starter pack...", "Dam that fool blacker than midnight lmao", "They eat it in Europe sandwich", "Michael Scott I wonder what time his watch read.......", "Sami Will i can totally see you doing this", "Gowop! The realest in the game. Don't get body bagged... Wop!!", "That's because you pay for a cheapass services and they dont lol", "Me 2 instead of the cookie there's a wine glass full of Pinot Grigio.", "Watch Movies For FREE rosorogo.com\n>>The Conjuring 2 http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-conjuring-2-259693.html \n>>Suicide Squad http://edanturonkanggoriko.lazerpunk.site/streaming-film/suicide-squad-297761.html\n>>Morgan http://edanturonkanggoriko.lazerpunk.site/streaming-film/morgan-377264.html\n>>The 9th Life of Louis Drax http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-9th-life-of-louis-drax-294795.html\n>>Kickboxer: Vengeance http://edanturonkanggoriko.lazerpunk.site/streaming-film/kickboxer-vengeance-308529.html\n>>The Light Between Oceans http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-light-between-oceans-283552.html\n>>Summer of 8 http://edanturonkanggoriko.lazerpunk.site/streaming-film/summer-of-8-352164.html\n>>The Academy of Muses http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-academy-of-muses-353793.html\n>>Tell Me How I Die http://edanturonkanggoriko.lazerpunk.site/streaming-film/tell-me-how-i-die-410876.html\n>>Yoga Hosers http://edanturonkanggoriko.lazerpunk.site/streaming-film/yoga-hosers-290825.html\n>>Other People http://edanturonkanggoriko.lazerpunk.site/streaming-film/other-people-371449.html\n>>X-Men: Apocalypse http://edanturonkanggoriko.lazerpunk.site/streaming-film/x-men-apocalypse-246655.html\n>>Skiptrace http://edanturonkanggoriko.lazerpunk.site/streaming-film/skiptrace-270774.html\n>>jason bourne http://edanturonkanggoriko.lazerpunk.site/streaming-film/jason-bourne-324668.html\n>>Ghostbusters (2016) http://edanturonkanggoriko.lazerpunk.site/streaming-film/ghostbusters-43074.html\n>>Batman v Superman: Dawn of Justice http://edanturonkanggoriko.lazerpunk.site/streaming-film/batman-v-superman-dawn-of-justice-209112.html\n>>Bad moms http://edanturonkanggoriko.lazerpunk.site/streaming-film/bad-moms-376659.html\n>>The Legend of Tarzan http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-legend-of-tarzan-258489.html \n>>The Secret Life of Pets http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-secret-life-of-pets-328111.html\n>>The Jungle Book http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-jungle-book-278927.html\n>>Captain America: Civil War http://edanturonkanggoriko.lazerpunk.site/streaming-film/captain-america-civil-war-271110.html\n>>Alice Through the Looking Glass http://edanturonkanggoriko.lazerpunk.site/streaming-film/alice-through-the-looking-glass-241259.html\n>>Central Intelligence http://edanturonkanggoriko.lazerpunk.site/streaming-film/central-intelligence-302699.html\n>>The Infiltrator http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-infiltrator-325789.html\n>>Independence Day: Resurgence http://edanturonkanggoriko.lazerpunk.site/streaming-film/independence-day-resurgence-47933.html\n>>The Shallows http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-shallows-332567.html\n>>Barbershop: The Next Cut http://edanturonkanggoriko.lazerpunk.site/streaming-film/barbershop-the-next-cut-326423.html\n>>Money Monster http://edanturonkanggoriko.lazerpunk.site/streaming-film/money-monster-303858.html\n>>The Nice Guys http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-nice-guys-290250.html\n>>The Darkness http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-darkness-257345.html\n>>Keanu http://edanturonkanggoriko.lazerpunk.site/streaming-film/keanu-342521.html\n>>The Boss http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-boss-323676.html\n>>Zootopia http://edanturonkanggoriko.lazerpunk.site/streaming-film/zootopia-269149.html\n>>Criminal http://edanturonkanggoriko.lazerpunk.site/streaming-film/criminal-302156.html\n>>My Big Fat Greek Wedding 2 http://edanturonkanggoriko.lazerpunk.site/streaming-film/my-big-fat-greek-wedding-2-302688.html\n>>Miracles from Heaven http://edanturonkanggoriko.lazerpunk.site/streaming-film/miracles-from-heaven-339984.html\n>>God's Not Dead 2 http://edanturonkanggoriko.lazerpunk.site/streaming-film/god-s-not-dead-2-347126.html\n>>Eye in the Sky http://edanturonkanggoriko.lazerpunk.site/streaming-film/eye-in-the-sky-333352.html\n>>Star Wars: Episode VII - The Force Awakens http://edanturonkanggoriko.lazerpunk.site/streaming-film/star-wars-the-force-awakens-140607.html\n>>Rogue One: A Star Wars Story http://edanturonkanggoriko.lazerpunk.site/streaming-film/rogue-one-a-star-wars-story-330459.html\n>>10 Cloverfield Lane http://edanturonkanggoriko.lazerpunk.site/streaming-film/10-cloverfield-lane-333371.html\n>>The Huntsman: Winter's War http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-huntsman-winter-s-war-290595.html\n>>Deadpool http://edanturonkanggoriko.lazerpunk.site/streaming-film/deadpool-293660.html\n>>Fantastic Beasts and Where to Find Them http://edanturonkanggoriko.lazerpunk.site/streaming-film/fantastic-beasts-and-where-to-find-them-259316.html\n>>The Revenant http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-revenant-281957.html\n>>The Trust http://edanturonkanggoriko.lazerpunk.site/streaming-film/the-trust-301608.html\n>>Wonder Woman http://edanturonkanggoriko.lazerpunk.site/streaming-film/wonder-woman-297762.html\n>>Everybody Wants Some!! http://edanturonkanggoriko.lazerpunk.site/streaming-film/everybody-wants-some-295699.html\n>>Hardcore Henry http://edanturonkanggoriko.lazerpunk.site/streaming-film/hardcore-henry-325348.html\n>>White Girl http://edanturonkanggoriko.lazerpunk.site/streaming-film/white-girl-336011.html\n>>Doctor Strange http://edanturonkanggoriko.lazerpunk.site/streaming-film/doctor-strange-284052.html\n>>Complete Unknown http://edanturonkanggoriko.lazerpunk.site/streaming-film/complete-unknown-373476.html\n>>Finding Dory http://edanturonkanggoriko.lazerpunk.site/streaming-film/finding-dory-127380.html\n\n??)))))??? 1000% safe guaranteed!!! ??", "Or when it's the end of your second term, and you never really gave a F about your job in the first place....", "Alicia Cloud you can relate to the \"help me.... I'm feeling\" part more then anything else lol.", "I'm just glad Gucci Mane approves tosh", "Jamie Goddard are you looking for a gift for Andrew this Christmas?", "So meee Chrisann Hernandez you should see me high. Lol", "It dosent matter what I say her mind is made up might as well make her fall in love with me all over again with a story.", "I know this is a joke but seriously you guys are stupid. They film it in the desert so people can't figure out their location then they post it in a city like Raqqa, Mosul or other corrupt cities and then they go back to their accomdation in mountains or deserts.", "There's definitely going to be some cons there", "When I was young, I would watch only the movies that's started like the pic or the horse with wings.", "Remember how we talked about going to Reno and they gonna share same room lol this is Dao Yang @ P Vang Lee haha Wendy Thao", "Put on big boots and turn on 4WD and plow through it.", "It's so lonely at the top, plus it's real cold!", "this fake ass gucci lol and Jean shorts should be illegal", "I remmeber on two occassions where people asked me if i played basket ball. The first guy was white , i didn't take it offensively i just said no i didn't. But he asked cause he was a coach, then he asked if you do track, i kinda chucked cause it's like the next best thing. The 2nd guy was black and was adamant for me to come play on his basket ball team. Even though i have no basketballs skills whatsoever.lol) He gave me a flyer and everything while i was at work. Kept coming back that he expects me to reach out to him about playing for the team.lol", "Nicole Montagna Im laughing harder than I should be at this", "Curtis Britz I wish we could go to this", "Yeeees but please back the old Cucci and work with rick ross", "Dave McFadden...Made me chuckle and think of you ha...'You owe me money man'", "Its called a front lol I can't get that with my light bill", "Pavan lmao I grew up to become someone I was scared of", "Dang even Gucci Mane liked this one..", "It is racist but it is also funny. It is so outrageously racist to assume a person's name is any stereotypical name of any particular race like calling all Mexican men Jesus or Jose calling all white men jimmy or Bert calling all Asian men Ping or Lin or calling all black men Tyrone or Latrell. It's racist it's blatant rudeness but that's what makes it funny plus it's coming from an old person. After the moment is over it is no longer funny it's Fucked up.", "Folks actually think this is Gucci page lmao", "I legit did this for like 1 hour when i was drunk i thought someone was fucking around copying me...turns out i was fucking with me lol", "The most embrassing part of this is they texted it to someone else. There's a witness and you can't delete it off their phone haaha", "Wat gucci mane gotta do with it", "hello friends !! Come on! Coming soon to our blog, there is the latest box office movie in 2016!\nCome on let's do not miss it guys!\n\n~Suicide Squad[HD]\nhttp://manggaliren.blogspot.co.id/2016/09/suicide-squad-2016.html\n\n~Bad Moms[HD]\nhttp://manggaliren.blogspot.co.id/2016/09/bad-moms-2016.html\n\n~Don't Breathe[HD] \nhttp://manggaliren.blogspot.co.id/2016/09/dont-breathe-2016.html\n\n~Sausage Party[HD]\nhttp://manggaliren.blogspot.co.id/2016/09/sausage-party-2016.html\n\n~Fast 8[HD] \nhttp://manggaliren.blogspot.co.id/2016/09/fast-8-2017.html\n\n              *Thank you for your attention*", "Thats a koo album cover, I give it an a, and we need more catchy spacey beats", "This is not Gucci you idiots", "LMAOOO LOOK AT HIS FACE, LIKE REALLY BITCH? REALLY Sabrina Chaddoud :v", "No one should be played about there heart and feels no one shouldnt cheat on the person you truthly love if you love that person you should stay with that one person and on top of that you do not know what the other person have you can catch bad stuffs mess around like that is the true real life stuffs so that why i say it wrong not rite", "Brad Petronio can't play battlefront without massive lag but Osama can record a message for America with 3 bars tf bruh", "Stop Flapping Gucci get you a artist that old shit in the past the new future for real!", "http://www.infinityprofitsystem.com/cap1.php?id=Taquise.  Finally ready to be paid online? Ready to join a system that works and gets all members earning residual income? If yes GPS is your solution Join at level of your choice $25 $50 $100 or all 3 and you're good to go Promote one team link go to sleep and wake up to new emails from the FREE rotator which guarantees 4 sales Have questions just add/inbox I'll answer your questions", "my dad has me trained in body restoration. I asked at an early age and then at 14 restored a '57 Pontiac. Also did  54 sedan delivery, 65 Biscayne, 65 impala, 63 Buick wild cat, 3 Dodge Dakotas for racing. Started building another race truck from scratch and then helped my dad restore an 89 Dodge Dakota  truck/convertible factory made so no it wasn't modified.", "I'm a Ceo and Owner of OBEDOr Productions & Iman's Entertainment LLC...  I'm a Creator/Writer/Executive Producer/& Director. I write concepts and TV Shows for major networks. I also offer my services through my production company. I have an entire production team. I have writers. We have a mini crane. I have three camera guys A Red Camera Operator that owns a #redEpicDragon & the new #redraven my other two guys shoot with 4k cameras , I have a drone operator who is an air plane pilot that owns 5 different top of the line drones that he builds himself, I have a editor, and I have a production manager.  We shoot movies, music videos, Tv Pilots, and Commercials. We can handle any form of your visual needs.", "Bae means shit in Danish. I think it's absolutely hilarious that people are calling their boyfriends and girlfriends shit.", "I got dat bit3h and it go ham", "Kaitlyn the looks on our faces when people come over for the first timw", "Everyone's gonna eat it anyways so stfu", "Hey my name is Jamara Lee I am a youth Positive/ Gospel rapper from Detroit MI. I make a lot of Gospel -vs- Street Music something I created from Detroit -vs- Everybody... Can I please have anyone to go to my wall and watch my videos. Maybe even share it for me if you're liking my vibe. Please Follow Me if you would like to support me and help me get my music around where you live. I need help. I do know that 1 man is not a island. This my way of getting help. Sorry I was off topic on this post. But I have to make a move no one won't do it for me. Please Follow Me thank you and God bless.", "check us out for me yall...thanks https://youtu.be/LAzP8G3_Ics", "YES!!! I finally found the Official link to watch ...\n\nBad Moms Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/bad-moms-full-movie.html\n\nSuicide Squad Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/suicide-squad-full-movie.html\n\nDon't Breathe Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/don-breathe-full-movie.html\n\nThe Purge: Election Year Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/the-purge-election-year-full-movie.html\n\nBad Boys For Life Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/bad-boys-for-life-full-movie.html\n\nFast 8 Full Movie \nhttp://al-al16.blogspot.co.id/2016/09/fast-8-full-movie.html", "Brystal I would open the door to get him", "Hey! My best friend Holly Bennett has been searching for you for a long time! She said y'all had a great time in Panama City years ago and it was a time she would never forget. She'd love to see you again. She lost your contact information after the weekend y'all spent together.", "This gona happen tonight...waitng for him to get home", "Keisha! \n\n\"Smells like Honey Boo Boo's boo-boo up in hurr, himmey!\"\n\nLmao", "Thats me and my lil  brother all day", "Was not a big fan but played some of ur music. But after The Venue in Orlando Sat. Nov. 19th I am a big ass fan. U took time to touch my wife's hand and it made our weekend. Plus ur girl's blue lipstick was on point. Thanks man!!!!", "La India Maria  already past away  (CANCER) this year . She was born in Puebla", "Bro gucci aint got time too look at this kinda tings", "Skye Cushy Bridget Louise Olli Bear pretty sure we can all relate, the olli instead of snow cars and car parts haha", "Wish I could like this a million times. My brothers girlfriend always has weed, but I just went to help pay for food for them. Food, flea meds, etc. I hate people", "Find the 2 and tomorrow you will be kissed 555555555555555 555555555555555 555555555555555 555555555555555 555555555555555 555555555555555 555552555555555 555555555555555 555555555555555 555555555555555 555555555555555 555555555555555 555555555555555 Count down: 10-9-8-7-6-5-4-3-2-1... Now close your eyes and make a wish! NOW, *,*,*,*,*,*,*paste this into 15 comments an your wish will come true.! Hurry have 20 minutes or the opposite of your wish will happen", "If you have to tell people your nuggets is real white meat and your burgers are 100 percent beef....yeaaaaa some people's don't have open minds", "Or a fucking Monday and everyone in your fucking life sucks", "Rebecca why does this explain do much", "Lol , not racist tho ,but funny", "I am always nice. I was just hungry and tired. Keon Brewer", "Looking like Wesley but blacker than akon", "Saw it the first 5 min it came out", "Y'all boys these days want crack heads I would love for my last to eat a good meal that's just childish", "That ain't the real Gucci Mane", "Dominic Byrd every time i come across this imma tag you lmfao!", "Ever since you got on IG You...Started wearing less n posting pics more, posing wit ya ass out on the damn floor, dressed in all this shit I never seen before....don't let me catch yo ass on twiiiterrr, like u don't see myyy Deee M", "John Gootchi funny how it is in the page of Gucci Mane", "If your reading this your parents will die within 5 years to break the curse you must copy this to 5 pictures good luck. If you love your mom post this to 20 picture. One girl ignored this and her mom died 365days later. Sorry I can't ignore this because I love my mom", "yes Gucci mane I feel you", "https://soundcloud.com/ricky-francois/my-life please listen and tell me what you think", "I've forgotten even before I enter.", "I dont have any of that shit and feel that way", "Damn that's how the whole family bonds", "Many of the Warner Bros movies were crap. So the WB logo is no guarantee that the film is going to be good", "Ludovik Proulx sauf moi jtes echapper din bras de riopel..", "Dan smoked weed once this is a funny meme", "This memo is a great way to say u know how to plan and hustle for weed, but not how to pay ur rent or bills or even how to put food in your kids stomach. Thank God i have a man of God that don't stress over weed.", "I thought you were locked up gucci fuck you doing on fb.", "Ash Renea saw u and jumped under those pics and in those DM's....like a real nigga", "Another thought, someone said, why don't woman have respect for themselves. Well here, it all starts with jumping in bed with every tom dick and Harry. If a man won't make a commitment to you, what would make you think he will be faithful? You are so sad, girls.", "Excuse me! We all aren't ignorant.. We pay a pretty penny for our services...NOt only is Wi-Fi horrible in most homes but all over the damn place.. What do you say about that.? Like the young man posted, I believe it's atrocious in how these fools from abroad get much, much, much better internet service and wi-fi, than we do? Please, don't you be ignorant and point fingers unless your one of them, as well.... YOu might be speaking in general or for yourself because maybe you have been in a good wealthy upbringing and have everything at hand.... Think about that!  Not angry.. Just giving my opinio.... Have a nice day!", "ima do this to you lmao Erick Carvajal", "Looks Crystal, it's  Jackie on Sunday morning lol", "Doug Stultz  idk why but I find this just hilarious like extremely funny", "Alexis Rhodes nows our chance to hang with gucci!!!!!!", "I would share, but it is \"hear.\" Soo close to being good.", "When you sitting there when she laying on the bed in the other room like...\" Did I pull out?\"", "check us out for me tho yall...listen to the track....thanks alot real shithttps://youtu.be/LAzP8G3_Ics", "Haha Michael Pete Miller i told you how i would duck off to the bathroom after payin for the tickets at the movies just so i wouldnt have to buy a female a snack", "MY NIGGA BIG GUWOP WHEN THE FUCK YOU COMING TO LA", "It has to be that way, I guess. You know, with our strong men being locked up and all. Those on the outside are full of fear and intimidated by a woman  with a back bone . With that being the case a woman needs survive", "Meek Reid  voice \"yo I can get that ten bro\"?", "Naaa I'm too stubborn for that shit.  I'll fix it when i screw up though", "saw it today youtube looking fresh too death", "All I see it as is a way for woman that have good looks to somehow say that a only good man should date them and basically be the only one working to support them like a little kid and buy them shit when they don't even deserve it if all they do is put on make up and try to be sexy like that don't pay any of my damn bills, then diss the guys that actually believe woman can work too and are not a dream guy with a ripped body and a 20' dick like wtf? Some woman irritate me with that I ONLY DATE PORN STAR DUDES!!!! get tf outta here with that \" I need a man who can support me bullshit\"", "Who posting? Cuz gucci in jail", "Mimi Alysz we always play the guessing game LMAO", "Gucci Mane the first rule of Facebook is not to like your own post!!!", "Seren Akyuce this is what i was talking about !", "Monnique Glanida made me think of you, the girl on the right hahahahaha!!!", "Looks like he just left the dojo", "I don't think those kids would have put their friend in the middle of the picture to dis him. Anyone who knows about Asian eyes knows that you can't \"roast\" someone for having them. All you can do is pretend to have them too.", "God bless u my angle ....", "Well, \"it's not unusual \" for children to look like their parents \n\n...I'll see myself out now.", "Listen to Plug by LOUDPACKCHELL727 #np on #SoundCloud\nhttps://soundcloud.com/loudpackchell727/plug", "https://youtu.be/LAzP8G3_Ics listen to the track for me tho yall", "His shirt is dope, this niggas a g", "Rachael Kragel I still look at yo sexy ass like that", "Lol Amanda Weiland !! I love that Gucci Mane \" liked it \" LOL...", "En Vee if she does wife her haha", "Pretty sure the Native American to the right started it", "Kids are kids. They all act like that no matter what color you are. Some do it behind your back, and some in your face, but they all do it", "I still have those boards too lol", "Ajaja not really, I be like good for you..", "(Vanessa)I'm not talking about females obviously.my girl is Mexican and doesn't date Mexicans.Alot of blacks don't date other blacks and are very vocal about it.", "Donwload this app to test your Math Brain\nhttps://play.google.com/store/apps/details?id=com.shaarawi.braintest", "Savannah Jo I'm cracking up at these dammit hahahaha", "Only little boys who need to grow up think that way. Some women are hard to handle and at least they know that about themselves. Its usually a way for the girl to tell the guy that she's  gonna hurt him sooner  or  later.", "For y'all who are mad bc it says girls and not ladies, only a GIRL would try and act like they know something they don't to get a guy in their pants, but a LADY would simply talk with him and only flirt when necessary.", "Pretty sure that's a hepa filter? I could be wrong but I looks like the filters we used in commercial dehumidifiers", "Sara Elsaddig This showed up on my wall and I just had to giggle even though we already graduated. I love her.", "How the fuck do they got Wifi and shit too?", "Mikyel Caffey I couldn't answer that question because I asked myself that. I couple months back I was working for a contracting company. (I was growing out ny hair, kept it clean and under my hat) I was told I couldn't work as long as i had long hair, didn't look \"professional\" ect. Ect. I cut my hair because I couldn't go without work. But looked for another job and quit. Not everyone thinks a like, but we all have common goals... #acceptance #understanding #equality #education #opportunity. \nThis picture was posted as a joke. But i know some of you guys see a lot more. Keep asking questions! Keep asking why! Keep seeking the answers and stay true to yourself. May life bless y'all", "I am ok with horsemeat. It is a normally consumed animal in other countries. Like Andrew Zimmrnn says \"If it looks good, eat it\".", "Lol at least u made it home in that type of state", "When you coming to pittsburgh bro", "And FYI Mexican are also of native decent", "when Jay Z saw Beyonce for the first time he was like \"Damn Bey why you ain't fucking with me now that I got no money than you\"............lmao", "Ever notice how he looks like he's got a mouthful of shit?", "Kwaseem Mr.Thomas from 7th. Doing him dirty bro lmaoo", "Austin Mawbey you everytime go get a haircut", "This\nis based on a TRUE STORY! Once there\nwas\na baby\ngirl named Marry. Her mother couldn't\ntake\nall the\ncrying, so she decided it was time for her\nto\ngo. She\nburied her baby alive in her back yard.\nAfter she\nburied her she could still hear Marry\ncrying.\nSo she dug her back up and stabbed her\none\ntime in the arm,\nand buried her again. Marry cried harder,\nbut a few\nhours later it stopped. At exactly 12:42,\nMarry died.\nShe bleed to death. Now her sprite\nhaunts\nthe\nworld. When your sleeping, she stabs\nyou in\nthe\narm and watches you bleed to death.\nAnd\nthat's how she got the name \"Bloody\nMarry\" this is the true story\nof her. She wants everyone to feel her\npain\nthat she\nfelt. Apparently, if you re-post This isn't\nfake.\nApparently, if you copy and paste this to\nten\ncomments in the next ten minuets you\nwill\nhave the\nbest day of your life tomorrow. You will\neither get kissed or asked out, if you\nbrake\nthis chain you will\nsee a little dead girl in your room tonight.\nIn the next\n53 minuets someone will say I love you\nor\nI'm sorry\nto 12 other comments you will have the\nbest day of\nyour life tomorrow. But if you break this\nchain you die\nat exactly 12:42 tonight by Bloody Marry.\nDon't believe me? You'll see not taking", "I'm going to try it hahahha", "when you nonstop bring up your exes mang really idgaf Smallchild Carson", "That, literally was my face when I caught him and still ask to find out if he's gonna admit it. \n\nViola!!! Monkeys will always be monkeys. He Denied it til the end. An \"A\" grade asshole.", "U use to txt me wen u want some.. hit it for long long time.. txt me wen u want some.. hit it from da front & side, and I kno wen yo hormones bling.. u gone get dis ding-a-ling. . .", "And by the way since all these dudes on here are bad-Mouthing females,u should be glad I wasn't a hoe and slept with u the first night.because I gave u a chance I'm out of $600 of toys and furniture.As soon as u wanted to go back to america I took u back.U can have ur $40 gas money back.According to what u told me we are supposed to be in Arizona or North Dakota together.Why do Mexicans lie so much?I really want to know the answer.I was honest with you from the start....u just pretended like u could handle it.That's why I'm single now and will never ever ever give a Mexican,half-mexican,25% Mexican the time of day.Don esta mi papi puertoriqueno?;)", "Angel Rodriguez Karen Alvarado the story of my life u_u\n\n-thanks a lot elbert\n-it's eder sir\n-hahaha okay edgar", "Are you interested in wanting to live a healthy self-sustainable lifestyle? Well, you are not alone. Join me on my journey to find out how-to live ethically and responsibly.\nChecking out my Blog about Peace Love and Prosperity. \nPrimary objective of this blog is to share some of my knowledge about the Rastafarians sacred culture.\nwww.thewestcoastepisodes.blogspot.ca\nwww.thewestcoastepisodes.blogspot.ca\nwww.thewestcoastepisodes.blogspot.ca\nwww.thewestcoastepisodes.blogspot.ca", "1 218 895 2204. All ghetto black PARTYLINE number", "Girl you got me blocked, you got me stressed out.~", "The first time I was this it was when. I first saw willy wanka and the chocolate factory. After that, everytime I saw this I thought of chocolate", "Thanks this gave me a good idea just now...Some people have a couple kids and sometimes the kids turn out to be the same gender and they keep trying for the opposite gender and end up with more children than they were trying for. If gender selection was more accessible we would have less unwanted children cutting public school cost and possibly other govermen expenses. Seperating male sperms is not very difficult.", "Danae Crawford he look like Dayum y'all really finna look me up", "Ever heard the saying im so hungry i could eat a horse or u too young?", "she's a fighter since day one even before she met mr never give up,word up # Gucci mane what do you know about Aunt Nikki bella or. ((Stephanie Nicole Garcia-Colace))  in person,tell me ?", "Gucci Mane is one of the most realest person that you would ever meet in your life time we love you Gucci keep it real baby", "He is one Ugly dude. No shade.", "Sorry...\nIf your reading this your parents will die within 5 years to break the curse you must copy this to 5 pictures good luck. If you love your mom post this to 20 picture. One girl ignored this and her mom died 365days later. Sorry I can't ignore this because I love my mom", "I wanna know who's dog this is mine looks just like him/her!", "Download qriket. Legit money making app from your phone by choosing a color and spinning. Make money by spinning, challenging  and referring people with your code. Use my code in the pic for 25 free spins this is legit. Payout is thru paypal and we all know paypal is legit as well. Don't believe me? Why don't u see  for yourself", "When somebody comments a picture of there truck because they think they're cool. No nigga, gtfoh. I have an extra pair of shoes for you. You'll need th when your truck breaks down.", "Carrie Chevonna Miller me in front of tress's house. But with horns and sirens. And probably something to make her cry as much as she made me. Oh and a book of new majors.", "Yay another stupid ass dance that makes no sense. Hey can we make a dance where you scratch your ass or pick a wedgie? Man that way Noone will find their self in an embarrassing situation.", "MerryChristmas and A HappyNewYears Gucci Mane", "Lmfao. This was always McKav Arturo Adan", "Asha Nicolle THIS IS EXACTLY HOW I FELT WHEN YOU DID THIS TO ME! AND YOU GOT MAD AT ME FOR NOT REPLYING! THIS IS WHY!", "Motherfucker the third guy you made is not a muslim its other religion called Sikh..muslims only do not wear turban there are other religions also.see who is the defence minister of canada..he is not a muslim you dumb fuck.", "or when your Bestie bud just stays asleep and don't help lol Jessica Fern Thompson u just went asleep when I boffed up !!!! Un like me who helped u lol x", "Haha Evelyn Gomez wasn't this us when me you and Joseph would be in bed and then Aaron Gomez big head would stay up messing  wuth us because he was the baby", "I like it my big. Keep your head up out there.", "Gucci Mane just dropped the official video for his single \"Stove Music\" featuring Waka Flocka Flame. Watch the full video on our page!", "John Pierson this kid kinda looks like you", "All the hoes in this thread, yet not a single sandwich has been made...", "We can only tag 1 right lmao jk", "Funny how everyone pissed about this... It's just to make people laugh... If u don't like it then don't comment or like it.. Hard headed mofos XD", "Clayton Black birthday present to ourselves?", "Cmon tha KID didnt post this dum shit. Free the real Radric Davis", "Congrats Gucci !!! Last day with the Feds !!!", "Wellll let's just say at least people who smoke weed know when their bills are due and go to work everyday to pay them, I ain't never heard of to many crack heads or heroin addicts even having a job or owning anything, weed isn't the one to blame fuckers", "That's great!!!! I always tell my people to take my phone before it happens..... I either lose it or it's in my hand and that's bad.....", "lmao he look like the guy from those What's Inside videos", "Courtney why didn't you tell me you were addicted to eating dirty diapers", "Let them choose how much they want to put, I need to get me one coming soon", "I would hang with Joey Tribiani...the other 2 are dorks", "Sivaraman Counder  Young Ooi desperate times, comes desperate measures, hahahah you know when you have 1 hour of your life left lol", "Armando Flores think this is why Scott is in the bathroom all the time haha", "These are so dumb lol... if your not happy leave... no one should be cheating on anyone.. no one forces u to be with your partner.  Just leave it's not hard.. like what are u missing out on??? Feeling worthless? Not good enough?  stop the embarresment of being played like a fool or thinking they will change. . Haha. Life's to short to be with anyone that disrespects you!!!", "Does everyone who hates the word \"bar\" also hate babe? Practically the same, both sound kinda dumb, but I don't use either personally so I can't see why everyone is so bothered by it.", "I love dbz so you know people", "Whoever is running Gucci page need to chill ... he would never post some dumb shit like this ... cmon son", "Mariah Laidlaw \"Help me! I'm.... FEELING\" \"I guess I could use a little social interaction\" bahahah this reminds me of you", "Shiiiiiid, I'm too stubborn for that shit. Bitch be mad by her got damn self. I ain't gone play that weak ass game.", "Anthony Hernandez bro. This is the picture i saw that started the whole Papatokes name tag! Haha i didn't even know there was a back story!", "thats what happens when u get wit a cheap ass nigga lol", "Oh my god I could do everything with attack that I had every ramp with a tech deck I could grind boardslide kickflip tailslide to do all that s*** 50/50 kickflip grind with affliction with the pegs I could grind tailwhip jump over bulls with a scooter boardslide tailwhip front flip backflip everything with a flip trick Tech decks and scooters isplash tactics and flip tricks in school like every day where are you walking down the stairs to lunch how do use my tech tech n grind down the rail free drink 6 cups of Legends with a tech deck s***", "Hanna Russell this be you sometimes but most of your local friends are cool doe even though they weird as fuck", "That was me yesterday with the only exception I drink rarely, don't drink to stopper, and don't drive drunk", "Pshhhh I'm still gonna eat it", "Sounds like y'all are those over sensitive pussies they keep talking bout on my news feed lol", "I've told girls this. It's fun but it usually ends in not getting your dick sucked so do it after. Just my advice. Then she has to sit there with the \"and I just sucked this asshole's dick\" face lmao", "Summer Rose lmao i did this 247 at dolla gennneral", "Haha reminds me of living in Antioch sharing a room. Isaac Orozco,  I'd just tell you to shut up for no damn reason.", "https://www.allcounted.com/s?did=3oabx924pboah hey can you take my survey i made. I am conducting research about Black America(for a college research paper). Share with friends that are African American or African only( the survey is focused specifically on those two groups). Thank you. Deadline is november 23 at midnight, and the survey can only be taken once. It is only 8 questions!", "Lmao when i bring up ya ex Mayra Bernal", "Lindsay Hall, this is you lol, except for I hate the word bae", "fuck this now.... i just unliked this page", "Shaan Hossain LOL (Btw isn't Gucci Mane in jail??)", "Who gave dis guy fone in bars.i never like him", "how you posting on fb and you got life gucci man the shit haha", "Chayenne Bruinhart soms vraag ik me af , waar ben ik mijn taak gezakt om je wat te leren?", "When someone that owes u money from before forgets about the vaxation and its really at work ... To hustle Nd grindfor the support ...so lets hustle some money for the wings CUTS ITS A FLAP", "Ricardo Morales at school when its cold in the middle and you have to reheat it", "This may not be the point of the post but let's put it like this.  Some girls say they want a man to handle them but what do you mean by handle? Do you mean put up with a bad attitude all day then no leave that girl alone if she's going to have a bad attitude 98% of the time and bend and break just to make her happy she's not worth it don't put up with stress just to keep a girl when their are many of them but if you mean deal with you and your flaws while you deal with his then ok then I see the point. Like the post said, you shouldn't expect someone to be able to deal with your stuff just because. You need to be able to control yourself", "At some point I will get sponsored for Fingerboarding most likely by Skull but Flatface or Berlinwood is my main objective", "She took yo furniture cuuuuuuuuz lol", "Jasmine A. Ingram she look so good and ass so past she ah make ah R&B nigga cry for it", "Go back to Europe those who are native to the lands weren't European they were black read a book your European scholars described them as black skinned savages with wooly hair so which of you Caucasians fits that description... I'll wait", "Nothing to do with Black, White, young or old! I simply don't like the cut. Take it for what it is my opinion. If the young man likes it more power to him!", "BK is still more fire than anything you've ever put out.", "How I feel when someone else texts me and it's not you guys in our group text hahaha Christine Harris Genna Althouse", "Tom tag you know who lol", "Hot pockets are the bane of my existence. Oh sure the middle can be absolutely frozen but the outside is cheesy napalm and when it pops while you bite into it you got sticky fire in your mouth and you ponder your own existence", "You're a fur wearing piece of shit...that fur looked better on the animal it actually belonged to...shame on you!", "Tom Gill such a classic model, the intense bonus corridor thrusters make getting from A to B that much easier, and as we always talk about in the business, miles per minute is up there with the best", "Everybody has a mind of their own to think for themselves to know whether certain advice is good or bad for them. Not because a person is single doesn't mean they can't give good advice. Some people just choose to be single because they have a sense of freedom and they feel happier being single. Single doesn't mean miserable and taken doesn't mean being happy vice versa", "I got dared to do this... It's weird but it really works! You'll see it works!\n1. Put your hand on my forehead\n2. Make a wish\n3. Put this at 10 pictures without your hand on your forehead\n4. Look on hand", "Lmao omg can't get more true then this!", "Lmfao bitch yassss this had been plenty of times with yo ass Aaliyah Kennedy", "Pre ordered on apple and the album has yet to download and it doesn't even show up on the store anymore", "Horse meat is fine as long as it ain't skunk", "Lmao il wait starter kit they really talking about how some white parents be to they kids when they acting up,,,TIMMY IL WAIT LMBOOO", "They arent taliban you retards. Do you even actually pay attention to the news? Or you just hopping on the train because the terrorist attacks made them trending and fb and Twitter is your only source of info?", "I think the hair cut shows how talented the barber is. Amazing gift! People shouldn't down the art and wicked hand dude has.", "It don't always work hoes be having special skills", "Gucci mane u be tripping on en Chinese hoes", "Lmao u a fool for this one Gucci", "Bradley Poche Courtnee Rabalais Chanelle Schenck and Brandi Peyton i guess ill go out on a limb and tag you too because you know we do this to each other... lol", "Everyone is talking about getting into 2016 and this guy is already in 2025.", "because ISIS is a terror cell that doesn't restrict itself to hiding in the Hindu Kush. ISIS is situated in and around many major cities. What you would be referring to is Al Qaeda and the Taliban who were pushed into the mountainous regions of aghanistan when we invaded.", "shout out to you Gucci you the best i salute", "His skin is gorgeous. True idiots in these comments.", "Why single is better for me", "Laure Eliassaint Qnd ta dit tetais ps H hahaha jsuis encore dead plus le bahaye de A :/", "Fuck this page. Im unfollowing.  When gucci gets out!!   I'll follow back.  Smh.  Free Gucci.!!", "Carmen Jones don't think he likes Gucci :/", "Free Gucci real niggas do real things", "This is the \"I GAVE UP ON LIFE\" aisle....and it applies to both sexes...more a acceptable to society for women...and just plain creepy sad for you guys.", "Tre' Wilson moms lastnight Bol \"I smell cigarette I said that was  Cevante Turner smoking a black Bol", "Maxence De La Fontaine mdr le mec il est sorti de prison il s'arrete plus", "Deontre Ellison Wht is this\n Nat Turner A Black African R.B.G take Over nation wide and world wide.Anthony X\n Hunting Season for pin pointed europeans and all Africans with a European mind set on all levels that have killed raped or kidnaped a Arican man woman or kid starts when African true soldiers have the proper military, political ,and economical, and African revoluionary organization and leadership for the Hunting Season pass for eliminating pin pointed europeans on all levels that have killed, raped, or kidnaped a Arican man, woman, or kid Hunting Season tools AR 15's ak 47's 50 cals fighter jets ,fighter helicopters,predator drones,Black African air force,navy Black African ,military , Black African Spy networks, among other small arms and military, political, and economical forces in the interest of united Black Africa And the black African masses world wide Hunting Season Start's october 15 for all high level professional African killers.Anthony X Deontre Ellison Wht is this\n Nat Turner A Black African R.B.G take Over nation wide and world wide.Anthony X", "Yumna lol i found this funny af", "No wonder my Whopper taste so good!", "So Native Americans going to stay here by them selves everybody else is an immigrant just saying", "My ex did this to me a lot. Always accused me of cheating. I'm glad I got tired of his shit and finally left him alone before it was too late.", "Jay Jensen I need a grinch costume. \n\n#overit", "For real my pussy niggar Gucci", "Pretty much how this works  John", "Like if u miss old Gucci", "the snow is over my head lol .....", "He dont give a fuck, because dude is gay as fuck... notice GAYdude to the right ..", "Green Lantern, The Hangover, Clash of the Titans, Wrath of the Titans, Batman and Robin, I Am Legend, Dark Shadows and Entourage - All shite. Just because a studio has had a few good flicks, doesn't make everything they release is a hit.", "Sad but wrong Gucci.....wrong fa that..thot food", "Reg O'Doherty Sawyer Howell u guys better pay me for that icecream", "How many ways can you say they don't have a livable wage? Whether it's weed or a drink the poor man is still seeking a way to end the day on a peaceful note, knowing he/she still has to get up in the am and do it all over again.", "that akward moment when people post pics about being the only people who try and are depressed cause of it then admit to being assholes and greedy like te grinch", "Rafael Gucci with the quality meme", "Dessert caves? Wow. They have more money than most small countries. We give them weapons, and turkey funds them. Plenty of organizations do too. But that's not the problem. The fact they get the luxury of not being in a cave and not being strafed by an A-10 is what irks me.", "... Why is eating a horse bad but eating a cow ok?? Its meat", "I think gucci mane and kodak blac need to do a tracc together again", "Lmfao literally some of the funniest shit I've read on fb. So true but makes no damn sense", "Probably what Violet thinks about you Nick", "Exspensive jewelry, shoes and handbags, family planning and auto repair essentials.... Looks like they missed a few. LOL!", "You must be happy with your roots to me in any color so as long as they are comfortable in their own skin why not although I must admit I see a trend. I am not blind it's a pattern. okay whatever works but I think it's important for the kids to know BOTH histories. In addition I do not see too many whites that ARE educated on slavery and or roots. They just know it was mean wow! So yes interracial relationships could be a great thing as far as knowledge.", "You sure this isn't PC principal starter kit??", "Gucci if selena gomez was one of my hoes, Id give her to you, wooooo", "Jada Barela it's going down that night lmao", "Catch  that money material hoe", "Attention please:\nToday is December 31, 2015\n31 +12 + 15 = 58\nIts the 21st century:\n21x 58 =1218\nNow we add the two Numbers:\n1218+2015 = 3233\nAs you can see this number has no meaning at all.\nThanks for your attention.", "What they mean to say is ..\n\nBuy her flowers : Awwww thanks bae\n\nBuy her some food: OMFG Yaassssss bae you are the best in the world take your clothes off.. your mines after these red lobster biscuits ....", "Melissa Marie that's ur ass lmaoo", "I know a lot of people that do that", "Michelle Frith feels and the bowl feels like you're putting your hand inside of a fire", "Lmao!! Thought you would think this was funny bro Miguel Munoz", "ChinoxB-Yoyo Moreno this reminds me of u bro lol", "Sounds like he was just cracking a joke about his daughter looking just like her dad. I dont see racism in what he said at all...really ppl? Does every single thing have to be racist now-a-days? Dangggg its sad smh...", "Nelson Sada stop with your dumb shit is 10 years being stuck lol", "Them chains look better on me. Can't wait to snatch them chains off yo weak ass", "Luv all go hard Gucci because there was a tyme back when you were in a bad place & fuck boyz & ho niggaz were hating on u ! I spoke on dat shit back in 2009", "He going be in DC on the 21 of October. I'm in there. Know that. 1017 burr burr burr.", "Annie Ernst, kinda like your new scarf?  (; lol", "Whoever thinks this is actually gucci on this profile is a dumbass", "Maybe if you're high on mushrooms...", "Guys do the same. Talk to their single guy friends like they know what they're talking about....", "Kelsey Walton the one on the left is seriously Ian's son", "Is it true that Friends never had a black person on their show?", "That's an expression that says... I'm a complete loser.  I married a whore from a family of whores.  My father in law is now my mother in law and the only possible way out of all of this mess is suicide.  Come on Kanye, you can do it, you'll be in a much better place!", "half of you ain't even looking at this right. there's assholes complaining day in and day out that they broke, and they can't afford food or bills or to even have health insurance, but ALWAYS have weed on deck. Personally know a family thats getting their phones shut off and cable shut off constantly because they didnt have enough to pay the bills, but bought a q TWICE that same month. around me thats $180. how do you always have weed, but can't pay your bills ? simply because you don't have your priorities straight.  nobody is telling you to stop smoking weed and you'll be able to afford your bills, they're just telling you to stop fucking complaining about being broke when you've spent enough money on weed in one month to cover ATLEAST 1 bill that you claim you can't pay. no, spending $20 on a dub ain't gunna make you or break you, but when its time to pay your bills and you $20 short because you bought that dub at some point, then nobody wants to hear you bitch ! It's your money, you do what you please with it, but don't run around complaining about not having enough for your bills when you spending your bill money on weed ! & if you NEED weed that bad in your life, buy a large amount of it and flip some. Then you'll have money to pay your bills & to smoke ! oh but I forgot...nobody knows how to hustle anymore - everybody too lazy and rely on everyone else.", "The funny thing is the people actually get defensive if you correct them. Lol.\nThey have no idea how dumb and ignorant they sound", "Dude been recordingI music since cassete tapes walkin Millticket.He lives in the studio constantly workin best kept secret check it out", "That's fucked up. That is a beautiful native woman in that picture. Nothing is wrong with her braids. Assholes.", "Damn that's 3 already, The WOP Is Back lol!", "The fake Gucci mane,where is the real Gucci mane", "Rachel Hartman ay yo I'm gonna do this in person in less than two months. Then we can snuggle and watch 13 ghosts. Hope you're ready for me bia", "Jessica LovingMine Woods how me a Timothy Dalton use to be when i spent the night at his house i miss my big cuz already", "What I will say is this black people have come a long way!! Most of the black commented are folk praising his complexion, we are starting to wake up and see our beauty, even while they still try and tare it down . Next week they will b in tanning beds and in doctors offices adding shit to there lips just to have the same fullness we were naturally given. See these people for who they really are !!!", "Brian Suesens that time Robert owed you money lol", "I cant wait till all of America is like this. Then we can try to go to Russia. Lol jk like they would let us in.", "Jay-z look like he smell something. Funky Lmao", "How is this even racist? He could be white and the old guy could be black and they could still be Latrell/Tyrone anything's possible sure I never met white guys with those names but doesn't mean it doesn't exist lol", "When will the Santa shirts ship", "Graciela Rodriguez is this who you were talking about??", "I don't see how its racist... I fuck up people's name on accident lol so many muck mucks and Chinese people with weird unprononucable names and forgettable lol", "You are a racist ass hole\nRespect nigga, who told you they are needy", "Lmfao Madison Bomar that dog is like, oh hell no.", "Obviously guys are flawed, not arguing otherwise. Try and keep this in mind before you decide to attack me. But the antics of MANY women these days (not ALL women) are laughable at best. Women will swear that men are \"intimidated\" by them because they're confident and have an opinion but its just not true. A lot of the women who say this are not confident but  rather are: arrogant, narcissistic, entitled, abrasive, rude, immature, loud, confrontational, pretentious, self absorbed and self congratulatory. They have over inflated opinions of themselves and condescending attitudes toward men. Even when these particular women  admit to having these faults, rather than even partially blaming themselves for their failed relationships, they'll blame the man for \"not being strong enough\". Are they fucking serious? Media and entertainment have boosted their egos to the point of absurdity.", "If that kitty was going backwards on a sheet of ice...that would be me.", "Because we live in over populated cities full of data junkies. You think there's anyone else in the desert using the wifi? No.  Pendejo", "I got hoes in different area codes #igothoes lol", "Dumb ass post, by the way to all the white folks this woman was a Mexican comedian, so no need to assume she's Native American  just because of the braids. And both style are sexy, I prefer the new school braid.", "Not all white/rednecks are racist,don't let one or multiple people represent a race.i don't", "I can honestly say that does not go!!! Drakes lyrics is what makes hotline bling! So when peeps start making up they own rhymes,its just boring and so dumb", "Can't wait for this to drop!!! GYEAHHHHhHhHHhh!!", "Real talk, we can only do so much. We can't fix ugly.", "Bet these niggas dont even know who this dude is.", "Reminds me of master p video make me say", "It depends on how much you pay for weed a ten dollar bag of weed will not have a major effect on groceries and rent those things cost way more unless you live in a card board box.", "Andrea Brusger were going to Jacksonville", "u the only trap artist I follow on Facebook... bbbbuuurrrrr....", "This ain't no fresh cut, this just another nigga that gonna be roasted by his boys, like really?? And also yah gotta stop with this black and white shit cause that's how you start racism", "gucci can you please contact me about the hi five and the right on time beat, please with all due respect man i made those beats and i really could use the credits, my name is kirk, please call me 973-876-0584 it feels good to here my music on your album i play them songs when i touch street and am happy about it but we need to talk, there is a whole lot more beats in my computers that you also need to here.", "I got beats on this album so it's the best album in the world.", "Brenda Watkins Black but when the kids older, trying to hold/get a job that hair cut won't fly. But at a young age kids can get express themselves like this, because at a young age they're molding their own style their one persona", "If this is so tru, why hasnt they been shut down yet.   Dont believe everything folks tell u", "Leonor Rincon this was leslie when she threw up  then she said turn down for what lmao!!", "My relationship is great. I have an ex friend who's dying to see if she can ruin it. Bitch is nuts she acted jealous of him the first time I mentioned his name. I've had to block her number and cut ties with her . Luckily she doesn't have my address. My husband  and I just bought the house. She works for a local newspaper,,and she also very casually knows my brother ( he works in her building). Addresses aren't difficult to get when you work for newspaper publications. My husband is as normal and nice as they come, actually suggesting I make amends with her. Not happening. She wanted to pal around with me 24/7. But her dysfunctional relationship was never up for discussion.", "Wake up.  He or she cheated on you.  Leave it stay. The biggest problem is not the fact that this person is defective but you could \nBe given a deadly virus or illness you deal with the rest of your life or makes you sterile.  So wake up people  get over the crying and being hurt.  Get a good Dr check.  A good counselor ( not because of you but what happened to you and you will be ok).   Listen life is good don't let someone who is defective ruin yours.  Good luck.  Take the first step get help. Here is a good idea. As you decide to get help. If you step in a big pile of \nPoo. Do you keep it on your shoe? No you clean it up or in some cases you have to throw that part of your wardrobe away.   If you don't do something right away in a positive \nLight for you and forget about the dog that left it there then you will carry it around with you forever and no one will \nWant to be near you\nGet it???", "Cabrina McCoy this wat I was talkin about", "She needs to get hurt more often so she can keep dropping these hits lol", "This post is so last year...u look retarded Pablo and if u dont know what I didnt do Aaron then u didnt read the whole post.(I didnt have sex with   Ricky on a trip to Mexico and he thought he was goin to get some).....so anyway ,anyone who whats to insult me for keeping my cookies in the jar and thinks its acceptable to have all my belongings stolen for that reason drop me a message.", "It's a very intriguing and cute haircut for the young man.  Give the barber some props for his skills. The haircut has nothing to do with a job especially since it's a child. People really look to hard in situations that aren't anything but will be blind to important situations", "Technically it says to guess what so really you're doing it right by saying what", "Daniel remember when were in the store", "Ashley Mata instead of bitch i was telling you to go to sleep so i can go across the street and get you m&m's but just watched TV all night instead :)", "I'm just here to read all the angry 3rd wave feminists comments since they got their panties in a bunch.", "Brittany Dillon Kylie Hood ... I think I got the same look from oliver", "Julia Marie Hastings I thought you were strange but never mind", "So you can face criminal charges for trespassing, breaking and entering, AND disturbing the peace! Cool!", "lol it's only 80$ a ticket Curtis Britz", "Ladies, are you looking for great deals on bundle hair?, Then checkout my Mayveen store. Just go to https://kirshaysuniqueboutique.mayvenn.com/. We have Indian, Peruvian, Malaysian, and Brazilian. We have straight, curly, deep wave, body wave, and blonde hair for easy coloring. Hair ships for free within 1-5 business days. 30 day money back guarantee!! Save 15% using code KISS, plus an extra 10% off by buying three bundles. Shop Now for great deals on great hair!!! You can get your hair within 2 days, free shipping. Discounts for everyone, plus 3 bundle discounts. All bundles have matching closures, 30 day money back guarantee. Go to https://kirshaysuniqueboutique.mayvenn.com/", "God is good and you deserve happiness Angel.. Amen", "Shut up Gucci with your potbelly", "Tony Ramirez Puente this some shit your dumbass would do if a girl was gonna send you some shit lol", "Kirti - why is this so us?", "that's like my question. How is it that the Rangers and the seals can't locate Isis and yet reporters do it all the time", "How about you go to the person you're in a relationship and talk shit out. Who TF people think they is telling how to live YOUR relationship.  Lmao, TF yall is stupid asf. 90% of these relationships don't last long because of others telling you what to do in YOUR relationship but hey if it's to help you think what's best for you, nobody is telling or making you do anything, but know that your choice is your choice. Don't let others make choices for you, unless you ask for them!", "Hope my rap verse is going in the album you got arrested I remember Gucci you promised me a song", "Right next to the single men's aisle, featuring pork rinds, cheap beer, clean underwear, skin magazines and hand lotion. \"Cleanup on aisle six\".", "Brooke Walters you already know when I saw you at your mom's house... I was like I'm not leaving here without making her mine.", "Wisam Elhassan you should go here just to make sure", "Damn lol I come to see what people saying and it's all kinda talk about racism, finding jobs, people needing to find their lives...... Lol Facebook and social media I tell you what!!", "That, as I know from personal experience, could easily be a picture of a man with the caption \"When you already know what happened, but you ask her anyway & wait for the lie.\"", "Mato Najin lmfao idk why I thought of you", "This nigga looks like he was down to that grill.... \n#roasted #darkassmuthafucka", "U not the real Gucci u fake af brah", "wtf gucci mane now u disrespecting????   wat???  u aint getting no likes that u have to make all t", "Tamela Brower it might seem like it now but the snow will melt and you will get through :)", "Mariah me tripping over your words and hearing tou laugh at me haha", "I open up at the Fiend concert in Joliet camplyfe ent firm bso my name is Laro Fuscottie hit on my Messager check my video on my page it was Nov 11", "Lol funny thing is...If I've earned the money I should be able to spend it on whatever the fuck I want", "Are there not zoo creatures that are Female? You see the problem and you skate right over it. How do you not get that calling a woman or girl a female in normal conversation is wrong?", "I dont see a difference, they both look like lil girls", "HELL... Lets do this then pussy.... Lmao...", "Elix November tu va me dire c'est Gucci mane ki post sa hahahahahahaaha", "Lmao Vic Cowell Aaron Stiegler when we did that stuff going for late night walks and that night by the crescent i threw up and vics all \"its ok i threw up before u outside sev\"", "A black ass WALDO from FAMILY MATTERS", "#DudesWithNoChill don't wanna be that dude!  Lol", "Your choices are a reflection of you. Until you can work out how you are complicit, this will be repeated over and over.", "Adele White & Lydia DeNasha this has been me hanging out in the bookstore last couple weeks lol", "21st century Saint Nick. Rns lol!", "Ermina Avdulla hahah das mach ich auch mal mit dir und du schaust dann soo", "Fettiknox.com check it out, new nigga on the scene with hot beats. I know this is a shot in the dark but let us know what you think...", "Finally gucci mane posting some realness", "Want to make money just for downloading apps \nSign up here\nQuick and easy process\n\nhttp://featu.re/QP6SAC", "yall need to stop it about he wont get the job because he is black nor because of the dope haircut.that barber is a really good artist, End of story. That young guy just needs his front to ace an interview, where the mouth is. That recruiter might just offer him a job and see his back later. It may not even matter. Please yall, lets not take this broken mind into 2016.", "Straight love skiggs\nCheck me out FACEBOOK skiggs burkey new video bout real struggle dropping today need new and more fans straight love", "Zak Gonzo Erickson Derek Scoville this reminds me of you two at all those sleep overs!!! Lmfao", "Kayley people be like \"Sonn-..\" Me \"i don't give af\"", "I just knew he was gn marry a white girk", "Lynn Laube that i want my baby to make me brownies instead of cookies haha", "Before I saw that you liked this Brigette Belton, I thought it looked like your face!!", "Every since I logged out girl you you you..! All in my inbox wnt leave me alone.. posting up some statutes of sad songs, taggin me in shit its comin to my phone.. plz hoe leave me alone every since I logged out u! U r da reason I unfriend u, u r a thot and so are all your friend 2, bay I dnt eat wats not on the menu. . .", "A guy probably created this cuz he couldn't handle a woman just saying", "Or when you just walk over to the fridge and open it and then sit back down", "So strange.  Something happened to make her do this.  Guessing she lost a baby.  Not saying it makes it right at all but something traumatizing happened to make her so this.  She needs help and fast.  Disgusting!", "Gucci fuck u doing mane this ain't Vday", "ANY USAA BOA Chase TDBANK ETC WITH A ZERO BALANCE AND INTRESTED IN MAKING 6,500$ IN JUST 17 HRS GURANTEED CASH.HMU", "Sarah Grijalva i know you dont probly like the weeknd but the dragon ball Z reminded me of you lmfao", "YES!!! I finally found link Full Movie,,,please share If you wish to be lucky,,,Watch\n\nBoo! A Madea Halloween (2016)\nhttp://mamih-sayang.blogspot.co.id/2016/11/boo-madea-halloween-2016.html\n\nDoctor Strange (2016)\nhttp://mamih-sayang.blogspot.co.id/2016/11/doctor-strange-2016.html\n\nSuicide Squad (2016)\nhttp://mamih-sayang.blogspot.co.id/2016/11/suicide-squad-2016.html", "They sold an old car years ago, the family tracked it down and bought it back....", "Go back to the desert! #REDNECK AND PROUD!", "It's nothing in this world like having a sibling. That's how you really find out what type of person you are. No one will tell you the truth about yourself like your sister. Then you can either fix or leave it along, but you do know. You ever known some female who does not gave a sister?", "Sofia Kohestani Qazi weisst du wann ich  morgen aufstehen muss? wann? rate", "This was life for me when we first started getting to know each other lol Kayla Parker", "We need answers..y are children in the U S starvin??", "Arturo nuestro amigo Diego ya me esta preocupando, mira lo que hizo ahora", "Oh Yes!!! I hope your Day is always fun,with Full Movie..\nWhen the Bough Breaks\nhttp://ctyx3momdedy.blogspot.com/2016/09/when-bough-breaks.html\n\nSuicide Squad Full Movie\nhttp://ctyx3momdedy.blogspot.com/2016/09/suicide-squad-full-movie.html\n\ndon't breathe Full Movie\nhttp://ctyx3momdedy.blogspot.com/2016/09/dont-breathe-full-movie.html", "Babe* yes*\n\n\"You're the best in the world BABE. Take your clothes off! you're* mine after these nuggets!\" \n\nObviously his girlfriend is a dumbass", "Meowing, but I don't do dinner for one...LMBO. All the strong independent lonely women are salty as hell. Me, I'm laughing my ass off, because I'm strong independent and I got a man! Ladies, there is the strong independent, I can't get a man, because I'm too bitter type, and there is the strong independent, I don't need a man,  but I have one anyway type! Which one are you", "Megan, don't know why this reminds me of you :p", "And I hate all you people who have to take everything so serious  lol it's a damn meme chilllll your tits", "Congratulations for #8 with \"Black Beatles in the Official German Single Charts (Offizielle Deutsche Charts).", "Hahah...this pic. Jamil Glenn...my nigga i almost died in philly that night.after the bday girl kissed me, it was all downhill with bricks in my backpack faaast!", "this is some serious fuckboy shit, Gucci", "Dayton Quizon saw this i couldnt help but think of you lol miss yo crazy ass", "Brittany Byroad I have done all of these things in the past twenty four hours", "Diana Campos I can finally say this lmfao", "Gucc Gucc going hard on this one yeah these ladys are spicy got put them to the Trap", "some of yall so salty right now XD.get out yo feelins", "Lmfao you guys won the Internet", "Karley me rn with the dude I've been talking to. Or should I say had been talking to?", "Atleast im cute \nGetting through my life :3", "Hahaha all you girls who read a joke and get personally offended. You're the reason guys are still sexist. Cant even take a joke. You're just asking for trolls when you make your butthurt public.", "So then why do girls cheat?", "you use to text me on my cellphone, late night when u need my love.", "This must be true because it has words over a picture", "They Love Rail remember  u said dat", "Annika Hoger  all the guys I try to set you up with but you pie em", "Antionette Calamia I knew you had all them diapers in you house for a reason lol", "Lmao! Everytime i read this i imagine i 5pc chicken nugget pack no combo no fries no drink lol i needa a steak dinner and better if its home made", "What if I made an album called nigvember Olivia Jaskula I won't stand for this racist af", "Ishika Today at afternoon LOOOOL XDDD", "Andres Guadalupe you making me guess n not telling me", "Guwop my favorite rapper the real trapper", "Been doing this A LOT lately!", "Idk it made me think of you two Andrei Richard", "Sarkis Mylissa Sonia only she probs caught him ;)", "Andrea Mckevitt that's how you make me feel", "If this the real Gucci I'm proud of u u really motivated me fr fr", "My nigga Gucci liked this shit from jail lol", "Idk they need love too grinches lol", "This is just the Warner brother studios lot...all of their movies start off like this, and they are not always good.", "Alli Gondoli hahahahaha. Isn't this like your friend?", "You know that is how bill Gates dresses", "Also opening new tabs and unlocking my phone. And starting sentences LOL -.- This is my life. Benedict Jingu Chong Celina Lui", "Dakota Treso lol this is me and u. Happened to many times to count :)", "lol no fucken way man cant be asked", "I didn't even even get this until reading the comments. Dabbing in my book is vaping cannabis concentrates. Lol stoner problems.", "I don't know much about cars. I have an old 2005 gallant, all I care about is that it takes me to point a to point b, radio works, heat/ac works and where the battery is located and oil...", "Gucci Mane what is your phone number i am her dodder and her birth day is comeing ut pleace tell me.", "Cassia sorry the timing was perfect lol", "Kieran Kite so classic of Gucci mane", "Yes its true love dont cost a thing", "If we ain't eating together we ain't hanging together", "Ahhhhhhhhh whats wrong Kanyeeee???? Lmao. U have 22 Grammy's. Lmao. BTW Taylor Swift was talking about u u ignorant piece of shit!!! Remember when u cut her off a cpl yes a go???? Your a disgrace of a celebrity!!!", "Me and u at BAE Danyale Barnett we use to be sleepy as fuck", "I Must Say, I do some times just to get away or just think how to get out of work. SAD BUT TRUE", "Anyone who says they miss the old Gucci,  hasn't listened to this tape and are just talking shit... and it's obvioussss", "Teachers put in more hours in their work than u probably ever will in a day. Have respect. They do work at school and at home. How do u think ur shit gets graded ??", "Fab Ist omg also wie kommt man auf sowas hin schreiben und desch bild", "That is one person's opinion. I happen to Loke braids. What is your problem?", "Steve Panebianco I don't speak greekathology, is this a methadonist church", "Everyone believing this has to be dumb && have little to no education for real do your own research if you don't like what you don't eat it", "Yo, when is that song with Evander dropping?", "Thee is this the shop you work at lol", "If you stop reading this your gonna die.My name is Teresa Fidalgo if you don't post this on 20 photos i will sleep with you forever.This girl ignored it and 29 days later her mom died.I am real, you can look me up on google", "Alexis you annoying piece of love", "I still love the first one and play it on a regular", "Fuck I might as well try to see if I can get across", "Why are yall so damn busy talking about applying for jobs when this young brother might create them?Guess what whether he's in a suit dressed to the 9's the people still might not hire him because he's black.You do all the right things according to folks and he is still likely to get gunned down by the police or violated by his white brethren.That is a dope haircut the barber is talented and understood the concept.The kid is a visionary why would should he settle for working for someone  else stomping out his vision.Why don't yall pave the way so he has an opportunity to be hired by folks that look like him instead of trying to conform to a game that is not designed for you,me,or him", "Oh yeah, for sure! At work I wear devil horns instead of the typical Santa hat or reindeer antlers, and when people say \"wrong holiday\", I say, \"Nope, I'm the Grinch\". Screw all those reindeer antler hats and Santa hats!", "Stacy Neeson I know you dont like him but i think hes pretty spot on", "Not all a lie depends on who told on him is it out spite or they trying get with you I'll ask ma man ma self then I'll know if he lying or not been 30 yrs do think I know him not all plane sailing but we still together x", "Man fuck that come to Charlotte", "If people want to put themselves at risk then thats there redicoulous choice..  If they want eye problems..  And end up blind then they did that to themselves..  SMH..  So sad.  Good luck on that to whoever wants to do that.   .", "Lmfao , no one pays anyone back anymore . Might as well just gibe them a few hundred and call it a day lol", "Brandon Rose hahaha lmfao damn hummie!!!", "this is some funny ass shit", "Brandon Kathan lmao u do this to me lol a lot", "Lololololol Phil Mellinger aaaand also hilarious to read all these comments from people who feel the need to explain themselves haha.", "My memory card is running out of space too much mixtapes and album so I'm not ready", "Those complexes look freaky as fuck though. Probably represent something, or what's the point of showing them", "That track from gucci is fire", "The one on the right is actually a mexican comedian , so if your talking about young hispanic girls with braids then that makes it pretty dam funny.. js", "Its funny how gucci drop a post and every one on it but all it takes is pennies a day to feed starving kids in africa and no one cares.. lofl", "Best show ever minus the last season", "LOL well I'm glad I have a man that can \"handle\" me. Being handled doesn't necessarily mean that your a defiant woman, but that that particular man knows what to do to cheer you up when your in a sad or bad mood. They know how to console you as a person. Basically, they know how to take care of you (handle you). Not that you're a attitudinal person. But they know how to take it when you dish it out.  A STRONG man can HANDLE a strong woman. A weak man will say she has an attitude.", "Every man should invest on this for the outdoors lol Tina Nguyen", "This $20 isn't gonna pay a single bill nor will it make me happier in any other way than using it to purchase weed for me to smoke and remember that life is about much more than paying bills and money. Obviously these people also find money for food. People will find a way to provide what they consider necessary. But again, no bill is cheap enough to say that if that person hadn't bought weed, they could pay their bills. I can find $20 if I need to, not $1000.", "how Tf is people confusing Bryson tiller wth Gucci? ?? omg kill me now", "This the hardest album I've heard in so long these cats now have no skills..... Dolph is on point to tho south Memphis!!!!!", "How do u remove a belly button???", "I would drop his butt right there. No man will disrespect me like that.", "You know that barbershop in the hood, lol", "One might argue that if you were intending to post something on Facebook for a large audience you would take three seconds out of your busy schedule to properly spell \"nuggets.\" I mean, I would have commented on on the other grammar as well, but I've given up at this point. I'm sincerely convinced that I lose brain cells every time I see pictures like this somehow find their way on to my news feed. Anyways, romance is dead, and so is any form of intelligence whatsoever following my generation. RIP, Earth.", "Jessie Erne lol could be the next sign put up in Westlake", "That's funny as hell! Remind me of someone I know . Danny Shillings", "Matt Reid don't think i've ever seen a meme resemble a person so much", "females r so lame, hang your balls guys", "I gotcha brah lmao Elisa Ann", "Is this the real Gucci or a fake account", "I hate to lose respect for my President......", "listen to our track for me yall...thanks real talk https://youtu.be/LAzP8G3_Ics", "why is it that i cant get a wifi connection in the house but the police all ready now where to found me?", "in africa we talk of tribalism... its a stigma that we cant just live in peace without this hate shit... people need a chill out n fucking live", "Lupita Espino lmaoo every time you say something dumb like that", "Lacey Cason I miss my relationship with cookie", "Kyle my look when I think about shit Thomas says", "Strapaholic Mpm Check me out If You have time and dnt mind Family thanks", "Mahlih Vaughn Ashley Butler I'll be tryna compromise yalls relationship just so yall could spend more time with me! Lol!", "Gotta be strong ma'am your too young and fine to be stressin over that  smoke a blunt and get out yo feelings", "Emily Mallory looks like you when you spent time with the team lol", "Payton Danielle Stanley me-- w that thing about the cow.  You the homie that says some dumb shit.  I'm the one that spends 10 years confused...", "Aron, Kayne, Duncan all the time at duncans hahs", "Ever stop to think, they're NOT in need.", "Yea they smoke to forget all those other problems lol", "This is not a fact men get mad because they guilty when they get caught up then be mad because the woman is mad then a real man will apologize and try to figure out how to fix it", "Women love drama anyway, which is why they gravitate towards liars. And to brainwash women more into liking liars you got Rhianna with her famous \"Love the way you lie\" BS song... I am always 100% honest because I don't have anything to hide, yet I usually stay single cuz majority of these Westernized females only care about what you can give them. Superficial ass females.", "Since,  we're going to look at it from one point of view because that's what most of you guys are doing.  No you shouldn't have to put up with some woman's childish ways.  This is true but let's not pretend like you're perfect and that no woman overlooks your flaws.  That's what love is about and being in a relationship.  Loving each other in spite of flaws and inspiring the other to be a better person.", "KeepyOneShow this game over Gucci Mane", "Gucci Mane ay bruh you can't be a thug and use smiley face emojis....lol", "This makes doing hard drugs look like a great time.....", "Aren't you in jail/prison Gucci? 0_o", "HAHAHAHAHAHAHAHA not girls though - anybody with no car knowledge..", "Matt Slade reminds me of the time in highschool when me and my friends kept you awake all night, and the next day you wouldnt let me nap because I had to stay up tired hahaha.", "Goes made good loving  and u can a hoes into good house wives  let him be happy", "David Saelee bruh I don't be seeing you do this. It's actually the other way around", "Lionora Rodriguez lml remember your story from this morning", "I don't want to \"handle\" my woman.  She should make my life EASIER, not harder.  Some of these men will put up with the most dysfunctional women just because they are afraid of being alone.", "Selena when I'm about to get salty that you like a facebook post but don't reply to a snap, then I'm like \"eh. Screw it.\"", "What up Gucci Mane Eastside fuh ever!!!", "Well let me no cuz I am trying  to loose to", "yall wana knw why becos the real meaning of .I.S.I.S...   ' israeli secret intelligence service '.....the government knows that to,,,only a few audience knws that...bt we gada get da word out...#together.", "Guys tell me your secret how do you listen to Gucci?", "Don't wear glasses, got a Cadillac, beard and still feel that way lol", "Guwop chop it u wit me wen u come back to bham...", "Which is why i always feel sad for the good guys out there who try so hard, give n give n give...and all they get is shit from an undeserving girl... and by the end of this rant every  girl in the world that reads this will wanna kill me personally....but one advice to the dudes out there...man up and quit being whipped", "Fucc is up with Gucci Mane posting this bullshit....", "I miss yall guys too man", "when i saw you for the first time you were doing weird thing(left right left) yaad ayo? haha you're weird tho vondu ^_^  Sayori Thapa", "I wonder how people can expect women to not be offended by this. If being strong and independent is seen as being conducive to being a cat lady and lonely, then what does that say about our perceptions of women in power and the value we place on women?", "Hatchet Cat Smile-tokez get your ass home.. Your gonna fuck shit up for your self, wanna come admit shit and get passed it and leave the bullshit life behind u and have one with me and unblock me bitch", "Shaylyn Burr i swear this will be me once you drop any fuck boys xp", "Paola Castro lol thats me pretty much", "This is misinterpretation. Only a fuck boy would agree to this. Not a gentlemAn because he would take the time to find out what the female really means.", "What This Picture Means Is That Woman should be handled if they are mad ( cause unconscious stuffs happens when your mad) and so does she have to handle her man if he is mad or having a bad attitude , cause No body is perfect we have all negative and positive things there aint no body perfect so we need to accept the bad and good things in each others lol", "friday is three days shy of 10/17?", "Don't take it personal \nIt's just a joke \nLA India Maria is the real beautiful woman...", "Ania Biedron me errrday at work", "Haha. This dawg looki'n like a latino druglord asking for payback AF", "This is only for guys who give a f*** about making their girl upset", "Gucci taking the game back keep it up big dawg", "Me when I got drunk and tried to walk to the car I fucked around and ended up in the got dam trunk sleep late like a mf", "Shelbz Simpson the realist requires our presence", "There is a big diference between girls and women and there is also a huge diference between boys and men. Nobody is the same, I know about cars because I lived with my brother and he works as a mechanic and now that im married guess what my husband does for a living? yup cars. so I have no other choice than to know about cars. I dont really care about the whole \"girls are like this and guys are like that\" because there is no way everyone is the same. There might be a lot of girls like that and guys that are assholes but not all are like that. Who knows maybe she just wanted to keep talking cuz men are not easy to talk to either.", "If it was a 1992 Dixon Ticonderoga she woulda been like \"oh, cool\"", "That What's up my favorite rapper Gucci mane", "I don't smoke weed but I still find a way to deal with my problems.", "Kellc Fields im wrapping all gifts this year in east atlanta santa paper", "Come on! Coming soon to our blog, there is the latest box office movie in 2016!\nCome on let's do not miss it guys!\n\nSuicide Squad (2016)\nhttp://manggaliren.blogspot.co.id/2016/09/suicide-squad-2016.html\n\nBad Moms (2016)\nhttp://manggaliren.blogspot.co.id/2016/09/bad-moms-2016.html\n\nDon't Breathe (2016) \nhttp://manggaliren.blogspot.co.id/2016/09/dont-breathe-2016.html\n\nSausage Party (2016)\nhttp://manggaliren.blogspot.co.id/2016/09/sausage-party-2016.html\n\nFast 8 (2017) \nhttp://manggaliren.blogspot.co.id/2016/09/fast-8-2017.html\n\n              *Thank you for your attention*", "hold up I know I'm late AF but grandad got that huge ass house but those boys still have to share room?", "He is definitely warm, no doubt  ...", "lol..I don't  think it's racist. .I b fuckin  people  names up..all the time..black & white..", "They're probably trying to say that that guy is who helped or smthn but u losers get offended really quickly and then be like, \"fk u, im being who i am\"", "If the Tv is off u are not watchin a movie...", "Lol ain't Gucci signed to Warner? That's what this post about haha. Don't think Gucci has actually run this page for a loooong time cos he sure as hell wouldn't be posting the trash he does hahahaha", "Sounds like some broke ass problems lol", "That look like the drake video best I ever had lol", "Aaron Linker this is so fucking dumb but I can't stop laughing", "Daniel Pollock, you've tried to save me so Many times dawl", "Haha todas las historias que te he contado de yatusabesquien echt letterlijk verloopt de esta manera Hahahahhaha si te pones a pensar #goldthisonethiswillbemywallpaper hahahahahah Katia", "You flagging on this Rap shit Turfamdeskully IG get you a Artist", "Yes best way to start my day off log into the book n c dis  shit all in my face wit it too lmfao got me dying o shit lmao", "You mean Gucci's page finally posted something that didn't require me to click 50 times to see what the fuck is going on.", "Lmao. DBZ was the shit tho I fucks with Piccolo that's my nigga", "Proud to be a white yiah", "Wtf is dabbing??? This world is a complete loss I swear", "https://www.reverbnation.com/DOUBLELGANG/song/26836140-grind listen to our track for me yall...thanks", "A mcdouble and a water cup. Jazmin lol", "Zachary Wuest Trevor Jahnke Josh Benbo Charles Jonez What i really do when steve thinks im texting on the can. Cuz i have no friends. But i do have bunny suit", "Listen to SEXTACSY feat  FREE 2000 TRU by KING PHY DA BEAST #np on #SoundCloud\nhttps://soundcloud.com/yungphydabeast727/sex", "That's a throw! It looks good tho'... ROFL! :)  :*\n\nhttp://www.overstock.com/Bedding-Bath/Throws/Cotton,/material,/4535/cat.html?cid=243678&TRACK=PSGGL&gclid=COnVtMne9MkCFZAAaQodANEJpA", "Ever since you leftttt meee...you left me for that filthy hoe...now I be stalking all your pics...hating on all your chicks... Accidently press the like..I need to run for my life..", "like or inbox on how to become a member of the ILLUMINATI SOCIETY or contact illuminatisociety223@gmail.com", "Evan Juwono khali prnh gini ga wkwkwk", "Yassss!! Chuncie!! U already know! Lol", "All these racist ass comments. Comin mostly from non black ppl and tje few dumbass black ppl supporting it. Whats wrong with darker skin? Its actually more common in the world. \n\nAs to the Black ppl cracking jokes why should anyone support Blklives matter when you continue to degrade yourselves and kill your own people. Its almost like a joke when i see this! \n\nAnd dont anyone give me that \"Its just a joke, lighten up\" bullshit. You might think youre joking but there's a subconscious hate in that.", "Its a clean cut i like it and I personally feel that no matter how any of you feel about it its an opinion some people going to say its appropriate some will say it ain't that's something we all should've known when you first look so don't discourage somebody's opinion when yo shit ain't nothing but. An opinion just disagree and keep it pushing y'all mfks writing paragraphs arguing on right n wrongs spoiling the fun for the pic lame ass niggas you like it you like it you don't you don't so WHAT !!!!!!!!!", "Alyssa Ramirez who that last one look like? Lmfao", "Who spends 10 years on the same shit tho ..", "This was on 14 and john r in Madison heights, MI...I remember laughing at this sign every time  I passed by it lmaoo", "Just like a nigga...gotta get a piece of pussy before he go out lol", "The difference between new Gucci and prison Gucci post is pretty incredible", "Julian Bryant i would do this infront of Tori's house then spray paint her car. Putting us through hell! Hmm just sayin'", "ain't gon coment on this..buh the 2nd bitch looks like she abt to throw a spear, whats missing is a feather on her forehead.", "Bye! Find a new man that only needs you in their lives.", "Jus 2 sho u that little animals survive n cold", "Fuck outta here Black, Mexican and Native girls look beautiful with this hairstyle. We come from tribes go worship white girls.", "Why should a person only count that is what im saying yea money add up like driving and losing gas which u payed for with cash.... or buying 2 dollar coffes every morning, playing the lottery, pay for a gym membership wen you can workout from home, eat fast food when you coulda wen u could have saved by goin grocery shopping, pay for a contract phone and you coulda got cricket or etc.... point im tryna make is its alot of things people do on the daily that could save them hella money but thats what they wanna do...", "Yea the giving back part is ok", "Cormac Divilly Ronan Smith literally cormacs face everytime we walk home", "Only faggots have pet cats smh all of you are dumb ass homos for thinking the fuckboy who writes this shit is really Gucci and everything else lol", "When girls try to fake being car girls Lexi Haines", "Admitting Illuminati membership is like admitting one has a drug problem.\n\"Hi, my name is... (wait my name doesn't matter if it's not found in the Lamb's Book of Life according to Revelation 13:8)...and I am a hermetic mind-magick addict and if you ruin my microcosm (mikros cosmos) \"shared delusion between me and Satan (folie a deux)\" (2 Thessalonians 2:11-12; 1 John 4:6 ISR98) from my Illuminati etheric connection thought-pattern inside my mind that I proudly love doing with my magical thoughtforms then I will be a passive aggressive swine returning to my mud to hurt your feelings (Revelation 21:8; 22:15; 2 Peter 2:22)!\"\n\nPlease do not get lost in hermetic translation. There's no pride in that, only crazy.", "People acting like just because Gucci is in jail that he can't get on facebook. Smh let me inform you, Nigga in jail have phones and Facebook pages", "This is just dumb like why care so much about something so stupid its just a picture and u already have him so why do u got to go all psycho on his ass for a lousy picture and second why be with a guy who looks at half naked bitches anyways i mean some bitches need respect then just maybe all these guys wont be acting like a dog bitches are to easy even when they say ya arent like put on ur proper size instead of wearing toddler clothes and having ya tits and ass hanging out ( short shorts that are like undies and bras that are obvs to small ) js u want respect show it and u will meet the guys that aint no lil player lol player its not even that they just a joke", "Kenny, the costume made me think of you getting this job with disney.", "He need to wash his dirty ass", "i loved your shit and i hear you talkin to grown men about syurp, codiene is cool but if ya get that liquid hydrocodone syurp just be careful", "check us out tho yall https://youtu.be/LAzP8G3_Ics thanks real talk", "Genesis Brito us on Tuesday when we finally get to enjoy the rest of our break", "Sam Ghimire - WHY DO I FEEL LIKE THIS IS MY FAVE 4 U? IS THIS HOW HE IS?", "Id die and then so would he!!", "Do people even know the meaning of racism anymore? Man people need to go back to school. One who is racist believes that a particular race is superior or inferior to another. In this picture, it's called a fucking stereotype. It's not saying \"this man is black, therefore he is inferior to whites because of that name.\" It's just saying \"your name is Tyrone or Latrell because a lot of black people have these kind of names, not Eric.\" Now is that too hard to understand?", "I guess since its still 2015 i should just get this out of the way. Everybody sucks, you're all gonna die, and i hate you all equally. I hope that offended everyone, i wouldn't want anyone to feel left out.", "Fucking these sluts I'v never seen before", "Shit I give fuck say something bad about my ex we got problems to this day I got nothing but respect for her when I was sick she was there to take care of me when I was hungry she cooked for me when I was lonely she was the only one to come and keep me company when I had enough and had to cry she never judged me she loved me and I loved her and I'll never forget that and I'll never forgive anyone who slanders her I don't give a fuck", "Gucci Mane is featured on Freddie Gibbs' brand new single titled \"10 Times\". Listen to the full song on our page!", "If you stay Atlanta free vip until 11:30 just say you here for King Scorpio  party.   >>>Chuckie Tarver<<< this is his official page", "Everybody hollering about him not being able to get a job for one of u look at the size of the boys head he seems like he's a lil kid so therefore he don't have to worry about a job and can express himself however he wants and either way the cut dope took a lot of skill to do that some of y'all mediocre barbers can't do that shit so stfu", "Mariam Safi replace the cookie with a donut and its you", "Isra this was you in our group chat, when that guy enraged you. Remember Sally, Amy, Emma, Petra?", "What are the songs he performed?", "Lol dats me! I start cussing  for all da bs dey did to show no sign dat I give a care, but in fact I give a dam so dam--EM  lol dats y I cuss. ...", "Lets make racism funny again i mean cmon. It was more funny and relaxed when we could joke around with it. Now everybody is like mega serious . millennials need to check themselves.", "Lmfao. Bridgette Kirkbride...only because I will never forget watching this episode at your dads house haha. Every week!", "Jason Ling sorry man for tagging you in so much but seriously you're the only one who would get this from work", "I can't believe how many backwoods ignorant people here are trashing him for marrying interracialy. They'd be the FIRST idiots to cry \"RACISM!!!\"  if a white person said it the other way around. Pathetic. It's not your business what race other people choose, get a life.", "You forgot to add trump hair to that meme.", "Jaron Lewis Nini Sabree what's going on with these memes today lol", "Woop Is Here say hi ,He'll say it in return #it's #EastAtlantaSanta Return #Zone6", "They are obviously joking around. Yall just wanna be mad and call us sensitive or hypocrites. Calm down", "Rhys best reason to have a solar panel phone charger", "most these niggas wanna fall in love with a hoe so they gone fight u off lol", "@guccimane are you ever going to come to buffalo New York!!!", "Heidi Howard when I open my own salon lmao this will be my welcome sign", "Excuseme <3 Special for you,the official link Full Movie[HD] Live Stream without Register_____ (y) <3\nFILM WHEN THE BOUGH BREAKS (2016)\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-when-bough-breaks-2016.html\n\nFILM SUICIDE SQUAD (2016)\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-suicide-squad-2016.html\n\nFILM DEADPOOL 2\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-deadpool-2.html\n\nFILM DON'T BREATH (2016)\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-dont-breath-2016.html\n\nFILM FIFTY SHADES DARKER (2017)\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-fifty-shades-darker-2017.html\n\nFILM TRANSFORMERS: THE LAST KNIGHT\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-transformers-last-knight.html\n\nFILM THE FLASH\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-flash.html\n\nFilm Maze Runner: The Death Cure\nhttp://ratukebonraya24.blogspot.co.id/2016/10/film-maze-runner-death-cure.html\n\nJust Register and Get Free Trial 7 Day..!!", "When you coming to Houston niggs", "That's why you stop the time halfways and stir. You do it on microwavable meals, home made meals requires the same heating process.", "9/10 the type of woman that says this is bossy, know-it-all, spoiled, demanding, selfish, narcissistic, and/or angry that she can't find a man, keep a man, or knows they ain't looking for her. After being dumped, aside from dick size insults, it's the first thing a woman says. Is not about whether or not a man can handle you, sexually, emotionally, mentally. It's about whether or not you as a full grown adult not allowing your history dictate your personality traits. Men don't want to handle a woman, if she's an adult, he shouldn't have to. The only thing ppl have to handle is the truth, or stress. Which used in this context, \"handle me\" all we men see and hear is: Boys im living breathing stress and you need to be able to handle that. Girl bye. Or maybe since such a statement is misinterpreted , maybe elaborate what about you we need to handle. I wont lie, when I hear a woman say this, I literally hear I'm a bitch and a man needs to get wit that. I'm sure  other men do too. But if there is something else motivating the statement, explain it. \n\n[ despite how I use women in my statement, understand, this DOES NOT apply to all women.", "When you're Obama and stop giving an F about your country", "Totally see buddy doing this to me one day Max", "Simon SK he got a song with push I see", "goddamn :v :v look at that Apple :p", "Mingmer Shikha  hahaha us everytime", "Caleb Chowning this is what I used to do lol", "This offer is good again. You can get $30 FREE in clothes (No monthly fees to be a member) Plus they have FREE SHIPPING!! Earn sharing credits too!!\nClothes and accessories\nUse this link - https://www.schoola.com/stitch/rf611924\nMobile members need to click to view full site.\n* join with your email get $20 to spend (you will see it deducted at checkout)\n*create a collection by clicking the collections tab, name it , save it and get another $10 to spend.\n*shop $30\n(Items with a yellow tag in the corner of the picture are excluded).( items with a black and white box with a star are blemished. )\n40% will go into schools, so request a free preshipping labeled bag and you can donate to raise money for a school of your choice!", "they forgot side niggas and fuck buddies", "Jose Luis Cabada lol this is you, you just lie you have to shit", "That always happens to me, its like watching a movie a 2nd time u already know what's going to happen like nigga be creative get some new shit", "Daaaaamn son u got adub I swear to god I'm good for it bahaha", "Zo Grant your that duck looking at rodge when he went vegas lol", "It feels good to be out mane", "Anthony martial been serious since day lol", "That is the best, of all of what I have seen ever on Facebook. That cats built alone makes the cause for seen, and the comment. Way too Go!!", "And they be like ayye!!he turnt lol", "Haha!  You're trying to have a real deep conversation about your relationship and she blows you off;\n\n\"what happened?\"\n\n'I fell asleep'\nOr\n'I forgot to send my text'\nOr (even better)\n'I forgot to text back, but forgot what I was gonna say too'\n\nAnd *she* liked this post lmfao", "This right hear going bang hard asfk", "So, that's what's missing in my life. I'll get my credit card...", "I know it ain't eAsy tho I was in Luv once in  this lifetime", "listen to the track for me tho yall https://youtu.be/LAzP8G3_Ics", "Yeezy wouldve made a better president, but anyone would have.", "It's not the teachers faults for students having to wake up early. They have to be at the school an hour earlier than the students.", "All white bricks can sober you up Gucci", "I don't think gucci is making fun of race here. Shit I'm full mexican and I'm laughing cause its a funny joke some girls don't know how to braid there hair looking like the India maria lol ya'll need to chill and stop getting offended over little things", "go to burger king much better my opinion.", "Lmfaooo imma start wakin you up like this pftahahahah Jackkiie Miranda", "redneck conservatards don't wear oakleys, they can't afford it.", "Wtf is bae .damit what country am i in ? Speak american , pull up your pants and get out of your pajamas ! Fuck !", "When people say that then they ain't been in a  niggas house long enough", "I hate when I text someone new and its not that person phone flushed down toilet it aggravates the shit outta me to", "Move onto the next one. Just another day.", "Everybody knows gucci mane watches friends Eric Lemkowitz", "All I got to say is black Tony going crate they said his name not tony", "OK GUY....ENJOY IT NOW... :D HAPPY NICE DAY :D :v 46 MOVIES (y)\nDon't Breathe Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/dont-breathe-full-movie.html\nSuicide Squad Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/suicide-squad-full-movie.html\nSausage Party Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/sausage-party-full-movie.html\nResident Evil The Final Chapter Full Movie\thttps://setremmovie.blogspot.co.id/2016/09/resident-evil-final-chapter-full-movie.html\nxXx: Return of Xander Cage Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/xxx-return-of-xander-cage-full-movie.html\nBad Boys III Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/bad-boys-iii-full-movie.html\nJason Bourne Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/jason-bourne-full-movie.html\nThe Shallows Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/the-shallows-full-movie.html\nFifty Shades Darker\thttps://setremmovie.blogspot.co.id/2016/08/fifty-shades-darker.html\nBad Moms Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/bad-moms-full-movie.html\nThe Legend of Tarzan Full Movie\thttps://setremmovie.blogspot.co.id/2016/09/the-legend-of-tarzan-full-movie.html\nThe Secret Life of Pets Full Movie\thttps://setremmovie.blogspot.co.id/2016/09/the-secret-life-of-pets-full-movie.html\nPete's Dragon Full Movie\thttps://setremmovie.blogspot.co.id/2016/09/petes-dragon-full-movie.html\nBarbershop: The Next Cut Full Movie\thttps://setremmovie.blogspot.co.id/2016/08/barbershop-next-cut-full-movie.html", "Hannah Heather Angela Nadia Tasha Chris lol tell me in the morning which one of yall do this.", "He got it all backwards even his short", "When You Getting Out and You guys are dumb this not even  The real Gucci Mane And For You White People Say It like This Gucci Main", "Ali Stanbery thought this was your dad at first lmao", "Where does the meat in a Whopper come from? It seems like a silly question.", "When I was little The Big Lebowksi was my favorite movie and I didn't know the name so I always told them I wanted to watch the movie with that in", "Got me double tapping got me pressed out", "That was the best night haha", "everybody listen to our track for me https://www.reverbnation.com/DOUBLELGANG/song/26836140-grind thanks alot", "would get rid the bitch has done the dirty on it!", "Justin Caroselli dude, remember when we had hundreds of these and we're always trading lol", "My husband was just saying how proud he is of you and how you got you're life together!!!", "I would share this but certain people on my timeline would flag this", "Why Santa look like the only reason he going down chimneys is to Fuck your Bitch Alexus M Paige Brett Holder", "Classy stupidity of Gucci Mane but loving the real face of bitchy brain owners \"current reality\"  (( ;", "Is it me or is that Danny glover", "When he just chillin by himself and get a text from #Iggy_Azalea saying \"I hope you're havin fun with that biatch\"", "It's not about girls or woman and it's not about men or boys, it's simply about people that know about cars and people that don't, come on people, she was just trying to impress him get over it, he was the one that was fishing for a stupid response from someone that he already knew had no idea about cars", "I doubt they even know that's offensive", "Kayla Alexis this is your dad but in a different context that this is implying lmao", "If you stay Atlanta free vip until 11:30 just say you here for King Scorpio party Chuckie Tarver", "Woke up to freaky clowns playing heavy metal music! So terrifying! Please don't!", "Allysa Marie is that you? Lmao", "Lmfao I'm so dead omgg Mikayla Denae Laster", "Billy Gucci dropping a new album on my birthday. Going to be a good year", "Delilah so you sometimes. Lol. Jk luv ya!!!!!", "Chassity White lol except I go to the fitting room for till they call me!", "Gucci  Mane eat mud and I do too... I even ate the double cups", "Don't know why this reminded me of you hahaa Andrea Kasinak", "<3 (y) Oh Yess!! Hi GUY's..!!! took me hours to find finally found the link original Movie!!!! (y) (y)\nSausage Parti 2016\nhttp://1september2016.blogspot.co.id/2016/06/sausage-party.html\n\nSuicide Squad\nhttp://1september2016.blogspot.co.id/2016/06/suicide-squad-full-movie.html\n\nDon't Breathe 2016 Full Movie\nhttp://1september2016.blogspot.co.id/2016/09/dont-breathe-2016-full-movie.html\n\nBad mam\nhttp://1september2016.blogspot.co.id/2016/06/bad-moms.html", "Carrie Rhodes i immediately thought of you!", "Matt lmao if this isnt you idk what is...", "Oh Yess!! Hi GUY's..!!! took me hours to find finally found the link original Movie!!!! (y) (y)\n\nThe Secret Life of Pets (2016)\nhttps://samibaesimkuringteh.blogspot.co.id/2016/10/the-secret-life-of-pets-2016_16.html\n\nWhen the Bough Breaks (2016)\nhttps://samibaesimkuringteh.blogspot.co.id/2016/09/when-bough-breaks-2016.html\n\nDon't Breathe (2016)\nhttps://samibaesimkuringteh.blogspot.co.id/2016/09/don-breathe-2016.html", "Yo why can't he have this harcut and get a job so it's ok 4 a woman to have any haircut but not a man that's descromonation", "Yo I mind went lose when I say that", "Jameson Glasgow when people tell us guess lol", "nope...and when I get flowers, Im going after the scissors so that I can cut the stems at an angle and put them in water with an asprin tab...no big deal..just a thank you and kiss on the cheek...cook him dinner or something...", "Jose'sFluffy CardenasGio De La Paz yup ! You niggas know which one I am. El mas pendijo! ;) hahah!", "My boyfriend did the similar thing. Right after I lost my virginity with him he went on pc and i was next to him. I saw him look at his friends profile and I asked him \"why are you looking at her profile\" and he said \"she looks like you next competition\"", "bae? really? why do u dumb ass people still use that stupid ass word? it's babe not bae. sorry but I'm 4rm the old school not all this new school bae bullshit", "Lupe Vaca how it is with u liking all the pug pics lol", "Kaitlyn Toner me but only because cookies are my true love and I can't handle my emotions around them", "Ria, this is for serious how i  was when i first seent you.......and still when i see you across the way", "Who said he is helping them... Is it cuz those kids are blacks? Do the kinds in the picture looks so poor to require help?", "Now where Aladdin ass at lol!!!", "Yeah when I'm waiting on my crabby ass customers !!", "Excuseme <3 Special for you,the official link Full Movie[HD] 2016 Live Stream without Register\n\nBoo! A Madea Halloween Full Movie\nhttp://beaghdeady008.blogspot.com/2016/10/boo-madea-halloween-full-movie_17.html\n\t\nWhen the Bough Breaks Full Movie\nhttp://buronanmertua97.blogspot.com/2016/10/when-bough-breaks-full-movie.html\n\t\nKevin Hart: What Now? (2016) Full Movie\nhttp://buronanmertua97.blogspot.com/2016/08/kevin-hart-what-now-2016-full-movie.html", "Amber Bynes that's your face when you're making that ratchet ass noise, lmao.", "I may not no the story , but they prolly have never seen someone like that. But it's still wrong they make fun", "Hey Guys.... TOOK ME HOURS TO FIND, FINALLY GOT THE LINK Watch\n\n\nThe Girl on the Train\nhttp://wwwgongcayyy12345.blogspot.com/2016/10/bule.html\n\nMiss Peregrine's Home for Peculiar Children (2016)\nhttp://wwwgongcayyy12345.blogspot.com/2016/10/miss-peregrines-home-for-peculiar.html\n\nDeepwater Horizon (2016)\nhttp://wwwgongcayyy12345.blogspot.com/2016/10/deepwater-horizon-2016.html\n\n\nWATCH NOW...", "Black Tony happy now that Gucci came out wit another video and album", "Emma Diack they found out your addiction", "All niggas do, so called real niggas negus or what ever tf you want call it. when the time comes we will lose if we can't stick together and stop being so hard on each other when the time comes we will lose cause all niggas wana do is bullshit and hate on eachother, worry about money and shoes and bullshit bullshit on top of bullshit I'm so sick of nothing ass niggas like I'm sick of of these evil ass white folks you know what #FUCKEVERYBODY", "st brick intro is awesome bro. TRAPPING THROUGH THE SNOW...", "I came from the dirt  so my skin be brown... The devil on my back, still tryna pin me down......... So fuk breathin...cause we live to die for what reason... Clutch squeezin got me feelin like birds, in duck season........stick da heat into da  middle of my chest, and just squeeze... The only thing on my mind is DIE, and just bleed... Don't cry and just leave...What lies on my sleeve........ Is a whole lotta tissue....... Leaking from my pistol,  it is blood from my heart... I had no love from the start... So I took my own life, and from this world I grew apart......... From all the sufferin and the pain...plus all the scorchin and the flames. ... So I'm in heaven now, with a apartment in my name........ Jus looking down at the devil why talking to God...about how life was a bitch and I was strugglin hard........ ..i went from sittin in my yard, to laying up in prison... Behind a fukn dope charge and a illegal smithern (smith n wessin)                          I'm looking for a deal 225-210-9694 c-hood", "Hmm I remember I was flirting with this one girl for a long time and things were great and she would always dish out insults like nerd, geek , hairy , bum and one day she said \" you need to lose that hair \" I replied \" well why dont you lose some weight\" .....she stopped talking to me for 4 months", "thei shudnt have as ugli as u got", "Pictures on your tumblr got me stressed out", "Heather Arnett this would be me if we smoked lmao real shit", "Better than the dads who come out having kids that look nothing like them. Better get that test done.", "The advice is usually \"you go girl, you should dump him and fuck tim (or whoever) omg youse would be perfect\" or some crap along those lines", "Whatever they do and make fun with us, because they don't have what we have and don't look like us and also maybe they never see Asian before, just why they think it is ok to make fun.", "I wouldn't even take no chick to.McDonald's unless she wanted it that bad, but then I would think shes a Minor.", "I see many women claiming themselves to be a zoo creature or a bad bitch and that they need a man to handle them because of their bullshit. Why you gotta have bullshit in your life? Give me a woman like Lauryn Hill and I'm set for life. You want to be respected, then give me something to respect. Knowledge is power.", "Yep, Disney pixar, and Warner bros. r the best movie producing company ever, even though some of their movies were terrible", "To the people who don't understand money, and needs before wants:\nAdd every single $10-20 you spent for each transaction, lets just say for easy numbers once a month, thats $240 you spent a year, im pretty sure that could pay a few bills, its about responsibility, and creating a savings account. Same goes with people who spend $5 on starbucks every day. It looks small now, but in the long run its A LOT of money that could have solved the problems that \"caused\" you to smoke weed to begin with.", "That's hella my shit!! About anything mot just an X shit!!! Lol", "Shit hard bur bring the old gucci back glockamentary", "The truck needs to be a ford..", "Very Handsome............And the funny thing about it..... Been BLACK and down to earth is so Significant .............. Try living without all that comes from the earth, I need not say more.........Matthew Turner", "This look like my mama dog?", "Ppl just hate, they wish they had hair like that cause extensions ain't doing it", "I can't even tell you how many people have tagged me in this haha! Austin Butcher", "Only childish females do that and call other women bitches. But I can imagine my face being just like this lol", "i think Martial is just confused as to why United pay such a large sum of money for a unproven player.", "I can't understand why people take out the time to label other people's lives. My life is challenging enough. I don't have time to even think about what single bachelor's do. I don't care. It never even crosses my mind.", "I've been saying this for the longest.I'm glad my woman do not have that attitude.no man in his right mind wants to come home to a woman he have to handle.we already have to put up with bullshit at work on a daily basis,sit in traffic jams,and then have to come home to a woman we have to handle? Fuck that.my girl and I chill,go out,and get stuff done.no time for childish shit.", "Uhh there have been some pretty terrible movies with that intro. \n\nThe 1998 Godzilla film, for example.", "Ashley Beaman we throwing pepper in the snow when the porch is covered.", "Damien Butler remember when we killed that pizza at Jeff crib lol those were the days", "Lo Hinojos when the dog gets to your pills", "Jennifer Ebin we both said this last year lol", "That's not Gucci, that's flavor flave ! Lol", "I meed that my  phones stay dying!!!", "She's pretty and a daddy's girl we rock!", "Kayk Armstrong fam no wonder yo breath stank", "Bahahahhaa. Omg. I remember when we went to see that movie and DIED when they showed his part lmao Leigh Channell MANDINGO PARTY", "As a mechanic. All girls deserve to see this. Try it on a guy. I did. It worked xD so not a stab at girls, it's a stab at stupid dicktards", "There ain't a Damn thing wrong with that shame on you!", "See Lee should make this your thing lol", "Well i give relationship advice to my friends all the time. And at the end I always turn out to be right. I don't always give the bas aspect i give the good aspect too. I tell what is real.", "Value menu lol whata re yall twelve tf", "All the damn time smdh just can't get a break", "I want him to be from earth too...", "HEY GUYS.. TOOK ME HOURS TO FIND, FINALLY GOT THE LINK!!!!\n\nBoo! A Madea Halloween \nhttp://wariors9.blogspot.co.id/2016/10/boo-madea-halloween-2017.html\n\nSuicide Squad \nhttp://wariors9.blogspot.co.id/2016/10/suicide-squad-2016_18.html\n\nWhen the Bough Breaks \nhttp://wariors9.blogspot.co.id/2016/10/when-bough-breaks-2016.html", "Is dab not weed anymore wtf I understand making new terms but this shit is stupid lit is drunk dab is weed nog arm in the face and fuck the yeet yeet nae nae", "I am in Atlanta and need a few Santa shirts now", "you have a ice cream cone tatted on your face lol but this still pretty funny", "Y'all wish Gucci looked like that lmao this is Gucci mane", "Kyle Jennings remember you used to play with these all of the time??", "Why ask a question that you already know the answer to, he'll ima lie on purpose", "I'm sorry guys but I know this is ,fake but I always stick to the safe side I know I'm weird....if you stop reading this you are gonna die, my name is Teresa Fidalgo if you don't post this on 20 photos I will sleep with you forever. This girl ignored and 29 days later her mom died. I am real you can search me up on Google", "lol its never bae Gigi Rojas", "Who gives a F bout tha tatooo......", "Its his eyes they look like human eyes", "Waiting for people to blame this on Obama", "Krystal lmfao Gucci mane just fucking gets me", "FREE GUCCI MANE OK UP GUCCI", "Hahah oh Gucci Mane u get all the ladies! what r u talkin about!! #GucciGIrl", "So all my friends have to be white? LOL", "This look like they photoshopped their faces tho", "Emojis of champagne all in her inbox. ..", "can hide a shotgun under that lol", "Hey Kanye might be better than the new Hitler Trump. Idiots shouldn't be presidents didn't they learn from bush?", "Huge red flag for she's crazy af. No thanks. Too much exp with ones like that and lifes too short to deal with that kind of bs. Give her some medication and a therapist.", "Since when did everyone start saying dead? Or dead on the tracks or w.e the Fuck!? God dammit, do you know how retarded you sound?", "Aly Meganeno this is me when you do that", "Love that show sign Gurlmeetsgurl Gmg!", "So basically this guy's just an asshole, setting this poor girl up for failure. Wicked  douchey. Any girl who laughs at this obviously has low self esteem/ cold hearts... trying to be all like ha-ha Sofia is stupid, I wouldn't have made that mistake, I'm not stupid like her. Pshhh acting like you never bullshitted to impress someone. Lol acting like your first thought if 2014 Dixon Ticonderoga was texted to you would be \"that's a pencil\",(unless you buy a lot of pencils). I'd put money on it that if the picture of the pencil wasn't there most of yall would been googling like wtf is that? Bahahahahah. People are such pricks.", "On to the next one. Pussy dont wait on no man, and neither should you. Thats my free advice i wanted to share", "The best to do it Guooop", "Ruby Batson if a guy asked me about my interests it would be the tech deck", "I've seen this chick before her name is grace neutral her tattoos & body modifications are crazy af", "want eat it again.. but i show will rock that horse hair on my head lol!", "How to describe burr with a picture #wop Alex Wylie Greg Eimers", "#Gucci mane u got so much #money so why u #mobbin?", "Aint got time for dat Call of duty is home !!!", "If you stay Atlanta free vip until 11:30 just say you here for King Scorpio party that is the password", "I think racism rins through everyone with all the shit i see on facebook stereo typing everyone .....#Dead", "How the hell did he get up there that high?", "\"O so u just ganna kick me out brah\" cat voice", "Its a show, not fight :)", "Best president ever. Only white people disagree.", "Kyle McMullen Tucker Kavajecz basically how we bond with our coworkers, but more specifically each other haha", "That Arabic is hella' wrong. lmao dude wrote it left to right.", "never got 40$ but niggas got money for shows and shyt wow", "I up the for the challenge gucci mane we both handle each other", "From day one McDonalds burgers was a joke", "I'm so sorry. Keep reading on, or die tonight a exactly\n12:42. This\nis based on a TRUE STORY! Once there\nwas\na baby\ngirl named Marry. Her mother couldn't\ntake\nall the\ncrying, so she decided it was time for her\nto\ngo. She\nburied her baby alive in her back yard.\nAfter she\nburied her she could still hear Marry\ncrying.\nSo she dug her back up and stabbed her\none\ntime in the arm,\nand buried her again. Marry cried harder,\nbut a few\nhours later it stopped. At exactly 12:42,\nMarry died.\nShe bleed to death. Now her sprite\nhaunts\nthe\nworld. When your sleeping, she stabs\nyou in\nthe\narm and watches you bleed to death.\nAnd\nthat's how she got the name \"Bloody\nMarry\" this is the true story\nof her. She wants everyone to feel her\npain\nthat she\nfelt. Apparently, if you re-post This isn't\nfake.\nApparently, if you copy and paste this to\nten\ncomments in the next ten minuets you\nwill\nhave the\nbest day of your life tomorrow. You will\neither get kissed or asked out, if you\nbrake\nthis chain you will\nsee a little dead girl in your room tonight.\nIn the next\n53 minuets someone will say I love you\nor\nI'm sorry\nto 12 other comments you will have the\nbest day of\nyour life tomorrow. But if you break this\nchain you die\nat exactly 12:42 tonight by Bloody Marry.\nDon't believe me? You'll see not taking", "Why be someone side chick when you can be someone Queen the way it's supposed to be", "Birthday bash everybody free until 11:30 all you have to say is you here for a party for King Scorpio I'll see you there turn up", "This shit cracks me up so much.  Everyone lives how they think they should live.  Guy or girl...stop trying to change people just because you don't agree with how they present themselves.  Some guys like difficult    women just like some women like difficult men.  If it's it not your taste look else where.  I'm sure you'll find what you're looking for eventually.", "Ybow Kingbow the main reason why i always forget my phone when im with you lol i dont need to text anyone else when ur the only one i text", "Those were the best pencils. On a serious note, I've been a girl my whole life and I happen to know A LOT about cars. Maybe it is the fact that my dad works on them, or the fact that I love trucks and jeeps. Not sure, but this should say dumb girls because not all of us are ignorant dummies like this one.", "You trying to wake up in the morning lol Kristin Apple", "Erika Leyvaa\nLmfao dude I died laughing like if you come home right now I'll be on the floor dead with a smile on my face", "Kelly Beth this is why I never let you give me two braids lol Samantha Mijares", "Fuck yo page unlinking it's dumb as fuck you ever gonna post none stupid shit you should just delete this page and save the real Gucci the embarrassment because he wouldn't post this shit", "Hayley Rose when the shower at mums house is scolding hot so you turn the cold tap just a little, tiny bit and it goes to freezing.", "Gucci be trapping harder than other guys...", "When people  buy drugs for use it's because of their unhappiness. They feel the need to try and be happy. Don't judge people for their actions. When you know nothing about them or how they feel.", "If that's my situation, I probably need the weed"]