["Yeah but immigrants never win Nobel prizes or anything... /sarcasm", "Remember what Jonas Salk did? They should do the same!", "The male platypus has a poisonous spur. They can be fatal.", "any treatment based on a single theory will likely fail cos AD is likely a multifactorial disease", "If they don't get it then they should step out of their bubble and start listening.", "Don't shoot the messengers: I repeat  'Don't shoot the messengers'  [Values of Democracy ?] I have no access to the Scientific America facebook page anymore?  So i don't know if it was manually done,algorithm or even a hack? They are not in my likes and I'm blocked from comments,so i find very unlikely as a hack. I have never hacked anyone or any sites,have never threatened to!  And have fallowed these fun rules they have,and completely understand to average spam and over the top comments to be carefully regulated?  But the problem they like any other site are a public forum,and the need for people to try and communicate ~> equates to the science of all of us = real social science! \t\t\t\n\n\tI also noticed they have a 'Superiority Complex' often with posts,and need to realize you don't disregard someone that has defended many,shared many post and make worthy or important comments vs very mundane,simple,meaningless or sarcastic that have no violence or malice,but still up for interpretation like everything that is posted and comments. And should be recognized as such,so no site loses people or groups that share what real science gets acknowledged or not! Sadly the 'FACT' that they themselves have posted regularly to get the attention and provoke for a response by others,not just read what we say,and why it matters. Even taken back by this some being an adult to laugh it off to a point,the deeper concern is ( If a young person is deleted from science education over stupid comments,and instead of it being a unit ~ often can turn negative to that brain >of< memory ) and in science why does this matter again? To my understanding that even facebook has been a big part of how information gets around,even more so now than the obvious past.The lack of trust and honesty with misinformation shown through technology is pretty clear!", "here's your Christmas present Nikita Gupta", "It troubles me that the court is not addressing the issue that Berkeley filed first but Broad, filing later was able to leap the queue and get awarded a patent first by paying for an expedited processing. Expedited processing should not allow patent rights over  already filed intellectual work that USPTO simply hasn't worked because they're being paid to work someone else first", "Who needs science when your religious beliefs are your self contained reality?", "Science, in many countries, suffers intrusions by publicity-seekers, networkers, managerialists, manipulators, band-wagoners, and similar sorts of characters, who displace the more genuine, unique, autonomous intellectuals.  The article seems to recognise this ongoing decline.  The points about using online media are good.  Practising to give more conference talks is also fine, but the article seems to recommend that everyone should learn to imitate the networky invaders.  Isn't this defeatism?  Wouldn't it be better to think about ways to cleanse the rotting system someday, and look forward to a meritocratic purge?  For instance, it might be helpful to reform bibliometric scores, so that originality and individual contributions attract better rewards than gregariousness or conformity.", "Steve Crowley Phil Ryan Present for Harry sorted!", "Just because they discovered it doesnt mean they made us or saw potential in it. This is a very complicated case in which noone is clear victor. Since Feng did find a way to employ Crispr in eukaryotic cells merits him some ownership.", "oh boy .. and i got to the last word of this article without an answer to one of my questions .. people are so flummoxed w our New World Order they really don't have a clue about what to say ..", "Amanda Kraha Jonathan Banks Shana Southard-Dobbs Eric Schuler", "Why would a child need 3 parents?  2 is more than a kid can handle I think.", "The first baby using this method (or perhaps something similar?) was already born in the UK this year it looks like (https://www.newscientist.com/article/2107219-exclusive-worlds-first-baby-born-with-new-3-parent-technique/ ), and I know UK approved the use of this method back in 2015, with funded work since 2011. http://www.bbc.com/news/health-31594856", "Similar study came out a few years ago where the excess fat in the omenta fed ovarian tumors and a second messenger/FFA vicious cycle was set up. Chemotherapy does not do well in patients if there is excessive body fat. The PK's of the compounds aren't even in the ball park.", "This might interest you. Rituparna Saha", "Because it's fake .......made in China my friends.....made in China. Remember that", "Would there be any more decent people left to live in the future?", "Why not change diets to get cured?", "HUMANITY SCIENCE THESAURUS BROUGHT A LOT FRO HUMANITY.\n\n. #Math #Mathematics #Science #News #EarthNews #HumansNews #EarthProudDay #HumanityScienceThesaurus #AmericanScienceThesaurus #EuropeanScienceThesaurus #GodEquationsOfBalance\n\n- HUMANITY SCIENCE THESAURUS - not only because sent Fermat's Last Theorem in Fundamental , but also made a connection between all Real Numbers.\n\n- HUMANITY SCIENCE THESAURUS - brought GOD EQUATION OF BALANCE.\n\nI know I said the single Poincare Conjecture is #IonMurguCUTandPT345Resonator , but I said it as Physicist and in time you will understand for what, first is conserving UNITY.\n\nWe can be proud Physics Started it, but nobody can say isn't Math, for My Is Physics as containment and Math as expression. A,I. never will can have The Human Sense of Istant Contemplation- for it I am Proud I am #BornBarefootMan Fermat-Murgu Quadruplets is only a proof for n=3 - but Fermat-Murgu Second Grade Impossible Equations SENT - FERMAT's LAST THEOREM IN FUNDAMENTAL With your permission , after more then 40 years of work, I Declare Ion Murgu Integers Powers Fundamental Equations or Ion Murgu Math Millennium Equations as HUMANITY SCIENCE THESAURUS . Those HAVE already one years and a month existence and maybe anybody is hiding it, but can't be hide for Infinity. theirs importance is .... big ? will see.\n\n\"https://youtu.be/5cKlVrEt_GA\"\n\nHumanity's Team\n\n .", "It never ceases to amaze me how not even the most sophisticated aspects of life can escape drama.", "Having treated many children with mitochondrial syndrome in my close to 50 yr career as a speech therapist, I am delighted to hear about this breakthrough.", "John Paul Leigh you were on it w that song", "Love the pick.  It will balance the debate.", "Yes, I know someone who choose to spend more time with the kids and take hits after hits and eventually close down the lab, except that someone does not has a set of XX. Of course statistically, that someone does not exist.", "No science needed here. Only politics. We throw away tons of food every day, we just need to have better distribution.", "Francisco Montellano 1445 novos virus!!! vais ter muito trabalho pela frente ahahah (se nao fores para psiquiatria)!", "Which gas ! Carbon is only 10 percent, most is water vapour.", "They have a valid concern in that he has called for things like making a list of all Muslims in the country and other rhetoric. He has brought in blatant racists and Islamaphobes to his new staff. He has expressed idiotic mentalities toward climate change science so it is valid to be concerned for the treatment toward other scientific fields. The republican party itself has for many years attacked science itself and mixed their radical religious views into issues of a scientific nature where they do not belong. \n\nOne potential administration official recently alluded to using Japanese American internment camps. There need not be proof of an individual risk to any certain scientist immigrant for them to have legitimate concerns when there is this much evidence that points to potential bias against them. Impressions count, these are human beings not robots. \n\nWe should be giving them  a feeling of being welcomed even as we enforce any laws. This is at the heart of almost every political issue right now. We have allowed ourselves to be propagandized into thinking in strict terms in order to divide us when in fact we should be standing together and telling these politicians that we want them to be creative enough to find solutions which address any valid concerns as a whole not as either one side or the other gets what they want, then drives their advantage and opportunity into the ground to the point of being abusive. \n\nWe are letting our leaders off way too easily then turning at each other with angst when they inevitably pit us against each other. Enforce immigration laws AND make people feel very welcomed when coming to our country, not one or the other. And I mean it in the strictest terms. NO excuses or short sighted political games. I don't care what problems there are in approaching issues in the whole. Don't run for office if you don't have what it takes creatively to serve all valid concerns when devising plans and laws. This is their fault not the public's or even the immigrants'.", "At least, immigrants, and the others, can expect jobs in research...", "Nature law can not be broken", "Haobin Ye et al. showed this 6 months ago for chronic myeloid leukemia in the july issue of cell stem cell. The authors of this paper don't even mention this.", "Anyone that smokes while they're pregnant shouldn't be having children.", "Kevin Leslie, Lochness is possible! :P", ">inmigrant and minority 'scientists'\nStopped reading right there", "Trump and his cabinet are going to drive the environment down along with scientific literacy.", "Sir Ian Kendrich C. Fontanilla! :D :D :D", "This is amazing, but not unexpected.", "from the Guardian summary it looks like the study is struggling with statistical significance, though", "Wow, the comments in this thread...", "Wow, now all the fat people can live their unhealthy lives, because they found another animal that they can cut open :-(", "Hey! SustainabilityHack is a page devoted to spreading green habits to people through social media. Like my page for some easy ways to save the world!", "what, like a single person?? :D", "when Nature has a say Ghizlane", "Why are we calling it post-truth????  Why not just call it pathological lying?  Look at the mess yesterday due to post-truth pizzagate?  I now have some Anonymous whatever (freak) eating my brains bcz I dared not to chug from the pizzagate kool aid pitcher going around.  Moreover, these post-truthers make up RIDICULOUS conspiracies, and then put the onus on you to prove it is untrue.  It's anti-intellectualism at its very worst.  \n\nWhy to even label it post-truth?  It lends credibility like alt-right is simply white washed neoNazism.  Call a spade a spade.", "Except the political right in America is anti-intellectual now so there's nothing much of substance to discuss with the conservatives in general at this point until they begin to respect reason instead of their blind ideological obsessions and their love-affair with a slew of prejudices towards anything that isn't a straight white male.", "Humans are often wanting to (and thinking they can) communicate with extraterrestrial beings.  That seems to be so far-fetched to me given how little they know about and appreciate their fellow life forms here on Earth.", "Wasn't that in an entirely different role for a committee completely unrelated to hhs? Fake news?", "The first thing that shows is the 'may' weasel word. The claim cannot be challenged. Second, how would you know that an idiotic mother that does that, does not pass the idiotic genes to the child which tends to do the same things as the idiotic mother? Epigenetics is not needed to explain imbecility genes: they are already there :)", "Meaningless legal entanglement.  No matter what is decided other countries will ignore the verdict.", "That is fascinating! In animals, memory is due to physical structures induced by the stimulus. Although possible, I think an epigentic response may be less likely than some other \"structure\" perhaps clusters of receptors on the cell surface and/or microfibrils within the cytoskeleton are more likely.", "Are you guys actually trying to recruit nutjob commentators by invoking Trump?  \n\nWell, here I am motherfuckers!!\n\nHERE I AM!!!!", "I think that I'm most shocked to learn that a platypus is venomous", "Whatever make Mike Periods for Politicians formerly Periods for Pence lose his religious shit.", "there's this guy Martin Armstrong who claims to have predicted this nationalistic wave using historical cyclical data and he's  probably using  correlation algorithms for the prediction. Is his work of some merit, or a string of lucky guesses? https://www.armstrongeconomics.com/blog/", "Viruses should be associated with everything, before there were any animals, let alone invertebrates.", "Seriously, Nature, why share the LAT article--just the Nature article was all that was needed.", "That's the Brazilian's project, Amazon become a big pasture.", "hmmmm my computer says failed to load the PDF....  So much for CRISPR CALENDAR.  I love my calendar girl... yeahhhhhhhhhh....  scratch the needle.", "still the road is long ahead", "If these are the populist I want them niw here in Mexico!!", "Mentoring still exists?!? I thought grad students were people who got used hard and put up wet until the researcher with funding was shamed into allowing them to move on.", "Jess chalking up another win for optogenetics", "Here we go again...  If I wanted to read left wing propaganda Id read the NYT.  Please stick to SCIENCE!", "Luiz quase que a CRISPR foi desbancada haha", "This illustrates a pitiful descent from science by the refusal of psychiatry to yield to non deistic biologic avenues, as led ,50 yrs .,ago by Fuller Torrey,Dan Risken & H.A.Washington!", "Isabel Angelo thought u might like this. good read", "Daniel Corredor Hey! I told you about this!", "So gorillas are actually violent, and its not safe, to let your kid climb into their enclosure... Who knew?", "What will it take to wake up the climate change deniers?", "Ok... this is freaky.. kak rudi...", "Esta super interesante dr chequelo  Jonnathan G Santillan Benitez", "Not 12-17% *more*.  12-17% of.  Difference is doomsday versus just not good.", "Human race has always faced such problems", "Aniket Ravan Mayank Boob check this out", "Nothing can be done against nature...distruction takes place....", "Well if you think about it everything is a reflection of the interactions in its environment. If the thing still exists, the thing itself is the memory of that process.", "Darlene Godoy de Oliveira, Anna Carolina Cassiano novo tratamento para fobia!", "Well, we knew it was coming...", "It`s easy. It`s internet the reason.", "sharing is caring. kiss someone today!", "We can build our way out of global warming!", "oh that's easy. at least in Europe it's because of 1)Islamic terrorism and 2)financial incompetence of international orgs like EU... In U.S.A. it's a little different. It's more subtle and the causes run much deeper. Has to do with economic problems and a communication failure between the so-called political elite and the working class.", "I didnt know they were venomous.", "Bats are sweet creatures, widely misunderstood.", "A couple of lines into the text and you are already playing with my feelings? Nature you are sneaky.", "Animal experimentation makes me so uncomfortable. I know it's very helpful for science, but it really bothers me.", "Whatever. They will select someone based on political correctness rather than skills anyway.", "The most interesting article I've read this year!", "Hannah Stevenson I remember what you always told me", "Cause liberals hate Pruitt, So Trump has chosen wisely. I Hate fucking Liberalism. liberals are bitching about Pruitt cause of his past lawsuit against the EPA.. Theirs Little science to back up liberalism global warming.. read carefully I said liberalism global warming not real Science.", "It's like a real life group project", "Dear Nature, can we also make a medicine to cure phobia towards certain skin colors?", "sorry, but enjoying the revenge of the conservative!", "Trudeau has pals in the oil industry. Maybe one of them could do it.", "I think they missed a step. We are still looking for a real prime minister.", "Choose a climate scientist, you clearly need some advice there!", "Every time someone claims humans can't possibly impact the planet, I have two things to say:\n1) Have you seen pavement?!?! \n&\n2) The algae did it first... first 2 billion years or so the atmosphere didn't have free oxygen... then MASSIVE environmental change due to photosynthesis.", "A Mistake increases your experience & experience decreases your mistakes. \nYou learn from your mistakes then others learn from your success.", "What exactly is gender equality? Yes I know women fought for equal rights. But now they have children and send their children elsewhere instead of raising them. It's time the truth be revealed. \"Gender equality\" has torn mothers from their children. A woman should have the right to be there for her babies. That's the rights we should fight for.", "we can see where this is heading... nowhere good. well done murica.", "The most feasible explanation for viruses for me is that they evolved out of their parent organism through some yet to be defined process, at some stage in the life of the species.  Given the relatively short term of hominids & the prevalence of viruses in us, that time frame may be short.  Of course, mutation of protein envelope & DNA/RNA fragments could shortcut their evolution from similar species, but still, it is clearly a rapid process once an initial virus is successful.\n\nThis theory almost requires virtually every species of creature to have their own viruses.  As given that there's been plenty of time for them to evolve, if a species, even genera has no specific virus they would be a scientific gold mine.\n\nP.S. I wonder if moles respond differently at all, or if it's just mutagens they resist. I don't know the MoA of their resistances.", "Yeah! Right, what? Let me think about it... my distant relatives.", "Totally fascinating -- thanks for sharing! :)", "Casey Visintin (for the design nerd - I mean this in the nicest poss way...)", "Here you go, Kristen, this is what you were trained to do. Chemical Engineering.", "Well humans are also animals, same kind of \"groupthink\" observed in animal studies applies...it's not that complicated", "Luis Antonio Justulin Junior Jaqueline Rinaldi", "Anda what about Mojica, the first one that publish about it?", "Only simpletons are baffled by all this. When greedy ones lean too much on their slaves then a correction and redistribution of wealth is in the cards. One of this nationalist my kickstart their economy making weapons. Let's sit back and enjoy the show.", "Mentoring in the health sciences is vital!! \nI precepted, mentored, 2 Nurse Practitioner students and loved it. They then joined our institution.", "\"The majority of women leave the academic workforce before they want to, while others do not progress as far as they could.\"\nAnd what do the majority of men do? Do we have a comparison in that sense? Maybe the majority of women leave the academic workforce before they want to because the majority _of people_ leave the academic workforce before they want to?", "Give some credit to prof. Siksnys :(", "Ron I see some perspectives here ;)", "Katerina Hanton Angela Hanton Christopher Haggarty-Weir Xena Bee", "The only right to the tool CRISPR-CAS9 should be the right to have access for all who need it! And for it to be affordable access for everyone! Not as just another profit Machine for Pharmaceutical companies.", "Intelligent people do not try to argue semantics with others who are speaking from irrational anger or a reactive nature. They do not even usually speak to the actual topic presented. \nSome of us get what is being said here. We will just have to leave it at that. No need to feed the trolls.", "Wow how dare he question climate science we all know they are perfect", "Haran Haz Somehsa Rahul El Nino Kurup Dinesh Carl Junis Mahendran", "That headline is a laugh. In my experience it's boffins that are contemptuous of the public.", "Well, that's not quite the case history. Remember, the EPA itself said that it couldn't legally regulate CO2 becuase, being natural and ubiquitous, it wouldn't meet the legal standard of being a pollutant.\n\nThe Supreme Court twisted things a bit, insisting that not only COULD the EPA regulate it, but that it pretty much MUST.\n\nIn context, Pruitt's opposition to legally questionable regulations, and his siding with the EPA's original assessment, comes off a bit differently.", "Academia is full of liberal people rejecting other visions of the world.\n\nThis is particularly bad because scientists and literates should look for the truth and not for a particular side of it. (And they are the ones that should do it most)", "If you can't replicate it, can't use it.", "Riccardo kijk hun hier weer doen", "As if I didn't have enough to be anxious about", "The only demographic where the expected lifespan has decreased is the group who voted for these people.", "I do think China and US have something more immediate to do against the climate change than stuying it", "For the future, not only Birds-Voice Imitatoren, no Bats-Voice-Imitatoren! :-)", "Please don't go down this road,  Nature. Stick to what you know.", "Michelle Dillon at least by then no one will be able to do soil studies. Be none left", "Great. Not a person can argue against this without looking like an arsehole, but how are we going to feed all these healthy first world people who never get sick and never die with ever-diminishing resources? Are we going to eat up the third world entirely in our greed?", "Because most researchers have never lived in the kind of communities that suffer most from neoliberalism. It's pretty obvious to those of us who did why people are pissed off and frustrated.", "EAT SLEEP MOVE... the rest is MArketing", "maybe there is a ying yang we do do comprehend ?", "Look after the flower first, the pollinators come later.", "The uprising for Harambe has begun.", "When publication are more important than the credibility of your work.", "I think that's how the Zompocalypse Vampire Disaster began...but, thankfully, The Singularity occurred, and Skynet will take care of those filthy Zombyrz", "As an academic scientist, I'm happy with this.", "The only thing that seems like it wouldn't be clean is the manufacture of solar arrays. And possible pollution from transportation to their final destination. Other than that it's a really clean source of energy. And manufacturing methods arebgetting cleaner every year along with lower emussion vehicles.", "or... you know... people could start eating well and exercising...", "For me, it is clear that Berkeley did it first. Others, just applied this prior knowledge to their systems.", "Npr reported on this like 6 mo ago", "Well then how come we don't use dogs to detect explosives oh wait we do", "An excellent initiative by Prime Minister", "Maybe he hasn't noticed the increase of earth quakes in OK.  He probably does not believe they are caused by 'man.'", "Buh! Trump already appointed a woman as UN ambassador. Her parents are Indian immigrants. What we don't like is illegal immigrants.", "Then explain why people have been exposed to concentrations that are much higher (10000000x) in birth control pills without any problem? #chemistryfail\n\n\"despite of 20 years of research a human health risk from exposure to low concentrations of exogenous chemical substances with weak hormone-like activities remains an unproven and unlikely hypothesis.\" http://www.sciencedirect.com/science/article/pii/S0378427413013659", "Eric RubinTuri Reeves potentially very helpful w/r/t the needle", "Stop \"dieting\" and make it a way of life. Respect yourself by eating right every day. Food companies don't have your well being in mind, only profits.", "Don't bring the United States version of a science council into this. They just tweeted out a breitbart story about how the climate is cooling not warming. They don't count as a science advisory council.", "Ummm no. Read the article. Not in cells. It is cool by the way.", "The situation is very simple: due to the way researcher's minds are shaped at the time they do their undergraduate and post graduation studies, they no longer perceive the truth as the best possible description of reality. The truth, for the majority of the academic stablishment, is the most convenient narrative. The most convenient narrative frequently is a lie, so, when reality is inescapable, they get confused.", "Enaam, Madeleine, brush up your CVs. :p", "What fascinates is the advent of viruses may have resulted in an explosion of evolution as virus transported segments of DNA from one species to another.  Viruses may have rapidly speeded up evolution in that way.", "\"According to several reports\" = not official.", "What about recycling and disposing processes, why it is not taken into account here?", "interesting, well an evidence that a living thing don't need to have a brain to learn.", "But... but... Trump... oh, well. Never mind.", "Here's your Pavlov's theory in practice Tiffanie Thomas", "John LaRoy John Mundahl Bhargavi Puppala Bryant Schmitz", "You know and state exactly why, but remain baffled? Come on.", "Help me, my Lord God, how to deal with stress and cast my anxiety upon You, in Jesus name.  Amen!  Help anyone who calls upon Your mighty name to overcome stress and anxiety anytime and anywhere too, in Jesus name. Amen!", "Look after your snappers, David Jones!", "The Trump Group think? No they are of a confrontation cours with china!", "So vampires were not totally out of their minds then lol", "Ben this could be an interesting follow on from your psych studies? Or is it actually a variation of your spider study?", "Carlotta Cellini idk why I'm reading this before bed lol ~science~ so fun", "So I guess funding to understand the spread of West Nike & Zika will go out the window. If you get sick from it & you have no insurance it's back to the ER waiting game & hopefully there is a dr there who understands the disease", "Does this piss liberals off??   Exactly!!! Genius move Trump Rules..", "The same tactics Nature editors used to put fear of Brexit in people's minds are used here against Donald Trump. Well, good luck with that...", "Does politics need to be mixed in everything?", "can we find some clinical applications on this?", "Maria McGuinness Niall Mc Groarty Neil Scott James Garcia", "Why is this so baffling to people? Decades of the unionization of everything is the cause. People don't want to be consolidated into gigantic blobs to be ruled by far away and inaccessible \"representatives\". You can't put one person as a representative of an entire freaking country and then have that body pass laws that directly affects the lives of the individuals in those countries and not have problems. That's exactly why the United States was created the way it was created. Government consolidation robs people of their voice as to what is and is not acceptable to them as proper government. This is not baffling; it's elementary. We are not a hive of bees.", "Hey i met a girl 30 years ago who believed someone hit her brain with a laser and could control her mind.. not sure what to believe now. She ended up in a psychiatric hospital", "indeed, plants could be smart thanks to epigenetic memory http://journal.frontiersin.org/article/10.3389/fpls.2016.01354/full", "Bale Ro see do not get mad with me at night!", "'Scientists forget to ask internet commenters the answer to their question, pretend their question requires a complex answer to adequately address, get simple answers anyway'", "Collaboration breeds innovation and accelerates cures.", "We need to design a food replicator. One that allows to make food and also to recycle food to avoid wastage.", "Toni Tim Gunn gone wrong xd", "Cognition isn't required for learning. Very basic robots learn, and there's no suggestion this happens via conscious cognitive processing.", "Henna Reddy see it was relevant", "Researchers live in their ivory towers and dont understand the effects their neoliberal neocommunist indoctrination has on the general populace. Ofcourse they dont understand.", "Good. Scientists should be political and influence policy when it comes to science.", "Absolutely adore  anything  related to this", "Ji  James  Jeremy  Marissa  Abe", "Wasn't there this Korean 'scientist' who'd claimed to have cloned a dog? A number of similar claims come from Chinese labs on a regular basis, about as true as a Louis Vuitton bag from Chinese 'overproduction' is authentic.", "Carlo I'm gonna start bugging you a lot with this haha", "Natalie Jaksic i havent read the article yet, but thought this would be a good read for you! :)", "Nature defending a conservative view? There must be a chatch and i can't see. Somebody help.", "That is seriously amazing. I heard about this bird strange sexes but I never have time to fully understand until now.", "mais ou menos aquilo que tu disse Eduardo Habermann", "I can see people calling them Thirds or Trinies.", "I love such advices! so easy to realize! Exemple: Parents and chrildren, parents look the internet! \"Never go angry to bed!  Oh many example .. :-D :-D", "Fridays are for downloading CRISPR-themed calendars lawls - I'm sensing that 2017 has mighty fine things in store for you bbg haha Sadaf", "Lucas Kang I think you should apply, your country needs you", "Julian, this is what I was talking about today...", "If Justin Trudeau really wants to promote science and innovation culture in Canada, he must infuse massive cash in training middle school and high school science and math teachers. In Canada one does not required to have a university degree  in math and science to teach math and science at middle and high school levels. Of course, Trudeau would not take up my advice. However, if he want to see why this is very important policy initiative,  he might want to watch the PBS Documentary: Sputnik Moment.", "This is patently obvious. He was hardly subtle with his rhetoric.", "More vivisection to fix human error, great", "Tim Vinther Frederik Nielsen et minde om Eukaryot eksamen? ;)", "But,  a lot of \"mentors\" keep running after to be unique and excentric, leaving sceince aside...", "I think births by surrogate mother is already the case, the child has 3 dna", "One reason not to get prgenant! O:)", "Your life is a reflection of the way you think. If you change the way you think, you change your whole life.", "Wafa Charifi Haha mon Facebook m'aime bien =p", "Epigenetics becomes more and more creepy...", "i always thought we knew they could....environmental impact and epigenetic changes??", "Another intersting point is: Nature addresses the aggressive tone on Trump rethoric, but fails to mention the hate and violence showed across all America, including universities, by Clinton supporters."]