["hey guys I'm a novice on the houston circuit and i need advice fast on how to get a state point, or else i get purged(sent to congress) by the upperclassman!!!!", "What school? Best choices are Dobie and Maybe Creek I guess for January. Avoid Katy", "Main tournament of the week, usually very competitive", "Ok. I am going to Jersey Village and Dobie. Should those be comparable?", "Dobie is less competitive. Honestly I don't understand why you would go to Dobie when UH is the same weekend, if you had the choice. ", "Comparing Jersey Village to Katy: Jersey is competitive but not at the same level as (presumably) Katy. Katy is like the tournament of the week, meaning that most competitive schools will be there.", "I would suggest to find an event and stick to it, however freshman year is usually the year to branch out and try different events if your looking for state points I would say find one event that you like and stick to it. Also maybe try doing extemp along with whatever event you choose so you can get more points. ", "P.S. If your going to Dobie hmu I'm gonna be there lol ", "Go to magnolia, last year it was an all varsity tourney and the LD pool was FLOODED with novices ", "Also on another note: don't allow the upperclassmen to force you to go to congress just bc u don't get a state point, it's called your NOVICE year for a reason. You're still learning, and shouldn't be forced to move into a type of debate you don't want to do bc of a ridiculous rule", "I can second this I broke my novice year for the first time in varsity there", "I mean, there are a ton of Jan tournaments here that you can go to, that are pretty low skill (a good debater can usually make semis here). Other than that, I don't know what to tell you.", "If you're in PF there should be a ton of easy Jan tournaments. Most good teams have qualed by now. Pick up DX or FX as well if you haven't already ", "Bay City was pretty easy, as a novice, went 2-2, but that was a week ago.", "I just sit around bullshitting with my friend. ", "Depends on what the last round was like. If they found a hole, we fix it. If we absolutely destroyed the team, I usually hog the bandwidth by watching YouTube.", "Between rounds I clip my fingernails (sometimes toenails too) and put them in my special jar. When I ask for evidence in round I sprinkle them on my opponent's prep and give it back to them. It is a very effective method to assert perpetual dominance and I get compliments all the time about how nice my nails are.  ", "Make fun of the team we just beat, if we won in dominant fashion.", "Bitch if we lost in embarrassing fashion.", "Anywhere in between, talk tactics while watching wrestling or playing computer games to wind down.", "If we won, gush about how dank that win was.", "If we lost, bitch about why the judge sucks.", "If it was tied, be like \"oh man it was so close\" and then play TBOI.", "I pray to Robert Chen in the background, typically.", "If I win: pretend like I'm being professional \nIf I lose: stare down with my partner", "Chill until the next pairing come out then we prep until we have to go to our round", "Y'all are awful.  I absolutely prep for our next debate, or eat as needed.", "I disagree with you completely for two main reasons. First, asserting dominance isn't awful. It is the key way you not only win, but get disciples while doing it. Second, eating before rounds is the best way to put yourself in a content mood which is the last thing you need during a round. What I do is get 2 hours of sleep before a tournament so I'm sleep deprived and then snort some cocaine so I wake up. 10/10 would recommend. ", "Use your cocaine as a prop in-round tbh.", "I walk around the common area looking for card games to join. Forget debate; what better way is there to assert your dominance than to close out another school's game of ERS? ", "My friend and I work on our mixtape. It's lit.", "Even if rounds don't go our way, my team tends to just try and chill between rounds. Freaking out between rounds doesn't tend to help the nerves of some of our teammates. Also, most cases are pretty good even if another team finds a hole to poke. Really, it's just a matter of finding a response to their hole-poking.", "So to answer your question: we just chill", "My local league is not that small (but only because this year we have a billion novices) but some of our senior level events are barren. This year I've done events with 8, 6, and 6 competitors respectively. I'd assume this isn't common in other leagues but, it got me curious, how small is the smallest event you've competed in/seen in your local circuit?", "On our circuit varsity has been averaging between 6 and 10 teams in LD or PF and around half are from my school (the district has 16 highschools).", "Man. Houston locals are insane compares to y'all. 30-75 entries in VPF", "Smallest is 3 including myself. Biggest was 44", "Novice policy with only two entry. I guess everyone is a winner in that instance", "In my local circuits big events like PF, Parli, LD, and Impromptu get close to 50 entries, while most speech events only have about 10-15.  Smallest was Duo with just 2. ", "In Michigan, PF locals typically have between 10 and 20 entries in open (I think there's no reason to have a novice division when the open division is so small, but I don't make the rules). I think the smallest tournament I've ever competed at had eight entries. There are about five to seven active schools.", "Generally 12-14 teams varsity and 10-12 JV at the local tournaments.", "At most two CX because Pennsylvania.", "Typically 45-60 in VPF, 30-40 in JV, and 30+ in novice (this number is upwards of 60 at the beginning of the year). LD is a bit smaller, but VLD is probably around 30, JV LD around 30, and novice and 35. ", "Arizona typically has larger tournaments. In VPF and VLD there are normally around 50+ teams, the only debate event that lacks size is sometimes policy with it breaking to finals after two rounds. Speech events are big, there's at least 30-40 entries in each speech event.", "In Ohio, we get 20-40 entries in PF at basically every small tournament. LD is a little smaller, generally 15-35 entries, and speech events vary by district. ", "I have a congressional debate coming up in around a week and I was wondering if anyone had some tips for me. It would be greatly appreciated. Thank you.", "Be active in the starting procedures!! If the judges see that you are active then they will know that you exist and will remember your name. I typically like to make a motion to establish a 45 minute time limit with an optional 15 minute extension period(we would vote on the extension)", "If your team proposed any legislation put that in the top 5 or get with a group of other debaters and try and get your docket with your legislation in the top 5", "Be active in the starting procedures!! If the judges see that you are active then they will know that you exist and will remember your name. I typically like to make a motion to establish a 45 minute time limit with an optional 15 minute extension period(we would vote on the extension)", "While it's fine to be active, I'll note that one shouldn't make motions just to make motions. Unless your tournament or the parliamentarian doesn't establish time limits on the round, moving to establish time limits is generally unnecessary. Motions should be made with a purpose; unnecessary motions cut into the amount of time for speeches.", "Also, if the agenda isn't set by tournament staff, setting the agenda should be done in a way that every competitor gets a say in its order. Vote on it where each competitor gets a certain number of votes, put the legislation in order from most to least popular, and there's an agenda. If the tournament has you do committees, it's a similar principle where everyone in that committee should get a say in how the legislation within that committee's jurisdiction is ordered. Saying \"put that in the top 5\" and getting with a \"group of debaters\" suggests a method of agenda-setting that might not let everyone have a say, which isn't cool since civics is a huge part of this event; denying some competitors a fair way to set the agenda undermines civics. ", "I say all of this hoping that the way you're discussing gives everyone a proper voice, but I feel the point should be clarified since it's that crucial to the activity.", "I was just trying to give some general advice. I know there are so many variables with how the chamber is run depending on where you are so I didn't want to say anything about how we do it In my state(Texas) because it might not transfer over to how you do things in your state.", "Quick note about limiting time: this depends on the area. In my circuit we tend to limit based off of rounds/speeches, not time. If someone limited by time here, it would be confusing as we don't normally use it. Just pay attention to norms in the circuit so you don't seem like you don't know what you're doing.", "Other tips: speak as early as possible so you are more likely to have recency. Make sure you know parli pro. You don't need to know obscure stuff unless you plan to PO, but know the basics. Also, it's \"I move\" not \"I motion.\"", "Y'all must do it differently because we always do motion, always establish a time limit, and try to save or speech till the end. We usually only get 1 speech per session two if you get lucky with an authorship", "Give as many speeches as you can, ask as many questions as you can, think about the questions people might ask about your speeches and prep responses so cx goes smoothly, make friends with the people in your chamber, and pay attention to all the speeches in the room I know it can get boring but don't be a dick to your competitors they deserve your respect just like you deserve their's.", "This is gonna be a bit long, but I intend to cover motions, role play, legislation, research, speech writing, refutation, speech delivery, and questioning. If any of this is unclear, feel free to ask questions and I'll get back to you as soon as possible.", "That said, don't make motions just to make motions. We want to get through speeches and hear debate, not deal with unnecessary motions just so you can try to stand out. You'll stand out alright, but not in the right way. Basically, make sure your motions have a purpose.", "In Congressional Debate, you take on the role of a United States Representative or Senator. Don't be afraid to role play in your speeches; in fact, I encourage you to do so. Legislation may well have an impact on your constituents, and you can totally use negative impacts on constituents as a mechanism for negating certain legislation, or positive impacts on constituents as reasoning for affirming that legislation.", "Legislation takes the form of bills, resolutions, and Constitutional Amendments. Bills have the force of law, resolutions are statements of position the author feels Congress should take (and therefore do not have the force of law), and Constitutional Amendments are self-explanatory. Assuming people mainly write bills, you could use specifics of the bill as support for either side of a speech (usually the negative; example: the bill needs funding for its execution, but doesn't list a funding mechanism or is flawed in how it allocates funding; this could be used in a negative attack, followed by establishing that affirmative impacts are nonexistent if the bill can't be executed due to lack of funds).", "You can prepare speech outlines (don't write speeches word for word, even if you're new to this; I'll explain that more in a bit), but if you're busy with other stuff as well, you may not have as much time to do all speeches before the tournament. This is where your prep comes in, as you should be taking it to the tournament with you anyway; if you find you need to come up with a speech in the middle of the tournament, you have your research to help out, along with material from the other side of the debate to refute if you're still on that topic.", "When you gather your research and get to writing your speeches, don't do them word for word, even if you're writing an authorship speech. Congress speeches are meant to be extemporaneous; reading a word for word manuscript is completely against the point. Scripts tend to be inflexible, so if you aren't the first affirmative speaker, you may find it harder to include refutation of arguments on the opposing side. Also, if you rely too much on reading the speech, your eye contact in particular will suffer for it. This isn't to say you can't glance at notes (you should totally look at the evidence you're citing, for example), but more often than not, you should have your eyes up.", "A basic speech outline may have some material for an intro, along with taglines for your arguments, evidence to support those arguments written down (always make sure to have the full evidence on hand somewhere in case it becomes an issue), and some material for a conclusion. Things like transitions, analysis of evidence, and impacts should all either be kept off of the pad, or at least not written word for word. If having certain keywords helps for any of those, then feel free to jot them down, but aim to deliver them extemporaneously. When you are transitioning between points, when you are explaining why your arguments matter, when you are explaining why an opponent's argument is insufficient, it helps to make a connection with your peers. Looking at them instead of looking down at your paper strengthens that connection and displays a sharper delivery.", "A final note on arguments: an effective structure I alluded to above is claim, warrant, impact. In this context, your claim is the argument or point you're trying to make, your warrant is whatever evidence or logic supports that argument or point, and your impact explains why what you're saying matters. Without some sort of warrant, claims become unwarranted assertions, which hold little weight, especially against a point that does have a warrant. Without an impact, people don't have a reason to seriously consider your argument as significant. Don't assume that your evidence speaks for itself; take the time to analyze and establish significance in your own words, as this is your speech, not that of the scholar from the source you cited. Keep all this in mind when you're formulating arguments.", "About delivery, I've explained why eye contact is important, but another big thing for me is at least projecting confidence. That doesn't mean \"use a booming voice\" or anything like that. Fluidity of speech is confidence; stumbling, overuse of filler words, or other controllable vocal tics betray nervousness. Consistent eye contact across the room is confidence; relying on the legal pad or staring into space betrays a lack of preparation. Firm positioning, as opposed to pacing around the room aimlessly (you should walk with purpose, like to assist a transition) or swaying from side to side all the time, is confidence. ", "Even if you're not actually confident, doing these things makes you look confident. This isn't to say that a silver tongue or excellent body control are substitutes for content and argumentation; even if you deliver a crisp, confident speech, a lack of substantive content still hurts. Rather, good use of your body and your voice complements good content and forms the whole, which is to say good argumentation/analysis/clash + good delivery = great speech.", "Finally, I'll touch on questioning. If you want to question a speaker, you stand when the Presiding Officer (the student up front with the gavel running the show, to whom I'll refer as the PO) calls for questioners to rise. You do not speak until you are granted permission by the PO; they'll say something like \"Representative Carsontheninja\", you'll ask your question, and the speaker will answer it. Do not ask questions just to ask questions; make sure they have a purpose. To this point, do not ask soft or friendly questions, even if you're on the same side as that speaker. Tough, incisive questions about the content of their speech are what make for good questioning; this advances good debate much more effectively than something like \"Do you agree that blahblahblah?\" ", "Once the question has been answered, you may take your seat unless you have another question you wish to ask. You do not get two-part questions in Congressional Debate (unless a suspension of the rules to allow a two-part question is passed, which will basically never happen, so don't try it). Unless your tournament runs using a Direct Questioning format, you will not have uninterrupted back and forth crossfire with the speaker. Keep that in mind so that you don't make the mistake of speaking out of turn during the questioning period.", "Hopefully all of this helps. Again, be sure to look through the whole guide I linked you near the top; it covers much of what I've talked about here and more. Good luck at your tournament!", "Inevitably, there will be at least one bill that might be pretty one-sided, where most people want to be Pro/Con. Write a draft for the position that you think most students will oppose", "This is useful for two reasons.", "1) Statistically, you get to speak more often, increasing your overall score and likelihood of ranking.", "2) You learn to think about issues through a more critical and unbiased lens, which helps in all debate events.", "With that being said, if you didn't properly prepare, you're going to get grilled in Cross-Examination.", "EDIT: Also make sure you research and have questions for every bill being considered. Some POs will prioritize speakers with more questions.", "Also make sure you research and have questions for every bill being considered. Some POs will prioritize speakers with more questions.", "Any PO who picks speakers based on how many questions someone has is doing it wrong, at least at any event where NSDA protocol is enforced. Speaker selection based on questions (and motions) is explicitly forbidden by NSDA guidelines as it encourages people to ask poor or irrelevant questions for the sake of it, and it doesn't account for possible bias in legislator recognition. To quote the relevant part: ", "Activity - PO selects speakers based [on] whom they have already recognized for questions and motions. The problem with this is that the PO could still be biased in recognizing legislators for questions and motions in the first place, and it encourages impertinent questions, just for the sake of being recognized.", "So while you're correct in encouraging OP to be prepared, if your tournaments' PO's choose speakers based on activity, I would encourage them to stop since it's an unfair mechanism that isn't necessarily conducive to quality participation.", "Yeah, that's the thing, though. I haven't really prepared but the tournament did not require me to submit a bill to participate, it is my first ever debate so I'm testing the waters a little bit.  Thank you, everybody, for the help, it is greatly appreciated. ", "When you're debating the IoT topic and get lucky coin flips", "Or the super secret con arg", "Screen wasn't even colleyville xD", "Are you guys Oakton YZ, by any chance?", "I'm sorry. I had to hide our \"super secret\" pro argument (turns out it's not so great) so that people wouldn't just win the flip and choose Pro. We've actually did every single debate as Pro. It worked fine until the end. Yeah we're oakton yz", "Why... are you going to steal the super secret argument? (it's really not great you can probably find it out from our opponents)", "No, I just finished finals.", "By the way someone on our team is unhappy from losing to you, and they say you had a card claiming that Plan Colombia resulted in speeding up the court system by 71%. They think you made it up, but I'd prefer to give you the benefit of the doubt; did you really make it up?", "We didn't. I'll send you the link if you like.", "Before I do, is your school going to the WACFL tournament next week?", "Yep, so just send it to me after the tournament ends.", "But did you win those though", "We picked pro first round, then the opponent picked con rounds 2-3. Then we discovered the argument halfway through the tournament, then stayed up to rework our case and won the next 3. We went 4-2, then lost the elimination round. Went better than expected considering this was our second tournament, and it was collapsed.", "Ha, I'm wondering if its a similar/the same weird pro argument our kids are trying out at Princeton this weekend. ", "Is it the \"We've done all we can there, Colombia is successful, so we should leave\" arg? Hit that a few times at JMU.", "We considered running it, but then we realized that it hurt our hr abuses point, as they can just say \"but you said there are hr abuses so we need pc to stay.\" I was going to say that we never faced it but that was because we did only pro...", "That contradiction was there with the team we faced in semis (the better Woodberry Forest team). It can get you far. Good call, though, it might have cost them the round (it was a split decision).", "that was me and my partner today lol", "For me, the judge literally said that we had better arguments and they failed to refute our contentions. However, the judge decided that because our opponents \"presented better\" (i.e. didn't read off of paper, made better eye contact, probably practiced, and \"looked professional\"), they gave them the win. Seriously, they won despite them literally ignoring two of our contentions and us refuting all of theirs. I'm still pretty unhappy about that. What about you?", "'Team A was dressed better. Step it up next time team B; I know your school can afford it.'", "I've had rounds that I lost because the Judge knew the other team on a personal level. As in they went to the same school, were in the same groups of friends, etc. I find it pretty frustrating when that happens.", "Two words: Georgia circuit", "The judge wrote \"aff didnt flow\" for his rfd", "I lost a ballot once because my partner and I used our laptops and notes more than the other team. ", "Well, just yesterday. So our opponents mentioned that rape happened because of Plan Colombia, but they had no recent stats, admitted that the stat they had was extrapolated, and we refuted the point anyway. After what we thought was a solid win, the only RFD our judge even gave was that the rape point \"really hit home\", so she voted us down. Ended up OK, but that was still pretty annoying.", "I lost once as pro for \"not showing the burden of proof\" and \"running a counterplan\". I was PRO", "For saying the word \"abusive.\" The judge thought it was a strong word and shouldn't be said in a debate round.", "One judge I had really liked our opponents point on showing \"benefits outweigh the costs.\"  Not the actual points, but like the idea of how they needed to show the benefits outweigh the costs to win.  ", "Always the double standard: we're a two girl team, and get called \"catty\" and/or \"bitchy\" for matching the aggression level of a two boy team.", "Yea, that judge has his/her priorities and thought process fucked up. The person who won the debate, wins the debate. They can't win, if they lose.", "Fill in the blanks: ___ _____", "\"I bought the perm, and she kicked out of the DA, but I vote neg, mostly because her argumentation was better presented.\"", "All the other debater read was a CP (not competitive AT ALL) and a DA she kicks in the 2NR.", "Judge voted for person who shook hands with the judge first......and it was the other team.....", "My friend lost a round bc he said all men when quoting John Locke ", "Actually the worst thing would be getting your ass flamed by the man, the myth, the legend Conrad Donald Palor in finals, and dropping 0-3. Forfeiting saved you from next level embarassment, when a small school team beats your ass, with no coaches. ", "Ya it is lol. It was my grandpas name", "We were roommates @ BFI 2 years ago! Small world.", "Why does everyone consider GV to be a small school?", "Yo, actually the worst thing would be getting your ass flamed by conrad palor in finals and dropping 0-3. Forfeiting saved you from the embarrassment. ", "Hey all, i'm a novice and I've been stressed out recently. I don't know if I'm aloud relax during prep as round can get pretty stressing. Thanks!", "Definitly don't relax. You can take a deep breath and gather your thoughts but it's a 45 minute round, shouldn't require too much of a break", "As far as I'm concerned, your prep time is yours. I don't care if you strategize with your partner, write a draft of your speech, down a whole bottle of water, nap, or do yoga. Basically, you're free to do anything you want with that time other than disrupt your opponents (or other rounds in progress), use it as extra speech time (you can practice, I guess, but I won't be listening), or otherwise violate tournament rules. I like when debaters make full use of their prep time because that gives me valuable ballot-writing time too.", "That said, I am an experienced judge and former competitor. Less-seasoned judges may look less kindly if it appears that you are \"wasting\" prep time, because you are also then \"wasting\" their time. So if you're unsure how the judge will react, then you may want to spend a little more effort ensuring that your relaxation looks like something debate-related (e.g. if you need to stand and stretch, do so while talking to your partner or reviewing evidence, or if you need to close your eyes for a bit, maybe silently practice part of your next speech).", "Can I walk around practicing my speech really loud in the room during prep like they do in extemp?", "As long as the volume doesn't disrupt anyone else and you don't expect me to pay attention, then that's fine with me. But also consider that if your opponents can hear you, you're giving them a free preview and more time to prep their responses.", "to add on I would ask the judge first. they will almost definitely say yes but they might be surprised or think your starting your speech without/forgot prep if they don't know what's going on", "Good god no. Thats actually terrible. I would give you like a 23 if you did that", "Wait, you can use your prep time as extra speech time? ", "No, he means you can practice your speech.", "During the round, prep is best used sparingly, similar to NPC. For example, one should not dry the well too much, thus I would say it is best to use 20 seconds of prep (at best) per round (as there is only 2 minutes of prep for the entirety of prelim rounds). When using prep time, I would try to form a strong bond with your opponents, getting to know them can appeal to the lay group. Although, if you have a tech panel, feel free to use prep as you seek (yell at your partner, cook food, watch videos of Chef Nikhil). Ultimately, prep, when used, is best utilized before case readings (or if possible before the coin flip).", "For PF, you get 2 minutes for the entire round - not for all your rounds during the tournament combined", "Technically, relaxing during prep time isn't violating any rules or guidelines. However, seeing that your prep time is very limited--especially in PF--it would definitely be a good idea to use it wisely.", "Somewhat relevant story time:", "Once in PF, we went up against a team we hadn't hit before. They were newer, but it was mid-season and they were experienced enough to think they knew the rules. They called for prep time before one of their speeches, so my partner and I turned to each other and began discussing our strategy and pulling cards.", "Since the January topic asks PF debaters to consider the response to international conflicts and question if increased military spending would result in a better response to said conflicts, where do we stand in choosing what conflicts to look at? Would it be too plan like to say we want to look a Nigeria and the impact an increased military spending would have on the U.S. policy towards Boko Haram? Does Con need to prepare for all international conflicts then? Could Con just say - \"Pro is proposing that we use military spending in this way and this is a plan which is not allowed\"? If Con does this how does Pro even begin to show that we could respond better to conflicts then? ", "Very clever, I don't know how you do it ", "Resolved: In order to better respond to international conflicts, the United States should significantly increase its military spending.", "What if pro says \"we need to increase military spending because we don't have enough to respond to Conflict X, with all the other stuff we're already doing.\"", "Or \"we need to increase military spending because we don't have enough to respond to all conflicts. For example, look at Conflict X.\"", "but then conflict x just becomes a warrant doesnt it? either u prep out that specific warrant and link and go off a link turn or just attack the idea in general like if the contnention talks about all conflicts show how its not true and then link turn conflict x. at least thats how it think it should be done", "I think the latter is fair game.  The former becomes a question of whether we should spend enough to respond to all potential conflicts, or whether the reason we don't have enough to spend on X is because we're overspending on Y.", "It's not really a question of that because spending less on Y would be a counterplan. The fact that we are overspending on Y is therefore not really a reason why we shouldn't increase spending, because the Con can't do anything to solve overspending on Y. However, the Pro can show the benefits to increased spending overall specifically coming off of X, with overspending on Y being the warrant for uniqueness.", "The resolution is in itself a plan.  All you have to do to make your advocacy \"not a plan\" is focus on the ways that said scenario would occur naturally because of an increased budget.", "Say preventing terrorism is the justification. Give Boko Haram example. Say why more military spending would help solve this issue. Don't say only that we should focus on Nigeria, rather the issue of terrorism as a whole and give examples as a justification.", "This still doesn't show that military spending will be used int he way you say it will.", "Right, and there's no definitive way to show that it ABSOLUTELY will be used for that, however saying that we SHOULD, as a concept, agree to increase military spending in order to be able to better combat terrorist groups, like BH, would absolutely be fair PRO ground.", "So you think just saying military spending should be increased to combat terrorism - look to Boko Haram as an example where increased spending would result in a better response and money should be used in this way ", "But then you can't respond to authors that say that increased military spending would probably be used for x, even if it should be used to fight Boko Haram/terrorist groups, because the resolution only fiats increased spending, not how the money is used. So then I can concede that money should as a concept be used to fight terrorism if I can just show that the money is used in some other way.", "Right - it's not a flawless strategy, and that would be a pretty common probability response. There's two issues: a.) the resolution says should, so if you make a legitimate case as to why we should spend it on a specific program than I don't see an issue with that, and b.) if you're appropriating funds, the likelihood that it all goes to one area or another is incredibly slim, but it would rather be split multiple ways, and given different levels based on need. ", "It's more likely that Con teams will try to force Pro teams to debate what is \"likely\" to happen. In which case, Pro teams either get tangled in the link debate of what is \"likely\" to happen, or have to defend that they just get to defend what \"should\" happen. This is a far better Con strategy than just calling whatever the Pro does a plan, but Pro can still look to should in the resolution as a means of accessing hypothetical scenarios. Basically, the Con wants to focus on increasing military spending and what actually happens, while Pro wants to focus on what needs to happen and why increasing military spending would help. Therefore I think that general preparedness for responding to conflicts is absolutely a good Pro argument.", "The Pro probably wants to talk in general terms about increased funding so that they a) don't have to prove that funding goes where they say it will and b) don't have to prove that funding is the unique problem in whatever specific conflict they talk about. As a bonus, the Con can't say this is a plan.", "How will we know which briefs have already been added if we don't have access to the drive?", "For entry to the drive, briefs will not be accepted because I want to allow best/most promising people into the drive and I can't really discover anything from a brief.", "I think that these changes address some of the issues of quality of prep, etc, but my concern lies with people with less debate experience. I feel that they could be pushed away from joining the drive and getting better with this prep access. My suggestion here would be to create a specific folder in the drive that can be accessed by drive people and people who need prep but can't contribute, maybe like a \"Starter pack\" of sorts, with a brief or two and help with cutting cards. ", "Also, on the 1400 word count, will people with cases that have  long cards, but with large portions condensed be OKed into staying on the drive?", "And finally, great job, these reforms are well needed in the drive", "Ok, so I have some of the same worries you do. Novices will be let in, but only the most promising ones will get in. Google is capping us at about 400-500 people and I will keep it at most 425, so the drive will be competitive. Yes, people with long cards are OKed. The only reason this is being implemented is because I got tired of 200 word cases.", "I think this will greatly increase the quality of prep in the RPFC. Good job!", "So the RPFC ( that was used for September/ October 2016) is outdated and no longer used? I'm just a little confused, is this a new drive folder or is it the same folder but with changes to what was mentioned?", "Yep, you are right. There is a new folder and the \"old\" drive will not be used. I will transfer all the documents to the new one and then kick everyone.", "If you are contributing cases, then both cases combined should have a word total of at least 1400 right? Meaning around 700 words per case?", "One case could be 800 words and the other could be 600 and you would be fine.", "I personally think you are shutting out 90% of new debate teams and novices. This resource was supposed to be ablut helping grow the scene and providing materials to debaters without the means to get them.", "You have effectively closed those doors and created a situation where only top quality can get in. While I understand the want and need for quality content, disallowing access just holds those who have less from (a) seeing what is and isn't quality content and (b) having the access to materials to create quality content.", "We effectively have a private club", "If someone PMs me and includes that they are either a team captain or novice, that will influence strongly whether they get in. I noticed from my months of running the drive, that maybe 1 of 10 novices would actually submit prep. For right now, as long as you send prep that is not terrible, you will get in. There are only so many spots in the drive, so some people will wind up not getting in though.", "Alright that's good, I'm a coach of mostly novices and we worked to constantly submit materials. However we rely heavily on those materials to further our own work (low budget :/)", "...vote for the increased military spending topic.", "It sounds like a more straightforward topic, but after even a little research, it becomes clear that Pro has only one way to win, many, many ways to lose, and much less evidence to draw on.  Recruitment standards at least is an actual, evidence-based debate that the military is having, puts relatively even burdens on each side, and allows debate about age, education, criminal records, physical fitness, etc. without venturing into plan territory.", "Wait, there's a lot of literature that goes both ways for the spending topic...and Pro probably has tons of ways to win if they can find probability cards for all the potential advocacies on this topic. I'd much rather have round with real world impacts instead of \"unit cohesion\" or something equally irrelevant.", "What lit are you finding that says [a] the US military needs to intervene more [b] what's stopping us is that we don't spend enough on our military [c] we can actually afford to spend enough to make a difference since spending more than the next dozen countries combined isn't enough [d] this money should come from elsewhere in the budget instead from any wasteful military program?", "[a] There's tons of literature about this, offensive realism and generic Heg/Engagement good [b] You don't necessarily need to defend  increasing spending across the board, just for responding to conflicts/stopping current cuts [c] There isn't much reason to believe the US wouldn't just borrow more instead of cutting other programs [d] That sounds like a Neg CP", "It's actually very easy to find intellectuals arguing for more intervention. Here are some specific articles:", "It is, yes.  The trouble is that none of those require a significant increase in overall military budget and some justify themselves by saving on overall military spending.", "If it's a Neg CP, it's one that wins most rounds.  The resolution doesn't demand that Pro increase just the amount of spending that's allocated to preventing foreign conflicts, it demands that Pro increase total military spending, but just for the purpose of preventing foreign conflicts.", "There seems to be an impression among PFers that because Heg good was a stock policy argument and because policy arguments are naturally good, that Heg good must be a good argument.  Even the policy teams that run it successfully are more likely to do so by saving military costs or avoiding overstretch than by increasing spending.", "I don't think you should interpret the first half of the resolution to mean that you should derive your advantages from the response to international conflicts.  I think you should treat that clause as meaning that the increase in spending has some use in international conflict - but that doesn't mean you can't garner advantages external to that.", "As to the question of the counterplan this just implies that your aff needs to be able to generate a net benefit to the plan over the funding shift CP.", "\"In order to better do X, the US should spend more on Y\" seems pretty straightforward to me.  I like the topic you're describing better than the actual one and I might vote for it if it were an option.", "Right, so pretend the topic is \"in order to sate his hunger bcg should eat some food\".  Me going and buying a burger obviously does that - but it does other things too.  I get exercise going to the burger joint, I spend money etc - all of which could and should be made into advantages.  Similarly you can absolutely garner advantages off of non international conflict links.", "(don't get me wrong I think the better version of this res decreases spending - which makes it waaay easier to be bidirectional)", "You don't need to say more intervention - just sustain current interventions.  There's a bunch of lit that says that we're running out of bombs to use on isis - saying bombing the shit out of isis good is pretty easy strats.  We probably also need money to ensure that the futenma replacement facility gets built, which way or may not be key to US power projection in the South and/or East China Seas.", "this money should come from elsewhere in the budget instead from any wasteful military program?", "Deficit spending is your best friend.", "All of those are maintaining current levels of spending and business as usual.  I'm not sure how any of that qualifies as a significant increase.", "Here's a card from a week ago that says there must be in increase in spending for bombs:  (it's honestly not the best but I mean I've spent 30 seconds cutting cards so far)", "“We’re expending munitions faster than we can replenish them. B-1s have dropped bombs in record numbers. F-15Es are in the fight because they are able to employ a wide range of weapons and do so with great flexibility,” said Air Force Chief of Staff Gen. Mark Welsh in a statement. “We need the funding in place to ensure we’re prepared for the long fight. This is a critical need,” USA reported Gen Welsh concerns.\"", "https://www.sofmag.com/us-though-is-short-of-precision-weapons-and-can-no-longer-be-the-armory/", "I haven't done any research recently but hypersonic glide style PGS is also something that was in slow development.  I'm also pretty sure China is attempting to develop this tech.  An increase in funding to this program also probably has some pretty substantial advantage areas.", "yeah OK that card might be a bit PMC-y. That doesn't make them wrong - It's pretty hard to fake looking at the US munitions stockpile and check whether its getting bigger or smaller.  I'd be interested in seeing what other sources say for sure - and I'd hazard a guess that other sources agree.  ", "I'm not really sure what the distinction between a solvency advocate and a wishlist is, but I don't think you need a price.  I'd just be like \"I won't contest the link\" in CX. I'll also hazard a guess that it doesn't matter because the \"should spend money on bombs\" lit base is probably better than the \"should not spend money on bombing isis\"", "That card, and the warrants in it, are indicative of something a lot bigger.  I'll revisit this after work when I have more time, but the problem has never been \"we don't have enough bombs to eradicate every single town that's known to have ISIS presence in it\", let alone enough to level every city in Syria.  And that's without WMD.", "debates about \"age and physical fitness\" sound like shit", "They're actually debates about whether we need drone operators and hackers more than we need infantry and what 21st-century warfare will look like, but if you don't like those, you can debate about how OCS creates officers with no experience or about how gang members are trying to infiltrate the military or about how disproportionate punishments for nonviolent drug crimes are hurting our military readiness.", "I think the largest problem with the topic is the limitation of Pro impacts; there are plenty of benefits of military spending outside international conflict that would even the playing field. ", "Yeah, either half of the resolution would be more balanced.", "This is a genuine problem with the topic and it's not perfect. However, the recruitment topic isn't designed to be debated in PF, certianty not in a huge month like January. While responding to conflict limits pro impacts, the spending topic has much better impacts than recruitment standards. And even more than being good, debate topics need to matter; spending is a more important topic than recruitment.", "This is probably one of the more substantive posts this subreddit has gotten in a while, and it has a 50/50 upvote rating.  A reminder for everyone that upvoting and downvoting is to rate content based on the quality of the content, not whether or not you agree with the content.", "Nazi mod, trying to control our actions, once again.", "i like the shitposts better", "when al is butt hurt because southlake sm isnt \"substantive\" enough for him", "this man speaks the truth WAKE UP SHEEPLE ", "Too late, most people already voted. NSDA needs to make an option to change your vote", "NSDA needs to make a checkbox next to your vote for \"I have read the first Wikipedia page that pops up when I search this topic before voting.\"", "Anybody running or anticipating any teams saying that cocaine is actually good?", "Card \"methamphetamine is an economic substitute for cocaine when the price of cocaine goes up\" and then card \"methamphetamine worse than cocaine.\" Boom, a cocaine good turn.  ", "I'm not familiar with debate meta. Is this actually a viable option?", "You really have to explore the effects of substitute goods of coke on marginal societal benefit. IMO it's weak. Your main argument is basically this:", "\"Meth is worse than cocaine. Meth is a substitute for cocaine. If we legalize cocaine, people will stop using meth.\" ", "This gives rise to several issues. First, you're assuming that meth and coke are substitutes (card needed). Next, you'd need to prove that people on coke have greater societal benefit to those on meth (good luck finding a credible card here). Lastly, you'd have to prove that allowing cocaine bc it's minimally worse than meth makes it \"good\"/morally permissible. ", "If you took this approach, you could just jargon the judge with Econ stuff on market failure. Good luck!", "Cocaine helps people think faster, means work is done fast", "gonna definitely be running it now", "Turn: Cocaine is good, Freud used it to cure depression.  It's a medication.  Run it.", "Depends on the cocaine, man. In terms of the resolution... I don't really recommend the Colombian stuff 'cause it doesn't grind well. Hope this helps; feel free to cite me in round ;)", "personal experience, cocaine is great", "If this is run it wont say cocaine is good but that cocaine is the lesser of two evils", "Libertarians would agree that coke is bad. The argument, however, is that the government should not regulate people's decisions. So, no, Libertarianism is not a good example.", "Colombia still has institutional problems and new drug gangs are starting to pop up (BACRIM) so Plan Colombia is still needed to maintain stability after the peace deal.", "Thank you!\nIf one of my contentions is focusing on the necessity of Plan Colombia to assure Civic Civilization of Colombia, do you recommend changing it?", "If you run it well I think that's kick ass. I'm running a contention about rebuilding Colombia and improving quality of life etc... ", "Honestly, this makes pro's position more difficult IMO", "yeah, what does pro say against the deal?\nThis deal could be finalized, and ratified by the Colombian Congress, by next week. ", "one of plan colombias biggest goals was  to deal with drug traffickers, peace with farc does not stop drug trafficking so there is still a need", "Actually, Peace Colombia is a good thing for CON. Con can argue that Plan Colombia should focus more on improving humanitarian aid and infrastructure instead of military force. ", "So you would argue Plan and Peace colombia are two different things then?", "They talking about the peace deal between Columbia and farc not peace Columbia. Two totally separate things", "Well I mean Peace Colombia wouldn't really work without peace between Colombia and FARC mainly because the goal of Peace Colombia is revitalizing the country and rebuilding the infrastructure lost from the war.", "arent they both connected? the white house fact sheet says \"The President announced a new framework for bilateral cooperation in the event of a peace accord with the FARC: Peace Colombia.\" so doesn't that basically mean peace colombia would only been implemented if the peace deal had gone through?", "Not necessarily.  I read through the text of the proposal and basically every section had 2 senerios of implementation, one with the FARC-GOC deal and one without the deal.", "Can you DM me the link to the proposal. I wish to read it.", "Bro, if you look into the new deal, it makes it so con will win every time.", "not the case. Peace Colombia builds on plan colombia to focus more on peace and prosperity in the wake of the peace deal.", "About two weeks ago I my partner and I(PF) went to a CFL and got the same judge twice, she utterly hated us and voted for us once due to the fact that they where one of those \"doing this for credit\" teams and we turned all three of their contentions against them. The second time she dropped us to a crappy novice team whose only impact was IOT causes teen suicide, because she thought i was \"too aggressive\" to a girl on the con. So I ask you what is the worst way you have been judge screwed.", "Judge at Ridge last year dropped me b/c my opponent's policies were more aligned with Donald Trump's. No, I am not kidding.", "To be fair, it's the arguments that win the round, not necessarily the topicality if said arguments. ", "The most frustrating judge screws for me is when there are no RFDs, no comments, undisclosed and I get something like 25 speaker points or under. \nI don't even know why I lost, but I consider this a judge screw because my opponent admitted I won. Had this happen last tournament.", "I've had a lot of judge screws but I hate these the most because the very least you can do is type one sentence of feedback for debaters that worked really hard to get to where they are so they can improve.", "Every judge that ever dropped me amiright", "Dropped because we beat the other team too badly and the judge felt bad. I don't miss high school debate ", "Dropped because my opponents case was \"organized\" better.", "I can see that being frustrating, but at the same time if I have a hard time following your case, and the other side has presented their argument in a more logical, clear way, I'm more likely to vote for them, even if I think you might have made good points. If you don't make the points clearly, then it's hard to vote for you... ", "yeah i see your point, but i think anyone would be frustrated if that was the rfd on the ballot lol, at least at first.", "Wasn't debate for my worst judge screw, it was a prose interpretation for regionals through my state speech league (VHSL AAAAAA school). ", "One of the two judges in the room gave me a literally perfect score. The other one? Rated me last out of the 5 speakers in the room. Why? Because I chose to wear a Peacoat while my suit jacket was being mended. That was it. No remarks about the speech, just being anal about a poorly worded dress code that didn't stop any other judge from scoring me well.", "Missed out on going to states because of her.", "Also got screwed in a debate tournament because a lay judge decided our immigration case was \"too partisan.\" (This was back in 2014).", "Tl;Dr: Judges can suck sometimes", "Went all in for T in the 2NR. Even though my opponents dropped violation, standards, and voters in the round my judge voted for them because \"She didn't like the standard of brightline\"", "Dropped because I beat the judge's son", "At first I was thinking about you actually physically beating the judge's son, but then I realized it was beating in a round ", "I shoulda whooped him and his dad's ass after that bullshit", "Got dropped at Glenbrooks after turning their entire case in the rebuttal. In the final focus, I did impact calc, and they conceded two of their points in their FF. The judge said we beat them the entire debate, but voted us down because he wanted \"a story\" in he ff. worst part: he turns to the other team and says he has no idea why he voted for them", "I dropped my bubble at Yale because my judge voted off constructives alone, and that my opponents had a \"better structured case\". Oh and yes, she didn't flow a single thing afterwards.", "Last year at Stanford in Varsity Pufo, the judged ended the round after summary because he wanted to go eat lunch...", "I don't know what everyone means by \"dropped\" probably not a word I use on my circuit, but I got judge screwed by someone who was on their phone as I was making my summary speech (I watched her) and afterwards voted against us, but gave us our contention that IoT is not hack-able, yet weighed the round on personal privacy. That doesn't work, as you might think, because personal privacy is dependent on successful hacking, which she agreed was impossible.", "\"Dropped\" means you lost a round, likewise \"picked up\" means you won a round", "So I've been getting pretty much straight 1st or 2nd place in Prose for every tournament I go to, and last weekend in semis, the judge (who was a guy right out of high school and had competed against me) he wrote \"I didn't like your piece ;)\" ", "one of my teammates in LD won a round only because he spoke last because he was aff in the round", "Me and my partner were arguing against our opponents contention saying that there was economic benefits to the IoT, and our opponents said we could only debate the detriments to privacy. The judge bought it and gave our opponents the round because of it.", "That isn't a judge screw...", "i think he's saying he responded their contention and the judge didn't buy it because it wasn't privacy, which i would say is a screw. ", "It isn't a screw then. He should have explained it better in terms of framework and how privacy works. Being a good debater is adapting to judges who don't know how debate works. Would you agree? ", "Probable Cause at Beehive, we were Neg. Our opponents were awful, they had basic arguments and no links, they couldn't speak, for their rebuttal they simply reread their case, tried to make it a definitional debate but didn't bring any definitions of their own, Etc. We lost and the judge proceeded to lecture us that \"Topicality isn't a thing in PF\" and that we have a fundamental misunderstanding of PF, since the Aff doesn't have a responsibility to attack the Neg, and only what the Aff says stands. And since we spoke faster than 250 WPM he considered that spreading and dropped us. ", "250 is pretty fast for PF... ", "seriously? the best debaters in my local circuit write 1k-1.2k word cases.", "I suppose I'm just on a really lay circuit, bc the fastest around here are only about 750.", "Dang man me and my partner wrote 800-900 words in freshman year.", "I wish I could pull shit like that... ", "It's weird as I'm in a relatively lay area (Greenville South Carolina) but people can keep up a little better with my faster talking ", "Judge at Princeton in OH a couple weeks ago have us the loss because we had better impacts and all, he simply didn't like us. ", "Lost on IOT on Con cuz shot down a noob teams arguments with definitions. The other team even conceded the definition and none of their examples of IOT were actually IOT. They said Databases were IOT!! Also, judge basically slept thru rebuttal", "Lost once on a lay when my opponent basically dropped all of my T (didn't address my interp, violation, or standards specifically) and only called my DAs red herrings without even addressing the links at all. Lay judge voted me down because my opponent \"did the better debating\"", "Yeah your first mistake was prob running full T in front of a lay judge", "Yesterday at Libertyville in our final round, our opponents brought up a \"iot will give 11.x trillion dollars of economic GAIN\" card.\nThe card specifically says \"economic impact,\" my opponent repeatedly claimed it said 'gain' but refused to acknowledge it saying 'impact' when asked if it could be a negative impact. Cross then ended.", "I received a copy of the full card (I had scanned it in cross but not fully read it, only focusing on the \"impact\" part.  )\nThe issues were as follows. \nThe card was based off of a study of 150 instances of devices used. The Iot is much broader than 150 instances of devices, and we cannot weigh this in today's debate due to such a miniscule sample space. I brought this up in summary.\nThe card had a span of \"3.x trillion to 11.x trillion dollars\", this is a huge span, of over 8 trillion dollars, I brought up the fact that it's hard to weigh this card with such a huge variance. This was also in summary", "Now here's where it gets shady. The card specifically says \"potentially 3.x to 11.x of economic impact\". I bring this up in summary alongside the \"negative economic impact\" point I was pushing before.  ", "(My partner didn't mention it in his rebuttal, focusing on the whole contention and subpoints itself.)", "My opponents didn't argue against what I said in summary, or GC, so I assumed we had dropped it. My opponents were speaking second, and in final focus, claimed \"while the Con may be saying that our card is meaningless because it says 'economic impact,' it specifically says 'economic gain', no where does it say impact.\"  ", "I didn't want to bring it up to the judge as the round was over, but it irked me enough to want to bring this up in what to do in the future.  ", "Do I tell the judge to read the card? Do I just drop it and not care? Etc.", "We won the round anyways, but it was still annoying to think we could've lost from that.", "All of those Econ impact cards are talking about adding 3 ish trill to 15ish trillion (i.e. Econ gain) though...", "And even if there's more than 150 instances, it's easy to assume that the more IoT instances the more economic gain so", "Exactly. Those projections are only going to get higher because of the nature of tech development (exponential growth and compounding growth or something)", "Ran aff in a final round this weekend and had neg try to do what OP did. The attacked w/ wide rang (2.7 - 14.4 trill) and time frame (10 years) saying the card shouldn't be weighed at all. Eventually got them to just allot us worst case scenario and concede aff access to 2.7 trillion and nothing more.", "It was really just a waste of time when we could have been talking about the value clash that's at the core of this res. IMO there's VERY little room for evidence questioning in PF because there just isn't enough time. Sometimes, yes, a card is just shit. But 99% of the time, you have a better chance of winning by actually debating instead of worrying about the exact accuracy of a card.", "No, specifically the card claimed economic impact. Its not easy to assume the more iot the more economic gain because of the following reasons which include, but are not limited to, the tech bubble (which was in our old neg case actually), large manufacturing costs with little buyers, some iot devices being sold at a LOSS with govt subsidies, the cost of R&D which may never be made back with the \"very slim profit margins\" of many IOT chips, which quickly grow obsolete in the rapid market, and the severe monetary LOSSES of cyberattacks.  ", "In any case that wasnt the point, the point was the card specifically talked about the 'economic impact' of IOT and didnt specify gains. ", "To quote the card. (Found it)\n\"Our bottom up analysis for the applications we size estimated that the IOT has a total potential economic impact of 3.9 trillion to 11.1 trillion a year by 2025.\"  ", "Doesn't specify gain, and 'economic impact' is defined by investor words as \"the effect that an event, policy change, or market trend will have on economic factord such as interest rates, consumer confidence, stock market activity, or unemployment.\"   ", "So we can fairly conclude that 'economic impact' =/= 'economic gain'.  ", "But the original question was basically that my opponent purposefully misread the card, and what to do in that situation. In this case it didnt really matter, but if we had lost due to that that I would've been infinitely salty.  ", "but if you read the rest of the study it obviously gives a positive view of the IoT. so we can assume the gain is positive", "I was only reading the card given to me, we cant weigh the entire study if i wasnt given the entire study.", "ok, but i am telling u its positive.", "Yeah, I read through the card right now, it's definitely implied to be positive.  ", "The bigger issue with the card that could be attacked as it says for this to happen, numerous regulatory, technical, and organizational changes.  ", "It also says people have to start using IOT data differently for this to happen.  ", "We can conclude this is an entirely best case scenario, that is improbable due to the neccessary changes in how IOT is used, who manufactures it, our technical incapability, and the fact that it requires all iot systems to be able to communicate and operate with eachother, (\"interoperability between iot systems is critical\") and within an emerging market with many competitors, they will never join one unified language under the status quo, and we dont know if they will in the future, similar as to how linux, windows, and apple cannot use eachothers software.  ", "That is what I would say in the round, now. ^", "In this instance, I would say to just drop it. You don't want to be known as the team that always calls an evidence violation even when it may just be an interpretation issue. The only time I would call an evidence violation would be if a) you know they are misrepresenting the evidence and b) they are misstating it in a way that completely changes the meaning of the evidence. ", "I have debated a bunch of teams that misrepresented evidence, but after bringing it up once, I just let it go because it takes time away from debating the substance of the topic. ", "With that being said, I did ask the judge to read a team's evidence once because I knew for a fact that they changed the meaning of it by 180 degrees and it was the only piece of evidence supporting their case. It was on the Russian sanctions topic and they were saying that Russia had just taken away x number of fighter jets from Syria when the actual source said that sent x number of fighter jets for Syria. ", "Wew. Thanks. That's just what I wanted to know initially, not really argue about the card itself haha.", "there were three different teams running leaked nudes on con for the iot topic at a tournament i went to", "wow wtf how does that even work", "Security if the IoT is notoriously bad. So the webcam you have can easily be hacked and boom leaked nudes. ", "IoT bees. It wasn't even a good argument, just weird. ", "Bees were a great argument. Have you even seen the bee movie?", "\"According to all known laws of aviation...\"", "There is no way a bee should be able to fly. Its wings are too small to get its fat body off the ground.", "The bee, of course, flies anyway.", "In the world of the pro judge, this is no longer possible. Bee genocide is the largest impact in this round judge, Barry deserves better than this.", "Then I guess the problem isn't so much that Bees is a bad argument than that I don't know any good debaters, since at every IoT tourney I've been to every kid to run Bees (including myself) had a losing record at the end. ", "lol tfw u break using bees at a tourney but then immediately drop after.", "why isn't it a good argument? ", "bee populations are at a 20 year high so the problem is already being solved for in the status quo, pesticides kill more bees than mites so they aren't even solving the real problem, there is no need for a heater to be connected to the internet for it to heat up at certain times so it's nonunique, impact is mitigated with synthetic pollination", "As someone who did very well with the bees argument, I can easily frontline all of those responses.", "That happened in a troll round at camp. ", "CP on new ice age instead of our plantext of climate coop, except there was no actual CP plantext or any CP foundations beyond two cards from questionable sources.", "...by far the weirdest neg case I've ever seen run.", "Nuclear war solves all issues because it eliminates humans who cause all problems.", "actually wouldn't it be that quantum mechanics (discovered by humans) states that nothing is real until observed (by a human). therefore all problems are due to people having senses. kill all humans and nobody knows that there is anything wrong.", "on the ipf topic \"Countries of the world should accept substantially more refugees from the Middle East.\"\nmiddle eastern countries accepting refugees would lead to democracy in the middle east which pretty much solves everything", "Global Warming for Standardized Testing", "Cap and trade counterplan on carbon tax topic", "This wasn't a weird argument by any means. It wasn't particularly unique as countless teams ran it. And it's not an unorthodox or bizarre idea as quite a few countries across the world actually have cap and trade systems in place", "Explanation? Sounds interesting...", "It was a neg argument saying instead of doing a carbon tax, the USFG should do a cap and trade, where instead of taxing for emissions, it sold emissions to companies who polluted the air and allowed them to sell their \"pollution licenses\" to other companies who polluted more than they did. ", "In a strange way that actually sorta makes sense...", "It's basically how Europe does it.", "https://ec.europa.eu/clima/policies/ets/index_en.htm", "The primary issue was that the 2008 crisis, leading to their suddenly being way more excess licenses than planned.", "Everyone who ran it qualified to nats", "I have been in a couple rounds in which the opponent said in their CON framework that due to the fact that the resolution says that the benefits OUTWEIGH(without an s) the privacy harms that it should be in the present and past tense and cannot be extended to possibilities in the future. ", "None/few of the Con harms have happened in the status quo, pro almost instantly wins with this framework.", "Even so how could I combat it if I just wanted to get rid of the framework?", "The one counter I've seen in round was pretty messy. It basically said that the Framers most have meant for future impacts to be topical because otherwise IoT isn't an issue of any magnitude. It's only worth the time of debaters and judges if we can discuss where the industry ought to go, not just where it's been.", "Basically, this debate isn't relevant or educational if Con's interp is correct. Education is the purpose of debate. Therefore I (judge) should reject the interp. (That's a lot more clear than what was actually argued in round, and this whole thread was dropped by both teams before GCF, so it didn't impact my decision anyway, but there you go.)", "Make sure in your case you include at least a sub point of benefits that are happening in the status quo. (Agricultures a good one) Then even if they win they're framework you still have impacts. Also challenge their framework in the ways mentioned previously in this thread ", "You can use consequentialism if you want to get philosophical but I'm pretty sure this is a post about PF so that might not go over well. But basically consequentialism talks about how we have to look to the consequences of our actions and future outcomes before making decisions. ", "Reciprocity is key. If the framework applies to your side, it applies to theirs as well. Like others have said, show how the pro world has much more benefits than the present harms to decreased privacy. ", "Outweigh without an s doesn't inherently imply present and past, instead argue that the on balance part means you need to take all things into consideration which would include future benefits", "\"Outweigh\" is a present-tense, plural, transitive verb. Adding an S to make \"outweighs\" would change it from plural to singular, but wouldn't change the tense or transitive property.", "How does a present-tense verb not imply the present? (Hint: use examples from modern English usage to rebut the implication.)", "Also, if we accept for the sake of argument that\"outweigh\" only allows discussion of present impacts, how does \"on balance\" enlarge that?", "right. the obvious response here is \"present doesn't always mean present.\" English isn't the only language where present can mean future (e.g. \"We leave at dawn.\"), or even past (see: historical present, though kinda irrelevant here) so the most reasonable interp of the present tense here is \"future events still matter, if only because they should be factored into our ideas of if they make sense now, and besides IoT is still in its infancy so we have to expect it to become much larger in the future.\"", "Now THAT is a good response. Everyone, take notes.", "Thank you I will use this for sure.", "You can say the the IoT is just developing and most of the benefits will be in the near future: 0-10 years?", "That's true, but non-responsive. The argument is that the present-tense wording of the resolution disallows any consideration of future impacts, no matter how big. Saying that you can't prove enough benefits to win unless you get those future impacts is precisely the reason Con would want to run that argument.", "To respond, you'd need to provide a reason why future impacts are allowed (or, at least, not prohibited) by the resolution. Or, alternatively, why the resolution should be ignored on this point.", "After watching an IX Final Round speech at NSDA Nationals, I had a concern and emailed this on June 18.", "I have a concern about the IX final round. [removed] cited multiple experts in her speech.\nHenry Dean was the first. She said he was from NYU. There is no professor at NYU named Henry Dean.\nShe also cited Jessica Stern of the Harvard Law Review. I find it surprising that the Harvard Law Review, which tackles solely legal issues, wrote an article about the TPP. Additionally, many have seen her cite Jessica Stern throughout many tournaments. One extemper event went the lengths to amend Stern's Wikipedia page to read: \"She is regularly cited by Speech and Debate Students for her wide knowledge on Foreign Policy, the Environment, Space, Haitian Elections, Donald Trump's Presidential Campaign, and financial markets.\" Upon closer inspection, and considering the fact she is an expert on terrorism, there is no article by her about the TPP. She also cites the Carnegie Endowment for International Peace, which has never published an article about the specific focus on the TPP and the effect on women. Her speech is rife with factual errors. Singaporean tax benefits seem to not exist, nor do Shinzo Abe's plan to install more renewable energy(instead he has pivoted to nuclear energy.) I find it extremely disturbing that this type of academic dishonesty seems rampant and premeditated across her speech. I, along with many others, can attest that she uses the same fake experts in many extemp rounds. This blatant misconstruing and creation of fact has finally been recorded. While it is too late to allow another deserving extemper to take her spot on the stage, it is not too late to punish her for her lying and dishonesty. Going through the recording of the speech, it is obvious that this is a destruction of what the NSDA has tried to work towards for the past 50 years. Please heed my concerns.", "I followed up on September 9 and September 21 and none of my emails garnered even a response. Anyone can watch her speech and Google her sources to find nothing. I understand making mistakes in citations on a national stage, but citing experts that don't exist, from tournament to tournament, isn't a mistake. It's simple academic dishonesty and needs to be punished. The NSDA's silence about this is deafening. I do not want to start a witchunt, which is why I left the name out. But I do not know what else to do.", "How do you think they should be punished?", "When an interper miscuts a piece, their name literally gets deleted off the official results. Look how HI only has 5 people in the final round because a kid got DQed. I sent this message well ahead of the official results. If they truly cared about integrity, they would've taken the same action. I think revoking victories is fair. I also think that the NSDA has to make sure this doesn't happen again. I know many who would've loved to be on that stage but were disadvantaged because they wouldn't create their own sources. It's a real travesty to the seventh place individual, and the NSDA has to think long and hard about what they're going to do to prevent this in the future aka source checks in semis and finals before publishing results.", "That's a solution I can get behind. And I think you're correct something should be done about it. They have a facebook page. If you want to spam their page and encourage several others to do so that may be a way to get attention.", "when that interper is one of your friends and goes to your school...", "Victories revoked and a temporary suspension. Future attempts to do so will result in a permanent ban and a notice sent out to relevant academic establishments", "Temporary suspension from what? NSDA? School? Banned from the next Nationals? What if they graduated? Sure taking away victories is a thing but at this point they have their trophy. ", "Obviously suspended from nsda, they cant suspend you from school", "So like, kicked out of the tournament and if you do it again they send notices to major colleges and/or put you on a published list of cheaters", "If I found out that one of my students did something like this, I would remove them from the team and refer them to the school administration for academic dishonesty. Not much you can do against already-graduated seniors, unfortunately, but it could definitely be a big deal for juniors and below.", "They can't but getting in contact with school Admin could lead down that road. If you think about it if this became a big deal which is probably should the school name will be tarnished as well. So it would be understandable for them to do something. ", "This is why I hate extemp. Everyone I know that's done very well both locally and nationally make up evidence for every speech ever. Most use the same people's names over and over again or use previous debaters names over and over again. It's extemporaneous bullshitting. ", "One time, I did what everyone else was doing and made up evidence and arguments and actually placed which was irregular for me. ", "And I know a lot of you will say it's not that common but I'm a senior and every good extemporaneous speaker I've known has made shit up. Totally for calling her out on her bull shit. Debaye should he educational and on a fair playing field not who can make up the smartest sounding names and arguments. ", "It's turned into a creativity event ", "TBH, I can see the value from being able to bullshit stuff and make yourself seem smart, it could be quite applicable to real life stuff, but at same time shits annoying yo. ", "It's also why I hate debating extempers. They think they can pull that bullshit in pf and usually win too.", "It's never a problem at serious invitationals but damn if it doesn't get on my nerves on the local level. So many people just don't even bother bringing any of their evidence, so when you ask they just shrug and say \"I can give it to you after the round.\"", "Like that's nice and all, but I have 0% reason to believe you unless I'm sitting on the exact same card.", "It's definitely a problem at serious invitationals. I can't tell you how many rounds I've won by calling for opponents cards and them being flat out lies", "I have heard in elims at big tournaments like NSDA nationals there is a person who is specifically designated as a fact-checker, who looks up the sources the speaker references and makes sure they are not making stuff up.  Was a person like this present during the NSDA final round?  ", "Unrelated question about evidence use in extemp.  While I know it is prohibited to use debate evidence in the prep room because of tagging evidence, etc., if there is a source that I know to be true that is not in my saved articles, am I allowed to use it in round?  For example, if I have a card from John Smith saying the IoT increases automation by 50% (not an actual thing I'm making it up), and I get an extemp topic about labor automation, am I allowed to reference John Smith in my speech provided that I don't read the card during prep time?", "Certain tournaments do fact check. For example, Yale staff write down all the sources in semifinals along with the context, and then ask all semifinal round participants to show their sources after their speech. If there was one in NSDA finals, the speaker in question would've been caught. The people cited literally don't exist.", "That's based on the tournament. There aren't clear evidence policies on extemp in general, which is one thing that has to change. I would ask the person in charge at the tournament in question.", "I do a ton of collegiate debate and extemp. It really depends on the tournament.", "Most leagues dont even have a rule specifically stating you need legit sources (not that I'd say you should regardless). Like in parli you can literally say whatever you want, within reason. There is no cards, and thus youre not required nor expected to peoduce such. Literally if they say \"can you name your source\" i will 100% of the time say \"first, its parli, a non evidenciary based event. But because you asked (source).\"", "As for extemp, making up sources is common within reason because it often requires you to source about everything you say. So for example I may remember reading an article about Syria, but dont remember where. Itll probably come out as \"NYT had an editorial about syria on ______ date and blah blah.\" But this is extremely rare. And is usually because i decided mid speech to add it.", "to make up complete experts, context and etc. Is sketchy. However this is something I think you might be missing: in extemp, content is still only a small portion of how you score. You can be completely wrong on an issue and still win becasue of delivery. Its still a delivery based event.", "\"In <May> of <last year> the <New York Times> published an editorial on <Syria>\"", "Fill in the blanks, without looking I'm near sure The New York Times published an article about Syria in May of last year. For better or for worse, most judges will be fine with this.", "True. You may get hit with a \"you need exact dates. So may 13, 2016...\"", "Has happened to me before.\nNyt is my soley bs source. Everyone reports off of ap and reuters, so it's easy to see a copied version of it elsewhere. Same article essentially, but looks like 3.", "The economist is also nice since they don't publish author names.", "Of course the NSDA doesn't believe in integrity. They believe in money.", "Please never compete in parliamentary debate. ", "To be clear: this user is using my name (Chase Williams) to post, but this is NOT my account. I only have on reddit account (the one I am posting from...) that I use for ISD.", "Mods, please report/block this user.", "Does this mean that I have to return my stethoscope?", "I don't know where this idea that I carry a stethoscope wherever I go came about. I can tell you as someone who majored in Communications, that I will never use a medical tool or any of the sorts. Mods please exterminate this rumor.", "But it said on your other ISD account that you were leading stethoscope speaking drills. Is that seriously not a thing because I spent 75$ on a stethoscope?", "\"I do not want to start a witchunt, which is why I left the name out.\"", "Didn't read last part sorry", "I have had a long disagreement with the form of debating, and the dependence on collecting large chunks of evidence because has always seemed obvious to me that you can either lie or twist the truth to match your case.", "And while someone can say that a good opp will have a counter, you can't counter what is not true (as you can't really anticipate it) and it may discourage from engaging in certain areas of clash if it appears that one side has all the evidence, therefore fundamentally altering the balance of a debate.", "The form I do doesn't allow stats and quotes to count as either self-evident or independently valid, and it is the substantive that follows and the analysis of why one should care that matters.", "But maybe this will teach debaters that they are not geniuses able to cut through the bullshit of a debate when they can be conned with, what appears to be, such ease.", "\"Contention #1 is Hillary Clinton Walks on Water in a world of the Con.\"", "Makes it to finals last weekend", "Good debating, with evidence that you can explain with out taking up all your time gets to finals", "Stock arguments ran well, the teams that have a stock case but truly understand the win conditions of the arguments and the way the case plays out in the round do well.", "I agree.  If stock arguments sucked they wouldn't be stock arguments because no one would read them. ", "I think it doesn't matter. As long you have good frontlining and strategy you should be able to do well at a tournament. ", "They way I like to do it is with two stock arguments for impacts (stock arguments usually have the largest scale effects) and one \"unique\" argument in order to force the other team to drop an arguemtn", "Very good unique arguments will usually spread quickly and if they become popular enough just become a \"stock\" argument. Getting to finals is less about how unique or creative your arguments are and more about actual debating.", "In my experience stock arguments do better in general. The teams that do well take those stock arguments and run them in a nuanced manner. For example, on this topic, even though a good team might have an environment contention, they likely have a different warrant than just \"sensors\" and a different impact than just saving x amount of carbon emissions.", "Hey I don't know if this is the right place to ask this, but I'm losing my mind trying to find the right term.", "What kind of logical fallacy/debate tactic where you accuse someone of something, and their denial is support that they are guilty?", "Like  calling someone racist.  If someone denies being racist then they have entertained the notion that there is ground for them to be racist and therefore the denial is the proof.", "Edit: nvm after house of searching apparently I had to just type it all out to remember.  It's Kafkatrapping.", "Thanks for the downvotes too :)", "I'm new to PF, and while I've won a few novice tournaments, my partner and I went varsity recently and lost majestically. I'm second speaker, and I would very much appreciate help regarding rebuttals and final focus. I really want to become good at debate; it's  exhilarating and I love it, I'm just not so good at it. Does anyone have any advice for a beginner?", "First, you and your partner need to be good partners. From your Second Constructive to his/her Summary, you lose half of the available speech time. So your partner needs to communicate to you what they need you to hit hard in your speech and also in your solo Crossfire to set up that Summary. In the GCF, you should take the lead since you have the next speech (Final Focus).", "After you get your ballots back, do rebuttal re-do drills for your Final Focuses.", "Thank you for your advice! My partner and I know each other very well, so communication isn't the issue; it's more like, as novices, there's quite a bit we don't understand, but I usually pick things up before my partner does. Paired with the fact that my speaker points are consistently higher than hers, there's some resentment between us that's probably causing issues.", "For practicing Final Focuses, do you suggest I do entire practice rounds, or just go off the cuff? Also, I usually have short outlines written out (concise review of our contentions, frameworks, etc.) that I add onto before I give my speech, so as to optimize the time I have. Should I stop making outlines and do my FFs extemporaneously instead?", "I think I'm better at rebuttals, they usually go fairly well for me. Do you have any specific flowing suggestions? Our varsity taught us the basics, but there's still so much I'm unclear on.", "Again, thanks for the help! I really appreciate it.", "If you guys are close, I suggest talking the \"speaker points issue\" out together to work it out because partner chemistry is really really important in PF. ", "Also, take prep time before your rebuttals and before your partner's summary, it'll be really helpful if you do so you can solidify your key points. ", "Final Focuses seriously depend on the round but yeah there are a few basic stock contentions/key points that pop up in most rounds. You can practice FFs by themselves since doing full practice rounds every time you practice is usually not practical/possible. And you should do them extemporaneously. It'll be harder, but better for you in the long run.", "Are there any specifics you want to know on flowing? ", "Feel free to PM me if you have any other questions, and good luck! :) ", "I suggest talking the \"speaker points issue\" out together to work it out because partner chemistry is really really important in PF.", "Very true; also don't worry too much about who gets more speaker points. The \"points\" are meaningless except as a very low-level tiebreaker and judges do not generally put a ton of thought into them (they also mean different things to different judges).", "I've seen many successful PF and CX teams where one member is the \"pretty speaker\" while the other is the better tactician who sets up the dominoes that the more eloquent one knocks down. That is one of many kinds of successful partnerships, so if you're heading that way, don't worry about it. Just talk out what your strengths and weaknesses are with your partner and decide how to build, improve, and compensate.", "For practicing Final Focuses, do you suggest I do entire practice rounds, or just go off the cuff? Also, I usually have short outlines written out (concise review of our contentions, frameworks, etc.) that I add onto before I give my speech, so as to optimize the time I have. Should I stop making outlines and do my FFs extemporaneously instead?", "Are these outlines something you write in-round, or before the round? If they are from before the round, then scrap them. By the time you reach the Final Focus, the round will have progressed in such a way that nobody would be able to script out the perfect remarks (adequately defending your position, responding to the attacks that have been made by your opponents, reinforcing your attacks, and weighing everything) days before.", "Re-do your rebuttal for at least one round from each tournament you go to (but more is better). As you get more practiced giving better rebuttals, your actual in-round rebuttals will improve.", "I think I'm better at rebuttals, they usually go fairly well for me. Do you have any specific flowing suggestions? Our varsity taught us the basics, but there's still so much I'm unclear on.", "The flow is a very personal document, so I don't like to dictate a specific format (even for my own flow, I do it differently when I judge than when I debate). Your flow should serve two key functions: 1. allow you to see what arguments have been made in the round (including what evidence was offered in support and tracking attacks have been made in response), and 2. provide a basis for you to make your rebuttal arguments.", "So for my debating flow (if speaking second), I write in the arguments I intend to make in my constructive while flowing the opponents' case (in the next speech column). Then I flow my partner's case on the bottom half of the sheet (I only flow on 8.5\"x11\" Legal paper; letter-size is terrible for flowing...for me). Then, my flow runs my speech because it already contains the list of things I want to say, right next to things I'm responding to. (If I don't get to something I mean to, then I cross it off, to make clear that it wasn't said and to call special attention to bring it up ASAP if it's important.) Having what I intend to say on the same page as everything that's already been said also helps me sketch out things for my partner to ask during their CF. If your partner can read your flow, and vice-versa, all the better.", "I also like having a small pad of 5\"x7\" paper (they'll be right near the legal pads). These \"mini-flowpads\" are great for you and your partner to write notes and for you to write out longer arguments that won't fully fit on your flow. The small size is great for short bits like that and they won't get confused with your main flow or any other evidence/speeches you have.", "Honestly, just flow well and rebut every point made in your opponent's constructive. As a first speaker, I heavily rely on my partner to do the refutations in rounds. As second speaker, you need to set up your attack on their case so that your partner can drive it home in Summary, and you can push it through together in GCF. ", "The most important thing you can do in FF is just weigh. Show why your impacts are better than theirs, and/or how their contentions fall to yours. You have to wrap up the debate in a ballot for your side, so make sure you can convince the judge that all of their arguments fall and you outweigh", "Thank you! Do you have any specific suggestions on how to flow well? At this point, I'm literally just haphazardly scribbling things down upon a legal pad. ", "Are rebuttals usually done by just stringing together pre-made blocks? What are typical \"formats\" for them, from your experience?", "Weighing is like framework, isn't it? My FFs always go a bit overtime, and I rarely have the space to go over my side in more detail at the end. Would you mind giving generic \"formats\" for these as well? I have watched NSDA finals and semi-finals, but they're all a little different.", "Thanks again, your help is much appreciated.", "There really is no generic format except by region/type of circuit. In Oregon most of us do 2-3 voters or in layman's terms \"why you've won\". In your FF you don't refute or contruct anything. You take the main points that you've won and basically explain not only how you've won them but why it matters that you won them. ", "sounds like an incomprehensible notion", "Let your partner tell you what you need to cover to link in to her summary ", "This, clarify with them what they want you to cover in summary, so it flows nicer into a FF.", "I think confidence is really key in second speaker. You have to show the judge that you just heard the case and you're not even worried cause you can take it down. I would suggest also creating some opening phrases or phrases that just intimidate the opponents and add to your overall confidence that the judge sees. Overall, be confident and quick on your feet.", "what is something then? Cuz its for a local tourney. The ppl there aren't that good since by my third tournament I won an award.", "Would want to know* as well.", "Sorry, edited the comment now. I meant I would want to know too the number of pages of counters that's a something.", "Quality is more important than Quantity. 80 pages of crap is still crap. 13 pages of awesomeness could be improved on, but is still better than crap.", "Back when I was in PF my partner and I averaged between 40 and 60 pages per side.  This was usually enough to prep out both sides of all the stock issues and some more specific arguments.", "40-60 with u two working on it or as a team? Cuz im doin a bulk of the blocks for the team", "I did the bulk of the work for our team since I was the 2.  Partner would help fetch articles, but yeah pretty much all me.", "I averaged 40-55 per side, and I was the only person on my team that cut and highlighted cards. It definitely doable.", "Don't listen to this nonsense, if you are on local circuit you need like 10 per side.", "I gather around 40 pages myself and then trade for at least another 200. Trading is key.", "how do u ensure trading isnt one sided?", "Total mind game. I do a couple things to make sure i'm not getting ripped off. \n1. Start off by finding a base of other debaters that you trust (teammates and friendly schools). These prep in my experience is the most reliable.\n2. If you don't know anyone or you want more, even the debate subreddit or reddit PF center are great options, especially if you are a local circuit debater and prep can be traded without worrying about hitting others in round. \n3. Lastly, be cool about it. Don't come off as desperate or needy and instead just get a feel for interest. It's also important if they do say they want in and you are not 100% they are reliable that you make a plan. Make them agree to a date, certain amount of cards, etc. If the prep is crap then just never do business with them again. It is all trial and error. ", "Hope this helped, good luck!", "woah. not at all. for a tournament thats in the beggining of the month id have around 40-60 on each side. But getting to the end, it would be around 100. ", "What are counters? Blocks?", "awesome bro ur so cool i wish i were u ", "It really depends on how well you know them.  My partner and I achieved success and we just had a couple for each side but what I did was practice giving them in the most efficient ways possible. ", "I practice and time my blocks so that they're memorized so I usually had about 12-13 different ones per side. There usually isn't more than about that many arguments on a topic. Of course these were very condensed so there was a crap ton of pages of evidence and cards backing them up", "Is it when every device with an on/off switch can connect to the internet?", "If that's the case than the Internet of Things hasn't been implemented because not everything with an on/off switch can connect to the Internet currently?", "There hasn't been anywhere that has explained this thoroughly ", "Would an computer be considered an IoT product?", "Not sure if you have found the answer you are looking for in terms of \"has the IoT been implemented so I'll clear things up. The Internet of Things isn't one thing it's just the idea that ordinary objects can be connected to the internet. It has nothing to do with on/off switches. It has been implemented in the real world and you can see that with the Nest Thermostats. Not everything has to be connected to the internet for the internet of things to be a reality. The idea is that if a thermostat, refrigerator, car, etc is connected to the internet then it is apart of the Internet of Things.", "Internet of Things (IoT) is the internet connectivity of everyday items. It's a fridge or thermostat you can control from your phone. A good rule of thumb is \"if it can connect to your phone, it's IoT.\" ", "I don't believe on/off switches really have anything to do with it. ", "So has it been implemented yet because not everything currently can connect to the internet?", "There is no \"implementation\", the IoT is not a thing you can choose to do. It is pretty much any common object that has the ability to transfer data (some say without human interaction, meaning computers are not IoT) which means that there are many many examples of IoT devices in the status quo. ", "The IoT can exist without everything in the world being on it. All the phrase refers to is this phenomenon that involves people putting ordinary objects on a network.", "It's essentially anything with sensors that can alter the real life world. Fyi the internet is not iot.", "So has it been implemented yet?", "I think you're misunderstanding the idea of the IoT. It's not like a specific policy or technological implementation that's like a one time deal where everything suddenly becomes connected to the internet. Rather, it's a term used to describe the recent trend of more and more devices being able to be connected to the internet that wouldn't have been able to in the past like microwaves, refrigerators, thermostats, and things of that nature", "If you go to google and use the [define:] command, you can find a definition that best supports your advocacy.", "are you debating this for november?", "This is from the man who coined the term, he would've prefered it to be called the internet FOR things. That may help your brain do good.", "Someone in April ran something against me how Trump will win the election and republicans will get control of congress. Because of that, they won't be willing to give welfare to the poor to eliminate income inequality. I said this was dumb, and then I said we outweigh on probability", "Doesn't seem so crazy now...", "Yeah, they were novices who I think read their varsity team's case and didn't understand it too well.", "You should go to that team and tell them their argument was right. ", "Clinton won on the flow, but she got judge screwed :(", "What about Pennsylvania, Michigan, and Iowa, all states that Obama firmly won in 2012.", "Y'all seem to be forgetting North Carolina...", "tfw when you didn't read the elections DA for the past month because the UQ overwhelms", "I guess I can post Trump...er I mean president memes now.", "can Floating X be about Donald Trump as our president?", "PSA \nI understand why the mods are doing this I am just trying to make a joke.", "I posted a comment about the debate that was similar to this:", "There are things that are more important than the artificial boundaries we draw around our subreddit communities.  The moderation team, using their discretion, will occasionally attempt to engage the community in a discussion that we deem necessary and important.", "Well, I guess those Trump disads are in for some re-tooling.", "I have a lot of feels. When I woke up this morning everything felt hopeless. I was wondering what is the point? Why work on the tournaments I have coming up? Why get my check out for Berkeley? Why look up hotels for different tournaments? But then I realized that if I don't pull it together for my kids then who will? I have to lead them in a better direction and show them there is hope and a better way.", "So some things moving forward:", "Burn it all down now 95% more likely to win my ballot.", "I'll be fighting doubly hard to look out for debaters who are women, poc, or LGBTQIA+.", "Expect to vote for a lot of identity politics in the next 4 years. ", "I predicted this would happen 10 months before, that if Bernie was not nominated, Clinton would lose to Trump. It's a not surprising, she is an establishment insider that had a huge disconnect to her democratic base. Not to mention, after the primaries, she centered herself and basically showed her base how distrustful she was.", "Trump being a populist and idiot, ran very well surprisingly. The Republican base is not as split as Clinton's base. They adore him. They very well think he is an excellent leader. No scandal could hurt him. Scandals simply made the Democrats detest him further. His rhetoric alienated Clinton, and energized his voters. Clinton on the other hand never energized her voters, she was a status quo politician. Bernie energized his voters, he proposed big change, just like Trump did. And when it really mattered, Trump won by slim margins in states, grabbing all electoral votes, yet losing the national popular vote due to such slim margins.", "All in all, Hillary Clinton was a moron. She ran a pathetic campaign. She left her base hanging. Lied at every turn. She was complacent. And her hawkish record shows bad judgement. ", "But this moment, it is irrelevant how she ran her campaign. Trump, a disorganized campaign, but a resonating proposal, won the electoral system. Without little doubt, he is arguably the more horrendous option in this election.", "Now we sit and watch as the conservative party rips the progress..", "What upsets me is if Trump ends up actually being a decent President, none of the people stating that America is going to be destroyed or is in ruins will admit that they were wrong, similar to how people who didn't like Obama never did the same. Assuming Trump actually is a decent President, sites like Reddit will continue to scramble to find faults with his actions, even if he (in theory) managed to do what his motto was and \"make\" America a better country than it already is. ", "Following up on that, even if he has a lack of political experience, it should still say a lot when the person he was going against had quite a bit. If a candidate with no political experience can beat one with years worth of it, it says a lot of both of the two people.", "Next, many of his policies are wack? That's your own political opinion, and as a reminder many of Clinton's own ideas were pretty messed up. For example, Clinton herself stated she wanted a no-fly zone over Syria, back in the Presidential debates, which would have most certainly only strengthened hostilities. ", "No... I, like everyone should, hope that he will be a fantastic president, that many people's conceptions of Trump turn out to be false, and that America will emerge from the next four years in a better shape than we entered.  ", "Secondly, there are a couple of things that are important about Trumps slogan.  It is very reminiscent of Regan's slogan 'Let's Make America Great Again' with the careful and dangerous omission of 'Let's'.  It also assumes that America is currently not great.  It is not a statement of betterment but a statement calling for a return to some time in the past where America was truly 'great'.  ", "Thirdly, his lack of political experience is incredibly dangerous for a couple of reasons.  There are issues that plague this nation; regardless of your beliefs on what the solution should be, these issues require them.  With a president, who essentially has dismissed any formal code of behavior and conduct, we cannot be certain that congress will be willing to work with him.  Granted, in our ever-polarizing world, this possibility exists for both candidates but it is one that acutely affects Trump. His lack of decorum also threatens our international relations, many of which hang on tentative balances constructed over years of diplomacy.  Our relationships with countries like China, Iraq, Saudi Arabia, and many others have grown strained and require skillful maneuvering on America's part to negotiate these difficult waters, something that Trumps decorum, or lack thereof, could render impossible.", "Finally, the comparison to Clinton's no-fly zone, while fair, isn't very wholistic.  Trump has been cautioned, by leaders of his own party, former presidents, and respected political strategists that his policies are dangerous.  Clinton's notion of establishing a no-fly zone is incredibly preferable to the ambiguous notion of 'bombing the hell out of isis,' 'torturing [terrorist's] families,' which I remind you is a war crime, and engaging in full scale US military operations to establish 'US power in the region.'  On top of this, Trump's domestic policies of expelling illegal immigrants, banning immigration for certain ethnicities and religions, and his use of xenophobic, angry, and racist rhetoric is incredibly dangerous for our nation. ", "Glenn Beck ate his words to endorse Hillary and apologize for his role in stoking the racist fire in America. If he can recognize when he was wrong for so much of his professional career then I can too when I am wrong.", "Reagan had no experience. Hillary is also a bully, just in a different way. His policies aren't the greatest but he has been falling back on them for months now bringing them back down to earth. Honestly, he isn't as bad as a lot of you guys think. Just be open minded and give him a shot.", "Still tho, not that much experience on the national level. Also, he is a populist candidate. His experience didn't get him to the White House, it was simply a slap in the face to the elites.", "Reagan was the Governor of California for two terms, first in 1967, then re-elected in 1971. He left office in 1975.  I suppose you could say he had no political experience from 1976 to 1979, but if you care about facts, that's a bit less persuasive.  Trump, on the other hand, had literally no political experience beyond running for president and literally had never applied for a job before this.", "Pretty damn impressive lol. I have spent a lot of my time the past few months finding ways to discredit and disprove Trump, of which there are many. But look at what he has done. Make excuses about the uneducated turning out for him, about the third parties, whatever you say, what he has done is just objectively impressive. While I don't think he alone will be able to make decisions that will change our country for the better alone, I know he will try to surround himself with the best minds the right has to offer. At the end of the day, he just wants what is best for America, he just has a different plan.", "framework and T will become a lot weaker.", "most neg impacts are probably non-unique now.", "Everyone hide in your nuclear cellars, America's gone to shit", "Could be worse. Sidmala could be the president ", "This guy is being given rather unfair downvotes. ", "Why is it fair to upvote things that insult and belittle Trump, but a person who literally says nothing but a comment that is obviously support for Trump, is downvoted into oblivion? So much for being civil. ", "Someone that would comment NOOOOOOOOOO would get the same amount of downvotes. Its not about what he believes, but the quality of the post.", "Lets be real, this comment got shit on because of the liberal biases that exist in the debate community, not because it was a comment of \"poor quality\".", "Er, I doubt that, at least currently. I've seen comments which are basically the same get 80-100 upvotes today.", "No impact and no link. The downvotes are deserved on grounds of laziness. "]