["very cool, but i prefer how it looks like on computers now XD #old", "si asi fuese club penguin seria rechulo y con misiones y demas", "si esta nueva dimension  solo estara para portatiles o para compus de escritorio tambien", "ja assisti pois ja ta dublado", "Look like Worms 3D Game map! :)", "I'm so excited 2016 the surprice's year", "Is this going to be 3 dimensional because that always seems to ruin my interaction with games.", "como consigo el club penguin alien", "I have some experiences (good or bad) to share about Club Penguin customer service soon.", "I remember watching this the day it came out last year", "yo ya vi el video y esta bien bonito", "que mal que no estube en ese siglo beueno pero no inporta pero se be muy dibertido.....", "Callum Read Conner Humphrey Freddie Tipping", "I collect like 60000-70000 coins every year and I donate them ALL", "i donated too much, more then 10,000", "I like so much this party\nMerry christmas for everyone :D", "hey did you know that aunt arctic is the club penguin director see it in the tenth aniversery book character memories move you mouse pointer on aunt arctics name and pic of director and his comments will be written", "This is my favorite party! I donate approximately all of my money", "I donated all of my coins", "aqui e o filho dela o gabrielboff voce pode me dar uma assinatura gratis", "I have a problem. Why can't I get my rainbow puffle? I was right beside it and it wouldn't load so I could name it...", "i can not answer you because it also happens to me if you speak soubese", "Cant wait, David and I will be there on Slushy!", "Oh Cp, no me des lag, :'v", "Vi un capitulo de la serie de Club Penguin. Esta muy bueno!!", "Deberian darse unas vacaciones y hacer una mezcla de fiestas pero con nuevos articulos, gracias por la atencion, mi consejo es que si hacen una fiesta mucical que sea de noche , que contenga edificios y que se pueda percibir musica por doquier y pistas de baile fuera de los lugares y un concierto de R5, the Vamps, y otras bandas en el iceberg como funcion especial y para socios seria un Meet & Great en un backstage para conocer a los cantantes pinguinos.", "Hi Club Penguin! I have a problem... Today i'm tried to play in Club Penguin but I can't remember my password! I'm tried to change my password but I can't because the web say 'Sorry! Invalid Penguin Name or Email Adress' but I enter the correct information! I don't know what can I do. Thank You.", "Community service is great! I have to do a lot for school and I love how it helps people", "hi club penguin me podran agregar  como amigo en club penguin soy cluacluac", "I love doing coins for change!", "I donated about 100000coins!! 1 million coins!!", "es genial donar juguetes para lo que lo necesitan es muy generoso feliz navidad club penguin", "atencion jugadores de club penguin alerta roja11!!1!!1!", "y que paso con el otro culb piingue lo del sunami", "Hola por FA vor decirme donde puedo comprar cartas de card jhitsu", "me encANTA CP  PERO no soy socio", "Hi, I mean I need help .. I created a penguin came to me and no email. Help me anywhere? Well thank you :(", "Club Penguin porfvor onde posso assistir o  filme do hellowee", "no me a llegado para poder hablar hay porfa envienme el cuestion", "ai e e o es un misterio me encantan", "I am 14 years old and had been a long time (about 4 or 5 years) I did not want to hear about that game. I was a subscriber the Club for years, totally addicted and too loved this game, but when I stopped playing I ended up with this. But a few years ago I went back to listen to some music of our DJ Cadence and started to enjoy it again. And then hearing \"Cool in the Cold\" (I saw the release of the song in 2012) and remembered that every year I donated to the Coins for Change. I still do not own an interest in the game, but I can not break my promise of donating the MAXIMUM than I can donate every year. Always, on the weeks of December, I play all the possible games to earn coins and donate the last coin by the campaign. I love it!!", "ay un error yo y mi hermana nos queremos comprar los puffles cristal y olaf y no nos deja y somos socios  apretamos adoptar y no pasa nada espero que contesten chau", "I want to be a member Tailor5130 help call please help me", "yo no soy socia y quiero ser pero no tengo las targetas de las cuales dicen pagar por fa que ya no existan los socios que todos los articulos sean para todos", "porfa podrian dar los puffles especiales como el ddorado los puffles dinasaurios o otros mas sin ser socios", "Please arguien I can give a nuemero of credit card charging", "but I have no money for membership", "Ya no soy socio por eso ya no juego :v", "Eu consegui encontrar ele hoje !", "Tony Calderon Paola Alvarado Brandon Zubia Monte Garcia Victor Monterroza Alfredo Arredondo Brian Juarez Terrance Johnson Karely Annette Macias Helen Vega Anaisa Garcia", "will there be a day when we can see the updates as they are happening?", "Why cant you people bring old club penguin back it was way better.", "And people still complain about the old CP being better than the actual one. Geez, you guys gotta acept the things like how they are. Acept it, your lovely old CP it's dead, don't like the new? Go away plz.", "Finally renewed my membership after not having played in over a year.  I've been a part of Club Penguin since November of 2007", "Haven't played Club Penguin in awhile", "las actualizaciones se estan empezando a ver por ejemplo el arbol de navidad del fuerte nevado eso es lo unico q se nota", "Jeffery Johnson awwwww remember? We were SO obsessed haha", "bring the old club penguin back from 2007 plz", "Billy Garrigus ever play club penguin?", "love club pengui  aganme socio porfa", "Hello happy day to all ninjas club penguin", "Hello! We are new subscribers to Club Penguin. My son really enjoys the site, however it seems extremely glitchy. We have to often refresh, the login page doesn't load, games do not open. Is this normal for your site? I definitely have higher expectations for a subscription site. I would appreciate feedback! Thanks!", "lets play club penguin and run in world", "awesome i'm full carditsu fire snow and water ninja i hop they will add something new like a rock ninja or something", "lets play club penguin and run in world", "Cheers 2 all the true ninja penguins out there, we rock!!! ;)", "Happy ninja day for all ninjas", "Happy Ninja Day To All Ninjas", "Happy Ninja day for all <3", "Still remember rgis game from the 4-5 years  played it 2008-2011 but if you want a strong ninja go ask Naruto", "que viva club penguin y vipenguin", "Club Penguin Podrian Sacar otro Disco Por favor", "Do you still play this game?", "Club Penguin it's cool, my game favorite", "Ya lo se para el Enero 2016 aran al fiesta de Un Gran Dinosaurio, Las reconpensas seran, El traje de el dinosaurio verde, El otro dinosaurio rex, y el traje de Spop,", "club penguin est nul et pas cool  parce que on paye pour etre membre venez dans vipenguin c'est sans paye pour etre membre", "I LOVE CLUB Club Penguin :* :) :D :)", "quiero que club penguin mande los puoductos y juguetes a las tiendas de republica dominiccana", "Hi, im having with a puffle rescue game where the penguin is so hard to move left right up down", "Club Penguin todo mundo do meu iglu adora os ninjas  :D", "Hello happy day to all ninjas club penguin", "hello club penguin they can give five night at freddys pliss", "club penguin quiero que venga a la tienda de republica dominicana que vengan los productos de club penguin a las tiendas de republica domonicana", "I want to lavender in club penguin!", "Lindy Chen I LOVE CLUB PENGUIN <3", "i know that singer Mileo used to play this game :D", "mis puffles estan intusiasmados con las galletas sobre todo el perro", "This is me when I find cookies XD", "Franky Chacon dude get online hurry", "cool i got eat this day cookies and chocolate", "You finally did something right, CP.", "that end is the best (y)", "En el lado oscuro hay galletitas :3", "Esta es mi carta de jugador", "my name is eva 2805 i love your videogame", "me gustaria que me manden una solicitud de amistad", "nesecito ayuda,tengo 442 amigos pero cuando entro a cp no tengo ningun amigo, pero si entro en la app cp tengo mis amigos.Informe esto con el blog y no he tenido respuesta", "Club Penguin Quisiera aclarar una cosa ? no seria mejor que cuando compras la menbresia y se te acaba los objetos osea ropa o articulos del iglu se quedaran ? es que uno se le va muchas monedas y todo para que se lo quiten? me gustaria que cambiaran eso claro es una sugerenciavla verdad tengo a mi primo que era socio y de le acabo la menbresia y perdio la ropa y los muebles", "While I love Club Penguin, non-members can't do anything on there. It just now happened a couple months ago that members were able to get decent clothing. Non-members can only have 2 puffles, while members are able to get an unlimited number of puffles. They are also able to take better care of them because they have more available resources such as beds and food trays. Eventually club penguin will loose majority if their players since 2/3 of players are non-members, and they are being treated this way. Not everybody can afford to buy continuous months of membership. This also goes for Animal Jam, only Animal Jam is worse than this.", "Need more players, the way you make almost everything needs membership scares the non-members away", "Get rid of the autotyping adverts!", "Just going to call that this is a remodel of the docks", "I hate the membership thing some people can't afford this cool stuff like a new igloo and such sort", "Looks like a new place or a remodelation", "I'm still the fan of Club Penguin but i'm a retired player in 2009-2011. I will love the see Club Penguin the Movie!", "i try to adopt a Alien Puffle but it keeps saying \"You have the maximum number of Puffles\", even though i have the average amount (10-15)", "What servers will he be on most of the time?", "Eu vi o herbit no encontro dos pintores!!concluir os mandados!", "Club penguin yo cree mi pinguino y no me ah llegadfo el correo de aprovacion", "genial siiiiiiii es el juego mas divertido del mundo a soy el hijo de benedicto", "o rookie me no es el pinguino que mas me encanta de los famosos  pinguinos", "aoarece assim vc pode ativar sua conta em 3 dias restantes", "jai besoin daide mon compte ne marche pas quand que je cree un compte parent", "una pregunta club penguin yo tengo un pinguino entre y era socio le compre ropa un iglu y pufles me sali y cuando volvi a entrar ya no era socio solo me quedaron los pufles y la ropa ya no la podia usar pero nose como paso no he comprado membresia ni nada que hago", "miren club penguin me dise tenes 7 dias para abrir tu cuenta pero no se como ayuda", "porque en club penguin solo tienes que ser socio si quieres adoptar a un puffle no puedes al rosa al amarillo,etc nda ningun juego si no eres socioooooooo", "me paso algo muy malo  le agrege una menbresia a mi pinguino hoy y compre muchas cosas  y cerre secion y cuando la volvi a abrir  ya no tenia nada solo los puffles por fabor ayudenme", "olle me active la cuena para escribir y ablar etc. y no puedo ablar necesito ayuda", "El puffle verde alien es para no socios?", "loved this game alot made my child hood awesome was playing from a long time but had to go bought memberships lots of time and it was a good go thank you club penguin for making my child hood awesome ;)", "i cant adopt my green puffle...it says i have maximum numer of puffles...b'cuze of that i had t sell some of my beloved puffles...but i still cant adopt those green puffles...pls help me!", "if they keep giving the members im not gona play any more", "I have a problem- when I go to adopt an alien puffle, it says I reached my limit even if I release some puffles, I'm not a member, that might have to do with it, but I didn't reach the limit. Please help!!", "Can you put again the Cat and Dog puffles jackets? My penguin is new so i want to have that jackets than i really love", "I'm a non member and I have the maximum amount of puffles and I want to adopt an alien puffle :'(", "And a tip: if you to much puffle creature just acces the app tap to you're puffle and click the relase puffle button I train and that works :) , but now I haven't my super cute wild puffles but not unicorn puffle. :'(", "I get one name is UFO, the best party ever!  :D", "Aja yo ise todo y como ago para poner la roca en donde andava para que funcione la nave porque  si no ponemos la roca como la nave funcionara la roca la tiene herbert", "Oi Galera do CP, Sou Brasileiro mas n to gostando da festa, pelo amor d deus e mt chato.", "Its so kind of you to give green alien puffles to nonmembers", "I can't adopt the green alien puffle !!!!  Why???!!!!", "This is unfair, probably only members will be able to do the fun stuff", "Can you help me with something ? My name is fred73639 , and i have 4 puffle (red.blue,yellow , that i had code to put it, and gold) and i can't have the alien puffle , SO PLEASE DO SOMETHING,I REALLY NEED AN ALIEN PUFFLE :(", "I like club penguin because I can get the dishes in the dish washer while my kids have fun. <3", "why not pull more space for the puffles, I have a lot of them and I have to get the Alien Puffles! so, you pull more space for more puffles for the puffle garden, please?", "Club penguin I have a question does the alien puffle on operation crustacean also avalable for non members also?", "esto dijo ellos  lo se porque hablo ingles  La bondad es uno de los mejores regalos que puedes dar ! Contento", "Please,and erase all the other things I bought only my raccoon I want to keep", "I have a membership for 7 days only and I bought a raccoon puffle. It says only for members.\nIn six days I will not be a member please make my raccoon stay and i can play with it", "hey I got an alien puffle but it wont let me feed it n whatnot unless I become a member n I don't want it 2 die. y u do dis?", "i love club penguin is the best and everytime i play!", "justicia debe aver un catalogo para todos y otro para socios", "una pregunta como se ase socio", "I have been trying to delete my child's account forever. Couldn't do it. Finally cancelled my debit card. You still charged it. Can't update anything or buy anything until you are paid, again, for nothing. Not happy with you.", "hola ami en club penguin me dice avtiva tu cuenta y meto la des mis padre y ne les yega nadas", "Happy candy day?!!?!!?!! Hahahaha.... Happy halloween to you too!", "Happy Halloween MUAJAJA club penguin is very very awesome!", "I love club penguin not much candy", "club penguin coloca o evento do dinossauros de novo porfavor", "hey no sabia q club penguin tenia pag de facebook", "me considero fan de club penguin 8-)", "Voces sabem cono acha o puffle dourado", "I like haloween and club penguin", "played it and saw herberts lair", "I can't cancel my subscription. .tried now for 2 months no contact still taking my money. Try to get in touch with apple good luck an absolute rort don't sign up. If club penguin see this messege I'd be happy to talk to someone to stop as we are not and have not been using!!!!", "Club penguin tengo un problema no me sale jugar?? me aparece mas info por favor me puedes responder el problema?", "why isnt club penguin working today", "me encanta club penguin hasta tengo uno", "hello club penguin has dubbing portuges", "deverian de crear una serie de club penguin asi como los videos de musica de la penguin band y cadence", "Porque no hacen una Pelicula Animada de Club Penguin", "YAAAAAAAAY!!! finally another new club penguins movie!", "Simon can we pls watch this", "pasen Cp.......  ups  aqui no es", "Not releasing it on Disney channel this time? What about iTunes?", "no me a paresido pero para estar pre parado", "hoy gan nesesito ayuda no se como activar mi cuenta en club", "Happy anniversary Club Penguin thanks for all", "Happy Birthday Club Penguin. And, I don't know if you saw this from my account(Keldeo0604) thank you for using my idea of different parties ainside of different rooms. It was rally cool!", "Happpy 10th Anniversary Club penguin <3", "Happy anniversary < 3, thanks for a great game!", "Happy anniversary Club Penguin!\nWe love you!", "Here's a small question:\nDid Club Penguin Started on 24th October?", "Club Penguin Did a fantastic job on this party. Well done for 10 years!", "Happy anniversary to the best online game ever ;3", "Happy anniversary and thank you for making my YouTube channel grow 10% faster than it did before!", "hope there wil be some good event ;)", "That was the best party ever.", "hola amo club penguin soy de colombia y tambien tengo un juego muy parecido a club penguin los amo bay otro dia les dejo el lain", "It means a lot to have been part of this, Club Penguin Thank you so much for all the great memories, support and love! <3", "Happy anniversary club penguin  We Love u :)", "am club penguin did my email sent?", "Ami hijo le justa mucho este juego esta loko por el siempre agara la laptom y ai se la pasa todo el rato", "Based on FNAF. Isn't it too scary for young children?", "oye club penguin soy socio por 2 da ves!!!!!!!!!!!!!! gallogabi  volvio!!!!!!!!!!!!!", "una pregunta  cuando me meto a club penguin y le apreto en juegar no se puede por que me sale un cuadro del dia de brujas y me sale un cuadro q dice mas informacion por eso lla no s epuede meter acada ratito me sale", "hmm the Theory of FNaF is not wrong, but: It's not in a Restaurant", "al juego Five Nights at freddys", "Herbert es el causante (se descubrieron adelantos)", "a nao FIVE NIGHTS AT FREDDYS serio tenho medo do fox dai vou la jogo dai vejo ele eu desmaio :( :)", "Festa medieval do futuro :v imagina que louco", "I'm a Club Penguin member for two penguins", "Me encanta todo lo que han echo viva club penguin", "me encanta CLUB PENGUIN lo AMO", "eu amei  a musica e a festa do club penguin de dez anos", "i love the video  Happy Aniversario Club Penguin", "I would have send in a fan art if I knew your making a new song", "Hey club penguin! I just want to tell you my laptop is broken and i can't play club penguin now :'( cries i will get new laptop i can't wait :'(", "Your team did a fantastic job making this and all the contributers art is awesome!", "seria legal um the club penguin movie para ano que vem", "I love the video! I love the song! I love CP!", "Happy Birthday! I love the song and i am friends with every mascot btw i am alicia16286 :)", "como activo la cuenta ya puse el mail y no me mando nada :/", "Por culpa del juego de quitar las misiones de la EPF nadie sabe que el oso es vegetariano :C", "Wuau no sabia q ese oso era vegetariano  jajsjsj", "Operation in October? :D Waddle On", "me pregunto cuando habra noticias de herbert", "verry good game i love it", "por favor podes poner cosas que no se agan con membresia en club penguin", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "Pongan a five night at Freddy\"s", "happy birthday tra-la-lala; happy birthday tra-la-la-la-la-la", "como  se  juega  esto", "Hebert better not mess with the EPF!", "Hello! Penguin club membership can bring to Argentina? I want to buy but not hope your answer thanks for watching my comment...", "Hi! I have a little Club Penguin animated gif I made for one of my university courses of my penguin, and I would love to send it to you. Unfortunately your fanart page does not accept .GIF files. Is there any way I can send it in to you guys? :^)", "hola club penguin sera que me pueden ayudar a tener una membresia gratis", "como me puedo hacer socia porfavor ayuda", "oigan no me llega lo de la activacion q hago por fa contesten", "como se le hace para activar tu cuenta", "HAPPY BIRTHDAY i wish you everything good for the moderators and for the game itself  <3  #10years", "Is Jay the red one,Carlos the white one, Evie the blue and Mal the one with purple hair?", "Hi Club Penguin. I read that Nasa scientists find evidence of flowing water on Mars .. so, Mars Takeover?", "hi club penguin, about this months party for the aniversery you have the corrections wrong its suppose to be 11th anaversery cause i look on the year it started which was 2005 so you kinda got the years mixed up", "Seriously let the non-member people get stuff, all the membership cards and stuff is to exspensive. You should price it: $3.45-1Month;  $12.67-6Months; $34.55-1Year, not $10.00-1Month $30.00-6Months and $60.00-1Year!", "Hello club penguin who never tire of making money ? because people have to pay to be happy Everyone we should have equal non- partner does practically nothing I lose because I am a non- equal partner to many penguins tired of boredom in Club penguin everyone should have equal # Wepaynottobehappy", "Me gusta los pufles tengo 26", "Club penguin when you will put back the store? thank you", "That could be their puffles too.", "Those sould be puffle hats!~ They are so cute!", "COULD YOU DO A herbert takeover rescus=e gary and rockhopper and we have too save thrm", "Maybe a puffle with black puffle face but the color is red and blonde hair :v", "Hui Qing there all gonna be mine soon", "hey club Penguin qual vai ser a primeira festa do ano q vem? #pinguinando", "Club Penguin eu acabei de fazer um encontro para falARR como um pirata !", "ARRRRR,encontrei o Rockhopper no evento de FALAARRRR COMO UM PIRATA :)", "When is Rockhopper coming to Club Penguin again? I can't wait to get more pirate gear(besides the gear I already have).", "Don't forget (this is more about the paid members problem than the idea btw)!\n\n\"I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).\"", "club pinguim o passageiro clandestino muito legal o livro..", "bora bota contas do club penquin ?", "Get rid of the autotyping bots who have taken over... there is no room on screen because of their advertising outside websites. It would be nice too if the IGNORE function actually WORKED so these bots could at least be ignored.", "When will the rubber ducky floats be released again. I have been a member since 2008 kind of sad I never picked one up. You guys have a stamp that when you use a rubber ducky float in water you can get it. But it's kind of impossible if you guys don't have it out anymore. Will the rubber ducky pool float ever come back?", "Club Penguin a risco de banir um penguin que usa progama de terceiros?Haha club penguin e top", "amazing I will see rockhopper again that's amazing i can't to meet him again!", "why does cludb penguin keep charges me and in not activated??? please stop charging me", "I bet only paid members can get the clothes. However, I'm still more concerned about this (if you remember):\n\n\"I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).\"", "I think there's so much cool stuff for members ( even I can't buy it ) but I still love club penguin", "This is the lamest party cp has had. What are you suppose to do in two re-decorated places???", "I'm Mal or Evie :p Guys stop complaining for the party. It is small because they are making the 10th Anniversary. The party is very good!", "Beatriz Adara Torres Dominguez , some people don't have the money for the membership.", "hey they know how to get clothes descendants", "porque no ubo ni una mision solo los trajes y ya y casi las salas ni estan decoradas esta si es la peor fiesta de Club Penguin", "I don't even know what this show is. ._.", "haha i got mal's spell book >_<", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "When will it be till the next stupid theme -.-", "mal-igna because is the most bad of them all and i like so much the color purple", "Club Penguin,eu entrei na festa,mas nao tem nada legal apenas 3 salas decoradas e roupas gratis,eu esperava uma coisa melhor,voces ainda vao fazer alguma melhoria?", "I am so disappointed. After waiting so long all we get are 2 rooms decorated and no activities. wow ...", "I love desendets and I'm a member go evei I can't what for the holloween party that is my favret party every year", "I hate this Club Penguin. I want the original back, these parties are trash", "me gusta club penguin pero por favor quiten la membresia lo socios no pueden seguir siendo los que siempre tene", "Que finoooooooooooooooo  la ropa  de  desen dientes", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "me quiero ser sosio gratis pero no puedo mefacina club penguin", "I have one but ur kinda rit but it's because I said puts with an a I was tring to say puts away", "*_* I love descendants I'm not as equal partner gave me things and I'm so happy to follow CP", "me gusta club penguin pero por favor quiten la membresia lo socios no pueden seguir siendo los que siempre tienen todo", "me gusta club penguin pero porfavorr", "Guys stop! They made the party small because the 10th Anniversary!", "Everyone is right, This party is boring. But i can live with it. :l", "Like si quisieras ser socio :( :'(", "I was gonna thank you for a awesome game, which you do have, but I want to give you a Big THANK YOU for having the next party be Disney Descendants!!!!", "Could we have a specialized day as well? Maybe on the same day of when Club Penguin was made, just this year, or next year, we should have a throwback party! Like, maybe a whole day with everything looking as it did in 2005! Ooh, and we can have different colored hats than the beta testers!! Will you give it a shot, please?", "Thanks for all but you can come back the old penguin skin", "I was gonna thank you for a awesome game!", "Thank you for making my childhood amazing but I stopped playing when O got an Xbox360 and Xbox One", "como mi hijo puede ser socio en club penguin", "Quiero comprarme socio, pero con boleta se puede?", "Pls make club penguin available in Cyprus", "Donde se compran las tarjetas de socio en Argentina sin tarjeta de credito???", "Operation Teddy bear confirmed on November 2015!!!", "Its rookies a d i love herbert", "my daughter is having trouble logging onto Club Penguin at the moment. Is there a problem ?", "elle herbert las pagara la epf te encontrara y te castigaran", "Anyone else having trouble logging in?", "When I go to log on it says to come back that you're updating things behind the scenes? When will the site be up and running again?", "What if Herbert P. Bear IS the Teddy Bear? DOG PILE!", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "Quisiera darme de baja, que debo hacer?", "My favorite book Series is The Selection by Keira Cass.  I read three of the books in a week", "Well I play Club penguin: Kaylagirl503 (wishes to be penguin of the week) and well I love to read Fear street series by R.L.Stine.", "club penguin please can you have a party of disney chanel series call talent", "Where can I adopt a pet rock today? I can't find one?", "Bring back the typing game in the library at the coffee shop!!!", "I played club penguin for 1 year and it's a wonderful virtual world with penguins and they all live in the same neiborhood and lots of stuff. Seriously  who dose not  like a party every month!!!", "I can't get on the game. Why?", "CP i can be penguin of week i played for years", "hi how can i activated my penguin account for 7 days?", "I'm more of a manga person! I think I predict events in manga! Especially Pokemon XY!", "Fix it duck and the rainbow fairies books", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "club penguin i am really sad because my brother bought me a membership but when i went to my account there was no member :(", "Todo Porque por no ser Socio :V", "will there be more pufles soon?", "yo quiero uno de ellos puffles no soy socio pero quiero uno", "How do I adopt a pet rock today? I can't find one!", "Ojala la app salga ponto en android", "no nos dan ni uno? D;", "socios: 42 puffles\nNo socios: 2 pufles", "Pretty odd pic seeing as Puffle wild is now out of commision...", "Pls i want club.penguin on my phone........  you have it in Greece and no in Cyprus seriously pls update the range on Cyprus", "si andres yo no soy socio", "Vanessa S. Payne il y a plein d'animaux maintenant :D", "Club Penguin,Por favor lance club penguin para windows phone", "Looks like I'll be returning to Club Penguin soon.", "Hey guys I think we should do a game on who will win animal jam or club penguin", "animaljam v.s club penguin who will win?", "Just giving you ideas. You should do a Gravity Falls festival. Yeah. You should. Every one loves Gravity Falls, and that will cause a sensation all around the world. Like if you agree :3", "i dont understand why i cant write my own sentences anymore. after i verified my account i chose the setting to play with the chat bar", "meu sonho de festa aconteceu e eu aqui, sem assinatura :(", "Quando que vai sair o projeto super secreto?", "Still just another lame modern party", "Hello I loved this great party is re seriously :)", "The music In games such as hydro hopper and pizza tron are still not working.", "I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).", "The party is awsome and Dot is awsome too!", "I preferred her old design ):", "And i think old the penguins we can see dot tomorow in the party", "I love Dot. She is a true penguin inspiration", "Whoa dot has new Style and an herbert?!?", "Can we find Dot in the party???", "The old dot didn't have color in her hair.", "hi club penguin team why i can't see the dress of the vote?!?!", "I use to play this so much when i was younger but than everyone costed real life money and in game effort to get.", "I liked it when the Penguins had the old design.", "I rember her! I have all the DS games", "I remember meeting her, it was nice, I've always liked Dot, always been so witty. I'll miss the old look.", "Since when she is pink ?", "Herbert's paper says OPERATION...That means an Operation this year??!!", "Do you all still give out stamps? Because I feel like I should of received some recently or that some are not possible to get anymore.", "I quit club penguin because of the mobile version", "I don't like club penguin. In the game, all the things are for members", "club penguin es lo mejor del mundo", "I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).", "Furries version of puffles I guess.", "Mi hijo tiene a eso puffu de mascota y tambien tiene al dorado al arcoiris y al gato y tambien tiene uno de dinosaurio y uno nuevo que es un robot y un puffu fantasma", "This isn't a dog its a puffle!!!", "i guit club penguin because they don,t knoy my gmail", "hay un gran porcentaje de no socios en club penguin deberian de mejorar los ambitos como de poder adoptar mas puffles, poder comprar decoraciones para los iglus. etc", "como siempre e querido ese perro", "Para mis 3 perros Pretty, Krispy e Hito", "excuse me club penguin HQ i got a problem i just got membership today and i go login then a glitch came then i restart then my membership please fix it  my username on club penguin is dragonfan903", "Hi cp i want to be the penguin of week i have 5 years in cp and i have toys,cards of card jitsu and puffle toys please mi penguin is Chavo Del 75", "club penguin meus pais compraram a assinatura e faz uma semana que nao chega vcs tem como dar uma pra mim", "club penguin qual senha de cadence", "How do you become a penguin of the week? I have been trying for 2 years.", "I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!", "jajaja intensa mente en club penguin yo no estuve en ella fiesta", "Hey..I cant log in :( could you um help puhlease :)", "The music in the games such as hydro hopper, pizza tron, surfing, fishing, etc has stopped playing. This is very frustrating! I've tried everything to fix it! Help!", "Hola Club Penguin, me encanta su juego, pero me gustaria que hubiera mas ropa para los que no son miembros, por favor tomen en cuenta mi sugerencia, gracias.", "se los agradeseria si tuviera una membrecia", "why need to be a email why dont add it??", "Please put me penguin of the week  louis2015", "e huuuuuum amo club penguin e tinho pin achem eu Spokinha responda eu club penguin", "me pregunto quien seguira jugando club penguin", "Club Penguin Me dar uma assinatura? Ja coloquei 3 vezes e a minha acabou :( jogo club penguin deste 2011 :D tenho o pin", "*with a picture of Aunt Arctic using her right flipper*", "Hello I want to inform you that umaas pages called 'Agent Dot, Rocky and Cece are annoying players in club penguin are cursing or making profanity swearing if you can answer me\nGrateful! Bruno :)", "Ignore button DOES'T work! Servers are OVERWHELMED with these autotyping cube penguin army bots directing players to external websites to be given memberships. I will STOP ALLOWING MY CHILDREN TO PLAY Club PenguinN IF YOU DO NOT SORT THIS OUT! Fpr pity's sake- this is supposed to be a safe environment and it isn't and you can't even ignore them because the function doesn't work.", "Right handed. I can play left handed on my 3ds though", "Happy #Lefthandersday \nWish I was left handed", "Eu acabei de sair do computador ai eu fui jogar no server ingles ai eu vi ela :-D", "Is there a right handers day?", "Omg I'm a lefty Yaya Yaya Yaya yay btw it's my birthday", "tengo una duda, por que cuando el pinguinito de mi hijo me quiere enviar el correo de activacion no me llega??? que puedo hacer? es un gran problema por que si se juntan los 7 dias mi hijo perdera a su pinguinito!", "I sometimes miss those old missions you can't play anymore", "OMG the brown crying penguin from the PSA Mission MMNEEEOOORRRIIIEEESSS :)", "Good morning Club Penguin and everyone!!!!! :D", "waking up and realizing my membership expired 2 years ago...", "I love you club Penguin s2", "club penguin es delo mejor ok", "I love club penguin a speak spanish no inglish", "Like if u cri evri tim", "realising the ignore function STILL DOESN'T WORK. Please respond!", "im gonna to replay cp again.. 2 year later :,)", "uy si eso es horrible XD", "i miss the old EPF missions\ni never did complete the last one.how did it end??", "What excites me is: classes only in September and is summer :D", "but in my country today is a holiday", "I quit club penguin because you made the mobile version", "I don't have a cat! I could bring my cat puffle!!! :D", "I do not really like club penguin because only members can buy everything", "I think non-members should have a day just for them and win awesome prizes ,I am a member but I still think that non-members should be treated with a little more respect .I see every time i go somewhere in club penguin non-members getting turned down by members because they think they are better than them.Also members saying they are throwing a party,fashion show ,or contest only for members or they will be kicked out,ignored,or reported .So who is with me on making a non-member day on club penguin", "Club Penguin im very sad for club penguin if close i cry all the day club penguin is a great game but the boys of this days wants games of wars i have 11 years and i love club penguin", "Lo mejor es ta pade y yo estoy con....con...con quien sea XD", "solo tengo el celeste y el rojo", "yo no soy socia y no tengo el puffle gato", "Please put me penguin of the week Louis 2015", "Very nice this cat is so cute. :)) :** :3", "Can You Add More Rare Items To Clothing Catalog ?", "si que vivan los gatitos locas", "como le hago para que me llegue el codigo de activacion??", "i have this puffle cat his name is chedda #ilovechedda", "quiero el gato de el penguin", "So cute I have one to she name is Mimy. :)", "And how many old rare items have been ruined due to this one?\n\nEdit: Around over 20+ items are now ruined in rarity due to this one. Including the mullet tie\n\nEdit 2: Make that over 30+ items", "All the clothes for everyone is so lame. It's costumes from like a millions years ago.\n\nRare costumes aren't really rare anymore due to it being in this now. We non members look like absolute trash while members look like celebrities.....", "Club penguin como puedo ser socio", "I feel sorry for the Penguins who used to be rare", "the old items are back :)", "This catalog has many old items", "This is the longest catalog of cp history!!!! my story: I had 32,000 coins started buying things and when only half catalog was over I had on 9000 and something coins then, I wrote some codes in treausre books now I had 15,000 and something now I started buying and still when 3/4 catalog was over I had just 7000 this is current just a few moments before  #Daffodaily18", "wow I bought all thanks: D though not alas alfin partner that I could buy a hair baby", "total fashionistas on this game are screaming \"YES!!!!!\" in their heads right now", "I loged on in the moring", "Club Penguin VCS PODIAM POR FAVOR REPETIR A FESTA DO FROSEM", "Hola!,Club Penguin!!! Tengo una pregunta en 2011 active una cuenta de cp no podia abrir el chat hasta ahora [2015] no esta abriendo.Que hago??.Mis padres activaron mi cuenta pero no se q pasa.Me pueden ayudar??", "The ignore button still doesn't work. Is there a limit on the number of penguins we are allowed to ignore? If you allow the servers to be filled up with autotyping bots and the ignore button has stopped working how are we to avoid being overwhelmed by this? It would be nice to actually have a response.", "Such racists people.....everything for members. :/", "2mlg4u gr8 banter 4 club pengueen", "I have everything from the book... non member items for my 2nd account.", "Club penguin eu gravo videos de Club penguin, como codigos e etc... posso ser autorizado por isso? (y)", "Club penguin Hello, I am disappointed that at this moment the \"biggest fashion cp\" is only for members ..", "Good job Club Penguin ;) (y)", "porfa regalen una membresia vien echo por el parque pero al gunaos no difrutan en clud penguin", "Cool CP! Can we have a sneak peek of this months catalog? I'm really excited and I can't wait!!! :D", "quiero hacer una pregunta mi hija a entrado en el juego y dice que tiene que ser socia para hacer todo me pueden ayudar ami y ami hija para que eya juegue y que se divierta", "lo socialismo es perfecto son malos", "Hello! When you become a member at the club, and subscribe for one month. When we finished things left in my possession or disappear?", "It would be cool if it was Cp themed :D", "great job guys i wish i can go to that park CP ROCKS!", "hi club penguin my penguin the kell", "I play club penguin every single day", "guats no the club penguin ait delmecat", "feliz dia da amizade no club penguin a amizade vai longe", "Jahlein Ciel Astillero Is My BFF And Like Sister( We Are Not Sisters).", "Yo tengo membrecia y ya lo tengooo esta copado y me llamo torres49 soy cinta negra y soy socio", "I need the android app but cant find it on the appstore", "que todo el mundo pueda ser socio gratis porfi!! :( en serio o que por lo menos la ropa y las cosas sean para todos!", "Did you get the coincidence from the incredible's", "Elsa and Anna are great sisters.", "I'm gonna need to have a calendar for special occasions like this.", "Feliz dia da amizade club penguin !", "Hola Club pengui yo nada mas queria decir q  creo yo q seria mas divertido q todos tubieran membresia sin q nadie pagara xq si no se aburren en especial yo xq no puedo pagar una solo quiero  q todos puedan tener lo mismo de la membresia sin tener q pagar gracias", "oo than good club penguin love love him very much is a good healthy nuego also has nice things and pizzeria and intensely than joy to be part of the club :)", "I love club penguin it is the best online game ever I play it everyday", "Yay!!! Can't wait for August! :D", "Club penguin deixa eu ser uma moderadora do club penguin?eu adoro o jogo club penguin por favor?", "I signed up for a membership for my son and he still cannot do anything as a member. It is still saying he is not a member, but yall took my money. This is rediculous!!!", "club penguin'm from Brazil and I heard some penguins talking obr the dojo of the shadows it exists or existed? There could tell me where it is? or if there could please put the dojo of new shadows? and I was curious to see videos about this place?", "eu amo esse jogo pena que eu nao posso meu tablet nao pode jogar que nao e igual o joga mesmo assim eu amo ele ele ta no primeiro lugar de jogos <3 <3 <3", "gary because i want to meet u and my famous club favorite penguin signed polacraft", "We want old times in Club Penguin now is it boring...", "Club Penguin podrias hacer solo 3 misiones faciles", "copia barata de meet the- en team fortress 2", "club penguin deixe eu ser  um famoso do club peguin por favor?", "today is my birthday three years of club penguin", "So ignore button isn't working... overwhelmed with these armies and can't ignore.", "Edgar si no tuviste como amigo a Gary no eras jugador del 2010 :v", "club penguin eo maior do mundo da minha vida", "Alguem sabe aonde compra o puffle de gelo (um puffle q parece um boneco de neve)?", "Where can I find his secret lab?", "qualtas meias o senhor G tem", "Really I love cp too much cause it was my first online game at all, but I felt mad about that when we buy membership everything we buy for our house I cant use it. Really it's so mean ._.", "club penguin meus pais compraram a assinatura e faz uma semana que nao chega vcs tem como dar uma pra mim", "Whos your friend who likes to play?", "bing bong es el mejor,comediante y loco", "Josie McDermott Bing bong and club penguin! It just cant get any better", "Club penguin is very expensive on real money ._.", "I love I love party inside out I like club penguin now", "I miss old cp u u", "Hello and welcome to Club \"go see our new movies\" penguin", "I signed up for a membership for my son and he still cannot do anything as a member. It is still saying he is not a member, but yall took my money. This is rediculous!!!", "lla  lo   tenia    mami", "No me deja agarrar a mis puffles ...", "I really hope there is a medieval party this year! I miss thoes!", "Feliz sexta! essa festa club penguin do filme divertida mente foi um  susseso", "club penguin my best games ever", "What if they have a ninjago themed party on Club Penguin? That would be a very interesting visitor for sensei.", "ALL YOU ME IS CLUB Club Penguin", "club penguin mis juegos de pasatiempo", "Hahaj, Dj Cadence in the background", "Club penguin my best game ever", "*R5 song begins to play* :P", "Every server is filled with club penguin army recruiting autotyping.. it is impossible to even see other penguins through their speech bubbles. horrible", "Club penguin vcs falam varias linguas?porque eu vi uma resposta em portugues em comentarios e outra resposta em ingles", "ola club penguin te admiro me puedes dar una membresia", "Is club Penguin jenial dian leis an Hera nua", "Hpla Club penguin, quiero ser socio como hago??", "Club penguin me gusta mucho la fiesta de intensa mente muy buena :D", "club penguin fazem uma festa do TOTAL DRAMA PRESENTS THE  RIDONCULOUS RACE  onde os pinguins podiam visitar o mundo inteiro igual o desenho : )", "ola club penguin eu queria saber nos vamos poder se tranformar igual eles na festa", "club penguin por favor me puedes dar un pin de membresia", "You guys have to make a phineas and ferb party!", "me encanta club penguin y ahora mas con la fiesta de intesnsamente", "ta passando o evento ebaaaa,mas club penguin o evento so vai ter esses intes mesmo ou vai ter mais intes por ai?", "club penguin porque ao da pra falar agora", "Please have the orange tabby puffle costume return!!!!!!!!", "Jemima Knott I know what I'm gonna be doing", "como puedo ser socia gratis ayuda porfavor", "i cant wait for the inside out party i think its going to be awesome!", "What is with these club penguin autotyping armies on almost every server? You can't see anything because of their spamming autotyping- they are all over the screen, Why should I have to \"ignore\" 15 penguins every time I go onto club penguin? Since when did this become acceptable?", "la fiesta es ya assta el 5 de agosto", "falta 3 dias ebaaaaa ainda bem que sou assinante", "Sorry for the inconvenience but when I opened a new account penguin store and I gave mine a bone between the original is erased my friends and nose to do hope you can help me or say how to solve Thank you hope your answer Club Penguin", "I need the chat,I just joined club penguin and it doesnt have chat?", "to doido para o dia chegar", "hello cp team okay I'm with a problem in my notebook I can not update please adobe", "!!hello club penguin,I liked much the party from intense mind very good", "Like por los que quieran que comienze ya!!", "agregemen publico cosas de club penguin y mucho mas.", "como busco el club penguin en el android ????", "dear club peguin hi im tyler but my club penguin name is monstr25wigi i really want that brady hair because it's really special to me so can you give me some brady yair plz and if you do it would give me a smile", "I missed getting the orange tabby puffle costume :( :( for the next puffle party will you still have it? Hope you do :(", "I signed up for a membership for my son and he still cannot do anything as a member. It is still saying he is not a member, but yall took my money. This is rediculous!!!", "Pena qu nao sou assinante :l", "Don't speak spanish se here in a page in inglish", "Club Penguin, please please please, next year for the Puffle Party please have the Orange Tabby costume! The 1st you had it, I wasn't member, and the second time, I also wasn't member! But if you have it again I will buy it and I'll be a member. PLEASE HAVE IT AGAIN!", "Don't spoil the party, give us more functionable items, not fancy items. More quality items for the non-members, this game needs more penguins online.", "i'm really looking forwad to this party!!wanted to know if it will have the closes of the caracters as the disgust?", "furia furia furia furiamyamorcito querido como estas mucho calor ehh pss jajajajajajajajajajajajajajajajajaja", "it's so funny when Anger falls down and the butt sticks out", "me gustaria descargarlo pero pesa arto", "jaja isieron enfurecer a furia jaja como le pegaron con el balon i se enojo", "cancelaron teen beach movie 2 en cp", "Is this gonna be some thing for club penguin", "Why on my country is not available on the phone the club penguin????", "Does it look like I can play to u", "Where exactly will he be located? I mean, lighthouse or something?", "tambem eu mas so que ele perdeu a memoria", "What time zone are those times in? I hope EST", "Sorry for the inconvenience but when I opened a new account penguin store and I gave mine a bone between the original is erased my friends and nose to do hope you can help me or say how to solve Thank you await your response.", "I think rockhopper will lost his memories and the cheese is cursed right??", "el queso verde dua dua que ascoooo en club penguin le deven gustar pero a mi no guacala peor que el queso azul", "The party can be a good party...", "We need a club penguin tv show on Disney Channel, and maybe Disney XD too, but mostly Disney Channel,", "por eso le gusta a rockhopper hello rockhopper", "Oh no, that time in my country is midnight and the dawn, i can never meet him", "Club Penguin Every time i go to play.clubpenguin.com im greeted with a page that say:\n\"6 months ago\nYOU DECIDE: Musical Items\n27 comment(s)\"\nand then i cant log on to play :c ive tried on multiple computers and browers and clearing the cache :c, i just purchased a membership and now i cant even play! Please help.", "como ativo minha conta sou novo nesse jogo", "Acho que ele se assustou com ele mesmo!!! Hahahaha", "Aun siendo mayor es bueno jugar algo como club penguin para no olvidar la infancia", "Por que no puedo entrar a club penguin", "verdad yo en club penguin habia ganada eso dizfraz esta re peloa", "vivaa club penguin por que si esta animado jejeje", "me encanta club penguin solo que quiero mas misiones ya me estoy aburriendo", "mi infancia de club penguin y aun lo es es el jeugo que juge club penguin", "Where is the EPF missions? From the tube transfer", "please get rid of the auto-typing spammers. Ignoring the penguins doesn't work, it doesn't get rid of the auto-typing, just the penguin.", "Of course, because only Club Penguin Users still use a 4:3 Aspect Ratio.", "I just noticed Kluttzy behind the mirror o.O", "i love anh hate club penguin you know?\n i hate being not a member i always wanted to be a member but it costs real money!  i hate it so much and why dont non members get more stuff?!", "I love club penguin but I wish they have DJ cadence clothes and also I want teen beach 2 in cp  and the cp app", "Oh Herbert, I guess he did not lose any weight as he got older.", "I have cancelled my club penguin account 4 times and keep getting billed.  No one in your billing responds.   You just charged me again!   This has been going on for months.  My next call is to the BBB", "Tenho 15 anos, mas acho que daqui a 20 ainda amarei club pengin", "Club Penguin sounds like an epic place to work.", "Kara Liu and then look at their most recent post", "so eu acho que o herbert tinha q parar de agir igual um troxa?", "blash ni hablar hebert tiene miedo al frio mas nada ademan solo fue abandonado en el polo sur y los oso polares no odian el frio hebert esta cambiendo de tenperatura cama nosotros era de loco hebert esta asiendo planes sinientros", "como me uno a los miembros", "I like it, it looks really cool!", "tu y kluzzy son muy unidos", "Thursday, July 16\n\n * 10:00am on the server Chinook\n * 3:00pm on the server Wool Socks\n\nFriday, July 17\n\n * 10:30am on the server Cloudy\n * 5:00pm on the server Rainbow\n\nSaturday, July 18\n\n * 11:00am on the server Cozy\n * 3:30pm on the server Sherbet\n\nMonday, July 20\n\n * 2:30pm on the server Northern Lights\n\nTuesday, July 21\n\n * 10:00am on the server Frosty\n * 3:00pm on the server Mammoth", "O puffle brando fico muito fofo !", "sou a nojinho sou identica a ela odeio brocolis e sou muito ``frescurenta`` com insetos ratos e baratas .... entao eu sou a puffle preto", "gente como fazer a assinatura da conta? me ajudem pf", "YAY I love inside out I watched and the puffles have the same emotions as Joy , Anger, Fear ,Disgust and my most favorite is Saddness", "i have a membership code BUT IT DOES NOT WORK NO MATTER HOW HARD I TRY", "Hey Club Penguin, I Can't Activate My Membership code Because When I Click on Redeem than it Says That You Are Not Eligible For The Promotion :(", "Why doesn't club penguin app have all the games like thin ice", "Awesome!!!! Club Penguin should totally give puffles emojis!", "Well! This Is Certainly Going To Be Like The Matrix & Inside Out Combined On Club Penguin!", "Eu Sou O Puffle Dourado Com Mistura Do Branco , Com Uma Pitada Do Puffle Gato . :3", "there is club penguin for android mobiles ?", "New emotes for Inside Out parteh Yay", "pero por que el pufle caafe es temor", "When did club penguin died in 2014", "What club did the penguin go to? Club penguin!!!!", "The Eel and Eagle fell in love. But they cannot marry each other. Why? because it's EelEagle!", "..You what?\nMy best joke?\nAre you sure?", "Featured in the Club Penguin Times April 8th, 2010:\n\nWhat's a monkey's favourite month?\n\nAPE-ril", "i miss the OLD Club Penguin :(", "what is Elsa's pet? the white puffel since the cold never bothered him anyways", "Why do you never trust stairs? A: They're always UP to something. Terrible jokes make my day. Just kidding.", "Q : what animal should never play cards ? A: A cheetah XD", "There were 3 friends, first called crazy , the second called neither and te third called nobody. One day nobody fall in a pit, crazy call a police officer and says: Please help me, nobody falls in a pit and neither is help her. The police  officer says: Are you Crazy? and Crazy says: yes. Nice to met you.", "the next sentence is true.\nthe first sentence is false.\nmind blown.", "Q:Why was the elephant afraid to use the computer? \nA:Because there was a mouse!", "que hace una manguera en la calle? respuesta vendiendo mangos", "Why did the chicken cross the road? To get to the idiot's house.\nKnock knock.\nWho's there?\nThe chicken.", "Wife calls husband: Window is not working. Husband:put some oil it will work. After 10 min, Husband calls wife: Did window work?? Wife's reply: no windows did not open but laptop stopped working. #LOLOL", "Why did the chicken cross the road?\nBecause it can", "I've always had interest in botanical research, most of that research consists of trees. This research runs in the family, so I tend to STICK to my ROOTS, although I have been thinking about BRANCHING out, and if I could find something else to love, would I move to that subject? I WOOD; however, I don't want to BARK up the wrong tree. A comment section of jokes, I better make like a tree and LEAF, I'm starting to feel like I'm HOLLOWING out my collection of tree puns.", "Why penguins cant hide in the corner?\nBecause There is no corner on an Igloo!", "Y can't u give Elsa a balloon? because she'll let it go!", "Why is all for membership?? :)", "hey cp my brother mahamed can not activate his account", "acontece q eu nao consigo criar uma conta para mim e eu estou fazendo minha senha e meu usuario certos e em tamanho ideal", "esse jogo eu jogo so nao sei como ativar a conta", "Hello, I've made an account on CP and tried to activate my account through several email accounts but it seems that I'm not receiving anything. Can you guys help me please?", "Ola eu tenho uma duvida, ele dizen que vai enviar um email dos pais e quando eu vou ver se envio nao vejo nada, por que isso acontece?. Por favor me ajudem.", "Club Penguin existe um bug ao fazer o login no Aplicativo G-Ladeira esse bug esta no nome a dizer que esta mal.", "voces club penguin disseram que iam enviar messager e ainda nao enviarao", "Club penguin something make me weird cuz I have a penguin it name is cooler702 he was a member until I log out and log in again and now he not a member anymore what the heck happened plz reply", "eu tbb capa lindha continue assim cp", "que capa maneira com ninja e com outras coisas, realmente gostei muito desta capa", "Hi. I love club penguin game. It's so fantastic and fabulous.", "hey i really love playing this game its fun! but also some really inapprortie things happen personally like penguins do some bad things ive seen i reported them to the modren but no body did anything! so i would like to know if u can do something!", "Bons tempos de Club Penguin  <3 , quando eu era guri eu jogava muito, ainda entro de vez em quando pra matar a saudade xD", "Got login issues again. Help? I messaged your support team already", "I'm really getting annoyed about the Club Penguin Armies autotyping on the Flurry server- it is overwhelming and they are sending everyone to their own websites to join their army and become Club Penguin members. If this is the way Club Penguin is going then please let us know.", "club penguin nesesito que me digan como activo mi cuenta para que no se me elimine porfa ayudemen?", "I'm a huge fan of puffles I have 15 and more is wild puffles.", "quien me dice como ser socio :( buaaa porfavor :,(", "club penguin asqueroso prefiero geometry dash", "i  love  club  penguin!!", "Here You Go :D\n\n1362832942803669 \n1399540689327177 \n1371468894079990 \n1398738773744319 \n1324709933685516 \n1312524356957369 \n1372961321661007 \n1389733565156544 \n1316549775247232 \n1346142252642222 \n1357528240738652 \n1352939389577819 \n1340027712054359 \n1393801868111800 \n1376170722100576 \n1326331179390255 \n1309831604741910 \n1326902846475531 \n1365728299491482 \n1319704856514710 \n1398254750140932 \n1390586850169126 \n1388615574349442 \n1378348998487290 \n1300735415033889 \n1369759457360091 \n1357910712880863 \n1373431248926659 \n1395575724180854 \n1302285518236836 \n1382157574761361 \n1364798955748393 \n1365332496432507 \n1352045242416636 \n1337748754837004 \n1321061796119673 \n1315089430289016 \n1372108810046855 \n1341849619292505 \n1376247730397304 \n1375402273241453 \n1399816067414509 \n1363199329807740 \n1331465373428635 \n1330280040927937 \n1319289572830767 \n1300463281944667 \n1338619169678604 \n1327694862968180 \n1327685219910415", "es malo por que las cosas sola mente son para socios", "I really like this one. <3 :) What's the next party? :D", "hola club penguin los ammmmmmmo me llamo nifogu27 en club penguin", "Club my New penguin hcman6 i Need a email i Put my email And my Sister went To gamil And yahoo There Is no Message About You my Sister Put The email Again stil no Message From You To Put The email That you say", "hey club penguin why cant active my clubpenguin", "I am playing club penguin right now", "LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLlLLLLLLLLLLLLLLLLLLLLL\n LLLLL\n *Acum uita-te dupa Q si dorinta ti se va implini:\n ... ... ... ...\n\n OOOOOOOOOOOOOOOOOOOQOOOOOOOOOOOOOOOOOOOOOOOOO\n O.. .OOOOOOOO\n *Acum e foarte greu,gaseste N:\n MMMMMMMMMMMMMMMMMMMMMMMMMNMM\n *Acum gaseste greseala:\n ... ... ABCDEFGHIJKLNMOPQRSTUVWQYZ\n *Spune ceea ce-ti doresti dupa numaratoarea inversa:\n 10 9 8 7 6 5 4 3 2 1 Acum inchide-ti ochii si pune-ti o dorinta! ;*;*;*;*;*;*\n Acum pune acest mesaj in 9 comentarii si dorinta ti se va implini!\n GRABESTE-te! Ai 20de minute!!!!!\n Sau rezultatul va fi chiar opusu.", "I was just at command room with Gary lol!!!", "ai uma conta KiKiTo3 senha 651902ag", "It's actually nice that you remember stuff like this. I would think u wouldn't jerks.", "*****PLEASE SHARE*****\nCLUB PENGUIN (DISNEY)\nI had purchased a membership which I showed proof of and did not receive that membership. I called Club Penguin support and was told that there was a glitch on their end and that I would be receiving the membership which I paid for. 3 days later I received an email stating that I would not be receiving the membership due to problems on their end. I did not get a response to my email back to them so I called. I was on the phone for 40 mins before I was transferred to the Supervisor \"Amber\". I asked to speak with the person above her and she hung up on me. I called back and was hung up on by \"Serie\". I called again and was hung up on by \"Katrina\". I called again and was hung up on by \"Amber\" who said I wasn't allowed to speak with her manager. I never received my membership and was completely scammed. *****PLEASE PASS THIS ALONG SO THAT IT DOESN'T HAPPEN TO ANYONE ELSE*****", "My name is Kaneva Man start of both words are cap", "gente dise que o gary ia ta no avalanche 1 hora no horario do cp porque ele n teve la", "I TRY TO ACTIVAT MY GIFT CERTIFICATE AND IT SAYS THIS: Sorry, we can not process your payment request.\nSomething went wrong. Please wait for a few minutes then try again. WHAT DO I DO Club Penguin", "o gente alguem pode min da uma dica de onde eu acho o rookie", "-_- \"Happy\" and \"Monday\" Don't belong in the same sentence.", "Club penguin no puedo entrar a CP porqueeee!!!!!!", "club penguin no me gusta su juego porque me suspendieron mi pinguinoooooo", "Summer is the only time mondays are good.", "I love club penguin and i have my own nintendo 2ds", "Hi there, I was just curious about something. Were any of the original Club Penguin creators involved with the Wii game, Club Penguin: Game Day??? Like who's the staff behind this game? Who designed it? We're Merrifield, Priebe, or Krysko involved in any way?", "yo club penguin is this a sign? im epfs head detective and i know you guys so if theres something up here ill be the first to know. also you have many glitches today on 6/24/15 please fix them.", "club penguin i had membership on club penguin im Mavic1 i keep track of when it ended but it ended 1 week early what can i do", "I am sosio but I can not buy things I am gabcarp Fix it please", "com vc me falando isso, a segunda deixa de ser feliz.", "Failed to understand the \"good\" part of \"monday\" -.-", "I am prince CCC\nThe best player", "AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHH!!! Ok, I got loud. Now what?", "Quiero un puffle multic pero no tengo celular inteligente :'( :( ;( .( ( ,(", "Por fabor podrian  hacer como el de elsa, pero mejor  uno de five a nigs at fredis", "why i cant open club penguin?", "*****PLEASE SHARE*****\nCLUB PENGUIN (DISNEY)\nI had purchased a membership which I showed proof of and did not receive that membership. I called Club Penguin support and was told that there was a glitch on their end and that I would be receiving the membership which I paid for. 3 days later I received an email stating that I would not be receiving the membership due to problems on their end. I did not get a response to my email back to them so I called. I was on the phone for 40 mins before I was transferred to the Supervisor \"Amber\". I asked to speak with the person above her and she hung up on me. I called back and was hung up on by \"Serie\". I called again and was hung up on by \"Katrina\". I called again and was hung up on by \"Amber\" who said I wasn't allowed to speak with her manager. I never received my membership and was completely scammed. *****PLEASE PASS THIS ALONG SO THAT IT DOESN'T HAPPEN TO ANYONE ELSE*****", "hola club penguin para que son las tarjetas de juego", ":c lo malko es que no tengo plata y nunca me e podido comprar una menbre porfa alguien me ragal un monton de menvres gregen porfa :,(", "por que club penguin no sirbe", "as I can get a multicolored puffle", "club penguin e o jogo fantastico de sempre", "Patrick did you pass the safety quiz?", "How do I do the safety Quiz? It does not work", "ok ok ok Club pingui  es genial", "Seems like the website is down after the latest update", "Yo ya hice el cuestionario de seguridad", "Haven't been able to login all day today.", "I forgot when I passed the test?", "When I click for the safety quiz, I can't click anything else. Like the website hangs ( not my system). Can you help me out? :/", "Eu fiz esse teste e passei", "*****PLEASE SHARE*****\nCLUB PENGUIN (DISNEY)\nI had purchased a membership which I showed proof of and did not receive that membership. I called Club Penguin support and was told that there was a glitch on their end and that I would be receiving the membership which I paid for. 3 days later I received an email stating that I would not be receiving the membership due to problems on their end. I did not get a response to my email back to them so I called. I was on the phone for 40 mins before I was transferred to the Supervisor \"Amber\". I asked to speak with the person above her and she hung up on me. I called back and was hung up on by \"Serie\". I called again and was hung up on by \"Katrina\". I called again and was hung up on by \"Amber\" who said I wasn't allowed to speak with her manager. I never received my membership and was completely scammed. *****PLEASE PASS THIS ALONG SO THAT IT DOESN'T HAPPEN TO ANYONE ELSE*****", "I pass the safety quiz..! :)", "Will do a small party for the friends", "Write them a letter telling them all the things I love about them <3 And thank them for always being there for me :)", "Club Penguin is the BEST GAME :D", "Club Penguin Team can you pls make the club penguin apps avaible in android tablet? pls", "mande me una solicitu soy jhonmermicha en club penguin", "Tell my friends how much I care.", "For my best friends, i will get her a membership for club penguin. I meant best friend, Actually i would do it all to my friends! all my friends play club penguin soo yea.. I love my best friends.", "I will throw a celebration party with everything my friend likes", "club penguin yo envie una membresia y no me la mandan era de 7 dias y todavia no me la mandan :(", "My sister is my best friend.", "I love best friend day. My BFF is club penguin", "Send them a Hi, Friend, miss you note!   To all my Chicago Friends,  Love you all & miss you!   FLORIDA is great, but there is no place like home.  Love,  Jeri", "amigos me asen una cuenta activada en club penguin", "club penguin es lo mas cool que e visto y jugado :3", "club penguin no se como ser socia", "club penguin is the best game!", "sad story short: i don't have one", "I suggest you put more things such as transport things like that and we can travel by plane thanks. :D", "What the hell happened to the Puffles?!", "I think I didn't visit my account for a long time my puffle ran away", "Club penguin! How to be a membership! Please i want to be a membership!!!", "Hello clubpenguin I want too tell you something thank you for everything you have done in this game.thank you so... Much that is the best game.", "Wish I could have a cat on CP :)", "Wow Now On Facebook That Is So Cool", "goodnight I apologize sincerely want to have a membership in Bolivia live so I do not know where to find a card payment or Asher hope your answer thanks .....", "hi we have had problems with login for weeks due to up grades from club penguin  and sadly having sent several emails to discuss the frustration and upset, they gave us a months extension on membership . i think a little tight maybe its too cold for them to open their wallets any more , how sad."]