["What is with these club penguin autotyping armies on almost every server? You can't see anything because of their spamming autotyping- they are all over the screen, Why should I have to \"ignore\" 15 penguins every time I go onto club penguin? Since when did this become acceptable?", "yo tego club puguin me gusta mejooooor  queeee mudo gaturra clubbbb pinggguuuuiiil  eees loooo meee joooor", "gente e a tia artic em forma de pato", "yo ya vi el video y esta bien bonito", "hi club penguin my penguin the kell", "And a tip: if you to much puffle creature just acces the app tap to you're puffle and click the relase puffle button I train and that works :) , but now I haven't my super cute wild puffles but not unicorn puffle. :'(", "Kara Liu and then look at their most recent post", "Community service is great! I have to do a lot for school and I love how it helps people", "What's wrong why can't I goto club penguins site?", "I remember joining in 2007 just after the stage was built and when the yellow piffle was discovered. It makes me happy that Club Penguin is still alive. Waddle on!", "giovani estoy de a cuerdo con tigo es injusto asta las palas para escavar las monedas eso no bale si uno estar a jugar a un quesea 2 cosas que se nesesinten como las palas las patinetas ropa cosa para las mascotas etc etc etc", "Still remember rgis game from the 4-5 years  played it 2008-2011 but if you want a strong ninja go ask Naruto", "Hi, im having with a puffle rescue game where the penguin is so hard to move left right up down", "Happy anniversary Club Penguin thanks for all", "Happy Birthday Club Penguin. And, I don't know if you saw this from my account(Keldeo0604) thank you for using my idea of different parties ainside of different rooms. It was rally cool!", "Happy Birthday! I love the song and i am friends with every mascot btw i am alicia16286 :)", "porque no ubo ni una mision solo los trajes y ya y casi las salas ni estan decoradas esta si es la peor fiesta de Club Penguin", "How about if you designed a camoflauge puffle! I think a lot of players would find that interesting.", "Happy anniversary and thank you for making my YouTube channel grow 10% faster than it did before!", "club penguin ay un error ami no me aparece el laberinto estoy enojado nome aparece el laberinto ni nada nesecito su ayuda por favor respondan", "Me encanta todo lo que han echo viva club penguin", "Those sould be puffle hats!~ They are so cute!", "gary because i want to meet u and my famous club favorite penguin signed polacraft", "There were 3 friends, first called crazy , the second called neither and te third called nobody. One day nobody fall in a pit, crazy call a police officer and says: Please help me, nobody falls in a pit and neither is help her. The police  officer says: Are you Crazy? and Crazy says: yes. Nice to met you.", "sean amigos mios en club penguin y mi hermana v234", "In Club Penguin original ja ta halloween in VIP Penguin not", "I'm Mal or Evie :p Guys stop complaining for the party. It is small because they are making the 10th Anniversary. The party is very good!", "Feliz Natal a toda equipe do CP!", "Thursday, July 16\n\n * 10:00am on the server Chinook\n * 3:00pm on the server Wool Socks\n\nFriday, July 17\n\n * 10:30am on the server Cloudy\n * 5:00pm on the server Rainbow\n\nSaturday, July 18\n\n * 11:00am on the server Cozy\n * 3:30pm on the server Sherbet\n\nMonday, July 20\n\n * 2:30pm on the server Northern Lights\n\nTuesday, July 21\n\n * 10:00am on the server Frosty\n * 3:00pm on the server Mammoth", "Club Penguin, My sons account is not working, nor is your contact me page. Please contact me to resolve this issue.", "I TRY TO ACTIVAT MY GIFT CERTIFICATE AND IT SAYS THIS: Sorry, we can not process your payment request.\nSomething went wrong. Please wait for a few minutes then try again. WHAT DO I DO Club Penguin", "im gonna to replay cp again.. 2 year later :,)", "mande me una solicitu soy jhonmermicha en club penguin", "Jeffery Johnson awwwww remember? We were SO obsessed haha", "Hello, I've made an account on CP and tried to activate my account through several email accounts but it seems that I'm not receiving anything. Can you guys help me please?", "Ami hijo le justa mucho este juego esta loko por el siempre agara la laptom y ai se la pasa todo el rato", "I forgot when I passed the test?", "como me uno a los miembros", "Gracias por poner mi arte :D", "Club penguin! How to be a membership! Please i want to be a membership!!!", "Could we have a specialized day as well? Maybe on the same day of when Club Penguin was made, just this year, or next year, we should have a throwback party! Like, maybe a whole day with everything looking as it did in 2005! Ooh, and we can have different colored hats than the beta testers!! Will you give it a shot, please?", "when you will come out ?", "una pregunta  cuando me meto a club penguin y le apreto en juegar no se puede por que me sale un cuadro del dia de brujas y me sale un cuadro q dice mas informacion por eso lla no s epuede meter acada ratito me sale", "All of them are my favorite, but mostly I like the gold puffle.'", "Happy Earth Day Club Penguin! And to all of course! :) :)", "club penguin por favor me puedes dar un pin de membresia", "Eu fiz esse teste e passei", "pero por que el pufle caafe es temor", "I have cancelled my club penguin account 4 times and keep getting billed.  No one in your billing responds.   You just charged me again!   This has been going on for months.  My next call is to the BBB", "Fix it duck and the rainbow fairies books", "club penguin i had membership on club penguin im Mavic1 i keep track of when it ended but it ended 1 week early what can i do", "I am prince CCC\nThe best player", "club penguin mis juegos de pasatiempo", "y  lo  mas  mejor    es  cadence", "The music In games such as hydro hopper and pizza tron are still not working.", "to doido para o dia chegar", "Bons tempos de Club Penguin  <3 , quando eu era guri eu jogava muito, ainda entro de vez em quando pra matar a saudade xD", "I play club penguin every single day", "Ooh, those models look pretty good. Hype!", "It sounds great but they will recycle the parties so that they are not forgotten and are remembered ? :)", "Hello and welcome to Club \"go see our new movies\" penguin", "for club penguin i have my chat is set at standard safe chat and the chat isnt working, what should i do?", "Me gusta mucho #CLUB #PENGUIN quisiera que algun dia vinieran a Peru <3", "Jazmine Green Is this what you meant?", "Club Penguin can you make a apps for andriod? Please Thank u", "CP is love CP is life", "Quando que vai sair o projeto super secreto?", "I love you club Penguin s2", "I love club penguin not much candy", "hi club penugin can i have a membership :) :) :) :(", "club penguin es lo mas cool que e visto y jugado :3", "it will be a game for iPhone ?", "Hi Club Penguin! my name is Allisiya in the game, i'm just wondering if you could make a party called \"Meet The Celebrities\" so here how it works: the penguins will meet one celebrity every two days [ example: Cadence will be there in the party then next two days is Rockhopper ] and of course they will receive an item whenever a celebrity visits, one non - member [ which is for everyone ] and one for members... But its okay if wont make the party, I just dreamed about it last night so, what I can say about this is, THE BEST GAME EVER!!", "How do you become a penguin of the week? I have been trying for 2 years.", "Por culpa del juego de quitar las misiones de la EPF nadie sabe que el oso es vegetariano :C", "Like por los que quieran que comienze ya!!", "amigos me asen una cuenta activada en club penguin", "excuse me club penguin HQ i got a problem i just got membership today and i go login then a glitch came then i restart then my membership please fix it  my username on club penguin is dragonfan903", "meu amigos no jogo sumiram..oque aconteco pq nao tenho mais nenhum", "Good job Club Penguin ;) (y)", "The old dot didn't have color in her hair.", "Linda so I'm guessing we're not playing today", "I'm more of a manga person! I think I predict events in manga! Especially Pokemon XY!", "What excites me is: classes only in September and is summer :D", "Mande un correo y no me llega Club Penguin no se que hacer no se activa pofa espero mi correo .. :(", "club penguin quiero que venga a la tienda de republica dominicana que vengan los productos de club penguin a las tiendas de republica domonicana", "menos mal ne club penguin sere socio en poco tiempo jaja sere bueno como los demas adios pinguino sin socio", "i cant wait for the inside out party i think its going to be awesome!", "I knew Spike hike will leave the club penguin", "my name is eva 2805 i love your videogame", "i dont understand why i cant write my own sentences anymore. after i verified my account i chose the setting to play with the chat bar", "falta 3 dias ebaaaaa ainda bem que sou assinante", "there is club penguin for android mobiles ?", "Wife calls husband: Window is not working. Husband:put some oil it will work. After 10 min, Husband calls wife: Did window work?? Wife's reply: no windows did not open but laptop stopped working. #LOLOL", "i wish gary was my friend", "Acho que ele se assustou com ele mesmo!!! Hahahaha", "Is that a new club penguin app? If so plz tell me cuz I want it so bad.", "ola dono da page do cp na festa de natal eu ganhei o iglu de natal mas n aparece na abas onde ficam os iglus pf me ajudem", "HAPPY BIRTHDAY i wish you everything good for the moderators and for the game itself  <3  #10years", "Club Penguin I think you're confused that is not a dog that is a monstrosity", "club penguin coloca o evento do dinossauros de novo porfavor", "Is there a right handers day?", "Aun siendo mayor es bueno jugar algo como club penguin para no olvidar la infancia", "guats no the club penguin ait delmecat", "i miss the OLD Club Penguin :(", "Awesome!!!! Club Penguin should totally give puffles emojis!", "While I love Club Penguin, non-members can't do anything on there. It just now happened a couple months ago that members were able to get decent clothing. Non-members can only have 2 puffles, while members are able to get an unlimited number of puffles. They are also able to take better care of them because they have more available resources such as beds and food trays. Eventually club penguin will loose majority if their players since 2/3 of players are non-members, and they are being treated this way. Not everybody can afford to buy continuous months of membership. This also goes for Animal Jam, only Animal Jam is worse than this.", "furia furia furia furiamyamorcito querido como estas mucho calor ehh pss jajajajajajajajajajajajajajajajajaja", "I hope theres another big EPF Operation this year ^.^", "Not releasing it on Disney channel this time? What about iTunes?", "I don't like the \"CP army\" thing going on either. Quite beside safety, which is already a problem, it also takes away from the enjoyment of the game by the massive spamming", "Maybe a puffle with black puffle face but the color is red and blonde hair :v", "maybe he ran out of some puffle'o foods hahah", "Hello! When you become a member at the club, and subscribe for one month. When we finished things left in my possession or disappear?", "i play it alot and to be honest im not happy.i hate that we need memberships for certain things not everyone can afford a membership you know its not that easy to buy something like that,i think its completely unfair that you have to spend alot of money just because of a membership.im asking you to get rid of memberships because its not needed.", "I have a real concern about player safety with all of the autotyping members constantly directing players to outside websites. This clearly poses risks to young players and is against Club Penguin rules. And yet it goes on and on. Yes parents and players have a responsibility towards their own safety and Club Penguin has a responsibility too around ensuring a safe environment.", "When will the rubber ducky floats be released again. I have been a member since 2008 kind of sad I never picked one up. You guys have a stamp that when you use a rubber ducky float in water you can get it. But it's kind of impossible if you guys don't have it out anymore. Will the rubber ducky pool float ever come back?", "*R5 song begins to play* :P", "Take me back to grade 8 man holy", "The party can be a good party...", "Project Super secret is\nLooking good!  Miss you guys!", "Hey guys, I was thinking about create a group in Whatsapp for us to talk about the game, share theorys, tricks, that stuff, I promise well have interesting subjects, if you wanna join in, messages me or put you number here, thanks", "hebert planea conquistar todo club penguin planea algo en abril muy sospechoso", "when the app it will be able in other countrys???", "gracias este es el mejor juego de la vida", "Happy new year 2016 to all of you and is that 3D penguin a part of PROJECTSUPERSECRET", "miren club penguin me dise tenes 7 dias para abrir tu cuenta pero no se como ayuda", "Que finoooooooooooooooo  la ropa  de  desen dientes", "Anyone else having trouble logging in?", "Se nota que es Perry el ornitorrinco de Phineas y Pherb", "no llego el correo de aceptacion de mi hija", "si asi fuese club penguin seria rechulo y con misiones y demas", "Bonjour Clubpenguin je voudrais avoir un mail pour vous contacter merci :)", "I love sorry muy phone  is very  very sou sou", "hola club penguin para que son las tarjetas de juego", "igual yo estoy en club penguin", "This Party Looking Dory is Very Good Hope Parties in Club Penguin Good So What Not The Looking Dory xD", "Hey can u update club penguin in the tablet that i can fight in dojo with other players pls", "So cute I have one to she name is Mimy. :)", "I can't get on on the website. The pop up message says that the site was not found. Are you guys working on the site or something?", "And people still complain about the old CP being better than the actual one. Geez, you guys gotta acept the things like how they are. Acept it, your lovely old CP it's dead, don't like the new? Go away plz.", "waking up and realizing my membership expired 2 years ago...", "hello association of club penguin wanted to know if I could leave my penguin on one of his videos", "Club penguin something make me weird cuz I have a penguin it name is cooler702 he was a member until I log out and log in again and now he not a member anymore what the heck happened plz reply", "club penguin eo maior do mundo da minha vida", "In my country is the \"pollo a la brasa\" day :D", "Quisiera darme de baja, que debo hacer?", "Club Penguin Pongan mas modas Plis esque quiero comprar nueva ropa", "Honestly this time the anniversary wasnt that great.", "But how to get member ship", "Club Penguin should start the Process of switching to HTML5 since Flash is now dead.", "I still have that account from way!!! Back in like 2008 lol", "Can someone tell me how to help my son get into the prehistoric party to get a dino puffle.", "This is my favorite party! I donate approximately all of my money", "Please no more pop culture references.", "no me a llegado para poder hablar hay porfa envienme el cuestion", "You finally did something right, CP.", "hi club penguin team why i can't see the dress of the vote?!?!", "club penguin es delo mejor ok", "Why penguins cant hide in the corner?\nBecause There is no corner on an Igloo!", "o gente alguem pode min da uma dica de onde eu acho o rookie", "why are we not shrinking in other places like dock, that makes it no fun :", "Happy candy day?!!?!!?!! Hahahaha.... Happy halloween to you too!", "why need to be a email why dont add it??", "I like haloween and club penguin", "Ignore button DOES'T work! Servers are OVERWHELMED with these autotyping cube penguin army bots directing players to external websites to be given memberships. I will STOP ALLOWING MY CHILDREN TO PLAY Club PenguinN IF YOU DO NOT SORT THIS OUT! Fpr pity's sake- this is supposed to be a safe environment and it isn't and you can't even ignore them because the function doesn't work.", "Club penguin i didn't get any mail about activation thing. Maybe you want to delete my account. Username CoolGaming9", "qualtas meias o senhor G tem", "Oigan agan clud penguin para el salvador", "Pls make club penguin available in Cyprus", "yo no soy socia es injuto para otras personas", "When did club penguin died in 2014", "i try to adopt a Alien Puffle but it keeps saying \"You have the maximum number of Puffles\", even though i have the average amount (10-15)", "Beatriz Adara Torres Dominguez , some people don't have the money for the membership.", "What is happiness in club penguin this year? It is great. So i'm in love with #projectsupersecret #CpOn3d", "Te hamo Club Penguin dame un like :v", "Billy Garrigus ever play club penguin?", "Herbert's paper says OPERATION...That means an Operation this year??!!", "nesecito ayuda,tengo 442 amigos pero cuando entro a cp no tengo ningun amigo, pero si entro en la app cp tengo mis amigos.Informe esto con el blog y no he tenido respuesta", "I'm gonna need to have a calendar for special occasions like this.", "I played this game 5 years ago!", "Aja yo ise todo y como ago para poner la roca en donde andava para que funcione la nave porque  si no ponemos la roca como la nave funcionara la roca la tiene herbert", "se parece a perry de phineas y ferb en modo pinguino XDDD", "Jazmin Robles reunited and it feels so good", "hola esto deveria ser gratis osea sin socio porque en realidad pocos pueden pagar eso", "yo no soy socia y no tengo el puffle gato", "I like it club penguin is the best disney game", "a nao FIVE NIGHTS AT FREDDYS serio tenho medo do fox dai vou la jogo dai vejo ele eu desmaio :( :)", "verry good game i love it", "This is gonna be Lit!! Aislinn Matt", "Jahlein Ciel Astillero Is My BFF And Like Sister( We Are Not Sisters).", "What's up with everyday phone facility? Why is it closed and when will It open?", "total fashionistas on this game are screaming \"YES!!!!!\" in their heads right now", "please help!! I tried to login but it says that the password is wrong so i try to reset it, but when i enter my e-mail it says it's wrong", "feliz ano novo para todos que jogam club penguin", "hey, club penguin. can you add more hairs (includes and girls hair), body clothes, feet items and maybe 2 eyelashes for the penguins are not members?", "Te pusiste fome club penguin culiao erai mejor en el 2008 ctm", "Why not someday make a Pirates of the Caribean party? (in this party it will be a Pirate War will be involving Rockhopper, and Bearbossa (The club penguin , and Herbert gran, gran dauther, and pirate captain, of the Jolly Rogers) the place of the war is in Rockhopper's Island, in this party, the penguins will help Rockhopper to attack Bearbossa's Crew (using the Pirate sword mechanics) and defating Bearbossa, and save Rockhopper's Island from this notorious pirate captain! (Do you like my party idea?)", "my little sister rock on music", "una pregunta en donde estabas en club", "When will it be till the next stupid theme -.-", "Furries version of puffles I guess.", "Cuando saldra la app. Mix Disney", "me gusta club penguin pero por favor quiten la membresia lo socios no pueden seguir siendo los que siempre tienen todo", "Yo ya hice el cuestionario de seguridad", "Your team did a fantastic job making this and all the contributers art is awesome!", "aoarece assim vc pode ativar sua conta em 3 dias restantes", "Its rookies a d i love herbert", "CHEGARAO NOVAS COISA DO PASSADO DO FUTURO E MUITO MAIS A E SE VCS QUISEREM EU SOU PROTAGONISTA DO JORNAL CLUB PENGUIN NEWS!!!!CURTEM ESSE MARAVILHOSSO MUNDO DE MAGIAS!!!", "No me deja agarrar a mis puffles ...", "eso no esta en club penguin", "OMG!!! the last aniversary I celebrate was the 4th!! I'm too old, last thursday was my 22 birthday jajaja", "me gusta club penguin pero porfavorr", "I suggest you put more things such as transport things like that and we can travel by plane thanks. :D", "hi club penguin me podran agregar  como amigo en club penguin soy cluacluac", "Ive hated the game since disney took over Everything is memberships", "Pretty odd pic seeing as Puffle wild is now out of commision...", "no me llega el codigo de activacion", "I love my mouse (Reast in Peace)", "seria legal um the club penguin movie para ano que vem", "lla  lo   tenia    mami", "feliz natal,e boas festas para toda a equipe CP <3 :D", "As if I thought CP couldnt get any better", "Hahaj, Dj Cadence in the background", "Vendo conta Club Penguin com mais de 5mil itens,inclusive itens Raros.Conta com 2300 dias de vida(6anos e 300 dias) WPP PARA CONTATO: 21 9 97693009 Deixo logar na conta antes da compra!", "Make Da Fall Fair Come Back Pls", "your not to hungry for puffle o berries", "Get rid of the autotyping adverts!", "COULD YOU DO A herbert takeover rescus=e gary and rockhopper and we have too save thrm", "hay un gran porcentaje de no socios en club penguin deberian de mejorar los ambitos como de poder adoptar mas puffles, poder comprar decoraciones para los iglus. etc", "What servers will he be on most of the time?", "Write them a letter telling them all the things I love about them <3 And thank them for always being there for me :)", "love cp is the world s best...............", "Quem quiser ser assinante me chama no chat", "club penguin my best games ever", "Club Penguin, love your game but we have a claim; everything is only for members, others who are not members can only buy things just a little todom and partners, and also should not charge money for it is just a game", "I think rockhopper will lost his memories and the cheese is cursed right??", "uy si eso es horrible XD", "Rambol Catkitty look -3o Herbert P. bear up to no good B/", "I have been trying to delete my child's account forever. Couldn't do it. Finally cancelled my debit card. You still charged it. Can't update anything or buy anything until you are paid, again, for nothing. Not happy with you.", "Club Penguin todo mundo do meu iglu adora os ninjas  :D", "Hola Club pengui yo nada mas queria decir q  creo yo q seria mas divertido q todos tubieran membresia sin q nadie pagara xq si no se aburren en especial yo xq no puedo pagar una solo quiero  q todos puedan tener lo mismo de la membresia sin tener q pagar gracias", "quien me dice como ser socio :( buaaa porfavor :,(", "Daughter tried to enter a code no matter which ones she tries it won't take it and says try again in 45 minutes?  Club Penguin", "I don't even know what this show is. ._.", "Yo tengo membrecia y ya lo tengooo esta copado y me llamo torres49 soy cinta negra y soy socio", "as I can get a multicolored puffle", "I will throw a celebration party with everything my friend likes", "Como se activa la centaa :)", "anyone else having trouble getting on club penguin", "i like this game very much , it's a piece of cake the questions for cpf", "Hui Qing there all gonna be mine soon", "My penguin is 3000+ days old...back in 2008 when Mimo777 used to rule and Rockhopper used to visit", "loved this game alot made my child hood awesome was playing from a long time but had to go bought memberships lots of time and it was a good go thank you club penguin for making my child hood awesome ;)", "solo tengo el celeste y el rojo", "For example the party that made the new film Looking For Dori and wanted to buy a costume and it said only PARTNERS", "All the clothes for everyone is so lame. It's costumes from like a millions years ago.\n\nRare costumes aren't really rare anymore due to it being in this now. We non members look like absolute trash while members look like celebrities.....", "hola club penguin sera que me pueden ayudar a tener una membresia gratis", "I need help with the maze. I can't get to the star. My friend request is not showing up. Can someone please help me?", "Why won't you get rid of the autotyping spam?", "amazing I will see rockhopper again that's amazing i can't to meet him again!", "Thank you for making my childhood amazing but I stopped playing when O got an Xbox360 and Xbox One", "si andres yo no soy socio", "Hola Club Penguin, me encanta su juego, pero me gustaria que hubiera mas ropa para los que no son miembros, por favor tomen en cuenta mi sugerencia, gracias.", "club penguin qual senha de cadence", "I'm a freshman in high school but I still love club penguin.  Just extended my membership another 12 months.  I've been focusing on ROBLOX but it is getting worse while CP is improving drastically.", "me gusta club penguin pero por favor quiten la membresia lo socios no pueden seguir siendo los que siempre tene", "hello club penguin they can give five night at freddys pliss", "I think there's so much cool stuff for members ( even I can't buy it ) but I still love club penguin", "Please put me penguin of the week  louis2015", "11 years?  I play since the 3rd anniversary! (But I'm 18 and I'm extremely embarrassed of still owning my penguin account)", ":c lo malko es que no tengo plata y nunca me e podido comprar una menbre porfa alguien me ragal un monton de menvres gregen porfa :,(", "I love I love party inside out I like club penguin now", "club penguin no se como ser socia", "What LOL is this? Amazing, this club penguin update like me. What's the adventure that will start coming soon? Wait, wait...club penguin PSS is the MAX", "Todo Porque por no ser Socio :V", "mmm club penguin y la fiesta de zootopia? Hace un rato me conecte y no habia nada :(", "What if Herbert P. Bear IS the Teddy Bear? DOG PILE!", "esta cool y me divierte pero nome gusto que no me lleva a donde quiero ir ala pizza", "I miss the stage from club penguin :(\nAre u?", "I would have send in a fan art if I knew your making a new song", "Club penguin como puedo ser socio", "Ok please let me know if the date changes", "Bring back the old club penguin! Please stop making disney themed parties.... miss the old club penguin :(", "el  juego  es  genial", "Well! This Is Certainly Going To Be Like The Matrix & Inside Out Combined On Club Penguin!", "When I click for the safety quiz, I can't click anything else. Like the website hangs ( not my system). Can you help me out? :/", "whats that idk  what is it for a non member or both? :/", "Way I cAnt sig in my club penguin lovely kf", "Ken Sell omg this is so you", "go to blizzard right now- you can't see the screen for all of the spam.  Club Penguin isn't what it used to be...", "ai uma conta KiKiTo3 senha 651902ag", "YESS ELEVEN YEARS WOO HOOO! I LOVE THIS GAME!!!", "I think I know who this character is perry the platypus from phineas and ferb", "ES FEO POR QUE SOLO LOS SOCIOS COMPRAN Y LOS OTROS NO SOLO ROPA FEA", "Reagalo menbresias de una semana gratis ponganse en contacto con mi face (palabra para los que quieran la menbresia es pez) para mas informacion mi facebook Jims Kevin", "But for me I don,t have member ship and how to get it I can't buy anising but my big brother can how I ask my brother but he don,t no my did siste,r do its for him ??????", "bring the old club penguin back from 2007 plz", "Got login issues again. Help? I messaged your support team already", "por que club penguin no sirbe", "Yes :D happ new year for all fellow penguins out there, but especielly for the staff of Club Penguin :D", "como  se  juega  esto", "sou a nojinho sou identica a ela odeio brocolis e sou muito ``frescurenta`` com insetos ratos e baratas .... entao eu sou a puffle preto", "lets play club penguin and run in world", "awesome i'm full carditsu fire snow and water ninja i hop they will add something new like a rock ninja or something", "The ignore button still doesn't work. Is there a limit on the number of penguins we are allowed to ignore? If you allow the servers to be filled up with autotyping bots and the ignore button has stopped working how are we to avoid being overwhelmed by this? It would be nice to actually have a response.", "como ativo minha conta sou novo nesse jogo", "me encANTA CP  PERO no soy socio", "I have a problem. Why can't I get my rainbow puffle? I was right beside it and it wouldn't load so I could name it...", "And NOT sorting out the constant overwhelming SPAM", "Will there be a Penguin/Polar Bear meet-up on Easter?", "WHAT?! I can't wait for this. I'm so exciting", "I was gonna thank you for a awesome game, which you do have, but I want to give you a Big THANK YOU for having the next party be Disney Descendants!!!!", "club penguin porque ao da pra falar agora", "todo para los socios y nada para los no socios deberian aceptar cualquier formato  de pago por que cuando yo pongo mi numero de tarjeta me dice: club penguin no acepta es te tipo de formato de pago. Se supone que tienen que aceptar cualquier formato de pago", "I was gonna thank you for a awesome game!", "CP i can be penguin of week i played for years", "I loged on in the moring", "porfa regalen una membresia vien echo por el parque pero al gunaos no difrutan en clud penguin", "quieren ser mis amigos soy melange777", "yo no soy socia y quiero ser pero no tengo las targetas de las cuales dicen pagar por fa que ya no existan los socios que todos los articulos sean para todos", "Nice animation, but i hope it isn't permanent. I love the old stype", "I love club penguin best game <3 Game since of March 2014 sarted to play at the party Muppets ande then the next month the feast of Puffles won subscriber, haha and every year gain the egg CP *-* <3", "feliz anop novo club penguin adoro jogar seu jogo!", "Club penguin no puedo entrar a CP porqueeee!!!!!!", "porque en club penguin solo tienes que ser socio si quieres adoptar a un puffle no puedes al rosa al amarillo,etc nda ningun juego si no eres socioooooooo", "doa-se conta femenina no club penguin,envie mensagem para esse facebook:Marina Mendes//donates realized femenina in club penguin , send message to this facebook : Marina Mendes", "I was just at command room with Gary lol!!!", "Haven't been able to login all day today.", "Franky Chacon dude get online hurry", "but I have no money for membership", "millos tu papa jaja el q sea", "When is club penguin going to get Rockhopper back?My child never got to see him in the game :(", "quem quiser ser assinante chama no chat", "And i think old the penguins we can see dot tomorow in the party", "en club penguin en mi pais argentina muestran posho rico", "Hi cp i want to be the penguin of week i have 5 years in cp and i have toys,cards of card jitsu and puffle toys please mi penguin is Chavo Del 75", "Hey..I cant log in :( could you um help puhlease :)", "mis puffles estan intusiasmados con las galletas sobre todo el perro", "las actualizaciones se estan empezando a ver por ejemplo el arbol de navidad del fuerte nevado eso es lo unico q se nota", "In the beginning comes a magic chest :v"]