["Got a 1500 would have been much more satisfied if the tables converted to a higher score.", "Same lol", "does anyone remember the one that was in terms of a and was like a triangle?", "Hey, I have been using Dr. Chung's book for Math and I love it! The tips are very useful and quick. The practice tests are pretty hard, but it helped me become more confident about the harder questions.", "^ im sorry but if I asked that question at my school, people would say \"can your mom confirm\" ....lol...", "I'm scoring around 1460 reading seems to be a problem for me. I miss around 7 a section", "What was the topic of improving paragraphs", "I called college board an hour ago and they told me that the date on the admission ticket will still say january 23 but it will say make up on it", "Did anyone have the 2 passages arguing for woman's rights or something like that? I found the questions to those passages a little tricky.", "2190 this time (CR 670 M 770 W 750)", "Cool story ^", "With a 2160 do I have a reasonable chance at like a lower end ivy like Cornell or Brown? My super score is 720 cr 750 m 690 wr", "For the implicit and explicit one I said that they were both still widely known because passage 1 was basically saying that it persevered through ages and the second one was inquiring why were people still so into it even htough it was meant for entertainment", "Hey guys what was the sentence error from the writing passage?", "well thats dumb. i just decided to do some research too. whats hard to them isnt to others and the same applies for whats easy... stupid.", "Hah yeah the \"Passage about a drug that is used to increase the Flu vaccines effectiveness\" is word for word what I said in the reddit post.", "Will they use the same curve or another curve?", "I missed 4 math on my last test and got a 680 so missing 2 and getting 750 is not harsh", "after. focus on the ap exam as it is the most important thing right now. imo.", "Thanks! So (apart from reading past CC SAT threads), how does everyone know it was reused?", "I think I probably got 1-2 wrong on the reading section and about the same number wrong on the math section with calculator. Pretty confident that I got every question on the writing section, but there's always a possibility that I made a stupid mistake somewhere.", "Who remembers the 4 Ds in a row with 1-4 on a math section", "when will sat be out in nyc?", "What was the answer to the math question about forming committees of 3 people where the 3 department had 30, 20, and 20 members?", "Guys what the one with the squares and you have to find the value of X a grid in?", "Was there a doction question?", "For the curtains and blinds question, there was an error. Common idioms. The question stated \"between moving the _curtains or the blinds_\". The idiom is always \"between A AND B\". Therefore, it should that part of the question is wrong, it cannot be \"or\" and should be corrected to \"and\".", "I don't know if I'm interested in an Ivy Leagues yet, but I just want to know if any of y'all think they distinguish a 2290 from, say, a 2350.", "technically cb can release scores between 11th and 18th but it would be ideal if its tomorrow", "i put she didnt think deatils are important", "Went from a 2200 (680 CR, 770 M, 750 W) on the October sitting to a 2290 on this one (760 CR, 740 M, 790 W). Although I'm a little upset I couldn't get an 800 M like I was expecting, overall I'm pretty happy because I was so sure that I did badly on the January test. Congrats to everyone who reached their goals, and if not, there's always the new SAT or the ACT!", "So what you guys are saying is that that they might reuse the December 2013 curve or the January 2016 curve?", "Man I got a 2400 on a practice test I took today and a practice I took just last week.....hopefully I can do the same on test day but I seriously doubt it lol. I'm just focusing on learning more vocab and developing my essay more now.", "^That's what I thought. You're right about most likely doing better with more schooling.", "I've taken 3 of the tests and compared to the old test I've been doing much better. On two I received just about 1500 and the third was in the 1400s.", "20 minutes!!!!!!!! (Im awake because I have to study for a math test)", "For those of you who got 800 on CR, how many questions did you miss? I missed 5 and got 730. I think it 's reasonable, but just wondering.", "Aw man alright. Did much better on the writer than the Trinidad.", "I'm getting 1700 on practice tests, how should I approach increasing this to 2000+? I'm weakest on Math and Writing.", "When do scores come out in California? 5am or 2am?", "I have to wait til March 18th", "This score is unimportant guys. It's just the tip if the iceberg.", "why are the release times so staggered?", "I said hastily. And yes slothful", "\"Laud\", I think.", "The question was A + A = B^2", "I was so excited when it changed. Gah.", "What was the synonym for furiously on the amoeba passage? the answer choices were like intensely, angrily, noisily, hastily and something else.", "Hey guys where can I find an online version of the direct hits words?", "what was the astronomy passage question w/ conducting preliminary studies or collect data?", "The consensus seems to be that a new SAT's score is less valuable than an equal score on the old SAT. According to the converter app, my old SAT score (1950/1300) equates to a 1380 on the new one. Would a converted 1380 give me any better footing than a 1300 or not, since it's the same thing?", "Did no one get 4 Ds in a row for math??", "I had transformation", "experimental. i had one about Hollywood and film, the 20 min one, and 2 others i dont remember. anyone else?", "Yes. I think answer is overturned-> overturn.  Since it says as the popularity continues to grow", "There's a thing called My Score Report and it gives you a breakdown of how many you got wrong", "Did anyone else have math section 2 and 4 that were both 20 questions? If so, which do you think was the experimental section?", "I think the writing curve was so harsh because it was so easy this time.", "Does it really matter if I only included one supporting example for my essay (about leaders)? I had a pretty decent intro, body, and concluding paragraph but only one example.", "Also, what was the answer to the paradox question? And was it ominous or general confusion? If someone could answer these three that would be lovely.", "1580!", "Good luck everyone!", "You guys can all get caught for exposing the test questions.", "almost certain it said consecutive like 96% sure. If it didnt then thats sad on my part. Given that is was q 3 you could be right", "Where can I find the June 2014 test? I checked crack but the test on there was completely different", "I put \"by failing\"", "On the writing question about the mom solving issues with her dorm roommate and becoming friends, was the correct answer the sentence that started with \"but\" or is that grammatically incorrect?", "If i take the December SAT, can the scores still go to UCs???", "i said b", "Does anyone have a rough idea of what the curve will be", "By the way, I wouldn't worry too much about the low essay scores.  It's a brand-new test and the format of the SAT essay has been drastically changed.  For what it's worth, low essay scores relative to other scores has been a huge problem on the new ACT as well:", "the \"biased\" option, in my opinion, is incorrect.", "There is no QAS for June. Only October, January, and May.", "My test got rescheduled to Feb. 20th...another miserable month of studying!", "what did you guys put for the last question of the passage about dark matters (last reading secition) it was like which does the passage support, I chose intuition is as important as scientific evidence. Is it right?", "I wish i get 800 in CR though. My answers on questions in which i got confused matched with the general perception over here. But I've never scored 800 in practice test even. Usually around 750 so pretty unlikely.", "What did you get for the question in atlantis about explicitly stated in passage 1 and implicit in passage 2???", "I was debating finicky and dainty. Then I ended up picking dainty because dainty seems like more ornate+finicky, so yea.", "no I think at 5 am eastern time", "What's the personality of that writer? I put witty and egotistic, anyone?", "It's a College Board app. They used the official concordance table, but there might be some discrepancies regarding which table they used between subjects.", "Was the sentence fix one clothes strewn or strewn clothes?", "Can someone tell me the difference between SAT and SAT with Essay? \"With Essay\" is like ACT with writing? The colleges my D is interested in have not updated their websites to accommodate the new SAT. They just say SAT and two Subject Tests or ACT with Writing. If they are asking ACT with writing, should she register for SAT with Essay?", "What was the one at the short writing section towards the end with the Japanese art form and the choices were A)Beginning.... B)Beginning..... C)Began.....,it disputed..... don't really remember the question though but that was the general gist of it (I picked C, but the comma and then it disputed sounded weird, but all the other answers began weirdly)", "Rationale was also right !! I cant believe reading was better than my math this is crazy and amazing", "Could someone please tell me what the math experimental was? Thanks", "My essay was a 12 for the ages. Hopefully it can carry my writing section to a 750+.", "What happened with Collegeboard site? I found it is down. Maybe they released the score early?", "Do we actually get to find out which answers were correct? I thought we just found out our scores.", "Emphatic vs analytical?", "2220", "There was a person who said his son only wrote an introduction paragraph and still got a 7. One of my friends got a 9 and he only wrote 1 page.", "CR: 740", "me too", "I am leaving the house! Good Luck Everyone!!", "Who here is predicting a 2400 for themselves? is it you juicy mango...hmmmm????", "770 cr 800 math 770 wr", "Hey guys!", "It is pretty clear that each question is weighted differently. My kids missed quite a few (5 & 6) questions in the reading section, but apparently they were the right questions to miss. Each question is weighted for difficulty. I would guess that, as long as the questions you missed are difficult ones your score doesn't drop as much. My kids took the SAT in Jr. High for a talent search and they got feedback as to how many hard/medium/easy questions they missed. I think they are still doing that, but not being transparent about it.", "Well, we all need good luck since this is our last time that we can take the old SAT, and there is no way I'm taking the new SAT. It's too risky.", "why is \"dismissive\" correct?  both \"incredulous\" and \"dismissive\" are negative attitudes. I think it's more \"incredulous\" since 1)the choice for the other question: the author casts doubt on = incredulous  2)it also gives a paragraph of the opposing views. clearly it doesn't dismiss it just highly doubts it.", "Wait until 8am eastern because that's technically when all the scores are supposed to be out", "i personally thought the math was harder than in june and the reading was easier than it was on the june test. thats just me though", "hey what were everybody's essay prompts?", "30", "Heres my advice -- quit the apps (except SAT QOTD)", "If I got the gullivers one wrong, I'm definitely not getting an 800", "I missed 4 and got a 750 in CR. Isn't -2 almost always an 800 in CR? It's a shame that the curve is so hard at the top.", "for the math question with miles. the answer is 0.5 but i put 1/2. will mine be correct also?", "If they reuse any curve, it will be the curve for the December 2013 test I think. Or else there may be a completely new curve for this test.", "Is college confidential on the general consensus that the correct answers were provide a rationale and emphasizes relative unimportance of details?", "also, what do you guys think -1 on math mc?", "Yeah, I remember it saying AD and CD were the same length. If it had been AB and CD, I would have spent much less time trying to figure out why the question didn't say \"possible answer\".", "Many colleges have commented on their websites that they will not require the new sat essay portion.", "Just hoping for at least a 1400!", "Someone posted the curve somewhere. I think it was 3 wrong and 1 omit is below a 700. I mean, math was fairly easy, just some tricky questions. The only hard problem was the last question in the 20 question section. I made a lot of stupid mistakes though.", "I get 700+ on math but I Need any advice in the english part especially the cr", "I just got off of the phone with CB and they said mine were still being processed as of today?? so idk what's up this sucks i was excited", "Said I wouldn't check but I did, but not yet available anyway", "I thought it said something like 3 points converge on one side of the line, if so each angle has its respective on the other side", "Hey guys i canceled my score so i cant see what i got. But judging from the scores u got what would i get with 6 wrong reading, and 2 wrong writing and 8 on essay? My math would be a 770.", "I think we can all agree that this test was quite a humbling experience...", "Yes, for the MARCH SAT.. Not April", "The 2:3 angle question was 180/5 = 36 - - - 36 * 3 = 108", "I do not remember that question ..", "2 wrong was 800 for CR", "12 11/12", "I had four math sections but I didn't have the plant growth and science related stuff..anyone..else?", "It was 12", "How did kids have the answer key", "Lol plus you don't have the parents I have who are disappointed with my score.......some families value some things over others.", "I used a historical and personal on my essay and I used a personal example before on the SAT essay. >>", "740 800 720-740", "So it said to add? Therefore supplemented right?", "Can anyone please explain its not emphatic? Also why would the origin of zen have anything to do with the passage? Wasn't her purpose to show why her mother acted that way? Therefore, it should be rationale behind the decision", "What abt essay? Is it the same? Mine is discussing about responsibolities/obligations...", "Wait until 8. If it's not up by then, today's probably not the day.", "dang it did not want to ruin my friday", "I mean not important", "no, it is wrong lol,... but it is contrast to", "My test was rescheduled from January 23rd to Febuary 20th but my admission ticket is not updated... Does anyone else have the same problem?", "-4 never happened", "anyone remember the US December SAT Critical Reading curve?", "It was also recommended not to study today, but I don't feel as If I studied enough vocab words. Would it be okay If I studied some a bit??? I memorized 60+ words. .. (I had to volunteer during the summer)", "I'm excited though :')", "i got a lot of C's.. and i put 'no change' for some of them too.", "Also, for", "The wait is on", "I'm pretty damn sure it was find x as well, who else agrees besides", "why does azwu always get to start the threads", "I have to take the ACT too because my school requires us to", "did anybody else not get their scores yet?", "Ok thanks", "NJ: nothing ugh the anxiety is killing me.", "yeah it was harder but there are just so many people taking it that get 800s", "What the hell", "But if he started it, wouldnt that mean he had a ton of bearing on it ...", "Hey guys, what did you guys say for the one question where it asks about measuring the planet movement or something like that, and asked which assumption it was based on? I put disprove other hypothese because I thought the guy disproved an observation at the end.", "Oh wow. I feel so dumb now for missing that question that was easy", "oops yes it was probably the standard question. Although now that i think about it, uniform seems to fit better than accepted for the meaning of standard. : /", "curve predictions???", "What did you all get for the fixing sentences one about the chillies?", "well accoridng to him, the curve will be terrible for the most part. Also, the CB's claim that they pre determine curves is false. They only create curves after figuring out everyone's raw score.", "Is it possible to miss 1 in W, get a 10 on the essay, and still get 800 in W?", "Anyone have any advice on how to get an 800 on the writing section. I know pretty much all the tricks that college board has in stock since I have done a lot of practice tests. However, I always average 3-4 wrong on the two sections combined", "Isn't collegeboard technically not supposed to reuse exams? Cant we ask for another retake?", "So far, I know I missed at least 1 (finicky).", "Does anyone know if the retakes on the 27th will be the same? Or does anyone have ANY idea what they will reuse.?? Is there a pattern?", "just one more thing (because I can't rant off in public or to anybody else), the passage stated how the \"buzzing noise\" went away after a while. I felt that meant Marion got used to the whole American culture, which is an embodiment of an unfamiliar place. IDK, I might be reading too deep into all this, plus it's only 1 question", "I'd say once you get 800 in a section it's pretty easy to feel if the other sections will be 800's.", "Yea, the one about preserving and curating the past", "you had to square both sides. So it becomes 25<x<100.  I forgot, that was the experiment though. Cause I didnt finish that.", "Also want to know the answer to the math prof's hand gesture. I forgot what I put but am interested.", "I think I have to retake the SATs. My guidance counselor said 2230 isn't good enough lol", "How hard were the passages?", "i did the latter", "Not the reciprocal- it was the negative of the slope given", "What were your essay prompt??", "A solid 600", "I had 3 no errors", "Actually, I'm pretty convinced this was a 780ish test with a possibility of a 790. 770 means the test was very easy, which it was not. The section with the grid-ins was decently difficult so I think its more 780, but I wouldn't be surprised at all with a 770.", "i put normal; ___", "the reading passages was by far the hardest", "im gonna check it after school tomorrow so if its horrible i won't be depressed at school", "Looking back at the June 2014 questions it seems like there are a lot of similarities between the January 2016 test and the one taken in June 2014.", "Did anyone else do really badly in writing? I usually get 780-800 on writing but this time I somehow got a 730 and I thought it was really easy....", "The nerve-wracking anticipation", "They wouldn't be, that's bs and unsubstaniated", "Lol don't feel too bad! I'm with a 1730 so y'all are  pretty good....good at taking all the scholarships", "can I try for a prediction too?", "My experimental section was about parasitic birds and a a study done by Fetty at al. or something. It was like a reading section except it had bar graphs and asked which lines from the text would support each answer... It was really hard", "got a 2010 overall when I was expecting at least a 2150 since it's my first time.", "May 15th", "Damn. Nice scores ya'll. Lol I'm waiting on my score for the May exam. I thought 1400+ was comparable to 2200+ smh.", "Still, I hope the math curve isn't too harsh. I really hope I got at least a 2200, because although I have a chance to take an ACT and the new SAT before sending applications, it sounds like the new SAT will be easier on writing/reading and harder on math for me, and so will the ACT.. and math is my weakness", "no error for hat one", "Lol I'll just say to myself that I decreased in all my sections. I keep beating myself up over particular questions and who knows what I made! I'd rather be doubtful and then acknowledge the score than to be super optimistic and shocked if it's the opposite of what I expected.  \"Expect nothing and you will never be disappointed\" is my motto for this test take. (o3o)", "That screwed me then thought that since it was the last question it had to be the hardest", "Anybody taking may? I already know I screwed up on this one and signed up for the next, I want to be done with standardized testing by the summer. Any tips on the reading section?", "so in relation to the actual sat u took today, how hard are the blue book tests?", "Here's what one expert recommends:", "I think there were two questions involving therefore. For one of them, the answer was \"delete therefore\" but for the one", "i thought the math no calc was somewhat difficult, but for me the reading was by far the hardest.", "would 4 wrong be a 660 then?", "D: what happened", "The gulliver thing was about the Gulliver's Travels story, but the shipwreck part of it definitely did not sound correct to me. In fact, the answer with shipwreck in it was the first thing I dismissed because the use of \"Gulliver\" was to compare the author's actions/strength when handling the micro organisms with those represented in Guliver's Travels.", "7:30 not yet available.... THE ANXIETY AAAAAAAAAAH", "do the scores come out around 12 AM EST?", "But if anyone can help, can you pls explain this writing question to me. it's last question of section 10 of test 8 in the second blue book.", "When you guys are taking practice tests, are you all practicing with or without the essay. I feel that the new sat anaylsis essay is going to be more difficult to master than the old one.", "Son who is currently sophmore got 1550.  780 EBRW and 770 math.  He is interested in schools like Williams or IVY.  He has strong grades and extra-curriculars. Opinions on value of taking again for the few additional points? Sure he would love to focus on other stuff if not.", "the passage about teaching was the answer make a bold reasserment or dispel a perception", "hey what did you guys get for the 300 miles route question? I got .25 bc i thought it was 150 there and 150miles back. Is that right?", "here are my answers for the some of the free response, please check,", "I'm pretty sure the answer was finicky. Dainty means delicate while finicky means fussy about trivial details which is exactly what the question wanted.", "From what ive been hearing the past 4 makeups had almost the same exaxt questions", "i chose schism it wasnt experimental", "That kind of sucks,scores release(for February 27 test takers) most likely on March 18,the day before my birthday...hopefully my score is satisfactory.", "NOOOOOOOOOO", "Critical reading questions!", "We're students, it's what we do.", "My problem with perfect was that the author of the first described the depth of the struggle and the unease it brought him. Simply saying, \"the internet changes the way you think\", doesn't convey that struggle, and therefore it wouldn't be the \"perfect\" description. I don't see how anything could have been perfect which is why I strayed from that answer.", "If i normally get 2100+ on practice tests based off of cracksat how do u think I would do? Ik for a fact i missed 2-3 in math, a bunch in reading, and maybe 1-2 in writing. Please help!!!", "Can someone explain why my scores are not available yet?? Thanks", "How about in the zen passage: did anyone else say she wanted to challenge her students? The other options were mock something and show tiredness of her career.", "I'm freaking out and there's still 2 days left....", "Got an 800 CR:", "Anyone else think the concordance tables might be a bit tougher than actually true", "there are going to be a bunch of posts tomorrow huh... haha", "There is no indication that the March 2016 SAT scores are being cancelled.  There is an allegation that the March Test was leaked in China after it was taken in the USA.  There would be no rationale for cancelling any of the scores for students who sat for the exam in the USA.", "Not yet available:T", "I have 2 questions:", "Some girl asked the College Board Twitter when the scores would be up and the CB said \"we are releasing them throughout the day.\" If they we not up today, I'll be very mad.", "Were anyone else's reading scores really low? Mine seem crazy low based on practice test i have done.", "What did you guys put for the question where it asked for the length from A to B with the arrows pointing? Also, did you guys put incidentally for the grammar q.", "it all depends on the curve really", "So a perfect MC and a 9 on the essay is an 800? Screw the essay graders, if you look in the Blue Book the examples they give for a 4 essay (just 1 score not overall) are pretty bad and only 1 page long.......they graded really hard for this essay, especially considering the hard prompt.", "Hey, let's discuss everything - doubts and beliefs- about the test somewhere else...like google hangout. I'm from Asia and me test was quiet easy. What confuses me is that I got manny no errors in sentence error identification. Let me know soon through messaging i guess.", "My daughter has ACT composIte 36 and now has SAT 1530.Can anyone comment on if she should submit both scores on her applications to competitive schools or just the ACT?", "770 writing (-0 but 7 on the essay)", "What about the grid in one where it said square root of y-3 = the square root of x-2 + x? Was it 7?", "Junior here~Scored anywhere from 1800-2020 on practice tests. Hoping to get above a 1900 this test. Any last minute tips? Lowest score is Math ):", "yes it was randy", "Okay but if you plug in atyff", "for west coast students, is it still 5pm EST or 5pm PDT?", "4 was the radius, you had to use the formula (pi)(d) which is the circumference of a circle and being 2 semis, it was equivalent to a complete circle.", "Was the reading section with Africa the experimental section?", "Could anyone give me some insight about writing the wrong registration number? I've heard my test likely won't be cancelled, but is there any chance that it'll be released tomorrow like the rest? If anyone has experience with this kind of thing, I'd really like to hear about it.", "There is more than one piece of misinformation on this thread.", "I'm glad that the person who suggested for everyone to do an all nighter didn't do it because he would of been disappointed.", "I don't think they said that but I remember putting the answer because the passage said something like \"Plato created the story BUT(wasnt actually in caps but it's what triggered my answer) the story was mainly spread by word of mouth.\"", "This document pertains to the old SAT. Many top colleges have changed their policy this year since the SAT essay is now optional.", "Finally got to studying for this SAT. I guess I'll do an essay and a section each day.", "how come? The sentence before said that the mother didn't like the room mate matching. Therefore (lol), therefore marks a good transition into that sentence because it continues the logical flow. Idk im probably wrong just my thoughts.", "the test starts in less than 10 hours and I haven't even started studying yet...lol oops", "it means experimental section", "Can someone list out the answers they got on writing for the passage question at the end of the section?", "CR 670 M 680 W 770 2120 C", "Ahh only less than 8 hours to go but I'll be asleep during this long wait. I feel nervous now than I did on the day I took the SAT...sometimes I wonder if I set myself up for failure on purpose. I hope we all get to see our dream score or ranges of scores come true tomorrow morning! I'll be up by then when they come out, night people on the East coast! *_*", "If you ignore the non-essential clause then the answer becomes obvious.\"The legendary 19th century endurance rider Frank T. Hopkins also has become the hero of the Disney movie Hidalgo\" That doesn't sound right but \"The legendary 19th century endurance rider Frank T. Hopkins is the hero of the Disney movie Hidalgo\" sounds perfect.", "Which math question did you guys find hard? i got confused on the arc question but I ended up getting it somehow", "I check the site about 20 times a day - just in case they do another test load. No luck. I will report back here if I have luck!", "Wasn't this test the exact same test as the December 2013 one though?", "I liked the essay pretty well. I talked about Howard Roark from The Fountainhead and Warren Buffet, two uncompromising, effective leaders.", "for the farmer one i was confused on whether they were protesting corrupt government on farming economy or that other complex answer that i forgot", "Guys wat was the experimental section please answer asap", "I'm gonna be mad if that timber question is the one that screws up my CR score, because imo it was a very vague question with bad answer choices.", "For the question about Ptolemy's model, was it \"sophisticated but fundamentally flawed\" or \"poetic\"?", "I don't think I did too well in fact I may have done worse than my practice tests. I couldn't focus on Section 1 so I almost ran out of time and ended up rushing through the last reading section. I wasn't able to finish the No Calculation portion, which surprised me considering the fact that I always got perfect scores on them when I practiced. The Calculator and the essay sections were fairly easy, though.", "Got 2 wrong on CR, 1 on WR for sure", "the stupid dainty vs finicky one", "Hi! Does anyone know what a good score range for the new SAT would be? Thanks!", "At this point I would be ecstatic with a 760 or higher on both Math and CR.", "I'm starting to really think sinuous is not an error. Looking through google, sinuous is frequently used to describe Art Nouveau and it's also used alongside \"curvy\"", "anybody remember most of the questions and answers they put for the zen passage and the one with the dual one??", "What was the answer to the circle question with the unshaded and shaded portions?", "Whats my score if I got:", "It was 555 i think & okie i shall submit so now im at 1 omit 1 wrong cr", "the cycle of life continues: some will pass, some will retake", "All I have to say after thorough analysis is that the curves on this SAT were far from generous. They were pretty bad.", "I also had the prompt about developing many talents vs. focusing on a single skill, which I guess was the more leniently-graded one as -1 MC = 76/80 and an 11 essay scored 800, not 790.", "I got a 9 too when I thought my essay was amazing ! Whatever, time to study for November.", "Yep, 36 hours on the clock.", "Yup!", "Junior here, this is the first time I have taken the SAT.", "How was the question at all?", "10 essay, 78 mc - 790 writing", "Can anyone tell me what the Baboon question was? Like what was the sentence and what type of question was it?", "Does anyone know that answer to the circle problem, with XYPQ and radius 6? I thought it was not enough info given since you dk where the points are", "Hi joe I also want to know the answer to that question.", "The experimental section # is supposed to be the same for everyone regardless of form. (People can get math, reading, or writing as their experimental, but the section number should be the same).", "How important is the essay score?  Did pretty poorly there, but 1520 on the SAT score.", "I called and was barely able to understand the person who told me scores would be released throughout the day.  None of the kids in the room my son took his test in have gotten their scores yet.", "2300: 800 M, 800 W, 700 R. Not good enough for 7 year med unfortunately", "Also quick public service announcement for y'all.", "What do people think the writing curve will be?", "what did anyone get for that one problem that had squares with arrows on them saying what is the shortest distance to go from point A to point B? i put 18", "...unless I misread the question, in which case I'm screwed.", "Does anyone remember the exact wording on the 30 degree question", "I might call after school", "Is it confirmed that CB is reaeasing a concordance table tomorrow? If so, does anyone know what time?", "There's no way to tell.", "Just finished. Math and writing weren't bad, reading was ok. I have specific questions I'll post later", "My son's friend thought he remembered one of those reading questions with the line-number answer choices (\"which of the following...best evidence...\") having answer choices that had two sets of lines numbers each. Is he remembering that correctly? There wasn't anything like that on College Board's practice tests. All those on the practice test only had one line reference in each answer.", "also, screw CB for giving us an experimental on the LAST old SAT administration date. thought we'd make history with the first ever 9 section test", "Did anyone get like at least 4-5 no errors in error identification?", "^Truedeau (lol for Canadian elections)", "Srs question: why hasn't collegeboard cracked down on you guys yet", "I just feel bad for the waitlisted ticket people, since they got rejected and will be forced to take the new SAT. Ugh, what a disaster. Thankful it's not snowing that badly in Ohio right now.", "Anyone get their admission ticket updated yet? Do we just bring in the same one?", "It says not available, but I can see the other scores from the prior tests??", "well im positive determined to challenge was not the answer to any of the questions", "And those are the same tests on Khan Academy as well (at least the first two are).", "I took the test today and I'm CERTAIN I bombed the CR. I definitely got 12-15 wrong. 3-4 wrong on math and probably a 8-9 essay. So there goes my 2100..", "really ticked off with myself atm", "Japanese Zen, the students had to keep copying the letter until they reached perfection. what was the answer??", "Attempt #3", "Interesting, I thought that the grid-in was easier than normal, but that might have just been because I probably went too fast.  I wouldn't be surprised if I missed one question because of a silly mistake", "Anyone still up?", "For 2017ers, what will you do if you don't score well enough on this old version? Take the new SAT or opt for ACT? As a math/science oriented person, I think ACT will suit me better but I'm also worried that colleges might still prefer SAT even though they stated there's no difference.. Any thoughts?", "Dog winning one I put D, cuz you can't say prohibit to do, you say prohibit from doing", "Does anybody remember what the essay was", "Yeah I know and do u remember that ratio problem and it asked for the percentage?", "Holy cow, my highest score on practice SATs was 2160, but I got a 2290 (730 CR, 770 M, 790 W) on this one. I'm so ecstatic right now!", "^I omitted practice test one because I, a person who isn't that intelligent, got an 800 on it. I think if we miss 15 we can still get a 700!! (Hopefully)", "Feb 12th (:", "Do you remember the other choices for the same question? I really can't remember what I put.", "My scores still not available yet????? Why?? can someone help?", "I NOW HAVE A 2340 SUPERSCORE WHOOO", "Okay this is weird question but when you receive your score online do you see how you did on each part? What do they tell you online? This is my first SAT idk what to expect will I know what I got on each section", "730 reading", "No help for me bye brightful future welcome begging", "the test was pretty easy although there were the usual couple reading questions that throw you off. It is weird to see how this thread has little test discussion as many kids took the test today, I was kind of hoping to see the answers other people put to see if they matched mine.", "5t=1t+10, t=2.5, so distance is 12.5", "Okay maybe im retarded. I was 143% sure i saw consecutive. Looks like im signing up for november tonight!", "has anyone receive the score, heard someone got it already", "yes its a", "I think it was something like,", "any sunday test day takers", "To those that said rationale... you win. I now (regretfully) see that rationale is the most justifiable answer. So far I have missed dainty (but I will fight the college board over that one lol) and rationale. I'm praying by some miracle that I was correct about the teacher being determined to help her kids, but if I was wrong on that then my 800 is down the drain.", "2100 guys. 750 cr, 690 math (They used the same curve- 3 wrong, 1 omit), 660 writing (10 essay). Pretty happy with my score.", "I just tried calling. Was on hold for 20 minutes. I gave up.", "Can someone list the different cr sections? Comparing the two long passages was the reading one, there was zen, space, what about short one? What were the length of the others I am missing?????????", "Is my section 2 different from some one else's section 2 on the test or all they in the same order?", "Sounds good to me.", "Do some people get different experimental sections?", "early morning next Thursday. The exact time depends on what time zone you are in.", "Did anyone find out if this was a reused test?", "I think the question was something like what would the author of passage 2 when talking about \"innate ability\" think about the author of passage 1 when talking about \"blank slate,\" unless I am remembering it wroing.", "Thanks in advance", "Hi everyone! Can someone please give tips on how to raise an 8 essay to a 10? thanks.", "Just registered. Last time I got 2110 (690 CR, 740 M, 680 W). I'm hoping for 2220 on this next one (700CR, 800M, 720 W). If they superscored PSAT with SAT I'd have a 2250", "4 was definitely the radius and the answer was 8+8pi. I woefully accept rationale as the answer.", "Score predictions for", "is there a consensus on the improving paragraph question where it was like improve this sentence \"my mother is therefore not as happy about the arrangement as I am\" I have heard people here say that the answer was to delete therefore, but I don't agree. Any input.", "also, the highest I ever scored on a practice test was a 2210, so I highly doubt that I could exceed that score during the legitimate SAT", "wow it absolutely sucks to know that i consistently get 2 or 3 wrong in each practice section, and still get 2200s ish. now if i do the same ill get a super bad score ugh", "ugh i don't know, i was torn b/w the two. don't exactly remember the sentence, but it was something like: the (insert vocab word) of a subject, and how one thing could not be extrapolated for the effects of another thing.", "I felt like writing was really easy. Do a lot of people feel the same? I reaaallly don't wannt get screwed by a ridiculous writing curve haha.", "ANSWER WAS D RIGHT ???", "Yess the lava passage was so hard. I was so confused on most of that, and i messed up on the bias passage im pretty sure.", "If I filled in section 4 for my section 3 questions and my Procter gave me a new answer sheet to do the rest of my test will I get my scores accurately or will I have to do the hand score verification?", "What would be a good enough score for top schools to not have to retake it?", "They recycled both the US and International SAT...", "How is college board going to deal with this? Will they use the international or maybe the Sunday test?", "Does anyone have any tips on some quick reviews for the essay? I would love to score an 10-11 (if God is real", "You can send your scores, just not for free.  You just have to pay the $11 or $12 fee per school..", "3...weeks...the day I took my first practice test felt like yesterday...", "Anyone from nj get their scores", "This is too funny. I called aorund 9 times today, heard 4 different stories, 2 being unsure, 3 being similiar. Please be careful to not guess your score because there is a psychlogical thing where you guess and it's below your expectation(perhaps guess) you'll be even more disappointed. Also, don't assume that scores will come out today because if it doesn't then you'll just be even more disappointed. Be like water.. go with the flow", "The f(x) - g(x) question, the last one of a section, I don't understand how the answer could have been -4. There were two absolute value curves, one standard (f), and one reflected over the x-axis (g). The question (as I recall) then said f(6) = a, what is g(a). What \"a\" value would have gotten you a y-value of -4, given that these particular curves were rather standard. Did I miss any particular shifts or is this not what the question asked? Was the graph deceptively labeled in terms of intervals? If I've gotten this wrong my 800 is...no longer an 800 so if anyone could explain.", "It had something to do with \"There are a lot of ice rinks in the area, it can be said that the ice rinks are: ______\". I don't remember the exact question.", "For Critical Reading I suggest developing an even, comfortable reading pace for starters. There are loads of guides out there for Critical Reading.", "do we give up hope now", "were there any difficult reading questions anybody remembers. Some were difficult, such as the first one asking for the main idea of jane eyre", "Was there a diction question?", "Agree. I don't think the scores are harsh, its the concordance.. Perfect section scores don't concord to perfect scores on old SAT or ACT.", "The collegeboard books are literally made by the people who make the SAT. In fact, the first 3 tests are actually administered tests from like 2008 or something. They are the real deal. So they are basically real sats right in your hand. Your score should be accurate.", "Please post it if u know", "Oh boy...", "Hallelujah, that was the only math section I didn't finish", "your counterexample does work though, (0.5+0.1)^2=0.36 which is greater than (-0.1+0.2)^2 which is .01", "Why must you do this college board", "what about that question in the Ethiopian med student passage...", "I put comparison. It can't be a LITERARY allusion because he was alluding to his lunch, not to a book", "Yeah I got that too", "Do you guys think 2210 (680 math, 730 CR, 800 W) is good enough for ucla/Berkeley? I'm in-state btw.", "with collegeboard website down, does ANYONE know where I can get the bluebook answer explanations?! I'm in dire need of help on some of the questions", "Usually they come out on Wednesdays so do you all think it'll come out this Wednesday morning?", "i wasnt sure but i chose utterly groundless, i mean it sounds a bit extreme", "CR: 670", "Was 14/pi the second choice?", "What were the answers for the two small passages about Atlantis? Was one focusing on the appeal and the other on practical function?", "BunnyBlue thanks for the insight. Good to know.", "you took 2400 away from me lol. got the spam block at 2399", "sameeee thank god. but i think i did poorly on cr, which is usually my best subject.", "They're supposed to to come out today I know because I called the college board and screamed at them to tell me when they were coming out last week. This is such bs tho I'm glad I'm awake ughhh", "I just called for 2/27 scores, he said it will be on 3/18.", "I knew this was gonna happen", "Do you all remember a vocab question with circumspect? Also, in Fixing Sentences, did you say she was well-received with cheers or that she like wrote a book or something that outperformed Verne's?", "Can we show this to some new agency? I'm really shocked that they would repeat such a recent test!", "I put the decimal version of 7/25 which is .28 is that okay", "College Board just released an app for iPhone and Android called \"SAT Score Converter.\" Check it out", "SAT October 3, 2015 Predictions", "i got a 2000 total", "Btw I'm seeing an \"X contrasts with Y\" due to the comma.", "ahh nervous", "Oh my god, you guys already discussed the exact question that stymied me and might get me nuked.", "If you haven't gotten your scores yet...you probably won't be getting them today.", "The curve will be normal and standardized just like usual.", "Did college board release the prompts on its site?", "Writing -- 76/80 and 10 essay = 770", "Was a 12 and two wrong an 800 for writing?", "i think i got 780 in CR, 780 M, and 800 W", "What did you guys get for the dance troupe writing question and the writing question about the person who just moved and wanted to have either curtains or blinds?", "\"(She) yet still nags them on the smaller details of teqnique\" aka wanting to challenge kids", "what was the question with cynical as one of the choices?", "did you guys get 4 for the grid in for the 64 pints of ice cream?", "How did you get in", "what about a passage on baby fat?", "wondering the same thing. What is the latest time (like ex. 9PM)  CB will release the scores?", "1510 comp on april school day. 740 reading and 770 math. 3 sevens on the essay. For reference, i got a 33 act in February, 33 essay. The scores seem consistent based on the board's concordance tables, but I honestly don't know how much to trust them.", "what's the answer to the cr question like why the author mention guiliver or something? Is it related the mess he made to the shipwreck? Tks", "maze", "why was the other thread deleted?", "I started a different thread (", "My son got 1410/1520 on the PSAT (He took it while having the FLU).  He hasn't studied at all since then.  He's taken SAT Test #1 and #2 and got 1480 and 1500, respectively.   How are others doing?", "i just tweeted them, lets see if they respond", "10am - nothing for PA", "I said should use steel only if it takes less energy because in the final sentence he said because of this, timber should be used implying that he valued efficiency most and would use timber only if it took less energy", "aww I blew my last chance to not feel bad after looking at all your high scores. i got 670cr/770m/650wfor composite 2090.", "Alright then I'll be back here 4:45 am, good luck everybody I'm sure if you guys put in your best effort you'll get the score you are looking for, and remember to not let the SAT be a single test that defines you. Again... GOOOOD LUCCKKKK!!!!!", "Current junior here with a 2000 from the October test (cr: 640, m: 770, w: 590, essay: 8). Any advice on how to bump my score into the 2300s?", "Do you all agree that the math section with the box plots and statistical analysis was the experimental section? The last question in that section was the first time I have met with a math question I could not do, and I am counting on a perfect math score, so I am worried.", "im just anxious because im a senior and schools need my score", "got a 2290. wouldn't be disappointed except for the fact that i got 740 on math. Does that mean i missed 2 questions?", "Smh im a senior and took it again. College told me i just get 20 points more i get a full. Pray for me plis", "True, my dad said dammit when I told him I got a 2370", "I too put analytic && i said it was ominous. It sounded weird but the others made no sense", "Nope sorry, i just remember the answer and my process", "Guys, what did you get for the indirectly and directly proportional question. It was y is directly propotional to x^2 and that z is indirectly proportional to y. What is z's relationship to x^2. Was z directly or indirectly proportional to x^2.", "btw this was my first time taking it...should i take it again in november or december?", "Ha! Would you tell my kid that?", "what was the right answer for the sum of coins? I'm slightly freaking out because I can't remember half of my answers", "10:39 still nothing... Struggle", "By the way I know some people had trouble with writing. I got an 11 essay if anyone wants to read for help for November?", "Good luck to everyone! I am about to leave my house! May the curve be in everyone's favor", "Guys I thought this October's SATs were really easy", "What's the evidence for it being wrong?", "For the writing section food anyone put a ne for like the second go last question for improving sentences like the first part", "was there an idiom question on #28.", "what were your passages about? did anyone have a passage about corn or was that my experimental?", "But most of all was that section the experimental one?", "oh yeah", "So it's clear now. I need to focus on critical reading only for this trial!", "I keep going between refreshing this page and refreshing my scores page lol...good thing we don't have anything going on at school today or else I would not get a single thing done", "how do you think the curve is gonna be", "I felt confident that I got 100% on both but the inverse question kinda worried me since I deliberately chose not to study inverse proportionality since I thought there was little chance it'd be on the test. (So Ironic)", "Yay 2 am for west coast", "Did anyone get two 25 minute writing sections?", "Anyone got \"difficulty Saving amoeba\" in the last question of section 6", "Damn I think I did so bad on the dark matter passage. I put they don't have a theoretical model because it didn't really say anything about incomplete data right? Also was the question about how scientific discoveries raises both questions and answers correct?", "how many no errors did u guys get", "Answers are part of the QAS.", "hahah few more days to me is about 10-15 days xD", "Thank you for the tips!!  How true is the College Board blue book to the SAT? I know that the questions are extremely similar to the SAT. Are the scores from there accurate? So, the score that I receive from the practice tests from the blue book should be sort of what to expect on the actual SAT?", "So CB is being very inconsistent with the score release date?", "I think I put popular appeal then. Not completely sure but it rings a bell.", "I called Collegeboard and asked them if scores would be posted throughout the day but couldn't really understand the guy talking", "So most likely a 1500 on the new test will only be around low 1400s on the old version?", "there's at least 80% overlap in skills (excepting the essay).", "Maybe it'll come out tomorrow?", "Does anybody remember the question for the admonitory one? Or the other options? I feel like I chose it, but at the same time I don't remember...", "If its consecuative evens it could be option 2 ->>> 8/10/12 or 10/12/14", "Can someone answer  #2107????", "I'm actually shaking.", "it was sinuous, jeez shut up, you guys keep talking about this one question, what is wrong with you? If you got it wrong, you got it wrong.", "Dismissive or incredulous", "It normally is 5AM", "Guys, I really think it was dismissive instead of incredulous. The question was asking about the writer's attitude towards people who said they spend a lot of time on emails. The passage did not indicate that she does not BELIEVE people spend a lot of time on emails, only that she DOESN'T CARE whether they spend a lot of time on emails or not because experts think the Internet isn't changing anything whatsoever. And that's dismissive.", "750 CR", "yes i got awe", "690+800+700, essay 9.... Damn so close... Last time I got 10 on essay but this time I kinda messed up", "2260! I'm pretty sure my heart just exploded. In a good way. No more stupid standardized tests! (Well . . . until the APs. But shhh!)", "Plato had little effect on the popularity of Atlantis according to the passage.", "Mine aren't up yet.  Anyone else have that problem too?  Does this mean something was wrong with my test?", "Mine isnt out either but I'm glad it isn't bc if the curve goes to 750 for one incorrect, thats insane.", "Would anyone be willing to take a guess at my score?  I think I got 2 CR wrong, I omitted one M question, and while I'm not aware of any math mistakes so far, I would guess maybe 2 or 3, and I think 2 or 3 W wrong, and maybe a 7/8/9 essay.", "If they did come out early, would they send an email or something to tell us? and would they still come out only at like 5AM?", "Congratulations!!!", "What was the answer to the sentence completion. That said not all", "Yes, I see what you mean.  Maybe they just haven't changed the chart yet.", "No curves have to do with percentiles for each specific test", "Anyone know why they didn't come out earlier...seriously", "Why does College Board do this", "I drew 6 congruent angles (which appeared to be a hexagon) and since only 3 of the 6 angles are given, those three angles must sum to 180 degrees. Solving for X will give 30 degrees", "Could you explain how you got that", "Stupid writing.  So many friking subtle questions.  Wasn't redundancy something that usually isn't covered a whole lot in the test?", "Hey guys! I'm back. 2 weeks until the test! Super excited for all of this to be over. Took a practice test today and scored 2340 (800 Writing, 790 Math, 750 Critical Reading). I got one wrong on math and four wrong on CR (3 of which were vocab-- ARRRGHHH). I learned all of the first Direct Hits book in the last 2 weeks. Do you guys think I should memorize the 2nd book or memorize all the ones I missed on previous tests? Like everyone else, I'm sorta short on time here... Help would be much appreciated. Thanks.", "So, before they said on the collegeboard website that my test would be rescheduled to February 20th,so the colleges that  I applied to said they would still accept the February 20th deadline and said to email them if I plan to take the February 20th makeup. So,I did.However,collegeboard just emailed me saying my SAT would be rescheduled for February 27,so will the colleges,who said they would accept the February 20th deadline still accept the February 27th one? I was thinking of maybe calling/emailing the colleges,but what do you guys think?", "how are curves for the test? -9 CR? sigh", "What was the answer to why the author still nags her students on minor details?", "Math I think was easy", "T minus 30 hours", "I'm a rising senior and I'll be taking the October SAT. For the first attempt, I didn't study and had no practice which reflected in my score. I'll give an overview of what should be done for each main section:", "What do you guys think will be the curve for Math? I missed the trapezoid question(I put 3/5) but pretty confident that I got everything else right.", "Was it \"studies show people experience more jetlag than it is normal by failing...\" Or \"studies show people experience more jetlag than is normal because they fail...\"", "The majority of colleges look at your range of score not your fixed score.  So a 2380 will be seen as a 2360-2400, AND a 2400 will also be seen as a 2360-2400.  Same in individual. A 780 in math will be seen as the same as an 800 because they know that if you took it again you could easily get an 800.  This is actually pointed out on your score report too.  Whether you actually believe it or not is your own choice, I think everybody has some doubt, but if you are an AO, would you reject a kid because of missing one question?  I think that colleges have a threshold that you pass for test scores and that determines whether the school can accept you, but in short:  A bad test score can keep you out of a University but a great test score (2380) won't get you accepted or keep you out.  Its just another threshold, then they move on and look at another part of your app.", "Section 4 was experimental, like someone above mine was also exactly like the ACT english section. I did mine just because I would've gotten weird anxiety about it otherwise.", "How many questions wrong is 730 CR", "Was the one with square root of y-3 = square root of (x-2) + x  67 cuz the lowest for x was 6?", "Hey congrats on everyone reaching their goals! If you don't do well, there's always the ACT and the new SAT. And it's just a test at the end of the day", "Yes, but aren't there 3 possible experimentals, math, cr, writing? I'm trying to figure out which of mine was experimental...", "I got 2280, with 780 critical reading, 700 math", "Reading was brutal! Also writing was hard, I usually have 10 mins left but today I had to think many questions over. Math was easy but probably stupid mistakes will get to me.", "Ok I put that too", "for the last grid in question (.288 one) was it integer only?", "From what I've gathered throughout this post, it seems like I got 8 wrong in CR. I need to go silently cry now. D:", "Was the answer to the amneboa passage observing its movement or its nature", "me 2", "Special thanks to all of u homies out here on CC, the plethora of information I gained from u guys about this test is just crazy, and I am very thankful for everything. U guys helped me get past my dream score of 2300+ and I am very happy for everyone who also hit their goal. To those who didn't, just remember that this is only a test that doesn't define u in any manner; keep ur head up and keep moving in life. Don't squander and mope over a number- u are much more than that", "I focused on my 2nd paragraph so much that I didn't have enough time for a conclusion. Welp lol", "Does anybody else remember the other answers for the f(x) g(x) that had the answer of -4? I can't remember what my answer was.", "^ I've been arguing that its genuine confusion but apparently the consensus here is that it was an ominous explanation", "CB had one job....", "and for Internet question, the passage 1 has first paragraph saying \"I lost my focus on reading for a long time\"", "Lol College Board is such a joke, I just got off the phone and you are right. 6-8 weeks. Looks like the ACT is the right place for me..... All of us juniors have college apps around the corner and don't have 6-8 weeks", "I'm in the same boat as the people who don't have their scores yet. I had to have an irregularity form filled out for me because I accidently started putting in the answers for section 3 in section 4, so I basically had to continue bubbling as per my proctor's instruction. This must happen quite often, so I don't see why it would cause my scores to be canceled or anything. Hopefully they're working things out and I'll get my scores in less than a week. But your scores all look pretty good!! Good job to everyone!", "How many incorrect is a 720 CR?", "Hoping for atleast a 1930", "I chose the one with \"nature\".", "cb has dissapointed me already >.<", "Why is it not genuine confusion? I think ominous is a bit too strong cuz he never explicitly says that its a bad thing. He was along of the lines of \"OMG did my way of thinking change?\" That to me sounds like he was confused about what was actually happening to him", "Contrast with was incorrect right for the sinuous quesiton?????????????????", "Less than 24 hours left. Keeping my fingers crossed!", "what was the last question about the space guy's model? was it primitive?", "There are two essay prompts each for east and west. Mine is different", "apparently the international sat test in jan was a repeat of usas dec 2015", "They already have your score? Colleges are probably sent scores before students receive them so that universities have enough processing time (after all, they probably receive huge volumes of scores, especially in October).", "and did you guys get \"critique an approach\" for the celebrity passage?", "Was number 29 n/e for writing", "really really hoping for a 2100+! i took mine the 27th, so i bet they'll come out on the 18th. uuggggggghhhh i wish they would come out sooner! I'm so worried. i really do not not not NOT want to take another standardized test!", "Do you guys think the Feb 20 and Feb 27 tests will be the same?", "guys only a few more days, im so nervous! this thread is gonna be pretty hectic the day the scores get released. If i do terrible, i'm gonna need some comfort!", "Guys, let's just hope that it will be out before 8am", "i somehow ended up with 690W, even though it's usually my strongest subject (consistent 800s on practice tests). Score report says my essay was an 8 (understandable) but I missed three multiple choice which translates to a 71/80. On the December test, one multiple choice missed = 78/80. Is this discrepancy because of the curve of the test? How many did you all miss/ what number did did you receive out of 80?", "does anyone remember experimental passages like the autobiography.. was there any other experimental passages?", "MATH WAS so much harder than december OMG", "I feel like the curve is going to be that bad because honestly, this test felt really easy to me and a few of my friends.", "Maryland no scores", "From 680 to 680 to 790 in critical reading", "SOMEONE AGREES WITH ME OMG", "How is a 1460(2090 converted to old) for a school like Georgetown or BC?  Any chance for BC honors with that score?  Applying for business for both.", "This is referring to the marbles question", "80 MC with an 8 essay = 780 doesn't seem too harsh to me. Is this a normal curve or lenient?", "Yeah that's what I thought! But it's impossible for College Board to make a new test, maybe they will randomly choose questions from the previous unreleased tests", "Yes it was definitely integers only. I know that 100%.", "If I hit my target score before this test, I will not do it.", "Many conflicting stories about NMF cut off, like TS, SI, %tiles but rules are simple. Filter 1,724,416 test takers (11th grade), get 50000 top, then get 16000 out of 50000 - rest 34000 considered commended, final take 15000 out of 16000 - 1000 will be NMSF, 15000 will be NMF. The 15000 will be allocated by state population to whole US population. Headache, example TX get 1353, CA get 2025 or something like that", "I actually have not tried any of the blue test book practice tests or the ones on khan academy. I went in cold and took the test because my school already registered all of us. The questions for the reading section are much easier, and I finished that section with 10 minutes left to check over my answers. Some of my friends said they ran out of time, so timing might be an issue for some. Writing is very much like ACT writing. Lastly, the math non calculator section was mostly concepts with very few actual calculations. The math calculator section was considerably harder, but if you are strong in math, it shouldn't be too much of a problem. If you're not, practice practice practice!", "aww", "I put analytical too for the same reason", "that's what i thought to", "780 Math 800 CR 800 Writing", "You're confused? Me too!", "I got a 1950 but I really wanted over 2000. Do you guys think I should try ACT or should I settle for this score?", "Meh my superscore only went up to a 2230..", "What was your answer for the internet changing passage, where the question was about the relationship between P1 and P2? I said P2 supports P1, because even though it invalidates it at first, he supports it at the end", "it was untenable and the q was uh.....sorry i dont really remember", "I'm really happy that I got an 800 in CR, but I'm just a little bit pissed off that I got a 2290, only 10 points off from the illustrious 2300, since I can't retake again.", "I'm gonna say that I got around a 1700 to be realistic, I've been aiming for a 1900+ but anything above 1800 would be great!!!", "Guys, I had what I believe is a writing experimental section with a big long passage that spanned like 4 pages, with questions regarding how to fix it, does this sound like it was experimental?????", "Art Deco (A) CONSISTS OF geometric forms and straight lines, (B) WHICH (C) CONTRAST WITH the (D) SINUOUS, natural lines of Art Noveau. (E) NO ERROR.", "How did you guys feel about the prompt?", "Which writing section was the experimental?", "DD got 2 wrong and 2 omit and was a 700. Not sure why it wouldn't be same score as the 3 incorrect who got a 710?", "Is it just me or is it impossible to put a #19 + writing answer as \"no error\" and feel good about it", "And that would be awesome if someone could compile the curves for each section.", "I know it had something to do with honoring the women but I dont remember the word", "On the December one it was 2 wrong equals 750", "CR: 720, -6", "By fail I mean I'm not reaching my goal", "Would really appreciate a score estimate.", "Are we sure it is ominous? I think it is genuine confusion. What about the paradox? What was that full question and answer", "I only missed 3 on reading. Read actively. Get into it, and have fun with the passages. Underline the passages to help you pay attention. Skim through the questions asked to look for the main idea/general questions. I usually answer these first.", "Now there might be a slight variation, of course, as wrong answers in the grid-ins are just a deduction of 1 rather than 1.25.", "is it 5:00AM?", "For my experimental section I had a question that asked you to find the value of pq when 2x-y was a factor of 8x^3+pxy-qx^2y-y^2. Did any one of you guys with a math experimental have a similar question?", "I'm just hoping for an 1830+ realistically, but I'd really like 1870+", "Probable score: 720", "For the ominous explanation one I put unlikelihood, which is letter B", "why am i forcing myself to take the sat tomorrow why do i hate myself", "So are the people with cages in their avatar temporarily banned or something?", "We were given the slope of one side, and so I put the negative version of that given slope- hbu?", "probably not. the SAT isn't that stupid haha", "Any body know the answer to the first question about the land it was a short passage", "Yeah I guess that's true. My problem is that my CR is all over the place. In practice tests I've had from 620 to 780, but without any real consistency. It's unfortunate that both times on the actual test were in the lower half. It was that freaking Zen passage, and a few of the vocab that killed me.", "Also (i know my essay says not too but i made up those examples) Im seriously debating on canceling my score. This is my third time taking it, and I cant afford another bad score. Advice?", "none of those.. the answer is that the teacher wanted to express his or her passion for learning", "Jk found it. 1450 is a 32 so I found by goal but that doesn't seem promising", "Which section was experimental on math?", "Sinuous?", "Did anyone have the angle problem with 60 and 40 degrees given????  It had 4 lines in it.  I remember picking 80 degrees but that was the one question I was very unsure about.  Thanks.", "although i wish it wasnt, the wait for scores has seriously been killing me since I got home from taking the test. I'm constantly refreshing the MySAT page day in and day out despite knowing rationally that it won't come until March 11 or whatever. just wish I could finally see the results of my effort and then be able to forget about it and move on", "I'm going to be taking this test. I'll keep you all posted", "Was the answer to the Montreal ice rink question exorbitant or ubiquitous", "can someone answer my question about the improving paragraphs. pretty sure that was the only one i got wrong in writing.", "Oh man hope its emphatic.", "very frustrated with my 1440 (7,7,7 on the writing portion), was hoping for a 1500+. I really cant believe that this equates to about at 2030. These tables seem so off to me. Signing up for the ACT in June.", "anyone have any input on the math question I just posted ?", "Agreed. I hope I get good scores.", "The section/question types that I struggle the most on for CR and WR are sentence completions but the main problem was that I did not know the vocabulary very well. I understood the logic flow of each sentence quite fluently but was unable to answer since I had no idea what the words for the answer choices meant. I will most likely just review direct hits and vocab that I did not understand from practice tests. For WR, most questions I miss are on identifying sentence errors with an occasional one or two in the improving sentences/paragraphs. I have written the needed SAT grammar rules on notecards and am currently on a \"cooldown\" phase from my practice test to learn the rules. I am not sure if this plan is efficient with just notecards and a couple practice questions online to save the BB questions for replicating test conditions.", "Number 3 of multiple choice in the free response ine", "It was about black rhinos", "I really think it was positive not consecutive. I think the consecutive part made me not recognize it", "How can a 1550 equate to to 2280. Its mind boggling, the concordance.", "if theres a way i can post a screenshot i will!", "I don't understand. Are SAT questions in USA different from the ones given to students in other countries? I am seeing plenty of questions on this thread that I didnt see on my test 4 days ago.", "I put", "The guy said its not the same test and I kept telling him over that it is. Can you just answer my question about the curve?! Now he put me on hold. I probably annoyed him now.", "not there yet", "Does anyone here have QAS or a similar service for the June 2014 administration? I swear that this has got to be the experimental section; on my test there were two long multiple-choice math sections instead of one.", "Why retaking it when you already got a 2300?", "Shoot I didn't think of it like that", "anyone have a math equating section with graph of a survey for a restaurant with 3 questions on it? that was the equating section right?", "What do you guys plan to do for the last week of preparation? I plan to take as many practice tests as I can, but school might be a problem. I don't seem to have trouble with timing but reading passages and focusing too much on one problem have sometimes wasted time for me. Any Suggestions?", "I called during lunch (Virginia), and the lady who answered confirmed scores will be out sometime today.", "oh yea and what was the final zen question about the grandmothers words. I chose somethink like \"summarizing a general consensus by the teachers\"", "no it was finicky for sure", "I can't remember what I put for the trapezoid one. Was it just the positive version of the original or the reciprocal also", "i remmebr it is like defensive...escape", "was \"do not believe in their ability\" and \"didn't want to share their passion\" the same question? and are they 2 different choices or were they both the same choice?", "It was 10 billion. Did you all get the answers I said on the last page", "thank you for confirming that I thought I was crazy because I saw 5pm twice earlier in this thread and I was confused a littlee", "honestly though i wouldnt overthink these writing questions and rely on instinct. if you can instantly replace it with a better work then go with that", "Ya that was an idiom error on 28 btw", "Writing: 790 (Essay 11)", "You guys are all obsessing way too much over standardized testing. Competitive admissions only use the SAT and ACT to see that you are capable, you essentially pass the initial academic screening. After that, it comes down to your extracurriculars, essays, and recs. A 2250 is not that different than a 2400, could be a matter of 3 or 4 questions. Once you hit 2250, even a 2200 as long as you are in the Middle 50% for each section, it's honestly not worth a retake. Spend that time building up other parts of your application.", "That would be wrong. They give you 4 spaces for 4 significant figures or for fractions or decimals", "I got -4 for that question; also, my proctor said we weren't allowed to use mechanical pencils", "Praying for easy passages and no conic sections.", "Ohhh... thank you.", "2390... holy god I'm done with this standarized testing bullsh*t forever", "It's 5/3, 100% sure.", "did you guys get 2 No Errors in a row in the identifying sentence errors (35 section)? It was the choreographers trope and the one about the books being sold ??", "I wish I hadn't looked. Not where he wants to be.", "My QAS arrived a couple days ago. If anybody has questions, feel free to ask.", "Has anyone been practicing and scoring high?", "Classicl16, where did you hear or read that?", "Bigsurview:", "Yes, math curves are really brutal,", "There was a question about two triangles and the small one was shaded. Was the answer 3a or 4apicked the latter.", "so you guys think we'll get a harsh curve for the math section?", "Good night boys, I'll report back in a few weeks.", "no error", "yeah i thought it was like 60 and 40 for two angles so I put 80", "critical reading curve prediction ^^ sorry forgot to say", "ypmagic", "Funny thing is that the sat got postponed last year during the January administration..but I agree with", "Are any of you staying up to get your scores? Personally, I'm going to get a full night's sleep.", "Retaking from December lol........my superscore is at a 2290 now. I just want a 2300+", "math and writing, for me, were easy. CR was hard, esp the 20 minute one. i cant tell what my experimental was but i know it was a reading section. trying to figure it out", "i cant believe this is the last version of this SAT :o", "yeah I remember that. But you would think that the pronoun stands for all of them A B C.", "I'm pretty sure the Math Curve went something like this by the way", "the December sat w013 international was the same too", "Cool. Thanks a lot!", "ugh guys i think i got two math problems wrong", "im so stressed about this. I have to break 2000, and idk anymore how i did. I hate how long it takes to see results lol.", "Collegemomjam, with all due respect, the advice you're passing along is misleading. No college prefers one test over the other. Colleges accept both SAT and ACT equally. If anything, you can just go on a college's website and see for yourself that either test is fine.", "What is a bad curve in writing for like -4 or -5", "wasnt shoe size some number and 1/3", "Guys for the scatter plot question in math where u had to find when the average precipitation < 30 did you guys get 3 as the answer?", "What was the answer to the problem in the fishing passage where one of the answers had ...lack of foresight?", "Can i take the test more than 3 times? October was my first attempt, and I am planning on taking Dec/Jan. But debating on November", "i hope the curve is more generous this time, maybe 4 wrong is 750?", "Anyone else just take this to push up their superscore? I personally don't care about any section but the math.", "Any essay writing tips? I'm really confident that if I start off with a good essay on Saturday I'll really do well on the test.", "The site is still down", "M: 800", "How are you all doing with practice?", "Just got my scores!! Love you all", "I am take two more new SATs on October and November.", "Does anyone remember the answer choices for the internet \"perfect\" question? I think I chose one that said something like \"Reflects the author's loss of focus\"", "Reading KILLED me.", "What was the primary purpose of the Trinidad Passage......I put something with urging", "What was the math question that had 3a as the answer?", "Their customer service is terrible, both people I spoke to sounded clueless. One of them said its the same thing and the other one said there's no curve, das not it mane. I'm calling one last time.", "What is the Ptolemy question?", "i put the one about how new technology answers and opens more questions. im positive im right.", "do you remember any other ones that you gave some time to think about?", "Made multiple careless mistakes. Paired with the fact that this test supposedly has a horrid curve, I suppose there's no way I'm going to do well on this test. I was scoring high 2200's to low 2300'a but I'm pretty sure I didn't break 2200 this time", "Yeah, your answers are all incorrect. Are you a native speaker? Just playing these by ear, they make sense to me.", "\"So already 1 school thinks SAT scores for the new SAT are lower than old SAT. School is Texas A&M.; They are treating a 1300 old SAT as equivalent to a 1270 new SAT.\"", "Tell me how your body paragraphs were structured. If you conclude them, then you should've included evidence and analysis.", "I scored a 1450 (730 CR&W;, 720Math), with a 21/24 for the essay (all 7's). According to the concordance tables this is equivalent to a 2080. Should I retake the SAT or take the ACT senior year if I want to get into Stanford (50th percentile is 2210)?", "18 hours!", "I'm going to call in school rn. This is very unnecessarily tedious", "good luck. may the curve be ever in your favor.", "5:00, scores not here, as expected.", "Anyone else remember having a math question dealing with a confidence interval/level. It was something about a company claming a conf. level. but I was wondering if this was an experimental section? Can someone please acknowledge if they did or did not have this question ? It would put my mind at ease as I did not have time to answer 4 questions in this section. Praying it was. Thanks.", "Guys please answer!! Is it grammatically correct to pick an answer that starts with \"but\"? Bc I did for one of the CR questions", "Did u guys put \"not only by...but also\" or \"not only by... But also by\"", "I need the link to please", "I put \"no error\" on that one", "math - medium", "If they arent up by 8 they probably wont be released today and ill be mad", "As a follow up of Post #12, that's great advice. However, I'd like to add that reading the answers of other test-takers can be beneficial in helping you identify any obvious careless mistakes that you made; just take the responses with a grain of salt. Know that, regardless of what you do, your score is set in stone the moment you step out of the testing room. It's best to just put the SAT out of your mind until the scores come out.", "So has anyone gotten a date for the score release?", "I wish I had one more chance to take an old SAT. I never took a practice test in full.", "Does anyone remember the question \" as the book popularity began to grow .... underlined option was overturned, prohibiting , it was the grammar section", "trollingggg*", "Hi guys! I am an international student, so it may be wrong for me to post here. But you are more cognizant of sat strategies than your intl peers. Well, i need advice: how can i finish cr sections about 5-7 minutes earlier? Thanks in advance!", "Hi everyone, I know this is a bit late haha but here goes:", "Yeshh! we need to interlocute about anime into the wee hours of the night xD", "Yes- if you scroll below the percentiles, you'll come to the \"Test Scores\" section. In the upper right corner, there's small, blue text: \"Show Details\". It took me a few minutes to find it on the new site.", "I think the writer was experimental because I had definitely seen it before. I think it was the same experimental I had on the December test.", "i can only hope our testing group did horribly on math overall. any means of mitigating the curve's depression-inducing power is welcome by me.", "Hey, I just recently took my second SAT (last \"old\" test) and my score still isn't quite where I want it to be. I'm considering taking a new SAT but, since the format has changed so drastically, I'm afraid it'd basically be like taking it for the first time all over again. If I got a 1950, how would I prepare so as to nearly ensure not dipping below 1300?", "pillows and sk: thanks for commenting, and", "This wait is honestly ridiculous... The scores should have come out by now.", "People who took it on the 20th, when do we get our essays back?", "There probably isn't enough information on the essay scores yet to provide a true percentile.", "I scored bad, even though I had practiced about 50 papers. I got 2120..CR-630, M-800, W-690 (essay-9). Is it enough to get me into Princeton through early action?", "Yup i definitely agree with you.. the dispelling a misconception answer was a trick because the tone of the first sentence of the third paragraph seemed bold enough as a dispellment but there was no direct dispelling a misconception and earlier in the passage, the author did mention the zen technique. therefore, i 100 percent sure that it was bold reassessment", "I got a 1420", "what about the question with the hypotenuse that was between root2/10 and root2/5", "Also, there was a write-in math question i remember (mostly) that wasn't hard at all, but it was guaranteed the one question that I'm sure tons of people got wrong if they fell for college board's tricky phrasing.", "which math section do you guys think was experimental?", "Does anyone have an idea of the math curve?", "If I make NMSF, will a 1460 be a good enough score to send in?", "The \" as diverse as\"", "Do you guys remember if the math question with the circles and arcs (answer was pi) was C?", "I took it on Feb 20th", "This revelation is the highlight of my night. On the one hand, college board might have to take out the question. On the other hand, if they do stick with fickle, I think those of us that picked \"dainty\" have a legitimate claim to demand the point from them. I'm stressed though that I haven't so far picked an answer that is definitely wrong, but I've picked a lot that could be wrong:", "\"as diverse as\" should not be an error", "Oh my goat I thought tomorrow was the 11th", "That's true because I'm pretty sure people in East Coast were the only ones affected by the snow storm so I guess we are all in the same time zone?", "Zen passage", "I earned a 2280 Single Sitting (CR:720 M:760 W:800) and (780 CR:) 2340 Superscore...but honestly anything above 2250 is good enough to not retake the test.", "There actually is, there was an asterisk after the word Gulliver and at the end of the passage, it defined Gulliver as a some myth where there was a shipwreck and Gulliver was left with creatures that were 6 inches tall, which relates to him mentioning he was too big to help.", "READING MULTIPLE CHOICE QUESTION ABOUT JUMP SCARE.. WHICH OF THE FOLLOWING IS MOST SIMILAR TO THE THREE STEP PROCESS..", "*theoretical studies", "thanks do you by any chance remember the other choices", "How was the essay guys? What prompt or topic u got?", "Omg looks like we all did pretty well! I'm bawling my eyes out over a 2030!", "Out of 1600", "For the sentence completion, was it indoctrinate or commemorate?", "anyone remember question 13 on section 10? it was a sentence revision with the word develop in it. did anyone put the answer where it was one long sentence with the word developed?", "Essay will require more/different prep. Reading is more a matter of simplification--no more analogy or except Qs. Writing is obviously different since it's all passage-based and includes a couple \"new\" rules (comma placement, in particular) and vocab-in-context/tone Qs, but R is my area of expertise, not W.", "what was the essay question?", "Haven't gotten my score yet... Anyone know why", "Also I know that this is for the wrong test but the December thread is dead now so there is no point. I got 10 wrong in CR in december but I got a 630. I was thinking about calling them to see if they made a mistake since this seems rather weird.Do you think this score seems unusual?", "Good luck you all.  This is my second time taking the SAT this year, the first time being October 3, 2014 where I got a pretty good score.  I hope I did better, because I may have missed a few reading but the curve for this test is more lenient.", "Every day since the test I have checked the College Board Website knowing that I would see nothing. I'm a Sophomore, so my excuse for being so obsessive is that I need to get my score sent off for my application to my state's school of science and math. It's killing me wondering about it though.", "I almost had a heart attack", "was that the one with the Pluto passage or was that section 3", "during trip", "The thing is, I can't retake it because I have to do subject tests in Nov. Maybe I can pull an 800 on Math II. Like it'd be truly amazing if I pulled 780-800 on CR but CR isn't even supposed to be my thing. I'm all math lol.", "Good luck to all who are retaking. I guess I will do the same. Expecting 2300, but I got 2070. Goes to show how bad of a predictor I am. The only part of my score I'm happy about is my essay. I was expecting a 10 and got a 12.", "I see your points. Still think counterparts is a better choice", "LOL my experimental was horrible... It was just an extra writing section, exact same format...", "Whichever one was III only", "Incomprehensible. Are they going to end up canceling the SAT, or was that the same experimental section used twice, because after all they're discontinuing this format?", "Soooo I guess it's most likely the same curve then", "I put the possibility of time", "The wait is on indeed..", "Did anyone get 10 and 1/6 for the shoe question or was it just me??", "I'm tempted to set an alarm for 5 AM... they send out an email right? I'll probably just turn my ringer all the way up and if the email wakes me, so be it xD", "It said squares. It was 9 + 4 + 1 = 14.", "They used the same exact test for the november 2012 makeup and february of 2015 SAT which was all taken from the origianl March 2011 SAT go look at the threads of all 3 of these dayes they dicuss the EXACT questions", "I have called like 6 times no one at the stupid college board can tell me anything they suck", "Did you guys put poetic or sophisticated for the one about the dancing planets?", "April School Day: 1550 composite", "Oh i wasnt stating an exact answer just something similar & i thought people were sure it was rationale?", "If x was 15, the three angles would be 15, 30, and 45. They would then add up to 90.", "I'm seriously considering taking the ACT. I thought my score was equivalent to a 2080 and that one more round or two of testing could get me into the mid 2100s. But now with this concordance, it's as if I need 1500+ to even scrape this, which doesn't make any sense because that's only a few questions wrong on the whole test for an equivalent score of 300 points less than the old perfect score. Can someone explain what they think will happen or if I should take my chances with the ACT?", "Did anyone else feel like this test was significantly easier than other tests for writing? I thought reading and math were average.", "Scores should be available already, they came out about 10 minutes ago.", "Does anyone know where the thread for November 2012 makeup is, I want to investigate the rumors about using the same test twice", "when are we getting scores back?!?!", "They wouldn't make the curve any harsher because of the delay, right?", "I got the same for median", "Good luck everyone! Hopefully we all get the score we want!", "Im certain the first 4 questions of the last or second to last math section were all D", "Omg i cant believe i faied math i was certain id get 780+ but oh well, if i did well in critical reading i wont even care. What about question 3. 3 consecutive numbers = 32", "hmm i chose autodidact, i didnt know what it meant but i knew that \"auto\" meant self and \"didact\" meant educate. did anyone", "Has anybody tried the black book for SAT yet?  It is not updated for the new designed SAT yet, but does it still work, mainly for the writing and reading section.", "Does anybody remember a section with red and black headed birds and the research done on them? Or was that experimental?", "What'd you guys get for the question about the fish length problem? Like, if the fish were 4 inches longer than what tom said it would be, then the actual length would be three times .....etc. 8?", "I figured out from an Amazon review that the 4 tests in CollegeBoard's book for the New SAT are on Khan Academy for free.", "The one with the line was pretty difficult so hopefully everyone gets it wrong so SAT considers 1 wrong still a perfect", "by any chance when you guys say -3 = 690 or so, do you mean -3 per section, or -3 for the entire (for example) math catergory? because honestly its so hard to get above a 1500 if youre only allowed to get -3 to get a 690", "Does anyone remember the writing question about the choreographer''s troupe? It had something saying \"as diverse as\" in there too", "Last year's February test was released around 7:30 am I believe", "That QAS hasn't arrived yet.....Collegeboard please", "just kept trying to log in nothing different", "haha", "Someone remember that there is a answer 0.25 or something?", "Also on that link, the title claims the test was from asia's 2011 October test. Can someone find the test?", "It looks to me like the curve was way off this time.  For example, only 1 wrong on the MC portion of the writing, and a 10 essay was a 770 whereas the actual SAT tests in the blue book would have scored that performance a 790.  Similarly, whereas 1x on the math section would usually score a 780 or 800, this time it scored a 770.", "Is -2 and a 10 on the essay a 750 in writing??? If so, this curve IS pretty bad considering the writing section was harder imo. What about 700 critical reading, is that like 6 or 7 wrong???", "6 to 8 wrong=700", "Hello everyone, I'm considering taking this test, but I've done so poorly on practice math sections in the past (got a 570 on a Kaplan practice test). What do you guys recommend me doing to improve my math score in time for January?", "Hi, I'd really like the link too, please.", "like in the old Sat, there is always one experimental section, so will there be any for the new sat?", "What bothers me most is that an 800 english/reading subscore concords to a 34 ACT combined English/Reading subscore. That is ridiculous.", "eh superscore is 2320", "Well i got unbanned from collegeconfidential. I was using", "Guys is there a way to get your sat scores early I wanna see if I have to take the November sat", "I put comparison. Not literary allusion... anyone else?", "Sinuous natural curves is redundant but i dont even think i answered that one", "What do you guys for these questions in the fishing one:", "That's odd.  Two people posted different math scores even though they each got 1 wrong.  Is -1 Math 750 or 780?", "how are they even able to \"reuse\" a curve... curves are based off of the test itself, not some mathematical equation that the collegeboard is going to apply. we cant use the december 2013 curve because this wasnt the december 2013 test. different testtakers, different curve.", "Hopefully the reading. But from what everyone has been complaining about, I'd say math no calc. I'll admit, the time limit is harsh, but I still did well on it.", "Will there be an updated concordance table anytime soon?  I don't know if I should trust the table considering ACT literally called them out on it.  I'm not sure how good my 1460 is anymore.", "Using previous curves and trends, I filled in the gaps from the extrapolated data, so here they are:", "3 different lines intersect at one point .. forming 6 angles .. 3 of them are x, 2x, 3x .. what is x?", "The question was actually not poorly worded. If you do any conditional probability problems (which is what that was), that is exactly how it will be worded.", "attention grabbing pronouncement and", "I'm just gonna stick to the new sat", "When I take into account the questions discussed in this thread, I got something along the lines of", "An isosceles trapezoid has two legs that are the same length, not a base and a leg. A base and a leg that are the same length do not imply that both legs are the same length.", "for the linguistic passage, did anyone get an answer \"unthinkable\"? or is it \"simplistic\" or something", "no they dont have time to check if the literary title is correct, actually one of my friends said that she had forgot the name of a book and completely just made up the title... plus they dont grade for accuracy they grade for style, grammar et cetera", "Let's keep in mind, as always, that we are not allowed to share actual questions or other test content on this forum.  But talking about our scores and percentiles is completely fine.", "2260. Disappointed i didn't get an 800 math but I'm happy with the overall score.", "Anyone? I'm going crazy waiting for these scores", "Got rekt by math (careless mistake as well, didn't see the positive integer part on grid in) and my essay score is really meh. Should I retake or nah? This is my first take.", "We all took the last \"old\" SAT to ever be offered!", "I put 5/3..", "does anybody notice our messages going missing", "I took the SAT for the first time back in November and am retaking in January. My breakdown then was 800CR, 720 W, and 670M. On all my practice tests, I had scored consistently high on W but I messed up on the essay pretty badly in November so I'm pretty sure I can improve there without too much difficult, but what I can't seem to do is raise my M score. Any suggestions? (I've been doing a section daily in BB + reviewing my mistakes)", "I literally have nothing to show schools... so I'm hoping I can muster an SAT score that'll turn some heads", "Dainty is used to describe someone who is eclectic towards food, (similar to an epicure i think) &", "I messed up the reading so bad", "What was to sentence completion about synonyms/metaphors", "I guess we just wait", "what was the other mini passage's topic?", "What is the question fundamentally but flawed. U remember other choices?", "LETS GO SAT HYPE!", "But I don't know how I would do so poorly on reading this time... But I really hope I didn't screw up the math.", "meandering movements", "Does anyone know how to increase their scores +300 points. I have been on a score plateau since March, 29 Act-March, 1940 SAT- October, 29 ACT- December. These scores are equivalent, and I am starting to get frustrated.", "I thought they had to actually be released first though...?", "I think what you really need to do is go back and see what kind of questions that you repeatedly get wrong and try to see a pattern between the question and the right answer. Try to find a technique that works and make sure you are pacing yourself effectively. I know its a pain to do it, but you should go back and check what the correct answer was to every question you got wrong and try to see why you got it wrong. For the writing section, make up whatever information you want for the essay, they do not check for accuracy. As for the multiple choice writing questions, make sure you are aware of the most common grammar concepts that are tested. For example, \"Every student in the class failed their test\" is WRONG. And if you don't know that, you will get questions wrong. For math, make sure you do the problems that you know how to do first. Then, go back and do the problems that are harder. I cant really help you on reading because I suck at CR but my tutor said that you should not read the whole passage, read only 5 lines above and 5 lines below the line reference. If the question does not have a line reference, leave it to the end and see if you can answer it based on what you have already read. Good luck!", "I had that but then i thought plato was what inaugurated the hype around the atlantis myth, therefore he provided precedence for the myth's popularity. Does anyone remember tbe other options?", "so mad i didnt get 800 in M like last time", "\"Anyone else with essay almost get the variable section? My proctor was going to administer it to us but realized her mistake... \"", "I have to study for a math test so Im staying up no matter what.", "Anyone else with essay almost get the variable section? My proctor was going to administer it to us but realized her mistake... I think those without writing in my testing center all took the variable section", "comes at 5, right?", "not there yet..", "Me", "I got a 2310 (750 CR, 770 Math, 790 Writing). I thought the math curve was brutal though because I felt like I did better than a 770! My goal was a 2300 but now I wish I had hit 2350. Fingers crossed that 2310 is good enough for Cornell!", "I guess that makes sense, but using that logic, by saying \"the arrangement\", isn't that also ambiguous. Shouldn't we put \"this arrangement\" to make it more specific. But yeah i see your point.", "What was the curve for reading this time? Was -3 a 770?", "I used some practice problems from SAT Math Chung for practice. I never studied SAT Math , math is more of natural talent for me, but before the SAT, I went over old algebra and geometry notes. It also depends on what math you are in, since when I took the October SAT I was in AP Stats, so depending which math you are in certain concepts you forget. I missed 2 questions on the October SAT, and they were all geometry related, since you dont do geometry in statistics. I also got the SAT Subject Test Book, and went over Math I practice problems.", "That makes it an isoceles trapezoid", "can someone predict my essy score....it was bad...", "guys?", "Could someone please give me an explanation on this. I took the SAT a while ago and scored a 2210 (1450 Math/CR). I sent this score to BYU. I then took the oct. 3 SAT and had them to be sent to BYU as well. I assumed they wouldn't be reported until about a week after I see the scores. But on my BYU application it says they've received my score from a while ago AND a different score for this October test. How could they have my score already before I do???", "What was the one on the passage about children and computers, it was either undertaking or satirical something like that", "yall FECKLESS OR UNSCRUPULOUS", "I thought it was y is directly propotional to x, not to x^2. Am I wrong? Did I read it wrong?", "how can you be so sure it will come out?", "Hi everyone....sorry if my post implied that the ACT is not a valued test, because of course it is and will be respected more than ever before this year because of the new SAT and all of the ambiguity that surrounds it.", "yeah i made the same mistake", "I don't know it's the same for all tests, but it was choice A for me", "i will try to get 1600 on sat", "The score site is down for maintenance now. Interesting...", "Um I can't remember but I did not flip the original number. It was just positive because slope was going upward.", "Hmm.. I took my test on the 20th and my results have not been uploaded on the site. Should I call them?", "i have terrible luck.", "was the answer for the girl 12.5? and there was a question about the least distance... was that 6.5?", "I got analytical too", "can anyone send me the link please? thanks", "college admissions is a joke.", "What was the question for origins again?", "Short time lurker here. First time poster. My DS scored 1500. 750 math. 750 reading/writing.  4 wrong in math, 0 wrong reading, 4 wrong writing.  He was somewhat disappointed in his score - had felt very confident after the test - thought he had done better than he did.  Interesting to me that his subject subscores correlated exactly with his PSAT sub-scores and Total with his ACT composite.", "available now in VA", "M - 600", "Guys what was the shakespeare question? I wanted answer the one with dispute as the second word, but I hesitated cuz I didn't know what the first one meant so I chose B, which was collaborative and shared authorship I think. I knew it was likely gonna be wrong...", "I have a question about the triangle one with sides 15, 2x, and x. The lowest possible integer for x is 6, correct? It can be infinitely close to 5, but it has to be greater than 5, right? Someone confirm with me?", "Guys instead of asking other people to predict your score just go to the college panda SAT score calculator.", "M:710 W:770 CR:580 Eh did all right cr crazy low but whatever", "Is the writing curve gonna be ridiculous?", "hey guys i did exactly how i wanted to do, 1360 ( I know thats not amazing compared to you guys haha), but apparently it says im in the 95 and 91 percentile? Is that accurate, i thought my score was pretty average. What percentile are you guys in?", "hey guys do you think it's okay for us to discuss the answers here? Aren't there ppl who are still waiting to take the test on this Saturday 27th?", "So I know somebody else posted that they got 790 on the writing section with 76/80 multiple choice and an 11 essay while I got an 800 with the same score breakdown. I've read that, since different time zones get different essay prompts to prevent cheating, the essay scores get weighted differently - I can only assume that more people scored lower on my timezone's essay prompt than on the other prompts, leaving me with an (extremely) generous writing curve. I've got no other explanation (I rechecked my score so many times after hearing that because I was so worried that CollegeBoard had made a mistake and that my score was about to drop!)", "omg i want my scoooore", "I thought the reading section was easy compared to the documents in the practice SATs on Khan Academy, many of which are historical pieces about women's rights and race/politics... I was surprised when all of the stuff on the new SAT were high school level.", "maybe theyre coming out tmrw morning (thursday)?!", "does the sat approve of starting sentences with but", "I just assumed that it was implied to take all three men into account, but I was still pretty worried nonetheless. I recall it being a rather simple problem where you set up your equation, solved for x, then plugged back in/multiplied by two to find how much the one person made.", "Has anybody gotten theirs? It seems like the waiting time is abnormally long. Also, is there a separate service if somebody wants their test to be hand-checked? I thought that service was included with the QAS, but I'm not certain.", "Hey guys. Do you think I can still study for this in time if I start now?", "I forgot to eat dinner and now my stomach is killing me. I'm trying to stay as quiet as I can making some 3am coco puffs.", "It definitely can be petitioned. Even if you put the wrong choice anyways, and petition for a choice other than your choice, and the question gets removed, you won't get any points off for it.", "Sophisticated but fundamental flaw?????????? Ptolemy", "What did you guys choose for that writing question for the line about the dorm being near the library?", "Does anyone have an idea of what 3 mc wrong in math would be?? I'm kicking myself because I made 2 dumb mistakes.", "Personally I put dainty although if i could go back and change it to finicky I would.  Just like the vocab I put ubiquitous but it could have easily been exorbinant. Which did you pick?  I agree they can go either way.  Curious to see how everyone does when the scores come out.", "Shoe one was 19/2 + 1/6 + 1/6 + 1/12", "k im getting kind of nervous about CB so im gonna stop discussing questions.....how do you delete posts on here?", "does anyone remember any of the CR questions", "does anybody know what the answer to the writing question about adults and their back? Was it back or backs ?", "gr8", "Guys, didn't anyone take to heart the promise we all signed about not sharing test questions?", "My daughter thought that March math was harder than the PSAT.  On the PSAT, she got a 750 with minimal prep.  She prepared for the March SAT and got a 750 again.  She said she ran out of time and had to guess on the last 3 questions.", "What was the correct answer then because I think I may have put determined to challenge and if I did then I know I found support in the passage,", "10 & 1/3 is definitely correct.", "That really bothers me........if I get a 2350+ I will personally call up your mother and tell her that even though I got that score, I'm no better than someone who got a 2300, 2200, or even say a 1700. It's just a test in the end......", "what was the answer to the vocab question about the buffalo?", "^YES", "Counterpart - a person or thing holding a position or performing a function that corresponds to that of another person or thing in another place.", "I'm so scared. I was really shooting for a 2100 but I don't know if that happened. We'll see : (", "I know it's been asked a million times, but what time are scores released (EST)? I saw some people saying usually 5am, but college board is saying that scores are just released at random times tomorrow. Which is true?", "Also, I didn't take the essay, and had no experimental section...", "was it just me, or was the entire test so easy?", "Did you guys get sqrt(109) for an answer? I believe it was for a hypotenuse of a pyramid...", "Did anyone get a string of b's and or d's in writing", "Can someone give me a quick score estimate?", "Guys let's find out the answers to all those questions we spent so long arguing about:", "Sorry all. I don't mean to complain. (I didn't realize you can't remove posts!). Now I know.", "I just saw on collegeboard that the result for March SAT is released on 10th of May. That's like more than 2 months for the score to be out. Omg.", "\"ease of the questions\" it wasn't like it was so ridiculously easy to warrant such a brutal curve..", "12", "-5=740/750", "I do not think that should matter. The scanning equipment should be able to pick up.", "for the gulliver question, the shipwreck answer is the only answer that makes sense to me. other answers are either not related or too extreme. I remember the shipwreck answer wording was like \"linked the disorder (or something like a mess) he made to that of the shipwreck\", which matches the context I think because his actions disrupt the algae", "What would my score of 1450 convert to an old SAT score of?", "For the grammar would it be awarded in or awarded for", "I had 3 wrong on math, 4 on writing and 3 on reading.", "What is the consensus if it was at all mentioned on the reading question which asked how the author of (internet) passage 1, would view the opening paragraph of (internet) passage 2. I've heard something along the lines of perfect description of his experience, and I believe I've also seen misrepresentation of the drawbacks of the internet. I chose neither, and said that the author of the first passage would regard the paragraph as understating the effects of the internet.", "i put 3", "so nobody knows the date that scores come out?", "Twelve hours left and I'm so scared. I made an obvious misbubbling between sections two and three and noticed it in time to get my proctor to file an irregularity report a couple weeks ago. I really, really hope they decided to fix my scores for me, even though it's really unlikely. I just hope they did because I've applied early and that's the last SAT I had planned to take and I would rather not go through the score verification process. : |", "Oh, I'm sorry!  I was thinking about the other question I got wrong haha. You're right, it was MC", "There was a question about function on math MCQ, anyone got -4?", "me too^ My scores are out tomorrow. I'll post here any updates on my superscore, if there are any.", "Ok, can someone else call lol? I spoke to this lady, and she didn't know what I was talking about at all. She said that there's no curvature lol, idk guys. I tried to explain that there has to be a curve but she was of no help. Nice lady though.", "I've been scoring600-670 on math", "Look at the US discussion......its definitely the same questions. CrackSAT has the wrong SAT under the link for June 2014.", "So the official time is 8 am. However, they've historically always been up BY 5 am. Earlier is possible as well, but less common. I've received scores like 3 times and it's always been 5am but yeah it depends. I'm getting a good night's sleep though, not worth staying up over when it's unlikely anyways. Good luck to everyone! goodnightt", "Okay so someone told me that if you take the old sat more than 3 times( this one will be my fourth) that they will average your indivudal section scores instead of super scoring by taking the highest in each. Is this true??", "I know for a fact I can not possible get a 2400; I messed up on CR and missed a couple in math", "what did you guys say was the meaning of \"bright\" for reading 20 mins", "Also, I was curious to assess the validity of scanning college confidential feeds when attempting to estimate scores. For those of you who have taken the SAT previously and have poured over these feeds, were you able to estimate your score with a considerable degree of accuracy?", "Was the October SAT easy? because my friend reached 2110, and I'm not saying I doubt her ability, but... I didn't think she would get over 2100.", "Will you people who got 800's in Math and writing (and care to share how you studied & got those scores) please message me?", "These concordance tables from the College Board should be helpful for those of you who are trying to make sense of your scores:", "I heard it was only if you're taking the one without an essay", "When are May SAT results coming out ? heard was little bit easy than March one", "Does anybody know when the scores for this makeup date will be posted?", "Because I wrote the wrong registration number, I'm going to have to wait another 5-7 days. Maybe that's for the best as I don't particularly want to see my math score lol. Already thinking about the November test, hopefully I'll be done after that one. Congrats to everyone that got the scores they wanted and good luck for next time to those that didn't do as well as they expected.", "Only 1 more week! What do you guys think you will get for your scores?", "Guys any idea which writing was the experimental if u had it?", "Math - 800 (didn't miss any)", "I", "Got the QAS, and the writings section is just some BS.", "This is my third attempt and two of my dream colleges have yet to contact me. This tip of the iceberg is my last hope of impressing them", "It didn't say consecutive. The answer is the last two.", "2010, 60 points lower than my last one. Looks like I'm taking the ACT. I hate my life.", "only ten minutes left", "I guess the collegeboard did Accept \"dainty\" because I got 100% sentence completion. However, I missed 5 passage questions, which surprised me. I know I missed rationale and doesn't care about details, but I got all the other consensus questions. Could someone with 100% passage questions post their answers?", "Someone in my testing room said \"I swear, the Zen passage has to be the Equating section. I put C for the entire section. Since the questions just seemed different.\" What a loss", "Does anyone remember the full sentence for the sinuous question?", "What is this google doc you all speak of? Will someone please explain lol", "To be an effective leader should leaders be willing to compromise?", "I dunno, maybe it has something to do with Jan test being the last old SAT", "So was the one about Ptolemy's complex dancing planets that it was sophisticated yet flawed, since geocentrism is obviously wrong, but it was complex? I heard some people saying the author thinks it's poetic, which I don't remember there being textual evidence for", "No two questions", "Sorry this has been said like 40 times but what was the consensus about the ptolemey one ?", "Curve guesses?", "Im a senior hoping for columbia/yale/harvard in that order from a tiny lil town in canada (people here dont even know what columbia is) how about u guys & where u planning to go? And the math questions i mentioned whatd you guys put ?", "Did you guys got 0 for one of the grid ins? The one from point A to B and back?", "Btw guys, we should start an sat results thread in May", "It was leaked after the March paper. If you did not follow the link that was given in the discussion before it was removed  then I am sorry.", "Im freaking out because Ive done like all the practice tests and I feel like CR score is getting WORSE! ahhh one more week!!! idk what to do pls help!", "Correct me if I'm wrong, for every question wrong on the math section, the scaled score drops down 30 points.  For example 2 wrong is a 720 and 3 wrong is a 690.", "Yes, definitely,", "Does anyone remember any answers to the improving paragraphs section??", "he probably cares more about the score than the laptop lol.", "22. the attitude conveyed in lines 68-72 ( \"nobody ... water\") is best described as a combination of", "hello!! can u help in my sat igot math 510 Cr 310 wr 460 iwant ti increase loke 300 or more", "I said the time the Bears go extinct and humans arrived correlates or something like that. Pretty sure that was right", "\"No matter what and how we teach, we believe that what we value the most is beyond our meager abilty to describe. We are struck dumb with admiration at the things we value, so we try to teach the secondary things that we think are easier tot alk about\" straight ftom the passage", "2400! Bye Collegeboard!!!", "SAT: 1520 (99%/99%), R&W;: 740 (99%/98%), M: 780 (99%/98%)", "do u remember the whole sentence?", "Writing curve seemed harsh.....my writing score dropped from an 800 (Dec 2015) to a 730 (Jan 2016) O.o but hurray for superscoring!!", "What score are you guys aiming for?  I think I'd like atleast a 1300-1400 on my first try since that was my PSAT and I didn't get much time to study.", "haha thanks! I'm mostly concerned about the ivies and THOSE schools you know? My score on the MC section was pretty good, so I just don't know if I should worry about the essay part", "opinions on \"sufficient enough\"?", "for the essay i wrote about how i won a competition using my gut feeling and how dr house (from house md) diagnosed a very hard case due to his gut feeling. Is that a good idea? can someone please help", "OK, so have we come to a conclusion? Will it be based off the December 2013 curve or the January 2016 Curve?", "What do you think the curve for an 800 Math will be? If I missed one could I still possibly get it?", "I'm expecting 1900+ but really hoping for 2100", "That trinidad passage was SO hard. Anyone remember any questions?", "2370(770 on Math ugggh)- I missed the integer question", "Update!!!", "where does it say march 11-18?", "omg... of all the ones to get wrong.... this one....", "That is weird. I just checked again. 690 w/ 3 wrong and 9 essay.", "Why score is still not available?? Thanks", "Im taking it tomorrow and i have no idea what to review right now", "Is it previously administered test, any idea about CR curve.", "*cries*", "Can everyone please post their scores along with their percentiles so that we can have an idea of how we did relative to each other?", "i got a perfect 800 on math but went down in my reading and writing scores", "Writing 78 multiple choice and essay 11-800", "What is the variable section?", "Trust me guys, you don't want nor need the link, its a google docs page, with a bunch of idiots writing on it, it is unbearable, the majority of the people writing on it are illiterate and can barely spell grade school words right. It is just people begging for the answers and debating which answer was right or wrong, just like on here. No one knows for sure.", "Yes, basically. I thought I did well also until I saw the charts", "I said the paradox came from the ambivalence of teaching profession... anyone else? Also what about explicit vs implicit", "And I got 2.5 for one of the free responses", "i thinkbest method is review and repeat test of studies i tried solving many blue book tests and those r very accurete very godo luck! but will the cfollege board repeat tests from past years in the october exam as it does many years?", "Wasn't there another question that asked something similar like, \"If minor details weren't important in the end, then why did teachers spend so much time on them?\"", "And also, i'm hearing a lot of different views on the difficulty of the new sat compared to the old one. I just hope that the weight of the SAT doesn't become insignificant if everyone does really well on the new one.", "What was the radius of the cylinder with 11 x 14?", "did anyone else call CB? I would have called them only if I weren't at school right now... this wait is endless and it is killing me lol", "^ I got 10 and 1/3", "Japanese Zen, the students had to keep copying the letter until they reached perfection. what was the answer? i think i put something with punishment??", "^^^^780+750+760=2290", "Really poignant.  Thank you.", "Well. I got that 30 degree question wrong. I got all the angles to equal 12x but accidentally used 180 not 360 degrees. So 2 or 3 wrong on math = fail see some of you in november's thread ! I have some studying to do!!", "Omg acc i forgot about the second meaning maybe i got that wrong.... Redress actually works better does it not ? *hopes im wrong*", "I got a 750 on the writing with 1 incorrect mc and a 9 essay.  My essay was the one about leaders willing to compromise.  How could", "@ kcarpenterfan", "Has anyone not gotten their scores yet? I'm in California and it still hasn't come up.", "Lol awkward", "Official tables are up", "Did anyone get an answer like \"It will be more difficult for future generations.\"?", "I got 2 wrong and 1 omit- landed a 720", "For the last question I put something like \"used personal example to justify a decision.\"", "supercalf: I think it's incredulous as well. Wasn't the author of passage 2 saying that the experiences of passage one was not credible because it was based on personal experiences rather than through scientific research. Dismissive sounds right too though, so I'm not too sure.", "really happy with the improvement from november", "What would 8 wrong in CR be? PLEASE ANSWER IM SO DESPERATE FOR A 700", "Hickey, I got that too. I tried 6 different sets of numbers and I kept getting that.", "Hi guys,", "So.......anyone from June 2014 wanna help a few brothas and sistahs out???", "Perhaps the curve will be amazing and 1 wrong will be 800 and i wont have to retake", "same a 1300-1450", "for the sentence completion with the advertising was the answer the one with glut", "So my testing center was closed due to the blizzard. The make up is in February 20th which is probably way too late for any of the schools I am considering. Is there a way to get your money back?", "\"Studies have suggested people may experience more jet lag than (is normal because they..) or (it is normal by failing..)\"", "Can someone explain the concordance tables to me and what they possibly could mean for the test scores? Any clarification would be appreciated", "Disturbing that no one on CC is reporting 1600, a perfect score.   Hmmmmmm....", "Did anyone get the math question about the lowest possible value for y when radical(y-3) = radical (x-2) + x", "should i attempt to superscore? the 2300 was my first SAT attempt (though I did do a prep program)", "It said like how many ways can you make 12 from 2 3 5 or something like that", "My answer was something about shipwreck. There was a footnote defining a term as a \"shipwreck\". Many others, that were on this page last night, reaffirmed this answer. I really hope it's right.", "Anyone got ominous explanation in section 8", "I had analystical, fundamental but flawed and dispel misconception", "I got a CR experimental section and man! that was hard! Most of the passage questions were generalized and I had to read the entire thing before I could answer a single question!", "Anyone have the math section with the table and stack of books diagram and thought that that's the experimental section?", "Was it \"unthinkable\"? I thought it was \"deceptive\" because the author of the second passage said that babies have an innate ability to learn language, not that they were born knowing language. I don't think the author shot the other passage down, so unthinkable seems a little harsh. I may be wrong though, critical reading is my worst section.", "oh how quiet this thread has become", "does anyone know if the college board is going to cancel march sat scores because of the massive leak they had? looks like you can get the march 2016 sat all over the internet now.", "did anyone get sqroot109 too?", "In the thread \"New SAT Reading Scores\", some people have posted how many they missed in Reading and Writing and what their scores were.  We need more posts to get a clearer pattern, but so far, it seems that missing one question in Reading subtracted 10 points, and missing one question in Writing subtracted 10 points.", "Anika839 I got that one too", "When will we get our scores back?", "zilch for pa", "Was the trapzoid 5/3 or 3/5", "nothing for GA", "Score prediction please?", "At first I put 5/3, but then I thought it would be perpendicular...", "I got a 2090, I feel like I should retake it but I'm not sure if I should choose December and January or only January. The October sat was my first time taking the sat. However, I feel like it won't look good if I take the sat in December and January. so I'm leaning towards signing up only for January. Any advice?", "Guys, I made a really stupid mistake: I wrote the first part of my essay on the second sheet and the second part of my essay on the first sheet. I made a note saying which is which, and I used strong vocab and filled both pages. Do you guys think a 10+ is still possible?", "is it unsubstanciated and alarmist or self-evident", "What do you all think about the math curve (missing 1)?", "The token question wasn't experimental, it couldn't have been because it was in the only 20 minute 16 question math section.", "Yep--congrats to those of you who did well, condolences to those who didn't hit their mark. Either way, it's just one test and not a referendum on who you are or what you're worth.", "does anyone have the pdf by any chance for the dec 2013 or the international one please i really want to see it!!", "yoo what if we get an extra 200 points for the long wait", "any advice please???", "What abt explicit in 1 but not 2: the popularity not subdue in modern time right?", "Got a 1300. Got 770 in English and 530 in math. Disappointed in my math score. Do you guys know how I can improve, please? Lol, now considering taking the ACT for the first time... Is it worth it? Is easier to get a better score on it, especially in the math portion?", "So does anybody know exactly when the Feb 20 SAT scores will be out? I live in New Jersey and mine still aren't available.", "Even I finished taking mine in india like an hour back. Are the international and US ones really that different?", "And i couldnt bring myself to say no bearing", "prediction please?", "hey pokemon1, speaking of essay and writing in general, the correct grammar form is \"different questions FROM previous tests\", not \"different questions THAN previous tests.\"", "Prepscholar: \"Scores are usually released as early as 5AM Eastern Time, or 2AM Pacific Time. Depending on your account and the test date, this can be delayed by a few hours...Usually everyone can access their score by 8AM Eastern/5AM Pacific.\"", "Did anyone get 72 for the last grid in? and 4/3b^2 for one of the multiple choice?", "Wow then if a 1400 is only a 1990 that's crazy.", "Like I said in my last post guys... Relax, scores will come when they say it'll come.", "1 min to 8.....", "How are people getting their scores? Like just refreshing the page a bunch? When will the servers be back up? Anyome experience this before on a exam before", "It is the only book you should be using. It was made by the test takers themselves. All the other books you use will not accurately represent how well you will do.", "Really? But it's the first new SAT test how can it have leaked out before we took it?", "mine still say available soon!", "will colleges ask to see the subscores? because the subscores make me look like im doing way better. reading: 37/40, writing: 35/40, math: 37/40...13 mistakes total.... THIS IS SO WEIRD on the old sat, getting 10 wrong would still be in the 2300 range....THIS TEST IS TELLING ME THAT MY 1460 IS EQUAL TO A 2090... makes me feel like ****....", "It may be a sign! When I first took the exam, I had a dream that I got a low score and when I woke up I did.", "Plato caused popularity, you can also look that one up, its factual", "I believe the passage made a call to action to \"look in the past\" and revert back to use of timber, and although it did mention moving away from iron/steel, I felt that the main focus was reimplementing the heavy use of timber. The most interesting part is that I can't remember what I put down. (:", "^^^^^^^^^ Anyone?", "What was the vocab question with the answer \"enmity\"? Was that right?", "Also what was the math question that asked about the median of 31 numbers and the greatest number minus the smallest number's smallest value was what? (I remember the answers being like 30,31,60,61 and some other number)", "When deciding if you should take a test again, it probably is important to know what schools are your top choices. For example, if U Penn, Georgetown, and Stanford are in your top three, they want everything so unless you think you can go up, it might be a little risky. But many equally or more selective schools allow you to use score choice. And some want writing and some don't. So I would make a chart of who wants what (including subject tests) and come up with your testing strategy based on that. Unfortunately, every school has a different spin on this topic so you need to just go with your top choices' use of scores to guide you in what to do.", "no, but i remember 4 b's in a row in writing", "I know... worked really hard for it. 10 blue book tests... three more fom SAT website...  also reading comprehension from other tests. I have already signed up for November SAT just in case. On blue book's towards the end I was scoring 680-720 range... proud of that from 530, but on the bubble of 700 that I'm not sure I have done it yet. I am a junior so I am trying to get the 700 before test changes in March.", "i agree, absolutely correct is perfectly acceptable.", "It's been so long since I've taken it that I forgot how I think I did on the test lol.", "Does anyone remember that question about the exotic particles if the statement were true? And the other ones in the dark matter passage, I remember the number of the questions I found difficult were 10 11 and 16, but idk what the questions were.", "What were the other choices to the misconception question", "Loool someone answer the ptolmey question this is going to drive me crazy. Writing and math were a joke but if i got a 800 in reading i couldnt care less. Btw does anyone know how much it is to send sat scores to university? If you superscore and send scores from 2 is it twice as much money?", "I can sympathize with you guys so much! Best of luck on your college endeavors and hope you dont have to take the new SAT.", "Counterparts correct", "How top?", "Has anyone actually gotten a concrete time from CB??????", "So nervous about the test tomorrow! Good luck everyone .", "I'm pretty sure I missed a lot in math. Had to guess on about 7 or so", "For  all you guys who say that sinuous curve is redundant and wrong", "*Internet: eager to be part of consensus/want a simpler life/attention-grabbing pronouncement/etc?", "Same lol ive went to this tutor guy for math 2c cause hes my friends uncle and hes never had someone not get an 800 so i feel good about that and on first physics practice test i got an 800 so im just worried about sat 1. But you could retake sat 1 in december ?", "I was a bit nervous & couldn't concentrate at the beginning, so I kinda blew the questions in first two passage. Things got better and math is simple with many algebra Qs. BUT my roommate asked me one statistic question that she couldn't figure out, I just didn't understand what she said. Are we taking the same test or there were just 2 sets of questions today???!!!!!", "I would cancel your order,", "I need a lot of help I got 1280 in the trial this is my second try at the exam I dont want to do the new one", "Im actually so happy this thread has been so chill. Its been a great journey so far", "Do you mean 1600 out of 2400,", "2370 (770 math 800 cr and 800 writing) now i have a 2400 superscore cuz i got an 800 math in january when i first took it. message me if u wanna know how i studied, it was largely due to this site. and for anyone not happy w their score, don't worry too much. you still have more chances to take it and this is the type of test you can study for. when i first took it i wasn't that happy with my critical reading and writing scores, but i worked at it over the summer. so don't be too down. and congrats to anyone who did well!", "Can someone please estimate my scores?", "May 10th.", "790 (2 wrong) Reading", "What was the writing curve on the December 2014 test", "Oh I think I had an experimental CR section? Couldn't tell. But I did have 4 CR sections, but I couldn't tell.", "is the answer literary allusion or sth comparison?", "800 W", "Anybody else think sinuous was correctly used and the answer was \"no error\"? I'm holding out hope since", "What was the vocab word with the sentence about Judy Chicago's Dinner Table and women?", "They indeed did recycle it from June 2014. Proof:", "What do you guys think are the chances the February 20th SAT will be the same or similar to the one taken today? If it is different, will questions be pulled from prior exams or will it be a totally new, never-before-seen test?", "Don't care about Math and Writing cause I can superscore, for CR thinking 6-8 missed. Boy, I'll be on the verge of that 700, I'll probably register for November SAT too", "Rip 800 math dream", "Yeah. Do you think it means that many did well on the test?", "As a 10th grader, I'm really happy to get a 2330 (800math 770writing 760reading)", "Cool that's what I put", "About 22 more hours!", "Scores are up!", "Terribly on math, but really well on reading and writing.", "Anyone remember the choices for the sinuous question as well as the one with ominous and genuine?", "Counterpart means corresponding things in another place", "If I did very well on writing and reading- like close to 800, but utterly failed at math, do I still have a chance? Math is the bane of my existence.", "I got 35 composite in ACT last month, and today I got 1550 in new SAT", "I'm just pissed that the CR curve is so damn harsh....-2 790, -3 750... I was hoping for a 750 but I think I got 4 wrong", "If I omitted 5 math questions and missed 2, around what score do you thing that is for math?", "The \"Help\" says there is a download button, but I can't find it.", "back in the 530 days could not finish. after 10 bluebooks I finish every time and have jumped to 650 which is a big jump. so now i'm in the category where i'm still missing about 10 questions, both vocab and passages... usually 1-2 vocab and the rest passages.", "Curve Predictions??", "We should all be in a circle and pray for a lenient curve.", "Should I scream into the abyss? I have heard of others at my testing center receiving their scores on time. Am I unlikely to get anywhere if I call College Board? I am under the impression that I need my score relatively soon for an application.", "I don't think \"as diverse as\" was an error. For the sinuous one everyone's asking about, I thought the option with \"which\" in it was the error because I felt that it was ambiguous..but I might be wrong", "what did you put msbox for the answer", "Score prediction:", "I chose 31, I think. The whole thing would be 60 to 90, and since there's a definite median, the set would have 31 numbers, not 30.", "Still have not received it…on the east coast.", "Send the 36, and forget about the SAT!", "New jersey", "Correction: Then play devil's advocate and find reasons why answers are wrong as opposed to why they are right.", "Tell me the sentences", "Definitely 7/pi for radius", "11 essay 78/80 --> 800", "That sounds horrible are you sure they'll delay it a month?", "for the 02/20 test date, yes", "Senior, 3rd and last attempt", "Anyone pls confirm the shoe size 9 11/12 plssss", "I don't understand why they don't just curve it so a 1400 on the new SAT equals a 2100 on the old, etc.  These new conversions unnecessarily complicate these scores.", "Hi everyone - when you have a cgance could you go to this thread and post your thoughts and suggested about the new SAT?", "yea cr was so hard...i think i had a cr experimental and i have a feeling it was section 4 since s3 had 23 questions and s7 had 25 questions but only s4 had 24 questions. i hope im right because i really bombed on s4", "wait so they are releasing at least before 5pm today?", "8", "I'm literally INFURIATED right now. The January SAT is supposed to be my last, and I feel so ready for it. However, my test center is closed because of weather. What's worse is that I don't even know when the makeup is gonna be. All right. Maybe it's God's will to let me do more test prep...", "Re: above ^", "when do scores come out ?", "Down to 6 days before the test.  Anybody nervous?  Also I am continually testing in the 2040 ish range.  Is there anything I can do to bring my score up to 2100 ish.  I have a really low writing score which is bogging me down. My best SAT practice test scores are 720 M 680 CR (which should go up lol I did that one in a really loud house with no AC) and 640 W with 10 essay.  How can I increase my writing score by like 20 or 30 points anyone!!!", "People need to come to grips with the fact that these were not challenging questions and that petitioning is just rationalization of your own careless mistakes. Either study more or accept your performance. I don't know how you guys can have the arrogance to attribute all of your mistakes to greater inadequacies with the testing system.", "Im applying to berkley !", "For the grammar section with the roommate, what was the consensus on the question about \"the experience will be a surprise\"?", "im too feckless to answer your unscrupulously made question", "I scored a 1440", "A little over 6 hours left...", "2270 and youre dissappointed...smfh", "1570, 800M, 770R&W;, 20 Essay.  Disappointed-- really wanted a 1600.  Retaking at this point would be like retaking a 35 eq for a 36.  I feel like it's too late to take the June SAT (don't have much time to prepare) and don't want to take in the Fall, so will probably settle.", "I got an 11 and I think I wrote about Genghis Khan and the youth generation of Natzi Germany.", "For the first time, I might actually do better in reading than math.", "I put dismissive too. I left one blank (ranifications one) and i have yet to find another wrong but plato could easily be wrong and maybe a zen one so im not sure.", "I am taking the rescheduled ones Saturday! any tips?", "I don't even remember that question....It would be C tho. This is kinda unsettling", "Welp they didn't come out today. Guess they're really holding true to their words about releasing on March 11th..", "Also, how do you guys think the critical reading 'curve' will be for this test?  Did you think it was harder than normal or about the same, easier?  Usually its about -2/-3 raw score (not missed questions) for an 800 still.  Has it ever been lower than that, -4?", "scores are released in the middle of AP exams though", "Anyone with 800 in CR have passage strategies?", "So 2:00 am or 5:00 am tonight?", "perhaps we will get our scores tomorrow too", "It was not flux, it was either schism or digression", "Never mind, just saw that someone said May!", "which physics r u takn? I took 1 and c and it was a pain", "Only 6 more days", "This is most likely not the case due to cheating, and may have already been adressed, but is the sat tomorrow the same one that was administered on Wednesday?", "Are there any discussions to the March 2 exam? I can't seem to find them.", "If you go to college board then click the blue link at the top of the page that says like \"January SAT scores are now available\", it'll take you to a page where it shows your essay score. You probably got like a 78 MC and 10 essay like", "The writing curve did seem harsh. I think i only got one wrong and it brought the mc score own to 75.", "i live in east asia and took my first test today.. but are we even allowed to discuss about specific questions, essay topics, or dummies?", "Colleges will be able to see subscores for each section:", "Yes", "Good luck studying for the January SAT guys!", "i'm a little confused... do east coast and west coast have different tests? it seems like i got a completely different test...", "I think it will be fun to check this thread once scores come out and see what the correct answers actually were.", "its not origins because the passage didnt explicitly talk about the origins of the practice which would include way back into its history. moreover, you probably didnt read the question right. it probably said what was the author PRIMARILY talking about. the origins answer was pretty extreme", "Why do I feel that Panda SAT is horribly inaccurate for Math. According to them, there is an 80% chance that -1 is 780 or above(with 25% chance of 800) yet most -1ers report 770. I just don't get it.", "What I found interesting about the Writing was that I missed 0 on the identifying errors. That has never happened before on a practice test. I missed 3 on the improving sentences and 1 on improving paragraphs and I usually get 100% on those sections. So I found that interesting.", "2320!", "Superscore of 2320", "good luck erebody", "What is the best way to improve on math?", "Just reiterating a point. It really did ask for X, not 2x.", "I said 3 for the graph transormation one?", "Let me elaborate, sine, cosine, tangent, radians, etc. definitely no conic sections", "in May", "Pretty sure it was ubiquitus", "Makes sense, thanks. Also, the second to last grid-in was worded somewhat ambiguously. That was the question where Person A earned half as much as Person B and Person C earned twice as much as Person B. It asked how much Person C made if \"they\" earned $168. They was an ambiguous pronoun because it did not distinguish whether or not to include person B in the total amount earned. Any thoughts?", "I got a 1360 - 710 reading 650 math", "God, this is so annoying that the site is down!", "What was the answer to the six angles, and three are given, x, 2x, 3x? Can anyone explain to me how you did it too, I would really appreciate it", "Compromise V fairness", "ugh. I think I'm suffering from Educational burnout. I can't focus on practice tests and I have yet to write a template for the SAT  essay. I'm super upset..", "Same", "Was the one about evolution, cyanobacteria, and oxygen an experimental section???", "Still haven't gotten my QAS test....", "I got a 700 in CR and I didn't omit any, according to the curve, how many do you guys think i missed?", "Does anyone remember what they put for the last three questions in the ten minute writing section?", "I hope not!", "does anyone think scores could come today or tomorrow? last year they took it on feb 21 and got scores mar 3...", "The CB has said that scores won't be released until May. If anyone's already gotten scores, I'd be pretty surprised.", "does anyone know the answers to my questions 100%?", "Wait online it says May 10th though! Omg another 8 days?!", "did anyone take the dec sats? i feel like this one was harder than last time's", "I really hope I get an 800 in CR this time around. The only ones I'm not 100% sure about are..", "It wasn't 7/pi for a fact. When you crush a cylinder into a flat box, you're ignoring the fact that 14 for the length has to be multiplied by two to get the circumference of the circle. There are two sides to the 14 and when you open up the box to a cylinder again, the circumference is 28 therefore making the answer 14/pi", "Anyone get a math section for equating???", "Did you get civilization something for the short passage of reading? To object to a process for another? Something related to concerned about details for the second to last question in that passage? I got 3 no errors because sinuous is redundant.", "I know A is the right answer", "xxxx", "Took it on May 7th, I believe scores will come out for that on June 16th. Seems like everyone's done well so far.", "No I know for an absolute 100% sure fact that the answer to that question was NE. I went to past docs that debated this question and they said the answer turned out to be NE. Did anyone get the \"guy tried to keep his words from going into unuse\" question or something like that as another NE?", "Just out of curiosity, did anyone find the mat no-calc hard?", "God, I did SO much worse than I thought. I missed 13 on writing.. ****! I never get below a 750 in practice.", "I put that as an error..because sufficiently enough is redundant...", "no what happened?", "do colleges see how many times one has taken the SAT? And which colleges superscore? I find the superscoring to be extremely idiotic as one can take the test several times to receive a higher superscore", "i put those of. i really couldnt decide between the two so i decided those of because it mentioned two parties (those of children AND adults) rather than one. i dont knkw if im right but", "Predictions?", "Well...time to register for the ACT now", "Just \"normal\"", "You both are wrong. The sentence is correct. The correct idiom is \"contrast with,\" not \"contrast against\" or \"contrast to\"", "The final stretch", "i regret not just taking the act", "Hey all, sorry for the late response. There was a sudden power outage at my house, so it hasn't been the best of days", "cool", "I just checked, twitter says May 10th:", "Does anyone remember what they put for the last two writing questions for the 10 min section? I can't remember how I responded", "I got 1/27 aka .037 as well", "I'm really hoping for above a 2350! The October test curve was pretty harsh, do you guys think that January will be easy or hard??? I'm just worried bc its collegeboard's last chance to screw us over on the current exam", "I found it interesting that the PSAT had a very lenient math curve (missed 3 and got 750) as opposed to the old SAT/PSAT where missing 3 questions could cost someone 70-90 points. The grammar curve, meanwhile, was the harshest of the three sections. Do you guys think grammar will have the hardest curve on the New SAT test?", "I did worse on my CR by 50 points on my third time taking it. And I thought it was easy this time..", "SAT: 1470 (99th percentile (test sample) and 98% (actual national sample)) MATH: 740 (98th and 96th) READING +WRITING: 730 (99th and 97th)", "I got a reading section that had one question and then the next question asked 'which of these lines is proof for the previous question'"]