["Is that like 2500 sales? Lol", "She released a statement saying there's no lawsuit.", "Speak the truth, they cal you mentally ill... Cold world!", "THUG LIFE In Peace Big Syke", "Kanye West Won't Win Because Of The Rant On His Show -_- Music Industry Politics", "She should remember greed is one of the 7 deadly sins, like she ain't dipping into the offerings!", "Now yall wanna be tmz or MTO....i don't gaf about a pos and a hoe that ain't do sh*t to please my ears...go get me some news about some nu cats that hav bars....danm!", "We'll see since he's been garbage forever and his last listenable album was late registration", "These days was alright ..not really crazy amount of replay value Imo..haven't bumped this one ..but solo has more then he gives ..he's dope as fuck", "Nothing can stop I'm all way down!", "Thats when you realize that the music industry is fu@$ up, you no need no more talent to be in the music industry", "RIP to all the Dead Rappers", "It's between All the way up, No problems or T.I.s Warzone cuz of the climate", "Listened to AB new album.....first of any of his work I listened to cause of all the hype....not impressed with his lyrical skills....speaks to current state of hip hop that average is considered dope...#goldenagebaby", "Lol smh I'm always dope ! Marcel stay hatin smh", "So much trouble in the world nigga\nAint nobody feel ya pains\nThe world changing everyday\nTime moving fast\n\n#Alleyezonme.\nRIP BIG SYKE", "No way I just listened to the cole album and maybe 4 tracks cole has yet to put out anything comparable to god son let alone stillmatic", "Nope but they do have a herd of dickriders", "I hate this generation somethings get run into the ground to the point it gets annoying", "Is he on meth? He's acting real methy.", "He should get used to a jail cell..I hope he never sees freedom again the fat piece of s***....", "The man is right dunks doughnuts aren't good even if they are free and Krispy Kream is the doughnuts they serve in heaven", "CBO YUKMOUTH BROTHA LYNCH 2PAC TECH N9NE SPICE 1 SPM SCARFACE", "LL Cool downgraded to JaRule than JaRule downgraded to Drake, think of it and HELL NO J COLE IS NOT ANY WHERE NEAR NAS, and drake was cool but he ain't no new Jay Z", "For all I care let him stay in jail he knew what he did and what he down to easy -E fuck u prick God bless on your soul", "Why was false prophets not on the album", "Hey HipHopDX.com I'd like an interview", "Oh please, this piece of shit rapist doesn't give a fuck about reuniting \"with his son.\"", "Ban that nugga from all 50 states idgaf", "This that diddy bop get ready for the winter music", "He look like Uncle Phil now", "My Lord, I had to jump on this!..Because these young folks are so STUPID I seen this interview of her and she was DELIGHTED and she did a script of YOU NAME so stop spreading rumors that's why we are so divided because of lack of knowledge, do you homework instead of copying off someone else paper!", "Of course this was all a marketing ploy the album will still be trash but people will buy in with all this bullshit", "He fell for one of his songs Gold Digger and now he will drive off in a hyundai", "Sounds like a child who mashed a bunch of songs together and barely managed to think of some basic words that rhyme.  Embarrassing.", "Christopher Geddes look at that track list", "let it play on the radio 700 times and youll listen to it again.", "Big releases n u didnt put tech there?\nN put post malone in there\nU fucking kidding me!\nMalone had one good vibing song n others were so fucking trash!\nIt hurt listening to him", "That album is boring as fuck. Dont get me wrong I love Cole and his lyrics but 4 Your Eyez Only is mehh. Tech N9ne and Ab-Soul better.", "I feel this is kinda petty on Ms Ceasar's part.  She was just on Ricky Smiley's show, and was ok with it, but now she's suing?", "I personally think good artists should hold off a month so they can enjoy album sales for themselves", "Used to be my ringtone, damn shame", "It's just aight. People need to be honest. And I have mad respect for Cole. But this album won't be memorable after this month", "Shout out from Detroit 313 in this bitch wudup doe", "The Big Man will be Back in No time...Wait n C", "Just because Im a hater... SHOPPED!!! j/k... that was dope", "I haven't heard any of his music.", "Overated asf, and there should never be an award for that shit, its better to buy the physical copy of anything it shows that you cared to go out and buy the album and now u can show it off without wasting space on your phone", "I don't know. They been gone to long", "Ever thought that really they are just unique and don't need comparisons. Just as the times changed so did the artists. LeBron isn't trying to be the new Jordan he's just LeBron. Kendrick is Kendrick. They deserve their own respect. We don't always have to have a new whatever. The past was special because that's what it was. Trying to duplicate it takes away from the past and present.", "No mentions that Joel Ortiz is on it.. smh", "Rihanna had hits. Drake had some moments. Ye gave us Pablo.", "Hope you already meet PAC in heaven", "Jay electronica hasn't even put out an official album. I can't take that dude seriously.", "Mike Stillone he aint stunting ahaha", "It's better than cole album and cole album is fire", "Anything except music from these Fake deep rappers, The would-you-take-a-break-please rappers. Especially the amateur eight week rappers, Lil' whatever, These short bus rapper, Fake drug dealers turn tour bus trappers, These Pitchfork rappers, These hipster rappers and these piss-poor rappers.", "Amazing  post  very informative", "Some of you lack basic comprehension. If Cole isn't the Nas of this generation, who is? The article isn't saying they're equally great.", "Shan just mad that KRS-One has wrecked him twice now!!\n\nMC Shan: Still Huggin A Nut\nhttps://m.youtube.com/watch?v=7tzNSDYqtrc", "this guy seems to be hungry for attention,its like lower grade beefing", "The 'college dropout' is a classic!  \nEvery time I hear that title 'Family business' and 'spaceship' starts playing in my head.", "These Canadian dudes got the American charts on lock!", "Sheriel Grant but I feel the same way lol", "Alexa Chu when I get new clothing", "There is no way he's going to win best rap album.", "We all in nija miss ur voice and ur song R.I.P.dog", "Some people will believe anything, as long as it's on social media. Smh", "Man OITNB is just not working out for him", "It's not a bad album but by no means does it contend with his past projects", "Wow! Let me know when he next wipes his ass. Which I'm sure you will.", "You have lil yachty in the pic... I cannot take anything further you say seriously!", "Starr Carlisle Nothing older than 6 months.", "Hip hop was still a serious art form back then", "COLE IS GOD ??. FUCK YOU AVERAGE RAP FANS WITH LITTLE KNOWLEDGE", "she didnt do anything people are fucking stupid. ppl freaking out and trying to bash her have never been to miami during something like art basel CLEARLY. this homeless woman was yelling at her car and she filmed it after and was comical nicki while being polite. she was laughing at the situation.. people do sooo much worse when i saw the footage i was like u gotta be fucking kidding me this is the biggest reach for a story", "Had that extra track who shot ya?", "Really! Yall need to get one, I saw nothing in this video to suggest anything. Trump said and suggested worse than this", "Thing about These Days...it wasnt bad. He just put the mirror up to the face of the listeners when it came to music yall put on a pedestal. I listened to #DWTW last night and was blown away. I'll have to live with it a little while longer but its potentially is way better than Control System. And thats hard for me to say.", "Lol Randell go ahead and post as long as it's not more than 6 months old", "Wen is he going to become Soulja man ?", "That's white nigga it's a tranny", "Why not! I bet he will go platinum only thing we don't get is awards and recognition but the guy is pushing let's not forget his going platinum with Nas like music in an era of trap and music about party life too besides features his music is not so big in mainstream but still his touching hearts and souls!", "Why do these dudes fall for them Kardashian chicks ... tryna come up off their fame smh 21 gone get a curse put on his black azz ...", "the album is 4 the ears only :3 ;) :)", "Krispy cream is about as good as your album from what here", "But why are you acting like you don't know they're joking?", "Yusuf Daud woah man. Rip. Made some great features with pac", "there aint nothing like a brooklyn girl.... (nb) you need to finish your battle with serious jones before people can take you seriously", "If we are combining popularity and quality, No Problem is the winner.", "Nothing about Post's - Stoney?  This shit is Hot!  ;)", "Yeah right. Stupid lying asshole bitch", "He did this a while back at a concert tho", "Breaking News...J.Cole Album dropping soon.Throw away all your current music.", "This is what I got out of the article. \n\nModern Jay-Z: Drake \nModern Nas: J.Cole\nModern 2Pac: Kendrick Lamar", "Who's the next artist you wanna work with. Or who would do you really wanna work with next ?", "No worse than the \"Leader\" of our country mocking that mentally ill reporter amongst other things he's done", "Ummmmm...I just went to a dipset show with Jimmy,CamJuelz,and zeke like a year ago??", "Kanye West is not losing his mind", "Fk this low key racist meme", "Dont ever put Nas and Jcole in the same sentence. And Jay Z was consistent his whole career bringing fire every album. Drake was a dope rapper then this dude turned pop so I wouldnt even say hes Jay Z, hes more Taylor Swift than Jay Z", "Wu-Tang , BCC, The Lox , Jay-z, beanie sigel , freeway , 2pac, Nas, Big Pun , Slaughter House , Krs-one, Ra The Rugged Man, Pete rock & cal smooth , PE, The Roots , Common , RedMan , Epmd, Dmx, Busta Rhymes , a tribe called the quest , Eminem :)", "No sympathy for this shitbag. Has the biggest burden for hip hop falling off", "THE NEIGHBORS THINK I'M SELLIN DOPE!", "The dude got something to say man, he's opinionated....Im not saying he the dopest ever but from gangbanging to holding a mic down and trying to uplift THIS fucked up generation... not the biggest fan either but I think he's straight.....download the album Summertime 06,it might change your view...", "waiting for the jcole no features comments", "Fuck Brisco,ever since he ratted everyone stopped fucking with him", "What does the grammy know about hip hop? Artists who get  money dont give a flying fuck.", "I have no words for this bullshit bruh!", "Oh come the fuck on, they're obviously joking around, don't take it so serious", "This my favorite album from Cam'ron overall! It's a classic to me the production was crazy and you know Cam had that unique style you had to love... Lol", "These Days was dope for beats. It was just Soulo rhymes which were a bit flatter than Long Term 2 or Control System. \nHis new joint on one listen sounds fire.", "Why does she have to be the \"teacher\"?", "Soo many good contributions check out time bury me a G how long will they mourn me all eyes on me ......", "Haha the both of them Shouldn't even get one!!", "When the second one came out???", "The Kim Kardashian Kurse (aka. KKK or 3K) has strike again", "He is the new him, She is the new her, my generation and elders before strived to be us, independant all i hear is oooooh shit this guys the new Tupac, thats an exmple.. NO NO NO shits twisted, be you ffs", "Everyone in that groups a buncha females nowadays so it aint happenin him n cams always in they bitch ass feelings", "Comparing Future to Lil Wayne is asinine. But I agree with the rest", "He selling out just like Kanye", "It will be the year that people realize he's not that dope", "Do y'all listen to music or just skim thru it.. album is dope as hell don't sleep", "I don't follow Grammys anymore because it does not recognize real hip hop....I like Drake's Views it's nice,but to be honest that's not a hip hop album it's an R&B /dance hall album", "https://youtu.be/xNhcpmogUbA CHECK OUT MY BOY SUBSCRIBE SUPPORT THE MOVEMENT MANY MORE VIDEOS ON THE CHANNEL", "Album was trash except dead wrong.", "Lmao!! We always laugh at retarded people in the hood!", "Who thw fuck is azelia banks", "Damn sad day in hip hop", "Ask hospital for ticket real diamond nurse to see the show", "BOSS UNLIKE  THE REST WHO IS MILKING LIKE BABY ROSS", "It's truly sad that these dudes feel they have to commit a heinous crime to get a record deal. I gotta idea! Learn how to rap!", "Cole is an icon for such great songwriting and emotion. This new album is sick. FHD didn't click until about a year later with me because some of it just kinda felt lazy compared to what he did in the past. But as I grew up and matured it took on a whole new feel and it made me really appreciate it. But this one is so much better than FHD. Cole has so many great records.", "You know J Coles lyrics are real when you get chills because you had to rewind a lyric because it smacked you in the face with a cold dose of reality.", "Award\"showz\" have been garbage my whole life with rare exemptions where they actually honor talent... so who cares the grammys are the worst offenders", "Laura Melendez what do you think?", "So wouldn't that make him platinum?", "Damn, Tupac's bodyguard found dead some time ago, not too long; now Big Syke?!!! I'm old as sh%t!", "The problem with j cole is...it doesn't matter what he does. He's not better than Kendrick", "Hahaha that lasted a Lil longer than I thought. At least Ray J Didn't marry her hahaha he was smart. Make a sex video and bounce haha", "I don't know why there are surprised emojis here, like nobody thought Nicki had this type of behavior in her. She probably just couldn't stand someone not knowing or caring who the fuck she is. She still went and found a way to get attention out of it. I dunno what she's laughing at though.. bitch walks around looking like a confused reptilian.", "If they give him bond, shit sug gone.", "Thank you guys for watching my video.i have a good folllowing and growing plus support of Hotnewhiphop! I would like to email you guys for possible support on your site.", "I'd say as far as the culture goes.. it's definitely good. That is only maybe an issue for the individual artists, in terms of like \"how well your album sold in its first week\" type of thing. Other than that.. if they want your album, they'll still buy it eventually.. they just may buy the other guy's albums first.", "I feel like he was laid back on this album. It's something you listen to with head phones at night after a long day. Not something to bump in the car.", "You know how we do it!", "Platinum, that's Cole right there, nothing average", "\"your time is limited, so don't spend it living someone else's life ... And most important, have the courage to follow your heart and intuition. They somehow already know what you truly want to become. Everything else is secondary.\"", "He makes music for weird white boys....lost hisg card when he left Regime", "Back when hip hop was the shit, nowdays the game is full of gay ass rappers who cant make any sense.", "Panda and Timmy Turner hahahaha .... those are Hits ,Turn up for real but a Grammy :o where is J.cole  when you need him", "If it was that easy don't you think everybody would make fake money? How you think you won't gone get caught?", "once touted to be the next kanye, damn homie, what happened to you", "Rex Sanders We already played your joint.", "That sounded gay what tyga said tf. 21 gonna body that nigga", "Ppl pick apart stuff waaaaaaay too much. Jus enjoy it (or dont) and keep it moving. Stuff like this should only affect you if your in your teens lol.", "This is something Kyle would do Levi Jared", "I JSt don't get y ppl r on this guy's dick.I mean his music sux", "This dude is a genius... He's dissing all these \"short bus rappers\" and even calling out Kanye for the insane person HE IS. \n\nFinally a rapper with brains enough to call that fool out and who doesn't suck dick to get on everybody's good side. Kanye ain't no genius, but J. Cole IS.", "Album art looks like it was made in Powerpoint.", "Blows Coles album out of the universe", "Its lit as fuck. Seriously this guy bangin all the way!", "These days wasn't even that bad of an album...i really don't get it not having replay value? Have some fun? Stigmata? Hunnid Stax? People obsess too much on the newest music nowadays and really don't let lyrics or meaning digest anymore...", "Spencer Lane Karl Deissinger Eli Jaramillo", "I think Kanye is in a mental hospital and possibly being given extreme psychological drugs. He's been a little too quiet and we're not seeing him. I wouldn't be surprised if Kim had him admitted..not sure if I believe that divorce story though. Prayers to Kanye and I hope they're not destroying the little bit of sanity he has left.", "Gay ass Puffy released this album not Biggy. 'Dead wrong' ft Eminem was the best hit in my opinion", "Macklemore once again pandering, saying exactly what he expects everyone wants to here... there's nothing genuine about this bum at all", "Good. Competition brings out the best in people (usually)", "This album is like Control System pt.2", "Juelz released 3 songs in the past 3 weeks, I'll settle for this turning into Juelz's comeback, That guy was so talented and had so much potential, I have no idea what happened to him after What the Games been missing, I know he released God willin 3-4 years ago but he disappeared again. Hopefully this time a comeback is gonna happen", "Vision still blurry as a bitch..could write a book about it..", "As a fan it was a great day all three have a spot in the catalog", "He is been in jail all his life...this nigga though", "what about wrecking our eardrums... !!", "lol no what mArcel ima send y'all Freestyle video lol don't play me either ima beast off the top !!! lol don't hate", "this was announced at the beginning if the year...", "To die a young legend or live a long life unfulfilled Cause you wanna change the world But while alive you never will Cause they only feel you after you gone, or I've been told And now I'm caught between bein' heard and gettin' old. J Cole - Immortal", "If he had info on clinton there needs to be an investigation", "Randy Savage with the dance moves", "Shes always makin fun of somebody thats nothing new....she mock lilkim all these years", "When will this fuckery stop? (DJ Akademiks voice)", "Hannah Williams he copied my jelly legs", "That's fucking awful!!! This speaks more to the quality of consumers of music than the artists themselves. Especially when Lil Whothefuckever is selling out shows with zero skill. But someone with actual talent can't go gold at home but does so abroad. Stop letting your stupid kids stream and buy garbage and that shit will disappear.", "maybe he should try harder next time", "Ban him from S.Carolina,they need to ban him from rapping", "Tech, Post, Cole, Ab, all were good, not great albums, hinestly only got certainn songs from each album, can't listen to either one all the way through", "Exchange was stolen from B1da iyooo hahaha", "Dude is a real life characature.", "This album was trash tho lol I was so disappointed because I hella fuck with vince", "Yeah he even deserve to drink lyk that", "I know Omar Burges dont work there anymore but shout out to him.", "Redeem? Y'all niggas don't  LISTEN!! so many joints sound similar to These Days...", "I like the album.Not best of 2016 but good enough.", "Caleb Smith j.cole knows what's up haha", "KDot, JCole, Jay Electronic, Joey Badass, Then take it back with rappers that did tracks with following:\nDJPremier, Pete Rock, Dj Jazzy Jeff, JDilla and the like.", "Cole went platinum with no features", "Her n fat joe need to drop that album already", "Absoul is way better technically than Jay.", "He is a generic version of so many different rappers in the game... its seems like he cant come up with his own style to save his life...", "When we still dropping love for his old projects how it seem he need to do some wack shit like soulja fraud is pullin right now,coles one the goats,bottom line! Get off his dick", "Niggas don't understand this nigga talking bout his nigga y'all don't understand this man at all this album wasn't whack your poor perception is whack visionary at its best", "One good track shit is weak", "You know alot of people havent heard people music and some people got tracks that over 6 months long", "I can stand this long face shit bird.", "'Cause when she leave yo ass she gon' leave with half\n18 years, 18 years\nAnd on her 18th birthday he found out it wasn't his..\"", "This bitch need to stop lying already", "Everybody loves Syke now that he is dead......", "It's doper than Cole ... I just listened to both of em back to back ... .", "Next time I see you we doing this Teddy-Daniel Philcox", "This bitch is a total loser", "Hear him out. He's a big part of Hip Hop and embodies it. Reference Facemob's, The Diary and Geto Boys, Till Death.", "She got better flow n spit than that dude anyway", "No matter how you dress up cow Manure, it's still going to sound like, taste like, cow manure. No art or talent for any of the mumble dweebs.", "This dude is such a pussy.", "Just like Boi Wonder STOLE hugh hefners song for drakes biggest track?", "Lmfao out of all the ass rappers they gave this shit storm a grammy wtf", "Let it go Jones.. its Over!", "Good without a doubt. The only Bad side is deciding which album to listen to first lol, But the more Good albums that come out the better, I've still gotta check Out Ab Soul's album, Cole and Tech dropped good albums, But Charles Hamilton's album was my favourite that dropped yesterday", "I like that Worldwide Choppers with Bussa Bus and Twista. But he needs the real gangsta beats or it could fall flat. To much weak production going down.", "Everybody who says \"It is not a diss record\" is a true Stan. Stfu", "that boy lost it when he.actually discovered that he can't rap", "yeah that possible and everyone is waiting for the album", "Hell yeah MC Ceezy CF Mankge", "Yesterday was a good for releases", "Jason Gavriel this saga is actually tops", "Fuck Rap Snacks til they bring back the Mac-10's!!! Right Chris?", "I know once he gets out Dre need to watch his back cause he coming,lol", "https://soundcloud.com/rhinothepresident/secret-ft-chris-jackson-prod-sam-seaborne-hypnotic-hyena like, listen and share !", "I stopped  reading when I saw \" Drake is best paired with Jay Z\" wtf?", "Get out of here really nothing of substance has come out of hip hop you'll on here singing and disrespecting", "Nothin' compared to his two originals \"Ready to Die\" and \"Life After Death\", the others just released from Diddy.", "i hope not . he his avergae TBH FOR REAL . THIS GENERATIONS LACKS COMPETITION THATS WHY ARTISTE LIKE KDOT OR JCOLE ARE PRAISED AS GOAT . pfff !!", "Naw Frfr Everyone Fucks Wit Ellen", "\"I'm from the town where Nicky Barnes got rich as fuck\""]