["who!!! is perfect..Justin Bieber and The Weeked", "Our idol may again fall into a depression. Do not let it! In our country , Poland . It is the action of the cinematics and photos with hasztagiem : \" It is most popular with us . I am writing to you sister .. help us . To all the world and saw it ON ! Let's Beliebers ! I believe in you !  Help me please!", "U know there are so many justin biebers on facebook. People u are being pranked by someone who want some atension. I mean really . 5 justin biebers on facebook. And I think not one is real.", "You who are the author all that is beautiful and lovable fms.it", "ja ich gucke in morgen mit meiner cousine an ich freue mich schon voll darauf =) =)", "no me lo puedo creer\nque serie tan geniaaal!\nhttp://youtu.be/iUWEos9-hKs", "Never give it up . I love this!!!", "Woow Que Sorpresa Me Lleve, Cuando Vi Quien Ve Mi Biografia\nQue Esperas Para Usar La Aplicacion 100% Verificada Por Facebook\nQuien Ve Tu Biografia Solo Aca En: http://quienbiotuperfil.blogspot.com/", "sos re putaso justin sos re puto gai travesti de mierda", "I saw the special preview yesterday - and really liked it :-)", "I love ilove lloro x vs te amooooo", "JUSTIN BIEBER I LOVE YOU GO OUT WITH ME IM THE SAME AGE AS YOU", "Belibers Show Ur Love Plz Like This Page https://www.facebook.com/pages/Bieber-Styles/156067891270682?ref=hl", "Justin want to leave this message for you. I know that fame came to yourself so young. but I realize that is in need of help and even with all the people around you feel lonely and often discouraged. I am here to remember a person who is always you with you , his name is Jesus . And he wants to change his life . no matter what happened he wants you . He wants to take you all sorrow and give you new life. You are a power in the hands of God and you know it !! Do not let the world you away from him , because he cares for you . Please reflect on this message and not waste time . Back to the arms of Jesus He loves you and is waiting for you with open arms. I am praying for you!", "I am Aysia Hasna.I like you.I like your lifestyle.&you are my favourite person,singer,dancer.\n\"My favourite, my favourite\nMy favourite guy\nBaby it's you(JB).", "<3 <3 sweet <3 <3 :) :)", "I lyk u u r cute i wish i can meet u 1 day f2f", "Ich bin auf jeden Fall dabei :P", "i love this song and i m a big fan of urs", "Find the 2 and tommorow you will get kissed 555555555555555555555555555555 55555555555555555555555555 555555555555555555555555555555 55555555555555555555555555 555555555555555555555555555555 55555555555555555555555555 555555555555555555555555555555 55555555552555555555555555 count down: 10-9-8-7-6-5-4-3-2-1 now close your eyes and make a wish! NOW,*,*,*,*,*,*,*,* paste this into 15 different comments and your wish will come....! Hurry u hav 20 mins or the opposite#", "UNETE! buscamos cdc y administradoras          https://www.facebook.com/pages/Never-Say-Never-Believe/508686979250614?fref=ts", "hes not gay stop making  fun of him", "I love ur song , ilove the way u dance and ur so talented when u create a song related  on ur true life ( i dont care what people said about u like u are a anti- christ ive'been always believe in u:-*:-*:-D", "i <3 u        you'r the best!!!", "i love this song happy birthday justin", "hae can u ve my freind", "ja scho no film isch de hammer gsie <3 <3", "Your music is good i dont like it but if you feel good whit it than do it becase i have pink hair and there are a lot of people don't like it", "I kiffe your foto  <3", "Agnihotri Vaibhav I know you love him so fuckin much. You can't hide it. Not from me. \nYou might be just jumping on the bed by seeing this crazy pic of your love.", "Happy birthday idol I wish for you. Your family is safe and your health is good don't give up on the top", "Eita mim encanta love you ti amo", "I love you  justin bieber all you song  my favorite. you are the best justin", "I don't know weather I like you or love u but I always feel happy when am listening to your music love you for ever jb", "eu amoooo vc justim e senpre vou te amar", "justin yo quiero mas estar con tigo pero no puedo por que no tengo sufisiente dinero", "as long as you love for one a preasure 7 billion people in a world to fit in keep in together smile on your face", "Jackie and the kids are you going well que me know what you want me to the right now and then we have been in my", "JUSTIN BIEBER ILOVEU 4 - EVER", "you're sooooooooo beautifullyl gorgeous! ILOVEYOU! You're so talented and amazing!", "U look lyk so hot. Lyk it", "Justin biebers all albam like me.I want to     watch his new movie believe.", "my life is a movie and everyones watching so lets get to the good part and past on the non-sense when my preasure is coming down like lightining its like they want me to be perfect but they dont even know that im hurting", "I love justin bieber all you song my favorite", "NSN WAS MY DAD TATTOO ON HIS LEFT ARM SHOULDER  and never say never was what it stood Albert Alphonso Ross . Scotts man to the core", "Justin bieber please........come to India. When iam grown up i will came Canada and I wish i will meet. I love Justin bieber and i'll always love you so much", "hello justin bieber i love you you you you bie contesta", "hermosoooooooooooooooooooooo :-D :-) ;-) :* :* :* :* :* :* :* :* :* :* :* :* :*", "What happen justin bieber i like your songs", "u r so cutee but i see u on my facebook not real  because i ,m live in pakistan         and where u live", "yuor so cute  with yuor hair like that", "I love you Justin Bieber !!! COME TO SERBIA !!! <3 <3 <3", "but u taught me this ;never say never;", "Who can help Angolan people? We need to ask the american singer who was invited from Unitel a telecom company of the angolan dictator daughter Isabel dos Santos, she invited Miss Nick Minaj to come in Angola to pay her 500 000 usd while in south of our country people are dying with hunger, if you have a voice please tell Miss Nick Minaj not to come in Angola on next saturday 19th to make the concert, that money should be used help angolan people who have all the necessity, we asking to Chris Brown, Akon, Eminem, wiz khalifa, justin bieber, usher, snoop dog dog, busta rhymes, rock n'roll singer, u2, bryan adams, scorpions, cold play, the script, adele, elton john and all the singers in the world to ask it to Nick Minaj, Please share it. By Brain Justice Manuel", "Just keep the windows open <3\nSo we can see :)", "Justinian I'm a big fan of him but I love you", "he is singing there DOWN TO EARTH :D my favorite song <3", "Hermoso te amoo te amoo te amoo", "ooohhh never say never you justin bieber", "Aldub you JB I hope to see you in USA #(kilig pa more)I LOVE YOU VERY MUCH.!!!!", "Ai uii que tudo perfeitinho d+ sexy kkk <3", "Justin you can do better then Selena Gomez I like her as a actor but her doing that to you so wrong hope she decides which guy she wants wishing best of luck whever your paths lead", "my name is Kimberley what is your phone number", "Happy Birthday Justin Biber I LOVE YOU", "I love justin bieber #1 FAN", ":*lub u jb without hearing ur voice is like without my soul :)", "You so hot <3 <3 <3 <3 <3 <3 <3 <3 I love you <3 <3 <3 <3 <3 <3 <3", "i like u'r natural colour. but it is also gud now u r look always handsome. the cutest nd my fvt guy ever", "Ilove you very much and your personality", "hi.i am shabbir ahmad from Pakistan.i like your songs and you. you so cute as well as like a spring flowers. May God bless you very very much!", "why u people u ar so jrs of our lovly singer jb cnt u leav him alon??? jb dnt mind thos who ar foolig u nd i wshing  u the best lov u jb one tim my men good luck!!!_______", "A TALE TE SOS HDP THAT IS THE FIRST TIME IN MY FACE USE THIS LEXICON , SOS A STARVING who come to SEARCH OF A COUNTRY WHERE SILVER disrespected YOU , YOU LIKE YOUR FLAG kicked .... A MISERABLE SOS would not have to COME NO MORE , MAL STARVING GRATEFUL , BORN OF NOTHING , YOU PASSED OUR LOGO FOR THE HOMELAND AND NOT kiss to kick ... REPUDIATION TOGETHER WITH THOUSANDS AND THOUSANDS OF ARGENTINE BAD WAS SEEN BY COUNTRIES BROTHERS , YOU GOT NO QUALIFYING YOUNG AND THE APPOINTMENT TO READ THIS AND DO NOT YOU LIKE MY FIRST COMMENT FIRST THINK THAT IS OUR COUNTRY AND NOT LIKE THIS RAT HAVE FANS DESERVE .... SOS BORN BAD YOU A RAT IN THE PERSONAL REPUDIATION I RESPECT AND ADMIRE ALL FLAGS OF ALL COUNTRIES NOT BROTHERS AND BROTHERS , SOS PURE BRUTALITY AND PRAY THAT TERM AS YOUR CAREER COMPLETE OUR FLAG , BUT BY THE FLOOR THAT BEYOND Ayas WHAT ARE PROUD TO HAVE ECHO BLUE AND WHITE THE ABOVE ALL , FOR SOME SOUTHERN UNITED NATIONS HEALTH TELL ... BORN BAD filthy rat ARE YOU GOING TO END ALL AND SAY WHATEVER THEY TELL WHY NOT JUST FOR ARGENTINE BUT SO AS A RAT WITH ECHO SOS FORGIVENESS OF RODENT .", "helou  justin  bieber helou rouzi", "If anyone was looking for a part time job just on your phone or laptop or whatever you use to get on the internet all day long message me for more details and I'll send you the link", "t trop lais et ta une voix de guay la premiere fois que je t ai vu je savais si t etait une fille ou un garcon conard", "Millie Kasandra I take that comment back unless he changes his hats. all of them.", "hi it's gabrielle in the white and serena in the blue we are both twins and we love you", "I love you <3 justine bieber when i grown up i will com in USA to meet you in person ILOVE YOU <3", "nice singer so cute  baby", "i   love   justin", "Und, habt ihr auch alle schon beim Meet&Greet Gewinnspiel mitgemacht? www.JustinBieberNeverSayNever.de", "Ich geh dann ins Kino, freu mich schon voll! (:", "putaso de mierda hijo de pppp   sos re trolasoooooooooooooooooooooooooooooo", "a  mi me gustaria que justin venga a peru", "i am the biggest fan ever and u chloe underwood", "Courage Justin not desisting desisting of you talent you got talente", "you  are a nice person", "LOV U JB....u r my 1 of the fav... Singer and may ur sng alwlys b sucess 2 touch the hert of ur fans....!!!", "Asnos caso xq todas andamos detras de ti...", "I Love you to Justin biber Please heart iceland", "justin bieber u ar the king of music i wont 2 join music al so", "Want to buy games at incredibly discounted prices? Visit https://www.g2a.com/r/user-568780f5951ce\nAt G2A, you can enjoy prices similar to a Steam sale, all year round!\nImagine buying Call of Duty: Modern Warfare 3 for just $30!\nMost games here are at least 50% cheaper than Steam's prices! Some are even 80% off!\nHere are some other awesome deals at https://www.g2a.com/r/user-568780f5951ce :\nFar Cry 3: $5, Mirror's Edge: $2, Fallout 4: $30, Skyrim: $4, GTA V: $40, Assassin's Creed Syndicate: $18.\nThousands of other awesome deals available at https://www.g2a.com/r/user-568780f5951ce", "me gusto tu musica la de she dont like light", "e  tao   lindo    o    justins", "wow justin, i'm jst crazy about ur songs.", "you love you love justin I swear I wanted to be a singer like you justin bieber I love you and I will not stop my messenger is Asher mariafelixcovarrubias@hotmail.com.mx ok ok add me please", "I love you. Justin very muchhhhhhhhhhhhhhhhhhhhhhhhhhhhh", "Con esta aplicacion, ahora consigo mas de 1000 likes (me gusta) por dia para mi pagina . Me funciono Genial y mis Amigos se Sorprendieron a ver lo rapido que crecio mi pagina. Sin Descargar Nada, Lo Instale Aqui- http://fb-likes-paginas.blogspot.com/ 100% real :D", "Curtam pfvr? A outra com mais de 11 mil likes foi hackeada!  :( https://www.facebook.com/pages/Orgulho-Bieber-20/502900999807859 obrigada", "Do not think it's easy to live", "ish eifach d geilstii <3 :D i love jb <3", "i am your no. 1 fan", "hay entre mas mas mas guapo esta love", "hi jb you know all your song and vedeo is my like ur the best ur my super idol.........", "Hey All, \n'Sup.\nI am writing a Blog \"All about Learning and Earning\"\nIt's about Ideas and Tutorials\nwww.laiqshah.blogspot.com", "Guy ur on point ur outfit make", "No but your a cutie anyway.\nI'm old but you should take good care of yourself.  You look sad lately you are under a lot of pressure.  KEEP God in your life you can't go wrong. God bless. Would love to see you in concert. Hope you move to Arizona you would live it.", "Love diz song an all ur songs...hbd justin", "I love your song.&I want to say you---\n\"If I was  your girlfriend\nNever let you go.\nKeep me on your arm's boy\nthat I never felt alone.\"", "Hi Justin how can you ride one of them you are so cute and don't worry it's not Linda it's Haley and 9 years old my birthday is 24th March and I think you're really hot", "Justin I Love You ! (:", "people also judge, and some say good stuff, but some say bad stuff, what I can say you are not just young dude only #JB you are intelligent, a brilliant guy who have mind, a brave young star, everyone wish to be like you indeed, don't alwt anyone to put you down, whatever they can say. They wish to be like you. All the best to #BIERBE god bless you", "If you'd see what you saw,then you've seen it", "I love you so much justin forever", "Hi bata JB did you see all those people do their comments why you don't want to reply.", "So inspirational!  I used to say never all the time, now I never say never!", "So Justin my son 17  used sing your songs to me when he was younger course now he to cool he has himself single mom too wish u could meet him he looks lot like u before the blond and the tats. Good kid he hates me wish I had been more like your mom he embarrassed everything I have do and say", "i am ema no linda and i love justin bieber i like all your song.", "Hi Justin Bieber i lyk 2 be ur frnd.", "I hate justin bieber he suck!!!\"", "If you tryna make some serious cash today hit my inbox no personal info no SSN no nothing you can make between $5000 to $9000 in minutes serious ppl only!!!", "Hi! justin me your fanz your my idol u i want 2  meet this person! i love u my idol take care always be happy always!!! :)", "I love you very much Justin"]