["Timmy Timmy Timmy Turner Know The Whole Song", "It's actually cold for Austin today", "hublot talk #Geneva alot of these clowns dont een understand that lingo", "Nigga yu deserve a crown,coz yu run it man...", "Fuck come ok Brussels or Paris kiss waiting for U babe", "Dont drop the spirit stick (Bring it on)", "Shadman Maksood OH NAHHH you saw him??", "@Hugo Labrie caliss pour une fois ont comprend s'qui dit comme faut lol", "Greg Noo telle this isn't kynsley with uncle Murda , Jada, and Jeremiah", "Mehdi khouna zombie bla make up xD grrrraaah kikiki xD", "I never seen shit like that, Desiigner is the real artist.", "Desiigner and Ty Dolla $ign are featured on Pusha T's brand new single titled \"Circles\". Listen to the full song on our page!", "You're were local  now you're global", "who tha Fuck understood what he said... Somebody write what he said for me right now... I'll wait.", "Ma mahnnn desiigner,i love this songss as hell nigg", "bro, you r awesome, keep them sounds alive", "Why is this homo on my feed?", "Wenhuang Zeng Jacky Teoh Aayush Jackson Durell Gill bro what did this guy say at the end??? he spoke animal?? and he teleported from the beg of the vid to the end this guy is a magician FACX FACTS FAXS straight fa3ts the 3 is for kris dunn", "Dunno what u say however I still like it", "tiimmy tiimmy tiimmy turner i like your song", "I thought he \nrapped weird. Come to find out thsts how he actually talks. So its not his fault he a bad rapper. He was born tha way", "My friends call me crazy and shit,I don't have to Google lyrics I totally understand what bae be saying and people think I'M weird,...Pay no mind to what people have to say,you doing a great job and we luh yuh hunnay DO YOU.PEOPLE DON MATTER!!!!!!!!!!", "#Dessigner check in Jamaica to hear more than 10 hot remix for #panda", "Annalena Can haha ab 1 min etwa :D", "The king of the rap game", "Adrian Cruz Cringiest thing i have ever seen.", "Tiimmy, Tiimmy, Tiimmy Turner\nHe was wishin' for a burner\nTo kill everybody walkin'\nHe knows that his soul in the furnace\nFuck bitch on BET\nHave her walkin', she fuckin' for BET\nWildin' for wallet\nKill everybody walkin'\nHe knows that his soul in the furnace", "Yeah, yeah, yeah, yeah)\nBrrrrraght...!\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nGit, git, git, git\nYeah, yeah, yeah, yeah\nGit, git, git, git\nYeah, yeah, yeah, yeah\n\n- Desiigner before the song", "Grrrrah all you got to do Desiigner bro is to pay no attention to fuckers cause they are gonna get you confuse.......... We all believe that next VMA award you'll win that best new artist...... Just keep the ball rolling..... Git git git", "When he sold his soul, he had to start wearing their colors, black and white. Hence Panda.", "Fuck right off since when is these type of people considered rappers his lyrics are garbage sounds like a retard trying to rap special olympics of the rap game in 2016", "Imma be the first one to turn to that channel", "I am in Haiti niggaz  where you at cause niggaz waiting ya tho", "wait is it full film or ?", "its a hit,buh panda is the real hit mehn......\n#gi't,gi't,gi't\n#grrrrrrrrrah", "You winning man \nThe world knows", "stuphs ready natural and medicated hit us asap we got pill kush moon rocks and many more .we best dealers for more info hit us asap.", "So adorable the cutest baby ever", "if yall hate this man so much.... why yall even hit the play button ? lol.. i dont think nobody on here wit sumn negative to say got a record deal or bankin like dat guy.. is that why yall big mad ?? cause he got a break and you didnt ? lol.. awwww poor tinks, nobody told you to be dumb asses.. looks like somebody forgot to tell you that you can be what you wanna be on cloud 9 lol.. dont think Desiigner missed the memo... #keephatinonhim lol", "Sometimes I can't understand him but his happiness is so contagious and he seems like such a fun person!", "no control lotta chopper let it blow!", "Yeah tiimmy tiimmy turner desiigner panda panda panda panda", "U ar looking sweet! man... All dz hot girls aint gettin dia eyes off u #Braaaa #Gee!Geee", "Ringtone Desiigner x King Savage - Zombie Walk: http://my-ringtone.org/popular/5919-ringtone-desiigner-x-king-savage-zombie-walk-download-to-your-phone.html", "Hey Desiigner I make beats and also write songs.Hope I can get in touch with you", "CINEMA 21 Streaming Movies....FREE,!!! HAPPY HALLOWEEN DAY\nBoo! A Madea Halloween Full Movie\nhttp://celleengandollar.blogspot.co.id/2016/10/boo-madea-halloween.html\nJack Reacher: Never Go Back (2016)\nhttp://celleengandollar.blogspot.co.id/2016/10/jack-reacher-never-go-back-2016.html\nKevin Hart: What Now? Full Movie\nhttp://celleengandollar.blogspot.co.id/2016/10/kevin-hart-what-now.html", "Great, just what we need..while the country is being severed by the seams, we have people with enough idle time to stand around doing nothing. #theironyofamerica", "put a belt on and pull ya pants up", "Yep they got him, lost & confused..", "Why has desiigner got only africans commenting on his shits", "Panda Panda Panda Panda Panda Panda Panda Panda", "Cris Guilliani this is like the rap equivalent to a breakdown haha", "Put some stuff in android so I can support your movement was looking for the emojis", "WHY do u. U never close your mouth while taking yr fucken pics. That shit really turn me offf kraaaa.", "We   loveeeeeeeeee  yyyooouu", "Love u im a big fan", "Too bad.. we'll be missing your live concert this Friday :(", "I know you people understood him, y'all just hating, I understand every word", "I'd like to meet the man that signed him to a label....bc he deserves to be slapped", "Timmy Turner is just SICK man.. You killed it! Let the haters keep talking", "This man was dragged to jail under FALSE accusations. 'murikkka'", "Why don't you fools get some pants that fit. Look like a bunch of bitches. And that shit, whatever y'all call it is not rap. You're an embarrassment to anybody who held a mic before you.", "literally listen to New English every day #LOD !", "SUBTITLES:-\n\nTrrrraahh crazy man time is it cover art manj cjdjdieuxhgh desiigner man fiffiuejnwwbbs caliber man djcifejrjenwba I'm looking for dat cava art KEKEKEHEHEGEHEGEGEGE TRRRAAH tweet dat instagram dat EKHEKJKHEKHEK", "Wow,is King Savage making it to the industry ?", "Voted. For you and my producer friend menace. You both deserve to win !", "my friend has #desiignermadness.his always chanting #blackx6panda...desiigner you are really big in Nigeria", "What is the name of app....", "cause his using DRuGS cocaiN high grade", "Tittel Viktor Ilya Shirokov er geht zu halloween als desiigner hahahahaha", "xup dii am lilzi geo am rapper but in nigeria i get the don doin busniess men prove to the wold and to other nigiz that u can help the poor talented get it get it get it this ma num 09033953689", "https://youtu.be/zzbE9-KOHFw CHECK OUT MY MONEY DANCE!!", "People pay to see this clown? He's fucking garbage", "I voted for u on all my friends and my phone hope u when", "I wish I was there. Mad hype", "Timmy Turner remix - Desiigner featuring Kanye West: Tiimmy, Tiimmy, Tiimmy, too turnt up\nGrab the burner, leave the block burnt up\nNow look what you made me do\nLook who you made me shoot\nDon't ask for help from dude\nThat nigga crazy too\nI'm the new Steve, mixed with Ali\n'Bout to get freed, I'm the new Walt\nFuck what you thought\nMan fuck all of y'all.........", "Hi reasonable people!!!..No matter the way you think about this, just try and know that it was a miracle that truely helped me. I have been heart broken, several times. But on this occasion with my old flame, I couldn't let go, we started by having different problems almost everyday and to the extent we separated and he wanted me to File for a divorce, I couldn't let this happen and along the line I saw a lot of testimonies online about a Great man, Dr BUDHA the great how he helps the restoration of marriages of different people, I applied and it worked for me, my husband started calling me after the special pray and within 3 days he came back begging for forgiveness. The reason of me doing this is to give a medium to anybody who is having a similar problem can email, he also helps in terms of Job promotions, Long term sickness.his email is: drbudhadeliverer@gmail.com", "Hey yo Desiigner try to help ur Fellow OG bobby shmurda u both can hook up wif a great dope ass hip hop *xxx* rap song. U kno he Rides ur back", "Wtf is he saying he's either having seizures or a massive stutter or had a stroke someone get him a doctor", "nigga will be trippin on some weed for sure....", "Jahrista King feat Trey Songz : Hot Girls\nhttps://youtu.be/2z1WqLGbR10", "You going to jail mother fucker", "Brian Robles bagong aabangan sa november.", "You reminds me to native Americans with that long ass shirt, Dessigner, that's so crazy. #LOD", "\"rapping\" about bs all the time - like is that good for kids today ?", "THIS VIDEO IS TOTALLY EPIC THO... No second dull. You're a genius, Sydney Shelby III :-D But we want some visuals for Tiimmy too!!! Big ups, man... GRARGH! (Y)", "Every time he makes a song it turns into a hit", "This nigga can't be sad for one second", "All bout Tiimmy . . .", "Not cool to postpone it tho... now I'm outta the country", "OMG!!! Guys..I finally found the Official link Full Movies Live Streaming and Download (y)\nSuicide Squad 2106 Full Movie http://miasanmiaforever.blogspot.co.id/2016/08/suicide-squad-full-movie.html\nBad Moms Full Movie http://miasanmiaforever.blogspot.co.id/2016/08/bad-moms-full-movie.html\nFinding Dory Full Movie http://miasanmiaforever.blogspot.co.id/2016/08/finding-dory-full-movie.html\nLights Out Full Movie http://miasanmiaforever.blogspot.co.id/2016/08/lights-out-full-movie.html\nSausage Party full movie http://miasanmiaforever.blogspot.co.id/2016/08/sausage-party-full-movie.html\nCentral Intelligence full movie http://miasanmiaforever.blogspot.co.id/2016/08/central-intelligence-full-movie.html\nThe Purge Election Year 2016 http://miasanmiaforever.blogspot.co.id/2016/08/the-purge-election-year-full-movie.html", "if you need entertainment I watch a movie collection\nDoctor Strange\nhttp://plickett-bie.blogspot.co.id/2016/11/doctor-strange.html\n\nAlmost Christmas\nhttp://plickett-bie.blogspot.co.id/2016/11/almost-christmas.html\n\nBoo! A Madea Hallowen \nhttp://plickett-bie.blogspot.co.id/2016/11/boo-madea-hallowen.html\n\nJack Reacher: Never Go B\nhttp://plickett-bie.blogspot.co.id/2016/11/jack-reacher-never-go-b_5.html\n\nWhen the Bough Breaks\nhttp://plickett-bie.blogspot.co.id/2016/11/when-bough-breaks.html\n\nSuicide Squad (2016) \nhttp://plickett-bie.blogspot.co.id/2016/09/suicide-squad-2016.html\n\nFifty Shades Darker \nhttp://plickett-bie.blogspot.co.id/2016/09/fifty-shades-darker.html", "It only has 2 songs right", "Crack go kii yo oh oga", "I heard that you are arrested :( i hope you got a good lawyer.", "hey desiigner weres the link to vote", "i want the Lord to help me i want the Lord to kill me.......dude overnight is a hit.. i love that song", "Becareful who ur idol is cos u be twice as better like him and with Pusher T, i dont see a J sean level.", "THE MAN OF ALL TIME\nYall know what time is it", "So I know you prob can't understand me since I'm speaking English but FUCK YOU and all who associate with you ... we still here . Send that", "Michael Kontos lowkey wanna go for metro boomin", "#PANDA rap to the core DEE.Go set the stage on fire wth ur blistering energy", "Lil Flirty - Anna(Prod.by Flirty Beats Bitch)Ft.Yung Flair & Jumpm@n  http://youtu.be/lIkRHaEVcAc\n\n\"Anna\" is inspired by the 2016 American psychological               thriller film  \"When The Bough Breaks\" which features the character \"Anna Walsh\" a dangerous surrogate mother who falls in love with \"Jon\" the baby's father.\n\nLength: 2m 47s \nGenre: Trap/Club\nYear: 2016\n\nMusicians: \nLil Flirty(HOOK)(SECOND VERSE SECOND HALF)\nFacebook: Dareious Montana\nEmail: Dareiousmontana@gmail.com or Dareious17@gmail.com\n\nYung  Flair(VERSE ONE)\nFacebook: Adrian Hashaway\n\nJumpman(VERSE TWO FIRST HALF)\nN/A\n\nBeat produced by Flirty Beats Bitch\n\nMixed & Mastered by Lil Flirty\n\nThank you, Hi-Q MP3 Rec (Free) for making it possible to transfer our vocals from my phone to the computer.\n\nThank you, Jaz Sinclair for inspiring me to develop this song.\n\nThank You, Image Line \n\nThank You, Windows Live Movie Maker for making this exist on YouTube\n\nThumbnail Picture downloaded from Google.com\n\nLocation: Pittsburg, Texas\n\nShare with all of your family and friends!!!! ;) :) ;) :)\n\nBy the way I dissed Desiigner and Menance's Panda song if you really pay close attention to my verse LOL. I said THIS BEAT GO HARDER THAN PANDA!!!!!!", "Waiting For Timmy Turner Music video Desiigner.", "Tayden Stewart we need to go to one of these", "yeah ..... He was an innocent child and admired\nhhh h. Desiigner is phenomenon", "I LIKE TIMMY TURNER SONG NOT PANDA AND I DONT HAVE NOTHING AGAINST DESIIGNER BUT TO BE HONEST HE BIT OFF REAL HARD FROM FUTURE SOUND STYLE ETC PEOPLE STOP TRYING TO BE SOMEONE ELSE AND JUST BE YOURSELF", "Zakaria El Ouahli Timmy timmy turner he be wishing for a burner to kil avery body walking you know that he's holding the furnace .lkhwadri sghir ktb lih kalimat oui", "Your a fucking idiot desiigner... I hate your face and personality and wanna fight you.. what's up...", "what the h... is he sayin..? don't get it :D", "Black X6, Phantom White X6, look like a panda Going out like I'm Montana Hundred killers, hundred hammers", "I am an Artist out of Tallahassee Florida. Just trying to broaden my audience and spread good vibes to the world. Check my music page out! Like/Share/Download. Have a badass day! Www.reverbnation.com/bradleypolo", "I love it baby.it keeps me on ten.", "https://0.facebook.com/Blessed-Nation-Miusic-352487308427845/ . .. Blessed nation Miusic, ajuda o mambo a crescer. One", "Every time I see these new school rappers, I just picture 2pac punching them in the face.", "that old lady: i dont know what is talking about but its damnn gooood", "Why won't u come to Ghana and feel the real black Gangsters city. Ghanaians love u", "Man when you're comin to South Africa", "The prophecy has come true, the foretold intepreter.", "This one cant get love man..its trash.", "So if I rap and make my voice sound exactly like future I'm on ?\nThat's how you did it \nPanda panda panda panda", "Silkrox Boston Lynn Christmas-Major Lanijah Bridges", "I know when u come to Uganda I will kill it", "Omg GUYS....TOOK ME HOURS TO FIND, Finally GOT The LINK, Watch!\n\nRide Along 2 Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/ride-along-2.html\n\nStar Trek Beyond Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/star-trek-beyond.html\n\nFast 8 Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/fast-8.html\n\nSuicide Squad Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/suicide-squad.html\n\nBad Boys 3 Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/bad-boys-3.html\n\nBarbershop: The Next Cut Full-Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/barbershop-next-cut.html\n\nThe Secret Life of Pets Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/07/the-secret-life-of-pets.html\n\nWonder Woman Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/wonder-woman.html\n\nTeenage Mutant Ninja Turtles: Out of the Shadows \nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/teenage-mutant-ninja-turtles-out-of.html\n\nX-Men: Apocalypse Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/x-men-apocalypse.html\n\nMother's Day Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/mother-day.html\n\nWar Dogs Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/war-dogs.html\n\nCaptain America: Civil War Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/captain-america-civil-war.html\n\nDeadpool Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/deadpool.html\n\nThe Magnificent Seven Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/the-magnificent-seven.html\n\nKeanu Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/keanu.html\n\nCell Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/cell.html\n\nKevin Hart: What Now? Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/kevin-hart-what-now.html\n\nSpider-Man: Homecoming Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/spider-man-homecoming.html\n\nDoctor Strange Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/doctor-strange.html\n\nWarcraft Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/warcraft.html\n\nRogue One: A Star Wars Story Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/rogue-one-star-wars-story.html\n\nThor: Ragnarok Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/thor-ragnarok.html\n\nThe Jungle Book Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/the-jungle-book.html\n\nMeet the Blacks Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/meet-blacks.html\n\nBatman v Superman: Dawn of Justice Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/batman-v-superman-dawn-of-justice.html\n\nThe Lego Batman Movie Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/the-lego-batman-movie.html\n\nTeenage Mutant Ninja Turtles: Out of the Shadows Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/teenage-mutant-ninja-turtles-out-of.html\n\nIce Age: Collision Course Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/ice-age-collision-course.html\n\nxXx: The Return of Xander Cage Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/xxx-return-of-xander-cage.html\n\nMother's Day Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/mother-day.html\n\nIce Age: Collision Course Full Movie\nhttps://bocahwedon123ireng.blogspot.co.id/2016/06/ice-age-collision-course.html", "dead! did anyone else notice he changed the song when future started playing", "Catherine Chou i cant understand but he is still rly hot", "have fun bruh...., but remember to act like a KING bruh, bcs ur a KING dude.", "Fuck i fuckin' love dis Guy", "Like Graham Jacobs for all the funny shit to get you day started", "Very Afro Samurai..love your style already #NoControl\n-MTV's The Waatcher", "Where I can buy the tickets??Thanks...", "I am exactly right where I want to b in life...thanks for the inspiration..", "I feel ya brah.. Do you..", "U need a video for caliber and zombie walk fuck it drop one to Timmy turner too", "Get the best meds for your cancer, body pains and many more,\nMedical M.a.r.i.j.u.a.n.a Donations Grade AAA+ Delivery&Shipping Best Grower!\nMedical Ma.r.i.j.u.a.n.a, Rick Simpson Oil, Hemp oil, Hemp Seed Oil, Hash Oil, BHO...We are Discreet Suppliers !\n*B.l.u.e D.r.e.a.m\n*S.o.u.r D.i.e.sel\n*Girl S.c.o.u.t Cookies\n*Gr.e.e.n C.r.a.ck\n*J.a.c.k H.e.r.er\n*P.u.r.p.l.e H.a.z.e\n*S.k.y W.a.l.k.e.r.\n*F.i.re O.G\n*W.h.i.t.e Wi.d.o.w\n*Super L.e.m.o.n H.a.z.e\n*Extracts (H.a.s.h Oil , W.a.x , S.h.a.t.t.e.r , B.u.d.d.e.r.) .\nFOR FAST RESPOND BACK HOOK ME UP THRU TEXT  3 1 0 -2 9 9-3 4 4 2", "I been getting tha chicken,  countin' tha chicken and all my Niggas gonna split it Thilaaaaa. ..", "Oh shit he can have legit convo King", "desiigner - panda panda I like your song bruu but you smoke to much", "Istiak Dhrupad finally watched this lmao", "lets work meet me at germanos", "they been waitin' for this shit for a long time man.. i guess so. :D", "It wil be dope dis young dope nigga do the hit only such as. shooters u dope nigga u remake a society to be trapped in", "OMG GUYS!!!I finally found the Official link to watch Movies for FREE without register!!\nBoo! A Madea Halloween full movie HD (2016)\nhttp://b0o-m4d3a-hallowin.blogspot.co.id/2016/10/boo-madea-halloween-2016.html\n\nWhen the Bough Breaks (2016)\nhttp://b0o-m4d3a-hallowin.blogspot.co.id/2016/10/when-bough-breaks-2016.html\n\nSuicide Squad (2016)\nhttp://b0o-m4d3a-hallowin.blogspot.co.id/2016/10/suicide-squad-2016_48.html", "ok we can say the songs are good but please don't do another live show it was a joke", "HE WAs WISHING FOR A BURNER.", "When you coming to saint Louis  missouri. Love to meet you", "I gat natn bat lave for this nigg", "Your energy is contagious. So happy for you!", "Why do u understand him when he rapping but can't understand when he talkin", "gat broads in atlanta, get them to vote too!", "Desiigner be like : \nfiafiend dig ejf baud gosh hd f ffnsbd'sig wusnfbfjzl \nI just don't know what he just said lol", "Joshua Prevot number of hashtags is inversely proportionate to intelligence???", "Desiigner seems like he's always high whit some drug thats not been invented yet...", "Always smile more than you cry, give more than you take and love more than you hate.", "The best super nigga 2gether and 4ever", "I love you So much my nigga. From benin Africa the land of vodoun", "What does #LOD stand for....???OR is it not an abbreviation?", "yeaah we feel u bro... but didn't yor parents told u not 2 eat hot potatoes when u r smoked an u r about to record dwag we can't thou... :-D", "Panda panda panda....  1 love", "When is Desiigning The Future Coming Out??", "Amazon echo raps Panda. Home assistant meets gangsta shit. \nhttps://youtu.be/P4aWuKT9Hdg", "ya been wishin to kill everybody walkin yeah dat ma boi....", "I would like to invite you my company I just had a three boys are leaving Boston I hope you can except my invitation I am a computer engineer network security mechanical engineer I can send you my helicopter I hope you except my infant Tatian", "Is this your Halloween dress up or tattoos???", "Ashish Sagy this is the oscar winning performance desiigner was in", "Desiigner's got hella stage presence!!! <3", "When are You Coming To South Africa though?", "Josefine Spezzano dachte eigentlich das ich nach Geordie shore alles auf englisch verstehe aber was sagt der da hahaha trrrraaaaah", "Lmaaao he always rocking the suit with no shirt on lol. Can't knock his hustle tho! #TEAMTAURUS", "Kenny Flick I'm tagging you in every Desiigner video from here on out", "Your music has been helping me get through some real fucked up shit. Just when I thought I was crazy, I found you & to my relief, I wasn't alone. Fuck it, mash out!!!!! Skiiiiiiiiiira!!!!!!!!!!!!!", "It was nothing to offend designer it's people making a joke of the things that he say and do niggas always fill sum type of way fufu at the end of the day the guy that made this video made me laugh so fuck what you talking about", "Luther Wilson I understood up until 6 seconds... almost there", "Luca Romano mado che mostro, dobbiamo andare a vedere un live suo", "In the spirit of Halloween lol shoutout to Desiigner #TEAM TAURUS", "HELLO GUYS (Y) Watch New Movie Free 3:) 3:)\n<3 Boo! A Madea Halloween Full Movie\nhttp://jajarangenjangwae.blogspot.co.id/2016/10/boo-madea-halloween.html\n\n<3 Blair Witch 2016 Ful Movie\nhttp://jajarangenjangwae.blogspot.co.id/2016/10/blair-witch-2016.html\n\n<3 When the Bough Breaks 2016 Full Movie\nhttp://jajarangenjangwae.blogspot.co.id/2016/10/when-bough-breaks-2016-full-movie.html", "Much respect I've been diggin desiigner I'm a real hip hop head underground raw shit 90s flavor but I like his music paaaanda", "Caliber artwork sample by Griffin Productions for Desiigner #desiigner #LOD #NEWENGLISH #CaliberCoverArt #hakimgriffin #griffinpro #griffinproductions", "Black x6....panda.mhen am in love with the life of a desiigner", "For all we know desiigner might've stole that line fron the kids \"ggggglllllrrrrrrrrrrr\" lmfao a lot of babies do that. Anyways they speak the same language idk why they haven't sue him yet.", "I ws some of the first ones", "Desiigner just dropped the official remix to his single \"Timmy Turner\" featuring Kanye West. Listen to the full song on our page!", "Im d first 2 like yeah", "Yea desiigner song beat make some sense like bassline but most of his rap goes out of rhym,like moonpeople is absolutly rubbish to hear", "Sorry what? I can't understand you.", "This dudes ears are on his neck.. Smh", "The most energetic rapper in the industry....designer!!!!!!", "1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199\n200\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\n300\n301\n302\n303\n304\n305\n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\n331\n332\n333\n334\n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n391\n392\n393\n394\n395\n396\n397\n398\n399\n400\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n441\n442\n443\n444\n445\n446\n447\n448\n449\n450\n451\n452\n453\n454\n455\n456\n457\n458\n459\n460\n461\n462\n463\n464\n465\n466\n467\n468\n469\n470\n471\n472\n473\n474\n475\n476\n477\n478\n479\n480\n481\n482\n483\n484\n485\n486\n487\n488\n489\n490\n491\n492\n493\n494\n495\n496\n497\n498\n499\n500\n501\n502\n503\n504\n505\n506\n507\n508\n509\n510\n511\n512\n513\n514\n515\n516\n517\n518\n519\n520\n521\n522\n523\n524\n525\n526\n527\n528\n529\n530\n531\n532\n533\n534\n535\n536\n537\n538\n539\n540\n541\n542\n543\n544\n545\n546\n547\n548\n549\n550\n551\n552\n553\n554\n555\n556\n557\n558\n559\n560\n561\n562\n563\n564\n565\n566\n567\n568\n569\n570\n571\n572\n573\n574\n575\n576\n577\n578\n579\n580\n581\n582\n583\n584\n585\n586\n587\n588\n589\n590\n591\n592\n593\n594\n595\n596\n597\n598\n599\n600\n601\n602\n603\n604\n605\n606\n607\n608\n609\n610\n611\n612\n613\n614\n615\n616\n617\n618\n619\n620\n621\n622\n623\n624\n625\n626\n627\n628\n629\n630\n631\n632\n633\n634\n635\n636\n637\n638\n639\n640\n641\n642\n643\n644\n645\n646\n647\n648\n649\n650\n651\n652\n653\n654\n655\n656\n657\n658\n659\n660\n661\n662\n663\n664\n665\n666\n667\n668\n669\n670\n671\n672\n673\n674\n675\n676\n677\n678\n679\n680\n681\n682\n683\n684\n685\n686\n687\n688\n689\n690\n691\n692\n693\n694\n695\n696\n697\n698\n699\n700\n701\n702\n703\n704\n705\n706\n707\n708\n709\n710\n711\n712\n713\n714\n715\n716\n717\n718\n719\n720\n721\n722\n723\n724\n725\n726\n727\n728\n729\n730\n731\n732\n733\n734\n735\n736\n737\n738\n739\n740\n741\n742\n743\n744\n745\n746\n747\n748\n749\n750\n751\n752\n753\n754\n755\n756\n757\n758\n759\n760\n761\n762\n763\n764\n765\n766\n767\n768\n769\n770\n771\n772\n773\n774\n775\n776\n777\n778\n779\n780\n781\n782\n783\n784\n785\n786\n787\n788\n789\n790\n791\n792\n793\n794\n795\n796\n797\n798\n799\n800\n801\n802\n803\n804\n805\n806\n807\n808\n809\n810\n811\n812\n813\n814\n815\n816\n817\n818\n819\n820\n821\n822\n823\n824\n825\n826\n827\n828\n829\n830\n831\n832\n833\n834\n835\n836\n837\n838\n839\n840\n841\n842\n843\n844\n845\n846\n847\n848\n849\n850\n851\n852\n853\n854\n855\n856\n857\n858\n859\n860\n861\n862\n863\n864\n865\n866\n867\n868\n869\n870\n871\n872\n873\n874\n875\n876\n877\n878\n879\n880\n881\n882\n883\n884\n885\n886\n887\n888\n889\n890\n891\n892\n893\n894\n895\n896\n897\n898\n899\n900\n901\n902\n903\n904\n905\n906\n907\n908\n909\n910\n911\n912\n913\n914\n915\n916\n917\n918\n919\n920\n921\n922\n923\n924\n925\n926\n927\n928\n929\n930\n931\n932\n933\n934\n935\n936\n937\n938\n939\n940\n941\n942\n943\n944\n945\n946\n947\n948\n949\n950\n951\n952\n953\n954\n955\n956\n957\n958\n959\n960\n961\n962\n963\n964\n965\n966\n967\n968\n969\n970\n971\n972\n973\n974\n975\n976\n977\n978\n979\n980\n981\n982\n983\n984\n985\n986\n987\n988\n989\n990\n991\n992\n993\n994\n995\n996\n997\n998\n999\n1000\nu mad bro?\nlet's count up to a thousand Again\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199\n200\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\n300\n301\n302\n303\n304\n305\n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\n331\n332\n333\n334\n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n391\n392\n393\n394\n395\n396\n397\n398\n399\n400\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n441\n442\n443\n444\n445\n446\n447\n448\n449\n450\n451\n452\n453\n454\n455\n456\n457\n458\n459\n460\n461\n462\n463\n464\n465\n466\n467\n468\n469\n470\n471\n472\n473\n474\n475\n476\n477\n478\n479\n480\n481\n482\n483\n484\n485\n486\n487\n488\n489\n490\n491\n492\n493\n494\n495\n496\n497\n498\n499\n500\n501\n502\n503\n504\n505\n506\n507\n508\n509\n510\n511\n512\n513\n514\n515\n516\n517\n518\n519\n520\n521\n522\n523\n524\n525\n526\n527\n528\n529\n530\n531\n532\n533\n534\n535\n536\n537\n538\n539\n540\n541\n542\n543\n544\n545\n546\n547\n548\n549\n550\n551\n552\n553\n554\n555\n556\n557\n558\n559\n560\n561\n562\n563\n564\n565\n566\n567\n568\n569\n570\n571\n572\n573\n574\n575\n576\n577\n578\n579\n580\n581\n582\n583\n584\n585\n586\n587\n588\n589\n590\n591\n592\n593\n594\n595\n596\n597\n598\n599\n600\n601\n602\n603\n604\n605\n606\n607\n608\n609\n610\n611\n612\n613\n614\n615\n616\n617\n618\n619\n620\n621\n622\n623\n624\n625\n626\n627\n628\n629\n630\n631\n632\n633\n634\n635\n636\n637\n638\n639\n640\n641\n642\n643\n644\n645\n646\n647\n648\n649\n650\n651\n652\n653\n654\n655\n656\n657\n658\n659\n660\n661\n662\n663\n664\n665\n666\n667\n668\n669\n670\n671\n672\n673\n674\n675\n676\n677\n678\n679\n680\n681\n682\n683\n684\n685\n686\n687\n688\n689\n690\n691\n692\n693\n694\n695\n696\n697\n698\n699\n700\n701\n702\n703\n704\n705\n706\n707\n708\n709\n710\n711\n712\n713\n714\n715\n716\n717\n718\n719\n720\n721\n722\n723\n724\n725\n726\n727\n728\n729\n730\n731\n732\n733\n734\n735\n736\n737\n738\n739\n740\n741\n742\n743\n744\n745\n746\n747\n748\n749\n750\n751\n752\n753\n754\n755\n756\n757\n758\n759\n760\n761\n762\n763\n764\n765\n766\n767\n768\n769\n770\n771\n772\n773\n774\n775\n776\n777\n778\n779\n780\n781\n782\n783\n784\n785\n786\n787\n788\n789\n790\n791\n792\n793\n794\n795\n796\n797\n798\n799\n800\n801\n802\n803\n804\n805\n806\n807\n808\n809\n810\n811\n812\n813\n814\n815\n816\n817\n818\n819\n820\n821\n822\n823\n824\n825\n826\n827\n828\n829\n830\n831\n832\n833\n834\n835\n836\n837\n838\n839\n840\n841\n842\n843\n844\n845\n846\n847\n848\n849\n850\n851\n852\n853\n854\n855\n856\n857\n858\n859\n860\n861\n862\n863\n864\n865\n866\n867\n868\n869\n870\n871\n872\n873\n874\n875\n876\n877\n878\n879\n880\n881\n882\n883\n884\n885\n886\n887\n888\n889\n890\n891\n892\n893\n894\n895\n896\n897\n898\n899\n900\n901\n902\n903\n904\n905\n906\n907\n908\n909\n910\n911\n912\n913\n914\n915\n916\n917\n918\n919\n920\n921\n922\n923\n924\n925\n926\n927\n928\n929\n930\n931\n932\n933\n934\n935\n936\n937\n938\n939\n940\n941\n942\n943\n944\n945\n946\n947\n948\n949\n950\n951\n952\n953\n954\n955\n956\n957\n958\n959\n960\n961\n962\n963\n964\n965\n966\n967\n968\n969\n970\n971\n972\n973\n974\n975\n976\n977\n978\n979\n980\n981\n982\n983\n984\n985\n986\n987\n988\n989\n990\n991\n992\n993\n994\n995\n996\n997\n998\n999\n1000\nu mad bro?\nLike this so it can be top comment and piss people off.", "Lol..Your Outfit Nigga!...Everybody Please Look At Those Pants", "I am yo real fan #panda_boy", "I can't stop dabbing to this.. Keep up the good work Timmy Tunner", "I almost just threw up in my mouth", "Want a long & sick song like \"shooters\" on LOD", "don't like the mix tape though rush job only timmy Turner nd panda made sense", "People just suppose to give away cover artwork now days? Huh? I'm confused!!! Lol smh", "rrrrrrrhaaa i dont even knw what time it is men .. Shout out to u desiigner come on keep on doing great men...AAAAAAAA...kkkkk", "Watch now[Criminal Manne] Short film \"Da ReturnOf Da Neighborhood Dopeman https://youtu.be/ZFy1UdGNmZ8", "Is that how you really sound/ talk? You must be retarded..m", "ugh! i made it 15 seconds. why is that a chick has to always try to redo what a man has already perfected? #sitdown", "Ahmed RECREATE THIS PIC PLEASE WOULD GIVE U 10 GOATS", "Plz come to south africa mahn im a BIG FAN i can even rap the whole panda song", "Is Samsung going to set fire to ACL?", "Meg Benney something is seriously wrong with this man", "Some years ago, we got #future\nWe taught it was over, \n Just this year, #desiigner prove to us ,that future was just a pic of him, bro ur the best", "Nice one designer I'll always be cul dude", "Patrick the question is, will the internet call this trash or potential", "Wow desingner brought panda we thought dat waz de end but tank God 4 TIMMY TURNER", "When you  Come to Brazil?", "In gonna go , hopefully !", "Alvin Zhou ayyyyyy lmao what just happened? i don't get it", "Go smoke ur weed, and stop copying Future!!!!!!", "visit now link full movie free (y)\n(y) Boo! A Madea Halloween (2016) - Full Movie Streaming\nhttp://tahubulatdigorengdadakanss.blogspot.co.id/2016/10/boo-madea-halloween-2016-full-movie.html\nKevin Hart: What Now? - Full Movie\nhttp://tahubulatdigorengdadakanss.blogspot.co.id/2016/10/cinema-2016-kevin-hart-what-now-full.html\nWhen the Bough Breaks (2016) Full Streaming Movie\nhttp://tahubulatdigorengdadakanss.blogspot.co.id/2016/10/when-bough-breaks-2016-full-streaming.html", "Cant wait! I love you Desiigner", "what is that beat in the background?", "baby boo when iz u comin th fuk out to Charlotte, NC 2 c me? Like Imma need u to stop taking all day mkay?? luh uu lol", "damn, my baby is so fine!", "Drunk, high and drunk again no wonder he can't speak properly", "Honestly bro your living the life we all dream have fun fam enjoy this life makes me happy that someone is fulfilling there dreams", "Why his shoes look like cheese cake?", "Dear kids,\n\nThis is the reason we preach to y'all drugs take over your entire body. Here on display is a man who once had sense and you could hear. Because of drugs he now sounds like a scratched CD of battle cries and gun fire. Think about it the next time you think sipping lean is cool.", "Deidre Hernandez Marquez nmms wey llevo un chingo riendome de este video jajaja", "I Love, Love his confidence! He don't give a damn what NoBody think, he stay true to self...and Trust! at this age with that kind of confidence & don't mind taking Risk he can open lots of Doors for Himself. He seems to understand it's ok to be different & judged at such a young age. I think that's Marvelous,  especially with sooo many children living with Low Esteem,  Hooray for Desiigner!\nThere will always be haters! #loveself #confidenceiskey", "I swear the muppets could body this stupid mother fucker.", "OMG this acutely works\n1. Kiss ur hand\n2.say ur crush's name\n3.close ur hand \n4.say any day of the weekday\n5.say ur name\n6.open ur hand \n7. Repost this to 15 other pics\nThe point-ur crush will say I like you on the weekday you have chosen.", "Panda drives me crazy I don't go a day without playing it", "Can't he even sing with an africa artist", "I LOVE desiigner.  He's so animated and hyped up all the time.. he must be feelin great everyday!! Lol", "This dude be turnt 24/7. Talk exactly how he raps.", "he is starting to talk an clear anglish ! goodd :D", "Restect to one of a kind Desiigner....... Tiimmy, Tiimmy, Tiimmy Turner\n He been wishin' for a burner\n To kill everybody walkin'\nHe knows that his soul's in the furnace\nFine bitch on BET\n Hottie wilin', she fuckin' on BET, wildin' for wallet", "It looks like they're going to turnt up the whole city with them dope artists in the game. #LOD", "Nate Abhishek Ali this is how we should promote merch sales", "Kitty Xu this is what your talkin bout hey", "Wanna be Wiz. STFU you wannabee"]