["Hello, I'm a Filipino. I would like to know who is the licensee of Minecraft in Asia/Philippines", "When will Minecraft be released on Nintendo 3DS?", "i got banned on a minecraft server because a kid thought my skin was offensive", "thanks for destroying my account :) not only did the m,igrationshit a while back remove my password i cant get a recoverymail either. and the support team takes 2 years to answer so ty. thats some money wasted. i played for 2 years and then you take the account ? ty.....", "Hey can you please Inc. a block gun.\nIf you do please make the gun where you shot 1 block then shoot another block for large areas.\nPlease Inc. it", "Minecraft, please make Romanian Language, because a lot of people from Romania play and like this game.", "So I hadn't played minecraft on my steam account for a long time and I felt like playing it today and realised you removed it!! What the hell guys ?! I paid for it and everything and don't even have it on my computer anymore", "Mojang can you just add it in the minecraft in the steam", "I wish we knew the people who registered Friday would get more in their bag than the people who came opening day Saturday. A few of the activities ran out of give aways....that was disappointing since the tickets were so expensive you would think having enough on hand for every ticket sold would make sense.", "como puedo bajar este juego a mi pc", "Haha, I really miss the old Minecraft. I actually use to play it when not many people knew about it. It's sad to see that new minecraft is all about mods and crap... :(", "Wow that is cool, are you going to put features that you come up with while you are designing Minecraft education Edition in the PC version?", "I also don't care about the End or the Ender Dragon. All hopes for Villager Trading (survival player here).", "I was excited there until I seen pocket.\nso I immediately lost interest", "Cool. Wish I was old enough. I'm 16. Also, why do we need to deposit $60, if I read that right? Also, plane flights and hotel rooms cost so much too.", "What, have I seen or run away from Zombies in Minecraft? It's like asking if we've ever used a pickaxe in minecraft. Can you be more generic and all encompassing?", "Need help! Can't change skin, says I don't own and wants me to by it. Can't manage profile", "My kid was so disappointed not to be able to get tickets to Minecon.  He has been dreaming out this forever.  Please, please, Please Minecon- can you add another day and sell some more tickets?!?!??!!  With so many fans, this should be a weeklong event! It's a win-win for everyone.", "So what's that mine craft dudes name ? Stampy and the Minecraft Diamond ? I dunno something like that anyway they'll probably get them to narrate , I'm thinking it will be like a Lego movie .... But meh whatever ....", "ola MMMM queria saver como se busca la actualizacion de minecraft pra ebox 360 para tener todo infinito como se busca", "Does anyone else wish that Mojang would create separate pages for each of their MC versions?\nI have the original for PC, and I'm getting sick of all this story mode, pocket and win10 versions being the majority of the content.", "I'm ready for my xbox 360 controller to work on windows 10 without adding tons of stuff that doesn't work for windows 10. Ready for my controller back Mojang.", "Console needs a creative tool thing where when you are building somthing big (wall/floor) thats one material we can quickly use the tool to fill on the space so we dont waste hours putting in floors", "Redstone Update!\nRedstone Update!\n\nRedstone is fun, it is educational. You can do great stuff with it.\nBut it is oddly inconsistent. It could be great for educators if it had more components. Had a slightly better analogy to electronics. Had more objects to power.\n\nMicrosoft apparently wants to let the creative/intelligent side fade to develop more Warcraft-like games.\n\nCome on. Balance and fix other aspects.\n\nRedstone!\nRedstone!\n\n Update!", "I can't open some of my chests,when i did it,the game crushed and i had to restart the game, what's happened with this new update ??? Plz someone point out for me :( :( :(", "Amazing! Our son 7 years old, is found of his Minecraft Papercraft! https://youtu.be/ejZTcHw9yQ8", "I love the game minecraft [in Indonesia minecraft also called MC :) :)", "You should make one for wii", "So the tickets are sold out...no more??", "Ummm Bro if u are reading this I found hero brine in pocket edition 15.2 I was just getting woods and I feel bad at my world it was on fire and it crash", "Lego minecraft:logic x1000 nailed it.bricks version of brick", "Minecraft PS3 players? Need people to play with!", "Erika Oliveira da uma relida quando tiver tempo. E deixa o Luks ver isso..", "I love the QQ from PC gamers. I'm a PC gamer and am beyond thankful for the staggering amount of mods we have. If you're complaining about Minecraft not getting an update on PC then you're doing it very, very wrong.\n\nPS. If you're still playing vanilla, google \"Technic Launcher.\" You're welcome.", "But story mode was created by Telltale Games,but  still love minecraft for sure..must downloadbit from Mobogenie to save money thab you buy from Google Play Store..", "I really wish they updated and put some new creatures in Minecraft, like Lions, Tigers, Elephants, and Alligator", "i really hope lego does another wave of this. I have a lot of the stuff from the first 3 waves plus the D2C Village.", "Get this to consoles and maybe...just maybe...I'll have more interest in Minecraft again.", "We would like Minecraft pe to allow railroad tracks to be placed sideways and upside down so you can make loop de loop roller coasters and other awesome stuff. Thanks. Esther Grace Hedin Naomi Joyful Hedin Glenn C Hedin and mama", "when is minecraft wii going to come out", "I like skin in minecraft is stampylonghead", "New Faction Server With Custom Enchants,InGame Ranks, Player Vaults AND MUCH MORE!!! Join NOW!! 45.35.95.217:25722", "All those zombies would of been dead with the sword of the true heroes! (Available only in the Minecraft Story Mode MOD)", "Minecraft 2012. \"Hey I built this cool redstone calculator and safe 3x3 piston door\"\nMinecraft 2016 \"hurr duuurrr scripted control blocks is the only way to do anything non-visual\"", "its in the minecraft ps4 edition too i like it :D", "Mojang Minecraft customer service just hung up on me!! wanted to change my sons Minecraft account to an email that worked, apparently they can't do that, you have to buy a whole new game!", "Well maybe its been sold more than when there was Markuss,but it will never be as good as Markuss's minecraft", "Minecraft PE commands and command should come to your blog also eklermis Turkish language should be added to the latest version", "I have to ask, will there be an option for players to create their own Battle maps?", "the maker of minecraft maybe scam me i tried to log in password and email is right but they log out me even if i klick remember me", "I think it's really great that Minecraft has become such a cross-generational game. I started playing in college back when it was still in early beta, and I'm so happy that it has evolved so much since then.", "I'm mortified by how many adults play this game... please for the love of God and everything on this green growing planet just stop.", "I'm still learning to stay awake while playing the game, that building is amazing, i wish they had more feature's in the game in itself.", "You seriously making the console peasants pay for dlcs?? Haven't they got it bad enough what with the crappy graphics and the low framerates without you stealing their money from them  for no reason?", "Nothing beats the original version. Everything else is garbage. Paying for mod packs and skins? What BS. Everything like that on PC is FREE. FREE. The game for PC was $23CAN when I bought it, I see it has been dumbed down as a game and marked up in price for console. PE is a joke.\nWindows 10 is also garbage. I would rather use an Apple product... *shudder*", "Congratulation!   I have been a member and lover of Minecraft for years.  I would say back 2007ish I remember one day I was logging into my account and it asked me do you want to upgrade your account for a small fee so that you get all new version.  Sure why not.  Well I found out today that you guys are still honoring this and that is downright  amazing.   Thank you.", "I cant see any other contact but need help with Minecraft story mode! Bought episode 4 and 5 ages ago and cant play them! They are still showing as coming soon!", "Not sure if it is clever to use these guest stars just because they are popular.. but we'll have to see, MC storymode has surprised me before", "Why do i have to pay for skins when i can actually change my skin? Oh yeah, ITS BECAUSE IT HAS 3D MODELS.", "You mean \"spleef\", as it is called on PC by people who made it ages ago. \"minigame\" would also be created by making a big platform of snow/dirt and giving players efficiency shovels.", "I have mc on my Xbox one, tekket as well as IPad so I'm set thanks. *now where's the chest my pick axe is in...... ah found it*", "so in other words they are doing what modders have been doing since the beginning of minecraft ?", "Yea yea yea don't judge me on not knowing what Herobrine is. I played Minecraft not knowing about Herobrine, I bought Minecraft PlayStation edition. I'm watching different YouTube videos of Herobrine and it's like watching a Bigfoot episode. What gets me thinking is if notch said he wasn't real why would anyone have pictures of him to the exact detail? I'm sure someone's gonna say he's real or just a myth concocted by some players who have no life and lives in their mother's basement with \" collectables\" of star wars or star trek etc. Now while playing Minecraft I did notice some odd things going on, a farm patch that's not near my farm it's just a block away from the lake it won't go away. Some have said that pyramids will form but if you look around before altering the terrain you'll see pyramids small to large and then there's mountains, from what I saw each player has always hunted for Herobrine on creative mode. I did some research and found nothing that is important like I said before it's like trying to Bigfoot or the Loch Ness Monster you only see images and the way to quickly debunk the sitings is saying he's not real or he's real omg let's run away. Honestly if he's in the game it means that notch himself put him in the game. Some have said that he's notches dead brother why would he put him in the game? Maybe they've worked on the game together and he past away, maybe it was his idea and he past away before getting his idea to work, maybe notch wants to see his brother and have him around and have everyone who plays Minecraft to see his brother which if you think about it for some it's creepy but to others it's a way to keep him around in a virtual world cause he can't be there in the real world. No matter how you look at it, there's no middle ground for any myth's or legends, there's always gonna be those who say he's not real the videos are a hoax and there's those who believe cold heartily that he's real. Here's what's happening to me when I play it. 1) I've seen red stone torches in caves so i take them and use wood to make a sign that says come at me bro\n2) I've seen gold blocks and again I take them and place a sign each one is different and I put why play hide and seek? \n3) I've seen mist appearing about four five blocks away and when mist does form it's about at last a hundred blocks away or more for those who don't know four blocks is the same thing when looking at someone who is standing in front of you where you have to take four steps to get closer to them.\n4) I've seen tunnels that I haven't done cause when I explore the world i torch the area and use red stone torches for rails redstone lamps and anything that you use redstone for. \n5) I enter caves and I see tunnels going straight down and so I come prepared and make ladders to go back when I'm done.\n6) I hear voices not the mob growls, screeches etc actually talking.\n7) to be afraid of Herobrine is like being scared of a roach. I saw another player running past but here's the kicker I have no WiFi there's WiFi all around me but there all password protected I play offline all the time and my house still stands even now. Is it possible that I have no wood at my main house, it's all either stone brick, glass, cobble stone, nether bricks, quarts. But my addition to my house is all wood the bridge, the towers, the rooms etc.", "when will snow golem figurine be available for purchase? I don't mean the mini ones", "I'm kind of shocked PC players make up the smallest percentage.", "You guys should add more heads like the golem head cat head and on", "A nice cast of YouTubers...but you guys are still missing Sagateryuz...making it only fun for the kittle kids I guess", "no thanks rather have texture packs for xbox one!", "I like minecraft mostly but there are a few things I do not like at all. The first mainly being the new combat. Where do I even start with the new combat system? Lets start first with the timed attacks. This timed attacks is ridiculous! I took me 20 strikes on a skeleton alone cause I could not time my attacks cause I did not have enough time when I was in a dungeon near a monster spawner! I could not kill the mobs faster than they could spawn in! Its absurd in my opinion and completely killed minecraft past 1.8.9 and its too bad cause minecraft 1.10 has so much promise.", "Is there a stampy skin for ps3", "This is great for the game as a whole. The more console players means the more attention the game gets. The game gets attention and the staff grows. Most minecraft anything is developed for pc then modified for console, they barely had Redstone while we're making hundreds of various machines. Their maps are truly limited whole ours are limited to some trillions of cube^2.\nAny additional content for any version of minecraft is good for everyone. \n\nYes, I too have been anxiously waiting for 1.9, but it's okay. I'd rather them push a working version in January  (maybe jan) rather than have 1.9 now and they're getting attacked because 1 out of 1000 will enter the end and die or some random bug.\n\nMore development begets more development. Let's be happy", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "We just bought several texture packs and a skin pack for xbox one and none of this is working. EVen did a hard reset of the xbox. I want my money back if it isn't going to work properly", "Believe me Minecraft Story Mode is really awesome. It has a bit of jumpscare. Its funny alongside its gripping storyline", "Can I customize the texture?\nBtw, thanks for fixing Win10 Edition:D", "Micro(transaction)soft. Minecraft was good in classrooms before it became another product for you to profit off. The whole point of Minecraft is to have a blank slate and create something from nothing.", "I like minecraft minecraft is weri welwe like", "Awesome!!!!!!!!!!! Michael perfect time to start the sever up again.", "Mendingan main di sever lifeboat \nBagi yang gak tahu nama servernya aku kasih tahu \nNama:lifeboat \nIp/adres:sg.lbsg.net", "WingedNetworks host's this massive faction based community server, If anyone wants to join the IP is below\n\nWingConnect.cubed.pro\n\n- find more on the page", "Obten tarjetas de regalo de playstation, xbox one, STEAM gratis con la app \"WHAFF\" codigo de invitacion FK85325", "I have Minecraft pe and In computer and Xbox 360 edition", "I'm sorry for being THAT GUY but what happens at minecon", "I sorta build my bases underground like in the featured drawing...", "I am Vietnamese and I very, very, very love MINECRAFT!!!", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "it would be so nice to have pc 1.11 fixed and out for download.", "When can we expect the xbox one and playstatin 4 to get the rest of 1.9 and 1.10", "Very few of the EDU features that are supposedly different from the normal game are actually working in the Beta. Even the tutorial world posted on the website has many problems. The \"slate , board and poster\" don't work nor can you place these when creating your own world. There is no book and quill item for students to write in and I have found no way to spawn these magical \"NPC eggs\" either. It feels like a seriously rushed beta. I understand that betas will have issues but NONE of the EDU features are working in the beta. What's the point?", "Still waiting for servers to come out for XBOX ONE to be able to host your own Creative mode server", "Yes, thank you for not supporting the biggest feature of the Wii U, and thank you as well for forcing us to buy texture packs we don't give a crap about.", "My sons minecraft pocket edition on his tablet hasn't been working since April! Just wont load. Being told to uninstall and re install, which we have dine a million times now. If that doesn't work to wait for next update. Obviously updates aren't fixing the issue! Cannot seem to find any help on your website or find the right contact info to talk to someone who can actually help. Always end up talking to billing! Getting very frustrating now. \n\nAnyone else have this issue or know how to solve it?", "Ehhhhhhhhh don't know exactly how I feel about this....  The story lost its charm already after the first episode, and the fact that all your choices really do is replace characters in cutscenes and change some cutscenes slightly doesn't help much either.  I want to like this game, but the only episode I like was episode one.  That felt like a Minecraft story, everything else after feels like your typical \"save the world fantasy tale\".  Minecraft isn't about saving the world, like literally every other game out there is.  It's about the freedom of creativity, and just trying to make it in a world out to get you, it's about doing what YOU want, it's not about being a hero, it's about being imaginative, intuitive, inventive, and jus having fun.  If the story would stop with this stupid arch of, \"WE MUST SLAY THIS DARK FORCE OH NOoOOOO!\" And then instead tackle a topic like \"hey what if you didn't have the freedom to craft and mine as you please?\"  (A topic episode 5 had for like 2 seconds, before switching to, \"let's defeat the one-dimensional villain who is evil just cuz she can be!\"). The idea of YouTubers joining the party seems both like a cool idea and like a shameless cash grab.  That what this entire game has felt like to me, a series of cool ideas and flat out cash grabs.  My apologies for my crazy long rant thingy, the game is good, I just expected better, for a game based on something as amazing as Minecraft.", "I wish I had Minecraft Lego when I was a kid! Anyone remember Technic Legos?", "Thank you Minecraft, Mojang, and Anaheim Convention Center ... Minecon 2016 California was the best one yet!", "Dear mojang, i believe that you should add dinosaurs to minecraft ps4 addition because I watched vidieos about it, I think that people would enjoy it very much. Thank you.", "Will there still be the class A.K.A proper site aswell. I like the old fashioned site", "Who plays minecraft with inverted colors", "Kenny Cooper\nKenny Cooper This is one of the Telltale games I've really, really enjoyed. The characters are likable (I haven't seen a single one I don't like!) and the story (both main and DLC adventures) are quite a treat to play! I'm a bit sad to see this coming to an end, I'...", "I've been with Minecraft since they first introduced beds in the beta. I feel as though it's reached the limit of its potential, but it's one of the greatest games I've ever played.", "Can someone help me I am looking for a song to download apparently used on minecraft and heard from a YouTuber little lizard gaming lucky block challenge is a funny flute sounding song", "#Snorefest! I rather have more texture packs for minecraft on Xbox One!!!! #TiredOfTheGarbage!", "Lavasmithing isn't THAT hard. I still manage to find players who blindly walk into my projects and cry about lack of safety rails.", "WTF has heppend to this game??? $35 now???? was only $15 when i got it, bloody Microsoft pricks", "Artwork created by our resident crayon queen Ninni \"Ninnilicious\" Landin. @NinniLandin", "When will minecraft 1.5.0 release on iOS device", "I like how monopolized the console editions are, these map packs, skin packs and texture packs are expensive af for how low resolution they are", "So tired of the clunky combat in Minecraft.", "sorry, but i have a lot of trubles with minecraft in windows 10, please help!", "Hello I've sent you an email about forgotten password and I was hoping you could reply to it, I included all the information just it's been two days and haven't heard a reply.", "How much is the minecraft now?", "Gotta ask, isn't Lego Minecraft a bit redundant?", "A minecraft movie sounds cool. Think of it like steve and alex wake up on a island by them self and the only way for them to get back to there real home they need to defeat the enderdragon and go through the last portal.", "I've played every TTG series, and whilst I've been either unable to stop playing until the series reaches its conclusion, or otherwise obsessively followed news on the next episode, with Minecraft I was honestly bored shitless by the 3rd episode.", "I love telltale! All of their games are super amazing, they come up with wonderful story lines. Anyone complaining about the MC story mode is just a doodoo brain.", "Minecraft do you know if or when Minecraft windows 10 will be compatible for HTC Vive?", "i got that book, it made fun of how a gatherer of resources should organize an inventory \"nope fill it with ALL of this and that\" and how do you expect me to collect resources? \"It's what ALL SURVIVORS MUST DO\" that is not if i'm collec- \"AAAAALL! SURVIVORS\" but... \"CONFORM OR YOU WILL BE EXTERMINATED\" *lives with a pretty much empty inventory and a wooden house*  \"YOU IDIOT! THIS IS NOT SURVIVING! THIS IS SURVIVING!\" *build giant obsidian lava fortress* *continues living in wooden square house with iron armor for a year strait* \"NO NO NO! LOOK YOUR HOUSE IS ON FIRE\" thats because you just set it on- \"SILENCE! YOU CANNOT LIVE WITH THAT IRON!  LOOK AT ALL THIS ENCHANTED DIAMOND!\" but there's not anyother players... what use is op armor that doesn't even look good when there's no playe- \"YOU ARE NO SURVIVOR!\"", "I want to summon dragons in the overworld to really cause problems in my would be server.\n\nI'm sure that isn't something that will be possible though.", "We got 4 Lego Minecraft kits for Christmas!, my son and I have a great time building them together!", "How about you make skins free just like they are on pc. On pc you can even make your own skins.", "I wouldn't mind going, but from what I've seen of it, it is just dominated mostly by kids who make awkward cringe moments.", "Thank God they haven't updated Xbox to the Combat Update. I honestly really dislike the new PVP system. Take your time Microsoft! I'm glad there's a new minigame, sounds fun!", "quiuen video chat para minecraft team", "Minecraft pocket edition is easy for me now I'm one of the best players in minecraft pocket edition", "warcraftbr.bursthosting.com.br <-- Servidor Muito boom e 100% sem Lag!!", "I badly want to know who does the official art. It's so clean.", "wats the point of the minecraft education is it too teach the players all of the functions of minecraft n make potions n other like tht?", "Next lego release will be a single block lol.\nThe minecraft concept is a modern and virtual version of lego. The oposite is ridiculous.", "HAHAHA I rememeber education software its that place where good games become crappy edutainment and are the third  worst thing after meme games and indie early access", "is there any way i can change my world to be connected to other people so they can come to it? i am new and dont know much about the servers", "I really need to know how to download stuff for my daughter.  She desperately wants mo creatures and every download gets booted out by Norton.  Is there a safe website i may use.  i thought for xbox 360 mo creatures was linked with Mojang, but apparently not.  No JB Hifi or EB games or anyone has any clue?!", "Iron golem and wolf allso steve from: Dantdm i love diamond sed  Dantdm", "Why i can`t login into my premium on launcher,but i can login on site?", "yo can the people at minecraft look into adding mods for console edition? that would be great thanks", "Why don't you work on the original Minecraft enymore all my friends including me hates Minecraft story mode but we need new equipment for Minecraft on console and PC trust me best idea you will ever have is giving the original Minecraft more", "Who is the amazing animator that animated these Classic Tales?", "Can't wait till Minecraft pocket edition has the end and horses, I would also like spawn able dragons to have as pets.", "When are we console players haveing the pic minecraft updates please", "If Minecraft advantage of the new Vulkan Api?\nOr ... Minecraft is at all adapted to Vulkan? D:\n\nAlthough Fits here not there, but I can write anywhere else underneath.", "i hate minecraft cause i cant buy it im just poor and want to play a premuim minecraft but i cant cause im poor :'(", "So much fun for my son!  Thank you and we can't wait for next years!", "Excuse me. Why i can't install MCPE 0.15.90.7 build 4 apk on Android ver 5.1.1 (Lollipop) ?? Why ??", "Do never enter a cave without torches, tools, weapons and armor. hihi :) I'm 56, and i like to play Minecraft. :D", "But hwo can do lego minecraft video more sombies and alex with a iron golem??", "Those books are for new players. If players from begging of minecraft to now, already know these things. I am not trying to sound rude.", "I love Minecraft a lot but the hit delay after every hit were  bad the pvp were crazy but the new End Elytra and the second Hand are great!!!", "Can I view my in game coordinates yet? Portal jumping is nigh impossible", "And I assume we have to pay for it?", "minecraft plz help me in minecraft windows 10 edition beta as I open it has not as yet open is java", "I just purchased minecraft for my kids and can't get it to launch, can't get the help part of the forum to work (can't type) can anyone help me? I'm getting this when I hit play for the first time", "can i get some help pleas with something bad herobrine its not fake idk whout to do\npc minecraft has a big problom", "i cant play the realms and i cant sing up to my xbox live account", "No offence but I am going to stay with the older ones.", "Tinag nga kita addict sa minecraft ehh ! Cyprian Manzano", "Minecraft pe minecon 2016 yok ama neden Minecraft yenicen", "I'm going to the minecon next year.", "Ya know u guys should make an update to where there's more furniture like couches u can sit on,jars u can put stuff in and many more like how Mr crayfish did all th at designing u should associate with him and add him to the company you'll probably get way more people buying minecraft which is good for the company", "Hi guys please join my server\nname: PLAY\nIP;b29973.leet.cc\nPort; 29973", "yeah see more and share your creations good work inspired by players creating and destroying dimensional environement", "4 years and no realms... I would love to be able to share a world with my friends. Will you ever stop ignoring the fans?", "can you gys plss return minecraft to someting like 1.7 ore 1.8 but call it 1. 12 ore soething ?", "What about Android/iOS Minecraft players. We feel left out, for crying out loud. Give us the update please.", "SERVER SURVIVAL 1.8.X .... IP: mc.spartanoscraft.com !!! LETS GO GUYS", "I get the feeling minecraft has turned into a giant windows 10 advertising campaign.", "Minecraft \nes otho not like the fire in the face that is please in future versions make a potion for this problem.\nBecause of this problem 3 people killed me .\n\nI am Brazilian minecraft fan thanks for bringing an incredible game and have only 8 anos.MUITO THANK YOU!", "Just when I thought I didn't need to buy anymore editions of Minecraft...I already have every other one except wii u. Now I'm definitely going to have to get it!", "Hi There. Is anybody interested for donating in our server? That would be really helpful. Just 300 credits and you'll be promoted+OP MODE+Creative Game mode. Were now close to an Unli Server! Please join us. Message me if interested. Thank you :)", "Guys how to update minecraft in 0.14", "Which camp does windows 10 phone fall in - pocket or win 10? Does it have achievements?", "Don't get me wrong, Minecraft is propably the most time consuming game I've ever played (and that's big sentence coming out from the 80's kid) - but buying the newest console to play a game that runs perfectly on 5 year old laptop is quite odd combo :)", "It is the push of a creative game into a fixed story. I feel like the game has become less attractive these days. If they keep it open more to public, it could continue more.", "You know the Lego companies are desperate, when the start making Lego minecraft stuff. Legos are cool and all but kids are more interested in electronics now a days.", "neon-lit-ugly-rigs? Written by an edgy cuck in his 30s", "I'm just waiting for the content pc keeps getting. They're going on 1.11 and we're still stuck in the 1.8 on Xbox. Can easily play pc but I actually enjoy it more on the couch with a controller in hand.", "mojang can i pls say that i was little I played minecraft long ago it was the ever coolest game ever to build thats why im needing help to getting many mods texture and also crazy craft", "hey mojang could you please inform me why of xbox playstation and wii xbox being mainly a 4 player couch co-op playing style playstation being a 2 player couch co-op playing style those two systems were 4 player and yet the 5 player wii u is single player no couch co-op i was hoping since we have 5 people who are capable of playing minecraft in the house that maybe purchasing the wii u one would be the smart decision because of the kiddied down super mario edition and now after finally getting around to playing it (cant return it now) my kids cried as soon as they found out they cant play together, is this something that will hopefully be fixed in the near future by an update (very possible do 4 player split screen on tv and 5th player on the game pad (technically the first player) because my kids were really looking forward to it and we bought all the dlc", "Apparently, I've heard you cannot use the Wii U gamepad to manage inventory. It would be a feature that would make the console stand out more. Not sure though.", "Minecraft great update but .. nerf skeletons and baby zombies are too powerfull with this combat update", "If they fall off the stage in those costumes it will be some quality banter", "Okay if you want to create a safer environment stop forcing it into freaking bathrooms for Petes sake men and women no matter what they identify themselves as shouldn't be in each other's bathrooms that is my thought", "I don't have this episode... I see write Coming Soon, why?", "Down witthhh minecraft win 10 its so bad and should be away from this world nobody likes an copy", "Someone do a review on this book so that I can make use this is actually worth it.", "Join A Nice Rpg/Custom Survival server!\n------------------------------------------------------------\nIp: godlytowns.hosthorde.net\nGenre: Towny RPG Survival Custom_Items\nVersion: 1.8.x\nDesc: We are a small server looking for a good community. We have around 75 plugins and we \nhave so many custom items that we have double\nthe amounts of items in vanilla! We also have some RPG and Towny plugin where you can advance in our society and earn many new friends! We look forward to seeing you!", "I know its not likely but would love playstation vr support. Would be so cool to be able to walk through worlds we build.", "Hello fellow Minecrafter's! Me and my Girlfriend recently tried playing Minecraft again and we bought MC Realms... Only to figure out my girlfriend's Minecraft is broken and keeps giving her an error after she loads into a world and walks around for about 10 seconds. \"Java(TM) Platform SE binary has stopped working.\" Is there anyone who's able to help me? I'd love u forever!", "The story synopsis is stupid it lost me immedietly when I read\n\n\"Jesse (voiced by Patton Oswalt/Catherine Taber), who is a passionate newbie Minecraft player who sets out on a journey with his/her friends within the Minecraft world..\"\n\nThat would be like Luke Skywalker going to some toy store to purchase Star Wars action figures.\n\nWhy not just make an adventure story about Steve and Alex?\n\nFail.", "The only thing I like about Win 10 version is the performance increase.  The coding is more efficient and the fractal spawning of the landscapes is like =SLAM!= world is there!  I do like it for this reason and that it plays with less performance glitches.  But then my computer isn't the newest.  Just remember that MS bought this.  I fully expect them to be \"corporate-like\" and shut down the Java version in favor of the PE version one of these days.  It would be just like a corporation to do so.", "FINALLY IVE BEEN WAITING SO LONG FOR EPISODE 5", "\"If you're running on Windows and just want to set up a server easily, download minecraft_server.1.9.2.exe and run it. \"\nThis link just returns you to the main download page   ? ?", "Having problems on s7. The game crashes back to oculus home when I try to start a woeld. Same happens if I try to change the character/world name or any text input the game crashes after I press ok. Reinstalled and cleared oculus cache but it didnt help. Any clues anyone?", "For Minecraft on Xbox one and PlayStation four can you please put online servers like you have for the PC so I can play Minecraft The Funway!!!!!", "That \"stab in the back\" scenario is hilariously stupid.  After you dump lava on them, apparently you should just stick around and keep fighting in the lava pool you've just created?  Or was there a prologue page not shown, explaining how you should chug a Fire Resistance potion before starting, so you don't burn to death and lose all your stuff right along with the other player?\n\nAnd that's just setting aside the basic hilarity of a printed, unchangeable guide for a constantly revising game.", "I updated to the new version. The windows update is great, but the pocket version for my ipad won't load. I get an error saying \"invalid or corrupt skins\". How can I fix this? I went onto some forums and they weren't any help.", "Uh what update, nothings in the App Store update section related to minecraft", "Can we get rid of mini games and get actual fixes for console versions and updated to at least 1.9 on console? More time should be spent fixing the game then adding modes no one asked for.", "Guys when i play Minecraft (any version) the game lags mobs when get hit are slowly flying then dropping any block i destroy respawns why plz healp somebody!", "I love minecon but im just watching on you tube and i cant go there because im in the Philippines", "May I ask a request? In minecraft pocket edition can you add book and quilt and also add pistons lastly could you make the mobs talk to you thanks!", "Please make this for 3DS cuz I dont have a Wii u", "TBH if you need this to survive a day in minecraft, odds are the book wont help", "SOLD OUT ??? Thats a booboo. We had plans to come all the way from toronto, tickets hotels rental car and everything planned and look at this - minecon sold out ...!!!", "I wonder if The Creatures and Cow Chop are at Minecon this year.", "hey minecraft can you have a update with cars and guns in minecraft", "New update for mine craft android just keeps exiting to the home screen.  Before the update it worked perfectly.  Tried reinstalling and rebooting tablet?", "Just played after a year, my god is Minecraft terrible. It's just so bad when compared to so many other games on the market. I feel like when Notch left, the game was left EXACTLY the same. These new content updates are so minor and lacking, just wow. Mods are the only reason to play. I pay full respect towards the modding community, as for the developers, Microsoft needs to replace them before it's too late.\n\nIt's no wonder why the younger community eats this up, it's so basic and lacking that they're the only people who can make sense out of the game. I've seen early access games with more content for crying out loud. Always so disappointed with this game...", "i Think you guys need to make more realistic trees or make a big tree that is rare and find items in it like the blacksmith", "hi i lost my account and for no risen at all and im try to get it back if i cant i am not buy a nuther that sad i am done minecraf", "when are you going to fix all the bugs and broken features from previous updates tho", "Wasn't Minecraft already on Oculus? Ohh... you mean officially supported. Not a mod. Got it.", "Hello notch, just wanted to ask how my minecraft optimize the naturalness of the maximum.\nPlease help. XD :P", "Any word on when they'll launch Realms for Windows 10 Edition?", "Latest update doesnt work crashes my minecraft every time!", "Wonder if you have to buy the special Wii U Pro Controllers for this?", "They should make a minecraft trample run where u have different skins and having the ender dragon chase u", "Ask them to let people upload lets plays for it since Minecraft has a huge amount of YouTubers. It'll help advertise Minecraft and the Wii U.", "hello, Mojang, Pocket Edition game and enjoyed congratulations execelente game but like any player I wonder if you guys will put the portal end, this version would be really cool and good for the players this version know the work but this in leave very cheerful and happy to help us it please mojang put the end to be happy .. thank you.", "For those coming over from the 360 I think we should not have to re buy minecraft again", "This is one of the Telltale games I've really, really enjoyed. The characters are likable (I haven't seen a single one I don't like!) and the story (both main and DLC adventures) are quite a treat to play! I'm a bit sad to see this coming to an end, I'd love to see more of the adventures these characters have. ):\nAny plans to continue it, at all? It would be such a waste to put these characters on the backburner for good!", "OMG guys HELLP !!! something happend with myacount i could just play demo but i have boughted minecraft", "minecraft story mode e um jogo facil de jogor eu parei no episodio   3 .", "if days lasted only 20 minutes, I'd be a rich man working all that overtime.", "Minecraft has saying to me doenloading terrain on all servers", "You guys know you can keep playing old versions, right? No one is forcing you to update. You don't have to dramatically quit Minecraft just because of a newer version.", "I have book about Redstone which I am reading right now,can't wait too read that one!", "So I just downloaded minecraft off of the wii u eshop, I can't seem to find the dlc for mario mashup.", "Wait, are you seriously trying to tell me that more people have bought this for the phone than the other two platforms? If the smartphone was the first version I'd tried, I'd hate minecraft, this is simply one of those games that's meant to be played on a PC, where you can add mods.", "I used to love playing minecraft with the active mod community but now even that is diminishing quickly soon it will pan out to where minecraft only plays in vanilla mode that would be bland.", "For the next update/snapshot on pc can you guys make it so that Flame 1 bows can set flammable items on fire? e.g. logs or leaves?", "My Quick Select tools are inverted instead of adding things from left to right it goes Right to Left. Is anyone else having this problem if so how do you fix this its bugging the crap out of me!!!", "Hello Mojang, I wanna buy Minecraft PE but i cant set up the payment method...Its says that my credit/debit card number was invalid...I dont know why...Can you help me how to fix this", "I am a mother of a almost 6 year old boy that is obsessed with minecraft. He plays on my laptop. Windows 10 beta I think. I was thinking about getting him a console. Just want to know if this one is worth it?", "OMG the best ep ever YOUTUBER inside the Minecraft story mode wwoaahh", "I don't play electronic games, so I have almost no understanding of what will play on what machine and my wee boy wants to play more than pocket edition; if I buy minecraft pc will it work on an android tablet? Thank you :)", "I didnt know minecon is today. I thought it already happened tbh", "When will minecraft Xbox 360 edition update???", "Just saying if you go to this there's a 100 percent chance your gonna see a bunch of 10 year olds.", "3 years later...\nMeanwhile PC is hitting 1.11!! Bigger than that tiny pocket edition! ;D", "Your 360 update broke my game, all chests on all worlds freeze the consol when opened", "Is this available on iOS as well?? Actually no I don't even care!! pocket edition we can create are own character or download them. I think the console version should be like that also", "It does not show up in the Updates section. Has it not been released yet, or can I just not download it?", "sorry about this message but I am new to minecraft. I have an autistic son, who I see once a week. He is very demanding regarding minecraft, as I am an artist I am quite creative. My son has an amazing world etc.", "So now that consoles are getting mod support for games like fallout 4 are we going to be able to possibly see mods coming to console so we can get out if vanilla phase?", "GOLD CREEPER, its the icon of Minecraft!", "Oh, the comments- yes, it's a BOOK for Pete's Sake. Makes a birthday gift for a kid when you don't know what to get them. Reading for a long trip in the car, for a trip to the loo or in bed when your mom kicks you off the game for playing too long. YES, people still read BOOKS in paper format, LOL.", "I suggest add support for mods on mobiles as you can do on pc. Minecraft becomes famous cause all persons could add cool stuff to do", "HI, my grandson has just downloaded minecraft and is having trouble moving side to side / back and forth  after creating his world in minecraft on the computer,while using the key pad. We have checked all keys and nothing will allow him to move side to side. Any suggestions anyone......Please.", "Really concerned about this new mode only coming with 3 maps and then asking people to pay for more additional maps in future, we have a game where you can create and craft your tools, weapons and your own home and maps but just not for this mode...I hope I am wrong about this. I want to be able to create my own Battle maps.", "episode 4 was really bad to me i mean why did Reuben die that was so sad man and another thing my cousins name is Reuben", "In the past, i was always waiting for an update to come because i enjoyed all the update trailers that your team made... are they coming back?(i mean the trailers)", "Hey! I'm unable to play Minecraft with my son by creating a hotspot on my phone and having him connect to it. This is a crucial funcionality as we don't have a wifi connection avaliable all the time.\n\nEven togling \"use mobile data\" on options solves the problem! Please look into it mojang.", "Minecraft is an awesome game...but to be realistic, it sucks on console. The map is far too small and it's behind in terms of updates and features compared with the PC version.\nI love my xbox...but I brought Minecraft for PC because it's far far better.", "You can tell it's been a while when nobody knows what the Removed Herobrine in joke is.\n\nHonestly at this point I feel like you're beating a dead horse. Do one more update. Add that modding API you've been talking about for 5 years. Fully optimise the game. Then declare it the end of updates. Let the modding community take it over. That's what will make the game last", "They should of added more generated structures. Only one isn't enough to be called \"Exploration\"", "They need too make an update where other modarTors are aloud too join your city without keep inviting them all the time", "I haven't played minecraft in about 2 months due to my job, but I'm actually pretty excited to hop on today and test out 1.9 :) I've looked at it, and the Ender City is my first stop!! If anyone wants to hop on TS and play together, reply to my comment :D I'd love to get to know more new people who love playing Minecraft :D!!", "could you update the way your realms does not work and the fact you cant call customer support?", "Can i use VR with normal dioptric glasses?", "Why didnt you reals  the the playstaion skin pack", "Ahhh the diabolical skin pack tact. Hope everyone is enjoying the windows cash-in eddition.", "I am hoping someone can help.  My daughter has a PS3 and has minecraft game.  She wants the my little pony minecraft but for the life of me I have no idea how to get it through her PS3.  I do not play the game so if someone could walk me through what I need to do you would make my life so much easier.  Thanks.", "Space travel would be an awesome addition to the game...", "for gods sake, they say they're getting 1.9 and instead they update other consoles", "I WANT the cookie cutters. Love it all!!!\nMotherlode\nMotherlode\nMotherlode\nMotherlode", "DarkMoon Server, Run by hubby and wife. No longer whitelisted\nAccepting people to join and have some fun with us. We have a few requirements.\n1) Must be 13+ \n2) Respect\n2) No Grieving at all\n3) Respect everyone\nSlots expanded to 40\nPC Only, Not OFFLINE MODE\nIP: 158.69.122.94:25615\nPlay Style: Survival", "I would appreciate any help I can get.  I got Minecraft from a Walmart card 5-6 years ago? I don't even remember for sure.  Well since Mojang decided that my Minecraft account needed to be switched over I do not have access to my Minecraft any longer, demo only.  I put in my id and password, which has always been the same, and it tells me it is wrong.  No, I don't have the receipt or the order number, I trusted that once I bought, installed and years went by it was no longer a question that I owned it, HA!  So now my email is changed, the id and/or password no longer works, wth do I do now?  Am I just screwed out of my purchase?  I mean how hard is it to look on there and see that I have been a part of it literally for years?  Come on, someone figure this out before everyone starts losing their purchases.", "does anyone know if mojang will update the console minecraft's with the same stuff on the pc cause I use wiiU and PS4 and it is not the same. (missing block types, mobs, animals, etc)", "im not amerikan but im playing minecraft pe 14.0", "Can someone PLEASE tell me how I can get crazy craft?? My son wants it so bad and I thought it was a mod but i've been searching all day and just keep running into spam and adware. :-/ PLZ HELP.", "i also wanna go to minecon but its too far cause i live here in Philippines and i have many talents on redstone and almost anything", "Ok so lego was an invention so it would make it easier to build a house out of blocks. Before that it was wood blocks and Lincoln logs. The future was mine craft, made it easier to build whatever you want. And they said video games will make us stupid.... Mine craft has created a new gen of kids and adults, smart and creative. What I don't get, why would I want to have a game where I still have to use legos? Its ok for kids that don't think ahead and live off trend. Legos are dead, time to rethink this Lego. How about magnetic blocks. No more clicking.", "I liked minecraft and Mojang because it didn't get involved in political BS. You do realize people have differing opinions on what is and isn't right. Great way to alienate 50+% of the users.\nI don't like public schools getting involved in telling kids what is and isn't right and yet your company now just took a stance with a product doing it can you guess my feelings on that. Yea, you just got perma dropped. Everything I've made in support of mods for the game and so on is now gone permanently  including videos and tutorials.\nI used to support gays and their rights that was up till fairly recently when they started showing a disregard for others and their rights such as their right to religious freedom or beliefs.", "I have a problem with Minecraft PE, every time I open it, it crashes I tried resetting my iPad but it still keeps crashing, I just updated it But can you please help me?", "What happened to updating minecraft pocket edition, the game does not work, it does not work on my phone and my tablet also", "i cant create realms it always says ''your purchase succeded but, we cant create your realms right now'' and when i do it again it says ''ERROR\" why?", "I can't download The Pocket Edition on my phone, I only have The Mc Skin Editor", "Lego Minecraft because let's take the thing that was inspired by one thing and turn it back into the original thing that inspired it and call it new oh and jack up the price ahh innovative", "Purchased in 2011 via paypal, because it migrated across to mojang   had to re set everything and download again following instructions, and now get told oh sorry you will have to purchase again as file has been damaged! just seems to be a scam to get more money!!!!!", "i want this is will available on google play", "Can you make a skin creator for MC consoles? Tired of all the same skins", "Oh wow.... then we have the PC users making w/e skin they want. I'm very disappointed my niece and Nephews can't even have nearly as much fun as the PC users. No mods allowed for the console users.", "The llamas are pretty cute, I checked 'em out during the snapshot. I also really love the Shulker boxes, they're very helpful. <3", "I'm thinking of adding Minecraft to the list of games for ps4 is there anyone from Claiborne County Tennessee maybe we can team up and build Norris Lake", "Help Need !!!!!!!!!!!!!!!!!!!!!!!!!!!!!\ndoes any know about minecraft please for the PC..\nTrying to upload The MODS for my son and I seen not to get it write, have look on line but again not doing very well\nHelp me please", "I swear to god.. If you can't mine by swinging the Wii controller i'm going to be mad. xD", "Lobosjr started playing Minecraft. I don't care about Minecraft anymore but it's fun watching a Dark Souls pro play MC for the first time", "I'm able to download Castle Siege and Alien Invasion....but when I enter the world...they always crash! I'm hoping they fix this in 0.16.0...btw I'm an Amazon device", "Step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "I'm begging my mom Christa Lawrence to take me because she wants to go to cali and I want to go to minecon because my b-day is in September so if it works it will. Be a win-win", "Looks cool but you nerfed mob spawn and broke so many XP grinders :(", "Eurovision stage is something Magical. Congratulations FyreUK", "I really appreciate it but 3 more?! My wallet is already hungry for 3 months. And now 3 more? Send me to hell.", "This is amazing works by amazing people and the best learning tool for the brains of children with adhd, add, and autism! Thank you to the creators and God bless them! Have a most amazing and blessed webtime everyone!", "you should add deadly water mobs to minecraft pc", "Am Excuse me Sir, Iam A filipino minecrafter and my minecraft did'nt work it has crash report, I Did all the youtube videos on how to fix this, it did'nt work, the crash says that \"I think you are modded\" and more crash reports, I am sorry minecraft makers, But CAN you message me? on how to fix this? Step by Step", "minecraft i new every thing in minecraft i sow the video minecraft school little lizard high school i watch them every day day and night i love the little club the caracters are little donny,little kelly little carly,little lizard,Tiny tertle,cap_amereca,iron_man,max the monkey,donut the dog,scuber steve,sharky is a vegeteren shark in minecraft he dont eat people and alfred is the story teller iron_man a.k.a tony stark o and dantdm is the diamond minecrt good bay", "Hello, I can't play with my Minecraft account, i have to repurchase the game... Thanks you Mojang...", "I actually held off on the PS4 and XBONE editions just so I could get this on the Wii U... only to find out you made this the size of the 360 version (I'm sorry, but there is no excuse for that.. Xenoblade Chronicles X proved that hardcore) and my desire for this version plummeted.  I know everyone's upset about the lack of gamepad management (I  mean.. that would have been smart), but I'm disappointed in the basic game size limitations you implemented that was based on last gen file size limitations that are NOT present on the Wii U.  \n\nLazy... Lazy... Lazy.", "I'm not able to use the hoe to farm my land. It breaks the dirt tiles. Right clicking does not work. Does anyone know what to do? It's Minecraft for pc.", "The WiiU has been an obvious ideal platform for Minecraft for years. \n\n3 years later, I sincerely hope the fanbase treats the game as an afterthought as you did them. \n\nRidiculous that it took this long.", "I actually got this and biyed it and it was awesome book beacuse you can read guide for your survival world thank you for making minecraft", "Hi guys, I am having issues with the split screen on xbox 360 edition. The miners arm is not showing up and i can only move up and down. Is any one else having this issue and is there any way to resolve this? Cheers", "I love minecraft just building alone got me hooked on it and playing with friends is the best untill they have their friends join and they all have squeaky voices and they start using your resources that you gathered then they lead creepers to your house and it gets blown up noooo. Good thing you can change a setting so only the people you want can join. Console version is hella fun. The pc version is the best. Ahhh so many good times, i love minecraft. #redpandagang", "Microsoft ruined minecraft sorry but it used to be way simpler and now its so complicated and boring. I miss the 1.6.4 days\n\nEdit: please dont get butthurt. I am only stating my opinion and am not trying to make fun of anyone. Take a little constructive criticism, will ya?", "How much decicated wam do I need?", "So how come to play minecraft online in ps4, I all of a sudden need ps plus to play it??? Never needed it before you updated.....Thanks for the new update -_-", "I honestly think the best episodes were the original wither boss one. I feel that its kind of going down hill in terms of plot. Thats just my opinion and i may be wrong", "Me entretiene mas los comentarios que el calvito y el skater retirado friki ese", "add a new  sky dimenchen and its made the same as the nether portal", "Are they going to announce the completion of the modding API?", "Mojang hello when will the update has minecraft PS Vita ? and there will be anything new ?", "Don't you mean Fakelogdotzip since someone took his username in Windows 10?", "Woah. The magma cube was really really impressive. I hope that she wins.", "With a science degree, a smattering of several European languages, and 80+years of using English as my native tongue I have not a clue what Minecraft is all about. Must go back to school!", "Question:\nWill there be item handling say for keeping track of an item queue/stack more obvious? if I can also sort items (like how you can with hoppers) with an interesting schematic (say by looking at a map); and also having some nicer item transport pipes (because the water+packice+signpost+glassblock glitch isn't known to everyone)\n... you can set up an Deterministic Finite Automata, or a Non Deterministic Finite Automata.\nSay can players meet the challenge to get a machine to accept any possible queue of apples, diamonds, or gold bars which accepts there being the same amount of items (regardless of order), while rejecting any queue which doesn't pass the requirements?", "I liked this......but i wish they added more youtubers!Anyways....its cheap but i wached a youtuber LDShadowLady waching this so i dont have to buy it myself", "realy??? we want Texture-Packs and Updates for the Console-edition (Ps4)! Not 2000000000 mio skins! =(", "Galera vcs sabem como por uma nova textura no Minecraft Pocket Edition v.0.15.3 ?", "also add the skins pack of souls of minecraft pe !!!!", "A website geeze theres better things to work on like the console edition & maybe mc 2.0", "Hello, I have a problem with my minecraft 1.9, the run game fps me at 5 fps maximum 8 and that's not normal, earlier versions is run minecraft 1.8.9 or less perfect mind me but this version does not give me. Actualize all including java, system also eliminates the launcher minecraft and yet I run very slow, nose if I'm missing something or some system that not already incorporated into minecraft 1.9 if anyone knows what the problem please email me want to play minecraft 1.9\nNote: I have the primium minecraft.", "I has a minecraft...not this minecraft (minecraft campfire)", "Does Windows 10 edition have a working \"lefty option\" or customizable controls yet?", "Sounds great and all but it should be win10 and Xbox one together. Pe is cool but is hard to use controls. And also considering PE is out on a device you guys don't make that crushes your phone and tablet sales, maybe people at Microsoft should be rethinking their priorities. I own an iPhone but have much love to Microsoft. I just wish that Xbox should be considered first", "previously i can download minecraft and play on your computer , but when turned into yesterday morning , only minecraft minecraft out letters on the screen and disappear ! I 've tried to erase reload many times but still failed ?", "Or you could not go and do something outdoors like fishing or camping versus wasting time on a game. You all complain about this generation yet you support it with dumb things like this.", "I am a pro minecraft on minigame : build , ......", "Microsoft ruined Minecraft. They couldn't keep their dirty fingers off of Mojang's masterpiece. Microsoft is nothing more than a profit seeker, which i like to refer to as 'a greedy mosquito preying on it's prey.'", "Seriously,three more,when is it finished i mean what do they even have do in Minecraft Story Mode 6,7 & 8. What they are gonna make another Wither Storm...?", "After the update on my xbox 360 today I can't open any chest in the game without my xbox freezing. Anyone else having this issue or know how to fix? :(", "When is HEROBRINE is going to be added in Minecraft Story Mode", "Just give me a Lego Minecraft game. No one cares about toys", "this comment is not specifically just for Wii u, but all games in the Minecraft franchise.  how about an update that has a quartz pickaxe, emerald armor and tools, shields that have varying degrees of protection, and otherwise getting all of the games so that they have the same stuff, please.", "It's because of the childish youtubers that pretty much make their videos targeting toddlers with tablets. This is only temporary, those kids will grow up to play pc most likely", "I just wanted to let you know Minecraft that your game developers mojang and the owners of the company specifically Microsoft and Xbox have not gotten back to me in over 3 weeks regarding an issue I have had with accessing my main world in minecraft. The data is possibly corrupted and I have been trying to have it resolved or just given any information on the progress of resolving the issue and have not heard ANYTHING. It is unfortunate that has a fan, gamer and customer I am not hearing from the support community on how I can play the game.", "My daughter wants Minecraft for PC for Christmas. I found the download card in Game Stop but how would she purchase different packs/skins for that version???", "Hello Mojang Team, \n\nI have an idea for the next Minecraft 1.1 0 update just a little change in the game \n\nThe cow gives you infinity milk right \nI think We must change that \n\nMy Change                                            \n\nA cow that you find in Minecraft nature gives you now only 5 buckets of milk\nand for every milk bucket after 5 the cow has to eat 1 normal or tall grass \n1milk bucket (after the natural 5) = 1 grass to eat        \n\nand the animation can look like the sheep grass eat animation\n\nWell the real cows eat always grass why don't they eat grass in minecraft ?\n\nIdea by Minecraft0137", "I been have minecraft story mode it's cool", "Why exactly does a game that is about being creative and using your imagination need a book telling you how to build something?", "Today is May 17th...where is this update? Not on eShop or downloaded to my wiiu...", "Just read you are holding minecon in California. Guess that is your way of making your political affiliation known. Lots of more neutral states you could have selected instead you chose CA.", "How did we get from Notch's philosophy of buying the game once to having DLCs for Minecraft?", "Dual wielding does close to nothing except let you eat and block with a shield,  the whole cool down system, mixed with the mediocre shield blocking when your stuck in a corner is just disgusting.  You can literally have a full set of iron armor, and still get wrecked by 2 zombies and a skeleton, because you take gradual damage as our blocking, and if you even try to attack while shielding, your gonna get whipped by a zombie or a skeleton shot before you can even hit them.  The odds have been so stacked against your favor in this update, it almost feels like dark souls.  You cant mix a once, casual game that was semi easy, to a new combat system that makes the normal mode hard.  It draws all the people what liked the game for being what it was away.  And to those people who say \"get over it\" or \"ohh you just suck\" dont realize that minecraft in its first concept, wasn't supposed to be a skillful combat game, and not every game needs to be difficult.  I honestly cant see myself having any fun on this game anymore because how unbalanced the game has become.  this isnt dark souls.  you cant dodge or roll or do any of the combat related stuff in dark souls that makes a good compelling combat system in minecraft.  Its a game about building and crafting with the occasional combat and farms, not this mess of a system now.  Either balance the cooldowns, or just adjust the game so you arent overwhelmed no matter what you wear.", "been playing minecraft for over a year on xbox 360 been working on a map just about that long. now when i try to get into map i get freezes out.did just about everything i can to fix this with youtube help and micro soft help nothing works. it's no doubt that the xbox 360 version of minecraft was not developed for long goal gaming and with updates just made it worst.what i had read is a lot of xbox 360 gamers are having the same problem.", "I think the next update addition should be stainable *Glass half slabs* I would work in so many ways, 1 with redstone, also with builds for those who like to build. _Thumbs up if you think they should add this block with there next update_", "Again, weird to see PC rank the lowest in sales, I for one cannot imagine ever playing Vanilla Minecraft again, without all the fantastic mods that make MC so much more refined and interesting. It's a shame that the other versions are stuck with Vanilla :(", "Mojang board meeting next week: \"These Stats show that we could bankrupt all the independent server owners and kill the modding community and we still make lots of dough\" #BUKKIT", "$160? For two days? Even Comic-Con's not that expensive. What exactly makes MineCon worth $160? Any swag or goodies involved?", "I love battles games in minecraft and i love building too but my not favorite is the scary maps and i dont likr enderman and baby zombie riding in the chicken causr it so annoying most of all i dont like herobrine cause herobrine is so annoying but i love minecraft............;D", "Why? with all the texture packs, zelda, shyrim, enter yours here; I would think someone has already done it. Wait they did. I'll admit this looks better but really what's the point. They haven't added anything to the game from what I can see. We don't need this. Don't go Lego. Lego should have and could have made a game like this long before minecraft. Too late this is minecraft and that's what I and many others want to play. Keep adding new and fun game play mechanics, Mob, new fun was to mine that's more than just a pick. Yes you still start with a pick but you get better tool the more you play. How about some round trees? Better combat system. Old school zelda like skeletons. Minecraft can fit so many game types.", "Minecraft movie will probably be Steve and Alex and maybe few others surviving and their main goal is to get to the end and destroy the ender dragon. Easy enough to know that...", "I wonder if there's ever going to be a game for LEGO Minecraft.", "I have to wonder if most people complaining are just not familiar with updated games. This is a common process, guys. Things that changed this time might get changed back in a future update if it doesn't go over well. Glitches get fixed in future updates as well, based on USEFUL feedback from the players. Useful meaning pointing out said glitches instead of just complaining about them.\n\nExplain what you do and don't like and future updates can work on making game play better for you...\n\nBut you also need to remember that your opinion isn't law. If more people like things that you dislike, it will most likely stay, so you'll have to grow up and get over it. It's just a game.\n\nAlso, past mods have always been considered for vanilla gameplay. It's not \"stealing ideas,\" but incorporating cool things that people like into the game so that the mods are no longer needed...and if your current mods are no longer compatible, wait until the creators make them so or again, get over it. The game does not cater to the mods, it's the other way around.", "Hehehe,have some questions,why on sed:\"90210\" inside the nether world that have a giant castle/ruins,I found a saddle,but my version was 0.12.1 build 3,pocket edition,I need some answers...", "Realms are cool and all, but how about cross-platforming to where Console players can join massive servers like Mineplex alongside PC players. Allow modders to give Consoles their content like Pixelmon. So much opportunity here", "Im not sure if this is the right place to put this, but I think.it would be really cool if the xbox version would get better updates like witchery capabilities, and whu cant we keep our experience points, it sucks that we make it to level 30 and accidentally fall or die and lose everything, why not just take one level away. I think it would also be cool if we were allowed quest and bosses to beat. Playing minecraft now use to be fun but theres no ending or theres nothing really do work towards to accomplish. I think the xbox version should have alot more entertaining things in it like the mods on PC. Not all of us have PC's and I was highly upset that I spent 30$ on the minecraft story mode game for my daughter only to find out that she couldnt play but one level and needed xbox live to unlock and play the others. Really?", "NEW FACTIONS MINECRAFT SERVER JOIN US IP>>>>>>>>>>>> JOKERPVP.ME", "Tim looks like Lukas from Minecraft Story Mode both in MC form and RL", "Are you guys still working on the pc one or are we not doing much with it?", "For Wii U, I try to get it to search for a room and it makes my Wii U freeze up and I have to force shut it down. For PS4, it'll usually disconnect me saying that the host disconnected. Can you fix these problems?", "You doing some interesting things with Minecraft but there's one thing I would like to know will the VR version of Minecraft come to Android it seems a little unfair that only Samsung is getting it's not the other phones do you have an explanation for this", "I miss playing Minecraft. I need a good gaming computer : )\nI want to see you add ladys & girls,  to the game.  Lol.  \nIt be great if we could get the people to move to other citys to.", "Funny, I remember a tweet from notch saying the only reason they released minecraft for console was to get more money. Looks like it worked lmao", "minecraft account was stolen , but I can get my e-mail and I can change my password What is the solution that ?", "No don't end the MC Story mode please I love it SO MUCH !!!!\nPlease don't end it !!!", "I would like a realistic 3D Minecraft Diamond pendant made out of glass. ^^ Where can I go to custom order?", "From Minecraft - I changed my name but only on Internet no for Minecraft... Now I can't play on Mineplex or original servers", "hmmmmmm hunger games for the consoles that PC players can already play cool", "I sadly can't since 1. I am still 11 2. It is in CA 3. I can't afford a hotel to stay in or atleast a motel and I can't afford the airplane ride. :'(", "in the next update you should have girafes spawn in the savana and there should be polor bears in the iglo to get good loot like armor", "Mine craft pe is no longer loading on I pad, when we click the icon it starts to load and then crashes and closes down back to iPad home screen. I have the latest update and it's not jail broken, please can anyone help?", "I'm Having Trouble Changing my skin in minecraft why do you need so much security just to change your skin", "Nah.... Already Have Feel Minecraft Will Be As Bad As Fnaf o-o;", "i Have the same Problem, i have try to delete the update, but than Minecraft dont work :-(", "Kendra \"Would you like to join my dad's Minecraft server?\"", "I think it'd be cool that when you set it to hard difficulty the Creepers can target man-made structures that you built and attempt to blow them up, regardless if you're near the structures or not. That'd be one crazy challenge! :D", "What kind of Convention for youth and individual would allow BOTS to buy up tickets in 10 seconds??????????????  With only 6000 tickets available, my two boys wanted to go and we were right on at 6pm to purchase and they were gone faster than a football playoff game.  This is absolutely wrong.  Both boys autistic and rely on this game.  I would like those that run this to explain themselves.", "They at going to far with mine craft leave the game as it is u keep making different things it will make the game boring and pathetic and update the game in PE edition it's getting old and boring as hell like horses would be nice", "i am downlond minecraft now what password is minecraft try it guys", "Also Minecraft why isn't it a printed designed one like the Gears of War? Missed boat there", "Hola Queria que por favor visitaran esta pagina que poquitito a poquitito esta avanzando saludos :) Besos! Chicas Minecraft", "Hi. I need help. Everytime my son tries to enter in a server he gets this note: \"a fatal error has been detected by the Java runtime environment . Exception_access_\nViolation\" followed by a lot of numbers. And it also says \" failed to write core dump. Minidumps are not enable by default on client versions of Windows\" . Does anyone know what this means and how can we do?", "I want a Ghast-shaped carrying case for my Minecraft minis.  You know, like the Darth Vader and C-3PO \"bust\" figures cases for the the classic Kenner Star Wars action figures--a Ghast head that folds open to reveal storage spaces for your mini collection.  The collector's case that's currently on the market is awfully grey and boring.", "is there a way to get minecraft on chromebook?", "Yes, destroy minecraft even more. Thank you Jeb!", "Please add realms to Minecraft 0.14.3", "Btw, Herobrine was never real. The first appearance was in a video; he photoshopped it in the video. Notch and the creators of the game called it the biggest myth in the game; Herobrine is not real but he appears in some of Notch's designs; Herobrine was not a glitch, neither is he real. Notch just puts something in the update log in each version that says; - Removed Herobrine", "looking outstandingliy good - now stop using time on mobile devices and bring more content for the REAL Minecraft on PC XD =D", "The white pumpkin costume was the best", "With the release of Elytra, the third person is needed to fly well, so it would be VERY useful to put a button to change the camera on the side of the chat button, not to get in the menu every time you fly!", "my focking minecraft is hacking my username is PizzaGekkies", "Something tells me you didn't use OpenVR for this (thus supporting both the Rift AND the Vive + More). Oh well, there's always the mod.", "i love minecraft guys please do a update with chairs and things like that coz mods on phone there are bot working so plz do that and an gamemode that says NOOB GAMEMOD or PRO GAMEMOD", "I only have VR for my iphone :( please add VR to minecraft pocket edition", "I bought MC, and I got free copy of MC Windows 10 Edition, but I can't open it, it quit instantly when I click the icon.\nAMD A8 (2.1 GHz) WITH Radon HD (8550G), 17 inch touch screen, 1600x900 resolution, 8GB of RAM.\nHP PAVILION 17 E123CL", "#SaveMinecraftServers, So much destruction, for what aid is it that Mojang can't just say we desire 50% of your profits. If we think that you are doing this THEN we will ban you not just because it's \"not fair\" to purchase ranks. But this makes me wonder, what about buying servers. If you look at it that makes Minecraft Realms against EULA and therefore should be banned, well done Mojang /Microsoft, you just lost lots of cash. Please share this so that Microsoft can stop Mojang wrecking the game so that we can't enjoy a decent minecraft server without it being blacklisted espescially as they want some people to actually play minecraft now they just bought it for $2,000,000. There we go, rant over.", "Can we have minecon 2017 in Australia Victoria because there are so many minecrafters in Australia I know at least 100", "When are you going to FIX your update 15!!! It doesn't work on Android OR Ipads. FIX the update would you!!! You take peoples money but you don't care that no one can play the game.", "Any suggestions for a dad who doesn't know a heck'uv a lot about Minecraft but who is bringing his 7 year old? My son loves playing but loves watching YouTubers even more, lol. Also, we do not have Minecraft on a computer so my son has never been able to play a \"mod\". We may be getting him a laptop for xmas so he can. Are there any panels that help noobs like me with best mod practices?", "If mods come to it I might consider ditching the java version. But it isn't just that. I mean what happens to dedicated servers? Don't see it running on Linux. Microsoft just seem to be buying up stuff just to kill it. Look at Nokia.", "Bring mod support to the Xbox please? Like Bethesda has done with Fallout and Elder Scrolls, please make this a reality for Minecraft!", "Would anybody know how to stop minecraft from shutting down your computer when you try to play minecraft ?", "Dont have any wii u \nbut have a 3ds\ni hope there will be minecraft in 3ds", "At first I though it was five nights at Freddy's :-D", "I love minecraft I even like lego but the price of them lego minecraft set...really bad....", "my friend live in venezunla, and pay for minecraft premium and he's can't login.\nHelp me answer down here?", "Hello . I have a faulty Minecraft . I have some monsters out there that is not added to Minecraft . This only works on 1.9 world. If it is necessary I can send a picture (dragon monsters). Please help!", "Bueno joe tomapasca rondy somos tu y yo pero soy muy fans de minecraft", "is that CaptainSparklez on the next episode yessssss", "I love story mod i can't wait but to bad that is the final chapter", "I love lego minecraft but i need so many money to buy it(i can not buy it)", "ultimate-survival.serv.nu Premium Op Server JOIN Now", "all i get when creating a new world is desret and savana  I have been playing since 1.6.5. where are the grasslands and epic mountains. deep caverns with lava and water falls.  jeb sold out and bill gates is going to sink the bismark.    I have turned temples into condos and uncovered the seatemple from the depth of the ocean.       now you are going to loose a player", "Exact same issue with chests freezing my game after the updates.", "Guys, there's going to be a Season 2 eventually! I'll only say how I know if I'm asked nicely.", "Please fix the error that occur while purchasing the minecraft with visa card for PC, i tried like 30 times to buy a game....jeez", "believes a new world version 1.10.2 to PC and the problem is that the END portals do not appear (besides the fortress comes out how destroyed)\nhave tried several worlds, both creative and survival and the same thing happens in all\n\nPD: the same worlds has been tested on version 1.8 and this version if the strengths and portals appear", "i cant wait To read that BOOK!", "My son\nis looking for dreamcraft its mine craft game we can't find it. Can someone help", "I love the way Stampy looks. I was confused when I heard that he'd be in it because his skin is a cat but this makes more sense", "Minecraft update suggestion:1-Put a mode that is peaceful but you can get hunger.2-Pistonz PLS!!!3-add a incredible item and make it secret to craft!!Microsoft Add New Great UPDATES!!!and yeah,Add A New platform,Like unity,C++,and more!", "Love the artwork! Keep up the great work, guys!", "I can't space in minecraft. Minecraft help me because I cant play in servers because i have to register and theres a space when", "Hi I have Minecraft on the ps3 would anybody want to join me", "Thomas Henry Culhane remember when we talked about Minecraft as an education tool a few years ago? This concept is becoming early access now :)", "what I am finding to be a pain about minecraft is that I own the xbox 360 edition both in hard copy and live edition I also have it on my ipad in normal and story mode but if I want it on pc I have to fork out for it all over again, olus when I upgrade to xbox 1 I then have to pay nearly 80 for that edition too", "I'm ok if they continue to update Minecraft, but I hope they'll improve the survival aspect. After all, survival was one of the cores of the first versions.", "Hello I want to help you mojang for minecraft w10 beta and fucher and I have many many many ideas for mobs and etc. and I hope you reply to me", "can anyone help me i am trying red stone i watch it on youtube it gose to fast red stone gose on top and under were ur supose to me building i get so confuse", "Most likely if u look u can find minecraft stuff cheaper and buy more also u can make the chest urself and set it out for your kid to find just sayin lol", "can anyone help my pc minecraft wont allow me to build above 256 i thought pc was limitless??", "WHY WONT YOU REPLY TO EMAILS ...I HAVE BEEN LOCKED OUT OF MY ACCOUNT FOR OVER A WEEK AND ASKED FOR HELP THROUGH YOUR WEB SITE AND I HAVE HAD NOTHING BACK", "Minecraft is great but can never find any good players on Xbox one that want to actually play the game anyone care to make a survival world", "the appropriate term across every pc server that has built an arena for this \"mini game\" is 'Spleef'. Usually played on a 1 block thin platform of an easily breakable block (eg. dirt, snow etc.) suspended over a lava pool or the void or a really long drop. Players in console should know that they can re-create this game without having to get a whole extra game.", "umm... My account doesn't work, any account, mojang one, minecraft one... i hope it's just for a while. A.k.a. PLS HELP MY ACCOUNTS DON'T WORK I THINK IT'S HACKED PLS HELP ;-;", "Who wanna play FunTimeThemePark with me", "Maybe now Microsoft can stop squeezing what they can out of minecraft and actually develop the game with their vast resources and make it better", "I lost my version of Windows 10 minecraft. I bought original PC minecraft a few years ago, I tried to get the windows 10 version. Every time I start it, it always tells me to buy it.", "Hey! I would pay whatever if y'all came out with a Harry Potter world mash up! Even a Lord of the Rings mash up! That would be awesome!!!!!! PLEASE DO THIS!!!!!!!", "where release upgradable versions minecraft for my pc windows 7 please tell me", "Hey I update my minecraft to 0.15.4 and it say unfortuatly minecraft has stopped", "I need some help if anyone can pleaseeee. My son plays mine craft on the xbox360 but when I wanna put it on 2 player it won't let me split screen another person in. Every time I press start nothing I changed his leads to hdmi and still nothing. Yet soon as my niece does it on her p3 it works perfectly fine. What am I doing wrong haha", "Minna Chauncey when this hits console I will definitely play with you again", "Man this made me download MC again. I'll be playing this weekend.", "my son plays Minecraft of his PC and would like to play with other players. I m at a loss to figuring out how to do that. I don't understand how to add a server or direct connect. Can anyone help? Please:)", "We use it at school it is really cool I use it a lot", "Graphics are down on my gameplay.  That is i could see the occassional torch but not the hallway in which it sat.  I could see stars, but I'm in a cave.  And then just lotes of crazy lines and color bleeds and such.  The computer did an auto-update, but I don't what it chaged.  I had the same problem right on the date of the update and now can't remember how it was corrected.  Any recommendations?  I am not computer saavy enough to be super detailed, but I'll take any advice.", "I need some help.. My son is playing and suddenly he can no longer use tools. I've looked into the controls and all is well. Can someone please help. Cheers!", "Aarron Joshua you can learn to build like me now :^)", "I love playing minecraft I wish I could  go to minecon this year", "Y'all stop making fun of all these babies.. They are having fun at a convention about their favorite video game. If my little brother was able to go he would be living for it!!", "This ISN'T Minecraft, but it's pretty cool. Can't wait <3", "Great! This is perfect for students who live near equator (because it rains in June-July) like Indonesia, Philippines, and (Equador?) etc. Actualy, many of poor countries uses APKs to play Minecraft, and you can only learn few like Mathematics, reading, geometry (dash!) etc.", "Uploaded my first youtube vid if anyone wants to take a look.  Started the world day one on the 360 and wanted to upload it on its birthday.  Happy birthday Minecraft!", "i hate notch for letting Microsoft defile his work. sell out", "Wish these would roll out to Xbox One and other consoles simultaneously though. Unfortunately, we're still several updates behind.", "la biz oyunu bitirdik ne diyon", "Ik heb een mc account gekocht en ik log in en hij laat de heletijd zon 5 uur en dan doet ie he tnog steeds niet en als ik op minecraft site in logg doe ie het wel kunne julie helpe?", "Minecraft was developed minecraft pocket edition and the computer.", "Really was much amazing was all beautiful minecraft is the better game that exist thanks by all support and all developer that makes version PC/MAC\nPE/WIN10 console 4J studios you are really awesome and i'm saying \"i'm very anxious for Minecon on next mounth", "Please ! Please ! PLEASE !! Make the next update on the Console and pls include Vehicles or lucky blocks Please ! :) And if u can can u please reply t this comment :) Thanks ;)", "somebody can help me ? i'm play minecraft in my PC in version 1.10,but the game always force close.when im play in version 1.7.2 the game is fine..PLEASE HELP ME SOLVE THIS PROBLEM", "PlayStation and Xbox need computer updates. Don't friggin ignore me, you lazy freakshows.", "that's the same thing that happened to me nate", "Thanks to all the 12-year-olds who tested it so far!", "Iae Galera precisa de host de Miinecraft,ts3,web?\npassa na Skill Host mano precos bons e baratos passa la da uma olhadinha nos precos tenho certeza que vc vai gosta. compre!!\nLink:https://skillhost.net/central/aff.php?aff=8", "... lamas? Are you serious? Lamas doesn't belong to the minecraft world! They belong to survivalcraft or other MC clones.. if you want to add lamas so badly, make minecraft 2! Also, add Herobrine or Green Steve... they are WAY better than lamas.", "Well why is Alex has more skins than steve while steve is Long used and also has 1 MILLION (maybe) Players use steve arms", "really really bummmedd....  waited hit the button at the \"second\" it went live got in the cue and NOTHING!  stinks!!   bogus..  i'll wait again to get my son tickets...  thinking it's just a ploy.  going to Starwars convention and ANYBODY can get a ticket.  thinking this is a CON CON", "If everyone who has ever bought the game paid the current price, you guys would have made over $591 million, phew! lol. Will be buying this for pc in a day or so!", "Anyone know the answer to this? In two seperate worlds I've found abandoned mineshafts but all the minecarts are empty! I created both worlds yesterday, found the mineshafts today. What gives? I play on xbox 360.", "I don't understand why pocket gets it first then console :/ we don't even have 1.9 pvp yet please help the console people out", "I used to be afraid of dungeons in Minecraft.  Until I saw the price of Lego Minecraft sets....", "Hello,\nJust log in and you will earn great prizes in Heroes of the Storm!\nFor further information check and join the Nexus! https://battle.net/recruit/VXPWWWQTT7", "Minecraft should make Nintendo Mash-Up Packs exclusive to the Wii U Edition: The Legend of Zelda, Kid Icarus, Fire Emblem, Kirby, Star Fox, Pokemon, etc.", "Once you play mc on gearvr you can't go back to console or PC version", "ok so i know this have nothing to do with this pic but...... ok so noch sayed herobrine was never in mc right well if this is true why dose it say -removed herobrine at the end of all the major updates now if herobrine was never in minecraft why dose it say he was removed!!! like if you aggree", "Price point- Too Much\nConvention Incentive- My 12 year old would have bragging rights but he still doesn't know what \"Ram\" is in a computer.\nConclusion- no", "Hey Mojang -- is it somehow possible for people to download maps your testing team make and use? (Just a map copy)", "Leave a like who wants to see the legend of minecraft 'HEROBRINE' srew u minecraft sice u deleted herobrine the game sucks", "Heyyyyy Y'all should make a update were you can pick if you wanna be short or tall like if your short Ya have a big head and if you is taller you is like minecraft is now Plzzzz think about it", "Love that game it has many stuffs I wanted that minecraft gives me meaning of life and I also crossed my girlfriend's love on me by building a dream house for her always imagines she's there and making happy like we use to be as happy as a couple but that's only my thoughts in reality she never look for me and ignores me the sickest part is that she left me and don't think we can see each other the next days that game based all my activities including the inside I love minecraft too much like ever never will last", "I actually got this from the store national book store and we could't find and and we search at the service and we shoed the picture and then i have it thank you for making minecraft", "Why wouldn't you make a horse tracker?  A house arrest tracker really.?  Why ?   Every time I tie up my good horses. Come out the next day there all gone. I play allot of survival and it's so frustrating cave diving, come out with all my loot and my horse is gone. This is the fourth horse I've just randomly lost.   Like what the heck is going on.", "What about pocket edition? Y'all gave a big update but the thing is I can't even spawn monsters anymore! Why would you give the witch if you can't even spawn her?", "Olivier Doyon-Karout, Samuel Mollen-Dupuis, Annie Bearded Jones LES BOYS, jpensais jamais etre daccor sur le fait que le oculus cest nice, mais la MINECRAFT ESTIII", "That's great and everything but... you still can't cook an egg...", "Will this happen again next year? I didn't see this until today!!! We live in AK and my son would've LOVED to go!!! See pat and Jen; stampy and more!!!", "How about fixing the skin selection crash first before releasing the update for Android?!", "I would be excited if the content was actually avaliable on your Xbox one .. but they're having issues .", "Hey I like what you added to the game. Its pretty cool. I think this game need a bear and like deer though. Making the game with animals in our world that really wonder the land would be cool. just an Idea. thx", "I always wanted to go to a minecon ;(", "Why cant you guys add minecraft to steam? So we can buy the premuim account there and no more credit card. Just steam wallet :3", "I must agree with Bec Lobey u need mods for minecraft xbox 360 without xbox live plx", "Having problems with Minecraft on PC with mobs spawning on half slabs & grass paths since last update. When standing on half slabs or grass paths the light level is 0 allowing mobs to spawn there. They seem to spawn stuck half way in the ground.", "And then Microsoft will claim copyright on everything developed, sue those that developed it, charge everyone buku and conquer the globe!!\nAll Hail Brak!", "Looking for new friends for MC on the Xbox one.  I'm online now and playing.  My GT is KENMEISTER63 please come join and help me design a great world!!!", "Thank you, Mojang and 4J studios! I was already considering returning to Minecraft on my Xbox 360 after a long pause, due to the few updates I had seen, but now I am convinced! I'm off work at around 10:30 or 11:00pm tonight, it's time for Minecraft!", "Do we have an actual date for the release, or is it still nebulously \"sometime next week\"?", "Ummmm how about Realms for Xbox One Microsoft???? Seriously we need that so we can play in our friends worlds when they are not online!!!!", "Mojang/Microsoft add a wii version of the game plz", "Not buying from you pervs any more thank you", "I woyld really like to go to minecon its like a dream come true ayyyyyeeeeeeeee", "bang bagaimana download minecraft no demo\\", "Need help. My some minecraft wii u editions language changed and I can't find anywhere where it tells me how to fix it. Help", "\"Hey, have you seen the coasters? I don't want to put my coffee down on the table without a coaster, that's not classy!\"\n\n\"Hua? Oh..... I don't know where they are.... just use the Minecraft movie script that's in the corner, everyone else here has given it as much attention as they would to a coaster anyway.\"", "someone over in the minecraft world please tell me what happen to changing colours in the beds i like the mode please bring it back so i dont have to changed the updates all the time", "My minecraft isn't working, on single player I last 6 seconds then go back to launcher! I don't know how to fix it! On multiplayer I last 2 seconds. :T", "Entre a este sv de minecraft, mientras mas jueges mas rango tendras y ganaras cosas, con un muy buen sistema de survival y proximamente mas cosas 62.210.102.214:25657 tambien denle like a mi pagina y estaran ayudando mucho", "Is there a minecraft con on in london?", "I heard that u guys r thinking to add birds and more animals cuz there aren't enough is that true and please lucky blocks I beg Llease", "i love minecraft only thing hate about minecraft is way does everytime you die you loose everything to me seems like big un fair  we shouldn't  to get everything again then lose it again  !!! what heck you think  know little kids play it too", "Friend , I want the game to download minecraft in my \ncomputer for windows 8 with java please leave me the link to download it ! Thank you! :)", "Again I have to say how horrible to me is the new combat system (the cool downs) can you please give me an option? I love the old combat system and I can not be the only one. Also why was the other blocks (that is not stone eg: granite) never give the option to make fences, stairs like cobble stone? and even stone is missing a few things.", "I have  minecraft pe but I don't have minecraft pc", "Does it have instructions on how to make the fortress from the realms world?", "Neeto! Thats cool but were are the enderman!?", "anyone want to play minecraft on ps3 btw username is sabrina_levy", "I need help setting up mods for my game. Never done this before. Yes I've watched YouTube and read forums. Doesn't help I'm not PC savvy. Help Anyone?", "What's the point when they haven't even sold as many Wii Us as copies of Minecraft?", "I have all handbooks of minecraft they are very cool", "I can not play minecraft on my pc conputador I can not because he has not video card more I wanted so badly to play T_T", "You can build a tower to heaven at least 5 blocks tall so the zombies will burn ... because it's day\nAnd the golem can kill ...", "This is the problem in my minecraft(1.8)\nAfter i press W key , the character will walk. And when i release the W key, the character will keep walking himself!!! How to close this? guys pls help me :'(", "Don't be sad that it's ending, be sad that it even happened to begin with", "\"They didn't take into account that in order to live in Minecraft country the people would have to leave whatever other country they live in now to move to Minecraft so I think it's higher up on that. I'd leave America to live in Minecraft........\" -Melissa Rose Capps", "I have  minecraft  story  mode", "MAKE A ITALIAN UPDATE FOR MINECRAFT STORY MODE!", "mc.thinkoutsidetheblox.com Great new server with friendly players would love everyone to come take a look!", "Hi Mojang, what are you guys doing the whole time? It took you guys like half a year for 1.9 on the PC. I'm pretty sure if you'd actually go and work on the game you could have done this in a month.", "Too bad they still have at least one major bug that literally prevents you from even playing the game, which they haven't fixed yet even three months after it was reported on the bug tracker. I can't imagine how angry the people are who bought the game when they watch it immediately crash on launch.", "how i dowlownd minecraft pls teatch me", "Episode 6 a portal to mystery wow that's cool story mode.", "Can anyone in the Copenhagen area help with a minecraft problem? My sons computer comes up with a fault every time we try to reinstall the game? Kind regards Anne Linde", "Booo Story Mode was better than this I hate it I hate bad people and creature stuff", "hi I like to talk to you guys because I naum I can put my original minecraft account of which I paid for it?", "Pumpkin carving in minecraft would be interesting. Kind of like banners so you can make your own unique carving for decorating. And Jack-o-lanterns", "I really don't care if a person next to me is gay or not. Just don't force your status of it onto me. Don't try and use your status of being gay to force me to become that too. If you want to be gay, then go ahead. I for one love being straight still.", "If a day were only 20 minutes then the whole convention weekend will be like 40 minutes. They will begin packing shortly after arriving.", "ok minecraft, now make it so i can apply said skins to my villagers/mobs!", "and minecraft has what in common with a pride parade? Maybe I'm missing something here....but I won't be missing you on my facebook as I'm unfollowing you.", "Anybody have any advise? i bought minecraft for my Pc around October 4th and have been playing it for a while and i got on it today and it logged me off and now when i log back in it says play demo and it says i need to buy it??? help.", "guys i can't play online :'( whenever i try to login i won't let me login and whenever i try to register again i won't let me ......please help !", "Hey idiots at mojang. My children adore and love playing minecraft but the game is just too hard for them on survival.  Mobs are overwhelming now and hard to fight where before 1.9 they were manageable for a 10 year old. You took a great game and trashed it . Back to 1.8 it is idiots. How can a game developer be so dumb to change combat that hurts the younger people playing it.\nNothing worse than watching children get frustrated at a game they love because they don't understand the stupid mechanics added to it.", "i am trying to buy minecraft game on the mac but the debit card information is correct but is not going trough and it says error not correct what can i do", "It depends on what kind of stuff I have\nUnless it's creative", "Minecraft will not work on my PC following this mornings windows update. HELP!!!", "My minecraft is all wonky after the update... The music from one map doesn't shut off when you switch do it eventually turns into a jumbled mess of overlapping music", "Bring back a version of the original.\nI liked back in the early days of like 2011 when the game wasn't released for very long, playing with friends early in the morning and late at night.\nBack then the game was simple and fun.\n\nNow just way too much stuff has been added and I just don't like it anymore.\nId love to go back to the days of the crazy world spawns where I could build cool stuff on cool terrain, where everything was also simpler.\n\nIf anyone can get me a old gen MC version id love it", "Minecraft pe 0.16.0 redstone machines r don't work", "Windows ran an auto update on my PC and now any 1.9.x version of Minecraft won't run, keeps kicking me out. Have had to roll back to 1.8.9, any ideas?", "Or there should be a mode of minecraft where you have x amount of minutes to build a shelter then for the rest of the game it'll be night and non stop waves of monsters will come wave by wave. Creepers should blow up on contact with buildings. Last man alive wins and there could be up to 10 players helping each other or guarding their turf", "Can I punch the dispensers to activate because I can see the intro of minecraft story mode episode 5.", "do a new mon its called wither storm like on minecraft story mode", "If i was still little with the money i had i would have every set u guys got lol", "Hey guys I make this Minecraft tutorial really helped me out https://youtu.be/fxTKGSW-EVA", "Sigh... i just dont get why they didnt make an original game?\nAs they had to come up with all characters and the plot, why not also make some original graphics? (As i am sure the game is not run in the java engine anyways)\nThe only reason for this to take place in the minecraft universe is to get into fans of the franchise pockets.\nI aint saying it is a bad game, i just dont see why it has anything to do with minecraft -.-", "Dear Minecraft,\nCan you plz plz plz make the Minecraft PE to update to the WHOLE entire version to Minecraft PC because I want these things, ender dragon,ender pearls, mods, wings,beacon and can you plz add withers :)\nThanks :)", "Can anybody tell me where I can go to get some tech support. I can't log in - apparently my password is wrong - and I am not getting any emails when I try to reset my password.\n\nI only have a few days every month when I have time to play and this is not the first time my password has apparently changed for no reason causing me inconvenience but it is the first time I haven't been able to do what is needed to reset a new one.", "Mojang Minecraft Please Help . Me have Minecraft accout hacked passvord no mail pls help", "i got minecraft on xbox 360 hard drive and i never never never ever play with someone not even on any game exept for 2 games with my nabor but he moved out i have no friends in my naborhood so i would someone to by a hard drive and play with me the world i alway play on is AasharaWorld PLEASE play with me PLEASE.", "Anyone know if there will be new texture packs on Xbox one? Sorry I can't find out anything", "How the hell do people still find this game fun I get there is updates and new items but literally the same thing over and over how the hell do you call this game fun?", "Any word if the console versions will be seeing an upgrade? to say 1.9 anytime soon they seem to have been left behind while the pc version is getting ready for 1.10.", "We  are trying to buy minrcraft for PC and an error occures. We have  used a prepaid mastercard and a debit visa. What is going wrong with it?", "Can you typed the command for the day and to stay away any blocks and iron golem until then can kill some zombies :D", "dat was epic, but me dont have lego mc set", "It's a shame charging $160 per person which can come to $480 for a family of 3 not including travel and hotel cost.  At least don't make parents pay for their tickets.  I rather take my son to comic-con.", "So you pay $80 to play minecraft i already own? Whats wrong with putting your savegame on a $5 flashdrive? People buy everything af long as it had a brand on it... You guys are just abusing simpleminded folk who are gullable. Shame on you.", "This is what modded minecraft on the PC is for. And microsoft knows this. They have been silently taking certain things from mods like for instance the hopper. It was originally a modded item on pc. The extra biomes are mostly from a mod named extra biomes. And if people feel that online pc multiplayer is falling their are plenty of modded servers out their mainly on ftb or tekkit packs.", "Bought the lego set, but my legos don't move like they do in the video, I want a refund.", "DAAAAAAAAAAAAAAAAAAAAANG.  When I get a better system, I want to try this... though I'm really scared it will lead to the same thing:  Living in Minecraft instead of reality.  Wasn't my best idea, as I was kinda dying.  Can't play if you die...", "Stop creating new episodes of this game.Just fix the Minecraft problem which is happening while logging in", "I don't like Lego's or  Minecraft... Have fun Building, come on you do all by yourself......I'm in a rather per care us. Postision.", "Here are some things I want to be added to Minecraft PC, consel, ect.\n\n1: Making the Ender Dragon egg hatch\nI really want the Ender Dragon egg to hatch after a few Minecraft days. What's the point of keeping the egg if nothing happens? Plus, you could tame the Ender Dragon and keep it as a pet, and you could fly it to places that are far away from your house, say you had a big world and it was hard to get around the place.\n\n2: Different dog breeds\nPlain wolves are getting boring. We should have different sized, colored, and shaped dogs to play with. And I hope they'll be respawnable. The same goes for cats. (And there should be Nyan Cat and Grumpy Cat skins for the cats)\n\n3: More skins\nTheir should be more skins for the players, like Creepypasta skins, FNaF skins, and TV show character skins. For example, a Rebornica's Mike Schmidt skin, Rebornica's incent skin, MLP skins, Steven Universe skins, Star VS the Forces of Evil skins, ect.\n\n4: More blocks\nThey should add more blocks like checkered blocks, sapphire blocks, ruby blocks, ect.\n\n5: More paintings\nThey should add more paintings like Youtuber paintings. For example, Stampy paintings, DanTDM paintings, Pewdiepie paintings, Markiplier paintings, ect. And paintings of video games like FNaF, Skyrim, Slender, Nyan Cat, ect.\n\n6: Minigames\nAnother thing I hope Mojang/Microsoft add is minigames, so you can play minigames like Block Party, Hide and Seek, ect with friends to keep every Minecrafter amused.\n\n7: Emerald materials\nThere's only one use for emeralds, and that's trading them with villagers, which is kinda useless. We should be able to craft emerald materials like swords, pickaxes, axes, shovels, ect.\n\nSorry if there's too much scary stuff in my list. I'm just obsessed with Creepypastas and FNaF. I hope everybody has a nice day! :)", "This needs regular controller support for multiplayer.  When we have the classic pro controller and regular Wii motes there should not be the requirement to have to shell out fifty dollars for a new controller for two people to play.", "How is it possible for mojang to have the absolute worst customer service with such a popular item? Mojang is absolutely horrendous. The customer service guy was so rude, very disgusting and vile and instead of helping me he told me to suck his dick. Wtf? The number is off the website that you redirected me too. Absolutely uncalled for and completely and utterly disgusting", "How is it that almost none of you noticed that the update from this announcement is for \"1.8.8\", the same version number that PC has had for a while now, and that most of the added features in this update are things that the vanilla PC version already had?\n\nCome on, people, learn to read."]