["Seriously,three more,when is it finished i mean what do they even have do in Minecraft Story Mode 6,7 & 8. What they are gonna make another Wither Storm...?", "Step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "I Know this is not about story mode but i changed my name on Minecraft and now it comes up \"Not Authenticated To Minecraft.net Can some1 plz help me", "I really appreciate it but 3 more?! My wallet is already hungry for 3 months. And now 3 more? Send me to hell.", "Hey guys! I have just started a new Minecraft 1.8.9 server! It is a factions survival server with loads of exiting feature and prizes! Donators will recieve the power to go creative and disguise!!!!! JOIN NOW WHILE YOU CAN. IP:82.3.132.68", "Three more? Three more extra episodes? That's what eight? My word The Walking Dead only clocked in at 11 with two seasons. If this has \"A SECOND TALE\" it'll be 13.", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't  do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "Hi guys, I am having issues with the split screen on xbox 360 edition. The miners arm is not showing up and i can only move up and down. Is any one else having this issue and is there any way to resolve this? Cheers", "i bet supernatural is longer than that. well, the show. sam and deadn and cas... but if i were to choose, minecraafftt!", "Yay, is episode 5 out yet?", "probably wont read this but i have an idea for a future game. Minecraft Dungeons and dragons. Make a create able world where you can set up a dungeons and dragon game. Put monsters and more create dungeons fully customizable world for D&D players. to give us a virtual world to play along with our role playing game everyone loves", "I can't  wait to see episode 5 6 and 7", "What exactly is Minecraft story mode.", "Me and my brother liked episode 5 i cant wait for 6,7 and 8", "there is something i have thought about. why is there not snow biome mobs i know there is wolf but why not any thing else like penguin or polar bear there is a mod for minecraft where there is polar bear and penguin but i dont like to download mods i better like if they already was in the game i hope you DE's reading this", "FINALLY IVE BEEN WAITING SO LONG FOR EPISODE 5", "three or more its cool at minecraft world", "Gentlemen, a few days ago asked for help to regain access to my minecraft I believe to have been stolen. I sent my ID on request March 19 and still got no answer . Seeking another way to contact you, but I can not . Please help me!!!", "give actual PC Minecraft a story mode and i'll be interested.", "I just purchased minecraft and have been playing around with it!  Learning so much !   How do I get the story mode ?   Does vs. 1.9 have it or do I have to get something more?", "i gott the game minecraft story mode and i was almost with the part that rueben dies butt my game random delete his self and i feel just like why meeeeeeeeeeeee", "What so you have to buy 8 Minecraft for the story? Why not just buy the best and only 1", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "I've done mining for months and I have more than a full stake and forty-nine diamonds, fifty-two emeralds,two staks of block of iron , gold,redstone and coal.And I've done a cool hause under the graund.But you will never belive me for this------I faund to the mines quartz, I dont now if is a glitch or what but is true.", "Hey when r you adding all of the Minecraft PC i really would like to see all of the 1.09 update in Minecraft PS3", "OMG guys HELLP !!! something happend with myacount i could just play demo but i have boughted minecraft", "i Think you guys need to make more realistic trees or make a big tree that is rare and find items in it like the blacksmith", "May I ask a request? In minecraft pocket edition can you add book and quilt and also add pistons lastly could you make the mobs talk to you thanks!", "Hello notch, just wanted to ask how my minecraft optimize the naturalness of the maximum.\nPlease help. XD :P", "Not following this for cobalt updates. Stick to the Minecraft updates pleazzee. I tried and didn't like cobalt.", "Hello . I have a faulty Minecraft . I have some monsters out there that is not added to Minecraft . This only works on 1.9 world. If it is necessary I can send a picture (dragon monsters). Please help!", "Guys come join RevoltedNetwork IP: revolted.factions.ws  We currently need some donators to make our server officially a network as we already have our dedicated machine for the server. Come join us to have a wonderfull experience, Currently recruiting Helpers.  [Owner: 145], [Dev: CalPlayz].", "Hi all........ i want to by an account (minecraft) any ideas?? I cant by from the mojang......you see the capital control dont let me use my card or paysafe.  Or if anyone has an account to by it from him?", "I don't have minecraft on the pc, but on xbox 360!!!", "HI, my grandson has just downloaded minecraft and is having trouble moving side to side / back and forth  after creating his world in minecraft on the computer,while using the key pad. We have checked all keys and nothing will allow him to move side to side. Any suggestions anyone......Please.", "como soluciono un error de minecraft lanchure cuando le doi play", "This is the problem in my minecraft(1.8)\nAfter i press W key , the character will walk. And when i release the W key, the character will keep walking himself!!! How to close this? guys pls help me :'(", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "I'm not able to use the hoe to farm my land. It breaks the dirt tiles. Right clicking does not work. Does anyone know what to do? It's Minecraft for pc.", "There are so many hackers spread across Minecraft right now. I thought it was a problem with one server but no. Every single server that I go to, either mini games or classic (Eg: Prison, Factions, ect) there is at least 20+ hackers online, and a week has been gone and nothing happened about those hackers because they are still there. Very upsetting, seriously considering of not playing Minecraft anymore. I know it's hard to catch all hackers but still, it is very annoying. Loosing OP gear, accounts and etc just because people can't play properly. Minecraft is one of my favorite games ever but this hacking issue is really upsetting me. So, for now, good bye Minecraft.", "But I have already bought the game a while ago. When I open it it tells me that something's missing and that I need to reinstall it.", "Heyyyyy Y'all should make a update were you can pick if you wanna be short or tall like if your short Ya have a big head and if you is taller you is like minecraft is now Plzzzz think about it", "What about Update for Minecraft Xbox one Edition? Im still waiting for new things...", "why can you guys invent something better for childrens coz my kids are fitting too much when their are playing your dam games", "I don't know what's going on but it needs to be fixed now. I paid for an account, used it for a couple months, took some time off, now it only offers a demo version. I will NOT be paying again. Mojang can fix their mistake or I just won't play.", "Erik is theminecraft master.he gas 4 rankups.He can build online as well as by disk .By the way your Aunt Brendas Gta name is GEtAWAY.On GTA   and in real life.HA!", "Hi. I need help. Everytime my son tries to enter in a server he gets this note: \"a fatal error has been detected by the Java runtime environment . Exception_access_\nViolation\" followed by a lot of numbers. And it also says \" failed to write core dump. Minidumps are not enable by default on client versions of Windows\" . Does anyone know what this means and how can we do?", "Cobalt In steam? It's awesome i have waiting this good moment ^_^ maybe i will Moving from Dota 2 to Cobalt, #Indonesian_Minecraft_lovers", "Guys come join RevoltedNetwork IP: revolted.factions.ws  We currently need some donators to make our server officially a network as we already have our dedicated machine for the server. Come join us to have a wonderfull experience, Currently recruiting Helpers.  [Owner: 145], [Dev: CalPlayz].", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "Step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "Hi minecraft, i have a acc on MC... and all games fo mojang", "From Minecraft - I changed my name but only on Internet no for Minecraft... Now I can't play on Mineplex or original servers", "Hi guys please join my server\nname: PLAY\nIP;b29973.leet.cc\nPort; 29973", "hi guys if you are one of the fans of minecraft buy a t shirt here for only $20 to $30 quick this offer will end at april 4 2016 if interested click here https://teespring.com/mcplayer", "when you get an account you get the demo version, you you buy the full version luncher.", "We need Players And Donators Is Our Server !!! :)\nAnd We will Be Happy If you Donate Some Credits to make the server Premium And Also You can have rank and you can be OP If You Donate In our Server ^_^\nOur Server is For Minecraft 1.5.2 >DarkCrafter.serv.nu<\nWe will be Happy If you Donate In our Server Here is The link\nhttps://server.pro/server/2683693/donate/\nOwner:Skylersawesome\nCo-Owner:Dead1\nPlay now! :)", "Ik heb een mc account gekocht en ik log in en hij laat de heletijd zon 5 uur en dan doet ie he tnog steeds niet en als ik op minecraft site in logg doe ie het wel kunne julie helpe?", "please i need a premium account in minecraft", "ultimate-survival.serv.nu Premium Op Server JOIN Now", "WTF DOES THIS EVEN HAVE TO DO WITH MC?", "Sam hollway is my friend how lives a cross the roed", "that's the same thing that happened to me nate", "i got banned on a minecraft server because a kid thought my skin was offensive", "I've got a question, I'm curious but, is Herobrine real, did u really remove him, or what? people are constantly cyberbullying each other about it. not to mention when u guys say he doesn't exist or he isn't on Minecraft, but, the new update says you \"Remove Herobrine\", It confuses me and its making me question if Minecraft is actually worth the $20 to play it.", "I want a Ghast-shaped carrying case for my Minecraft minis.  You know, like the Darth Vader and C-3PO \"bust\" figures cases for the the classic Kenner Star Wars action figures--a Ghast head that folds open to reveal storage spaces for your mini collection.  The collector's case that's currently on the market is awfully grey and boring.", "I would like a realistic 3D Minecraft Diamond pendant made out of glass. ^^ Where can I go to custom order?", "Hi There. Is anybody interested for donating in our server? That would be really helpful. Just 300 credits and you'll be promoted+OP MODE+Creative Game mode. Were now close to an Unli Server! Please join us. Message me if interested. Thank you :)", "Why theres no Minecraft in PSP?", "Okay Mojang ADD IN THE HEROBRINE AND GIVE HIM HIS OWN DIMENSION.", "Tell em they are bad at \"\"designing toys...They dont look the the Minecraft game at all.", "And stop the \"- Removed Herobrine\"", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "Plastic moulds. Done. Do you really need an entire Youtube channel for that?", "Removed Herobrine is a Prank for beginners right?", "hey Minecraft , I have 1.8.9 but 1.9 does not work for me", "Hello I want to help you mojang for minecraft w10 beta and fucher and I have many many many ideas for mobs and etc. and I hope you reply to me", "Don't ever stop using removed herobrine.", "Add sponge in minecraft pocket edition can soak up water", "Yah, when are the updates going to be released for Minecraft PS4 and Minecraft Story Mode Episode 5, want to see all the new stuff.", "please make the next minecraft update be the \"redstone update\" w need more redstone components", "I am Vietnamese and I very, very, very love MINECRAFT!!!", "We need Players And Donators Is Our Server !!! :)\nAnd We will Be Happy If you Donate Some Credits to make the server Premium And Also You can have rank and you can be OP If You Donate In our Server ^_^\nOur Server is For Minecraft 1.5.2 >DarkCrafter.serv.nu<\nWe will be Happy If you Donate In our Server Here is The link\nhttps://server.pro/server/2683693/donate/\nOwner:Skylersawesome\nCo-Owner:Dead1\nPlay now! :)", "Bought the lego set, but my legos don't move like they do in the video, I want a refund.", "Once in minecraft i was so happy i found the end portal WITHOUT Ender eyes I jumped in and holded break button and broke the portal, but it was online so the ender eyes was already in, I raged lul c;", "Minecraft admin pls look here, you killed my minecraft account D: I already buy it but I cant log in. Pls fix  and give back my account", "Is anyone having problems in the 1.9 Update where trees won't grow anymore and bone meal has no effect in their growth?", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "minecraft account was stolen , but I can get my e-mail and I can change my password What is the solution that ?", "Why u take minecraft off of facebook :,(", "i love minecraft i even have it on my tablet", "Within the last week, My account is no longer available, I can't login to my account. When I do lost password or screen name I get no response. 6 years ago I paid $26 for my minecraft. Until my account is put back I will repost this over and over. my minecraft screen name is camelcash32. please put my account I paid for back.", "Hi There. Is anybody interested for donating in our server? That would be really helpful. Just 300 credits and you'll be promoted+OP MODE+Creative Game mode. Were now close to an Unli Server! Please join us. Message me if interested. Thank you :)", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "My 11 year old son started a Podcast about video games including Minecraft and Lego Dimensions - if you are looking for a fun safe podcast to listen to with your kids, give it a try - we are still working out the sound but appreciate any new listeners - new episode should be showing up by tonight! Thanks!\nhttps://itunes.apple.com/us/podcast/the-insane-arcade/id1088726516?mt=2", "I love minecraft I even like lego but the price of them lego minecraft set...really bad....", "I wish I had Minecraft Lego when I was a kid! Anyone remember Technic Legos?", "someone help me,,,why i cant play minecraft,,if i press PLAY is says\"Error: Could not find or load main class info.mineshafter.GameStarter\"please help me!!!", "Hey I like what you added to the game. Its pretty cool. I think this game need a bear and like deer though. Making the game with animals in our world that really wonder the land would be cool. just an Idea. thx", "umm... My account doesn't work, any account, mojang one, minecraft one... i hope it's just for a while. A.k.a. PLS HELP MY ACCOUNTS DON'T WORK I THINK IT'S HACKED PLS HELP ;-;", "Please invite me to minecraft pe realms my user name is torino dan my mojang account name francescotorino", "Step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "I am very new to minecraft does anyone want to be my buddy and guide me through it. I really need help.", "CAN ANYONE TELL ME WHY MY MINECRAFT PREMIUM DOESN'T WORK I AM AFRAID THAT IS HACKED ...", "Minecraft I just bought the minecraft one version by mistake can I please have a refund", "IM GOING TO GET A DIS LIKE ANT I", "Minecraft advertise that no one plays on leadcraft coz the owner gave me stuff to help me with my island (skyblock) then tried to accuse me of trying to kill him which is not the case i have pics of the chat log", "Within the last week, My account is no longer available, I can't login to my account. When I do lost password or screen name I get no response. 6 years ago I paid $26 for my minecraft. Until my account is put back I will repost this over and over. my minecraft screen name is camelcash32. please put my account I paid for back.", "Wish mojang would email me back. Someone hacked my sons account and changed all his freaking info. Just bought mine craft a week ago and he hasn't been able to play for 5 days now. Ughhhhh", "Anyone having issues updating minecraft on their xbox 360? Xbox live disconnects when it goes to do the update. Anyone know a fix?...it's been a month & 1/2 since my daughter has been able to play online with it. I've called xbox with this issue & have troubleshooted everything with no fix, not happy.", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "The minecraft.net help page is way put of date. Please update. I was researching mod downloading and other stuff and it is still for only 1.6", "Haha, I really miss the old Minecraft. I actually use to play it when not many people knew about it. It's sad to see that new minecraft is all about mods and crap... :(", "someone help me,,,why i cant play minecraft,,if i press PLAY is says\"Error: Could not find or load main class info.mineshafter.GameStarter\"please help me!!!", "Dear minecraft people\nI am sad that xbox's don't have mods but computers do. If you can please can you put mods on minecraft. Thank you :)", "Minecraft is great but can never find any good players on Xbox one that want to actually play the game anyone care to make a survival world", "my minecraft i didnt play for a month and now its trying to say its a demo im really sad because  i spent all that money on it", "NOOOOOOOOOOOOOO!!!! WHY Minecraft WHYYYY!!!! I wish they would change it to the summer!!!! I could have gone  there because my sister has college there!", "If Minecraft advantage of the new Vulkan Api?\nOr ... Minecraft is at all adapted to Vulkan? D:\n\nAlthough Fits here not there, but I can write anywhere else underneath.", "besa tu mano (izquierda) 2:di el nombre de tu amor 3:siera tu mano 4:di el nombre de un dia de la semana 5:di tu nombre 6:abre tu mano 7:pega esto en 15 comentarios yes el dia dijiste te va a decir que le gustas y te ba a pedir que sean novios.si rechasas esto te a ir muy mal", "I can watch your lifestream!!!!! Yeah! I might come to Minecon when I was 20! And it is the time which I am doing YouTube!", "And in that day MCPE 0.17.0 is confirmed", "It was in London last year because my son asked how much it was to fly to London it's not always in America", "My son has the game on XBox 360 and did the necessary updates. Now the game has a richer texture but now he can no longer move his head around, left to right, and the game freezes. I've tried to power off and on and fix it myself but it's not working. Any ideas why this is happening? My son is pretty upset.", "I'm begging my mom Christa Lawrence to take me because she wants to go to cali and I want to go to minecon because my b-day is in September so if it works it will. Be a win-win", "Step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "yay!!!!!  My son will explode when he finds out this exists - and that we may be able to go! Awesome.", "hello can anyone help me ? im looking for the link to the minecraft pocket Addison for pc but cant find the one for steam can anyone help me :l", "Looking for a minecraft server?! Send me your username! Looking for Survivors! Pc players!", "\"better fighting\" by adding in a cooldown. Combat is what started to ruin the fun of MC in the first place, this is the CU of Minecraft.", "You can tell it's been a while when nobody knows what the Removed Herobrine in joke is.\n\nHonestly at this point I feel like you're beating a dead horse. Do one more update. Add that modding API you've been talking about for 5 years. Fully optimise the game. Then declare it the end of updates. Let the modding community take it over. That's what will make the game last", "Wow, so they make the fighting more skill based, and it's ruining Minecraft somehow? Yeah last I checked, the previous combat was more luck based, and not skill based. All you literally had to do was repeatedly left click, until the other person was dead.", "Seriously? I've been playing Minecraft since 2010, and this is the worst update I've ever seen! The new combat is terrible! And the wings? Seriously? Why must Microsoft ruin everything they touch :'-(", "pls stop crying because this new combatsystem, it is realy funny to think it exist \"Combos or skill \" in minecraft PvP ITS TOO EASY . this new update brings Shield, Dual wield and nice cooldown for now you need SKILL! crapy kids", "Idk about y'all  but this update is much more than I expected, I've been playing Minecraft since the beginning and it has improved greatly in this update. The weapon cool down does give it a bit more realism seriously who can swing a sword 4 times in a split second XD although I do wish it had a weapon cool down toggle for people who just like swinging their swords", "> better fighting\nYes, because adding a cool down totally improves the combat. How about those new animations we were promised? I hope 1.10 or 2.0 is the last update so we can have a modding golden age. Mods are what kept this game going anyway.", "I'm ok if they continue to update Minecraft, but I hope they'll improve the survival aspect. After all, survival was one of the cores of the first versions.", "This will be the first chance for my survival server to go to the end! we started it before strongholds were even added to the game and once they were added the ground they'd be generated on was already created. This is a big day for us!", "Dual wielding does close to nothing except let you eat and block with a shield,  the whole cool down system, mixed with the mediocre shield blocking when your stuck in a corner is just disgusting.  You can literally have a full set of iron armor, and still get wrecked by 2 zombies and a skeleton, because you take gradual damage as our blocking, and if you even try to attack while shielding, your gonna get whipped by a zombie or a skeleton shot before you can even hit them.  The odds have been so stacked against your favor in this update, it almost feels like dark souls.  You cant mix a once, casual game that was semi easy, to a new combat system that makes the normal mode hard.  It draws all the people what liked the game for being what it was away.  And to those people who say \"get over it\" or \"ohh you just suck\" dont realize that minecraft in its first concept, wasn't supposed to be a skillful combat game, and not every game needs to be difficult.  I honestly cant see myself having any fun on this game anymore because how unbalanced the game has become.  this isnt dark souls.  you cant dodge or roll or do any of the combat related stuff in dark souls that makes a good compelling combat system in minecraft.  Its a game about building and crafting with the occasional combat and farms, not this mess of a system now.  Either balance the cooldowns, or just adjust the game so you arent overwhelmed no matter what you wear.", "The last time a fun game got a major update called the \"combat update\" it was the beginning of the end. Good luck.", "\"1.9 ruined pvp\"\n\nRemember when sprinting \"ruined\" pvp? Remember when potions \"ruined\" pvp? It takes more skill now. I, personally, am pretty skilled at pre-1.9 pvp; I'm a fast clicker, I can press a few different keys quickly, and I get about 25-35 ping on Badlion. Now in 1.9, it'll take more than clicking, hotkeying, and ping to be good at pvp.", "Bring back a version of the original.\nI liked back in the early days of like 2011 when the game wasn't released for very long, playing with friends early in the morning and late at night.\nBack then the game was simple and fun.\n\nNow just way too much stuff has been added and I just don't like it anymore.\nId love to go back to the days of the crazy world spawns where I could build cool stuff on cool terrain, where everything was also simpler.\n\nIf anyone can get me a old gen MC version id love it", "What about pocket edition? Y'all gave a big update but the thing is I can't even spawn monsters anymore! Why would you give the witch if you can't even spawn her?", "I'll join the \"dislike\" group.  The balance between damage taken and given is way out of proportion now.  The durability of the gear is way too low.  While there are some great ideas here, I'll wait for further updates before using this anymore.  I'm not into entering \"God-Mode\" and creating everything.  I prefer actually finding what I need to build what I imagine.  Minecraft is losing what made it unique.  Leave that to the mods.", "Minecraft great update but .. nerf skeletons and baby zombies are too powerfull with this combat update", "I have to say that I am disappointed... This is a sandbox survival adventure game, but you are trying to turn it into an MMO RPG. \n\nI watched my brother explore the new update, because, guess what, I COULDNT. I cant load into any worlds or LAN. What I saw, was not very appealing. You screwed things up.\n\nRemove the cool-down. we dont need shields, we already have blocking. the wings dont work. wth do you mean by 'expanded the end?' My bro tried to find a portal to take a look and there wasnt one. He ran around in the stronghold (that, by the way, was completely broken) and there wasnt a portal at all.\n\nYou guys need to fix things like horrendous lag issues, and glitched with the EXISTING stuff. Not adding more broken things and breaking more in the process.", "I love how people are still complaining about this update. Mojang wants to overhaul one of the oldest, most untouched mechanics in Minecraft, and everyone loses it? Be grateful there even WAS an update.", "It's not the combat update but the update that made me to hate minecraft ! Axe , the strongest weapon ! Are you guys kidding ? So WHY u created SWORD ? :/", "Btw, Herobrine was never real. The first appearance was in a video; he photoshopped it in the video. Notch and the creators of the game called it the biggest myth in the game; Herobrine is not real but he appears in some of Notch's designs; Herobrine was not a glitch, neither is he real. Notch just puts something in the update log in each version that says; - Removed Herobrine", "It doesn't work for me. I completely removed Minecraft, uninstalled Java, and used the installer file from Minecraft.net. But when I create a new map and try to load it no chunks will load, and the game crashes. What's going on??", "In the past, i was always waiting for an update to come because i enjoyed all the update trailers that your team made... are they coming back?(i mean the trailers)", "i personally am not a fan of this update, it just made the game 10 times hard because of the cool down and also the shield is a kind of dumb idea. the sword blocking was easier. this is minecraft not skyrim", "I had to roll back to 1.8.9... It updated on my computer yesterday and suddenly NONE of my texture packs work on the game!! I can't stand the standard pixelated appearance of the game. It messes my eyes up bad and gives me a headache.\nPLEASE hurry with new texture packs for the new update... can't play it until there are smoother, realistic packs (that get rid of the choppy appearance).", "Forcing the player to use Blaze Powder for potion brewing now is a change I'd expect from an early access game. NOT one that has been properly out for almost FOUR AND A HALF YEARS. Sure it's small, but it seems like every Minecraft release now has been changing stuff that really shouldn't be changed for the sake of changing. There's a key difference between rebalancing (such as damage values or durability) and changing core mechanics after years of them being the same.\n\nI'm glad I'm going to stick with a Modded 1.7, because tbh the game is pretty much Modware now...", "A year later...\n\n- Still there is no way of claiming land to have land protection or being able to lock anything from griefers.\n- Still cutting down trees is annoying and floating trees continue to this day, exist.\n- Still there is no furniture to furnish your empty homes, aside by trying to make blocks look like something they're not.\n- Still there is no official Mod API which was promised and later abandoned.\n- Still survival has very few survival elements.\n- Still all mechanics are overly simplified to the point that the game doesn't even feel like an actual game.\n\nSure, improving combat was needed and welcomed, but it's priority was very minimal when compared to all the other things I've outlined. The game remains to be for children, not everyone. Am I the only one noticed that the game went to trash the moment Jeb took over? Reading ideas that Notch presented way back, were amazing compared to what we have now.", "Why is everyone upset? It's still the same minecraft, they just adding more. All you're old stuff will still be there, and if you don't like all the new features they're going to add, don't use them.", "The only good version is 1.5.4, 1.7 is ok... 1.8 isn't the best, but.. You know better then nothing. Now we can say goodbye to GOOD OLD minecraft. :(", "I am super excited for this update because by the looks of it, they have cool brand new stuff in it that will make your gameplay a lot more fun and will be a bit of a change. THANKS Mojang!", "Hello, I have a problem with my minecraft 1.9, the run game fps me at 5 fps maximum 8 and that's not normal, earlier versions is run minecraft 1.8.9 or less perfect mind me but this version does not give me. Actualize all including java, system also eliminates the launcher minecraft and yet I run very slow, nose if I'm missing something or some system that not already incorporated into minecraft 1.9 if anyone knows what the problem please email me want to play minecraft 1.9\nNote: I have the primium minecraft.", "It is stupid that servers don't work in Minecraft PE because when I type in the name and complete it and load into the server it always says Invalid name. The servers worked the other day and now the servers are not working anymore. Please fix this. I love the servers but it won't let me play them.", "I have a request for the next update if you can could you make hoppers which transport items upwards rather than downwards ty for reading this and please consider it", "I need help. My son's cousin kept playing Minecraft when it was time for bed, so I deleted the app off the iPad and sent him to bed, the following am I re-download the app on my son's ipad and all his world's were gone :o he worked so hard on all his world's and they're all gone! How do I get his world's back? Help please!", "thanks for destroying my account :) not only did the m,igrationshit a while back remove my password i cant get a recoverymail either. and the support team takes 2 years to answer so ty. thats some money wasted. i played for 2 years and then you take the account ? ty.....", "Me and my step son found a typo on the advanced world options on trust players the word authorize is spelt wrong it is spelt with a s not a z", "I'm  so sorry WARNING! Carry on reading! Or you will die, even if you only looked at the word warning! Once there was a little girl called Clarissa, she was ten-years-old and she lived in a mental hospital, because she killed her mom and her dad. She got so bad she went to kill all the staff in the hospital so the More-government decided that best idea was to get rid of her so they set up a special room to kill her, as humane as possible but it went wrong the machine they were using went wrong. And she sat there in agony for hours until she died. Now every week on the day of her death she returns to the person that reads this letter, on a monday night at 12:00a.m. She creeps into your room and kills you slowly, by cutting you and watching you bleed to death. Now send this to ten other pictures on this one site, and she will haunt someone else who doesn't. This isn't fake. apparently, if u copy and paste this to ten comments in the next ten minutes u will have the best day of ur life tomorrow. u will either get kissed or asked out, if u break this chain u will see a little dead girl in your room tonight. in 53 mins someone will say i love you or im sorry", "If people are so bothered about 1.9 just change your game to 1.8 or below in the game launcher! Personally 1.9 is great!", "This update is so stupid. I DIE every time I try and kill anything! If it's not lag, it's the fact that it's 3 times HARDER to kill anything! I HATE IT! >:(!!!!", "I dont midn 1.9, I just find the colision prevention system they added to be a major challenge for the serevrs to handle", "Minecraft... why do you do this to me??? You were great in Beta 1.7.3 and then after 1.8.1, you lost your shine. Goodbye Minecraft, again.", "i must say this 1.9 update is pretty good and although 1. whatever was cool too but this is better ......... Just Saying lol", "Elytra and end structures are my favorite parts. I still play 1.7.10 though because that's the version with all the GOOD mods.", "please bring back the old combat system. This game used to be minecraft. Now this is just German Combat Simulator UltraReal Mega Slam V9.45.12.1 REEEEEEEEEEEEEEEEEEEE", "We cannot seem to get our Minecraft PC to update to 1.9, anyone else having trouble or have any advice on what we can do? We have updated Java an uninstalled/re-installed to no avail. Any help would be greatly appreciated.", "Graphics are down on my gameplay.  That is i could see the occassional torch but not the hallway in which it sat.  I could see stars, but I'm in a cave.  And then just lotes of crazy lines and color bleeds and such.  The computer did an auto-update, but I don't what it chaged.  I had the same problem right on the date of the update and now can't remember how it was corrected.  Any recommendations?  I am not computer saavy enough to be super detailed, but I'll take any advice.", "Keeps crashing. Something about minidumps. Was able to fix the issue for one child by going into the Options file and changing the \"fboenabled\" to false.  But my other child's computer...  nothing I do is working.  We've tried restarting, a clean install, changing the options file, everything I can think of.  She gets into a world, plays for about a minute, than bam. Crash.", "1.9 everything is amazing EXCEPT for the new control and combat... totally ruins the minecraft gameplay most people in big servers are saying this too. Even normal players are starting to quit servers with  1.9 and returning to 1.8.9/1.8 even 1.7.10. In my opinion the combat style must change! Until then me and overy 573 people are not playing! Good luck!", "I used to be afraid of dungeons in Minecraft.  Until I saw the price of Lego Minecraft sets....", "What, have I seen or run away from Zombies in Minecraft? It's like asking if we've ever used a pickaxe in minecraft. Can you be more generic and all encompassing?", "How can you have lego minecraft when minecraft is blocks anyway? Yo dawg, I heard you like blocks. So we took a game of blocks and turned it into blocks so you can block while you block", "Ok so lego was an invention so it would make it easier to build a house out of blocks. Before that it was wood blocks and Lincoln logs. The future was mine craft, made it easier to build whatever you want. And they said video games will make us stupid.... Mine craft has created a new gen of kids and adults, smart and creative. What I don't get, why would I want to have a game where I still have to use legos? Its ok for kids that don't think ahead and live off trend. Legos are dead, time to rethink this Lego. How about magnetic blocks. No more clicking.", "Do never enter a cave without torches, tools, weapons and armor. hihi :) I'm 56, and i like to play Minecraft. :D", "When playing lego virtually is too mainstream, here comes Lego \"Virtual Lego\" collection so that You can play with virtual legos in real life!\nbut seriously, what?", "Why? with all the texture packs, zelda, shyrim, enter yours here; I would think someone has already done it. Wait they did. I'll admit this looks better but really what's the point. They haven't added anything to the game from what I can see. We don't need this. Don't go Lego. Lego should have and could have made a game like this long before minecraft. Too late this is minecraft and that's what I and many others want to play. Keep adding new and fun game play mechanics, Mob, new fun was to mine that's more than just a pick. Yes you still start with a pick but you get better tool the more you play. How about some round trees? Better combat system. Old school zelda like skeletons. Minecraft can fit so many game types.", "Next lego release will be a single block lol.\nThe minecraft concept is a modern and virtual version of lego. The oposite is ridiculous.", "No it have never happen for me, because Im not a minecraft character made out of Lego! Use your brain next time you ask a question...", "previously i can download minecraft and play on your computer , but when turned into yesterday morning , only minecraft minecraft out letters on the screen and disappear ! I 've tried to erase reload many times but still failed ?", "Nope because when in a cave zombies are least of problems.  Cave spiders are what give you the nightmares or silverfish x.x play safely my gamers", "Gotta ask, isn't Lego Minecraft a bit redundant?", "So i downloaded minecraft right.. So then after that i tried to play minecraft and its keeps on saying unable to update minecraft native launcher... please tell me wtf to do ;-;", "Have my Lego pieces ever come to life? Nope. I haven't had Lego since I was 16 years old. (I really liked building and creating xD)", "guys i like caves in minecraft i like exploring what i dont like is strongholds.. :P i have found one with my friends and its soo big you get lost in there... i finaly found the portall to the end with a spawner in the stairs of silverfish... creapers are all around skeletons and zombies too that is more than enough to kill all the players together and there is lava on the floor too XD any ideas how to win this?", "Lol i always thought of Minecraft to be Legos, I don't think theirs a purpose of the game, but that's my opinion. But if it makes Minecraft gamers and the company happy, I guess that's all that matters.", "hey Minecraft my brother forgot his minecraft username and password, and he forgot his Gmail that he used to host the account so we really have no way of recovering his account, all we know if that his username was Dule### and he had a mudkip skin, if you could pleas help us with this problem that would be great because we don't want our money to go to waste when we already paid for the account and used it but then forget its info and have to buy a new account because yet again that would be a waste of money. if you could get back to me on this it would be great, i really want to play minecraft with my brother again.", "slowly minecraft has become less challenging i can find diamonds in 1.5-2hrs of gameplay and then kill enderdragon within 6-7hrs....", "Lego Minecraft because let's take the thing that was inspired by one thing and turn it back into the original thing that inspired it and call it new oh and jack up the price ahh innovative", "I've had my HP whittled down by Zombies and been exploded on by Creepers but that's nothing compared to the online bullies in Minecraft...", "All those zombies would of been dead with the sword of the true heroes! (Available only in the Minecraft Story Mode MOD)", "I hate you. Now, i want to play Minecraft, but have to work. :P", "Does anyone here play Minecraft for the 360?? Although I will most likely get an Xbox One in about a month when my tax return finally gets here. :p Message me if interested.", "I have a question so when I was buying minecraft it stopped and the money went through but I didn't get the game what do I do and I don't play it my daurter does", "$30 for a bunch of exclusive happy meal toys and a t-shirt that says  \"#Minechest\". I love Minecraft but this is dumb. Killing Minecraft one box at a time.", "hey minecraft when i go into minecraft the blue loading bar goes across and then it just kicks me out of the launcher pls help me", "hey minecraft when i switch my version the whole world turned into a jungle then my house was destroyed i was really sad so i had to reset the world", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "And so it begins - what most of us have been dreading for, please be careful with this, please think about it before saying yes to this :)", "Ummm...are your marketing directors on crack? No one in their right mind would pay for something like this for $30 dollars plus 7.00 tax a month!! Unless you are trying to coax little kids to steal their parents credit cards and I bet most of them would agree with me that this is an absolute waste of money for anyone. Honestly, you guys are no World of Warcraft by any means. As for paying that a month as an subscription fee? No way.", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "Hay i dont play minecraft .help me for download minecraft", "When will Xbox minecraft get lucky blocks  that's all I want", "i dont know how to pla minecraft on facebook help me mojang plssssss", "dear MINECRAFT I don't know how to get ahold you anyways I'm coming here can you try to make it Borderlands texture pack for Minecraft Xbox 360", "Im not sure if this is the right place to put this, but I think.it would be really cool if the xbox version would get better updates like witchery capabilities, and whu cant we keep our experience points, it sucks that we make it to level 30 and accidentally fall or die and lose everything, why not just take one level away. I think it would also be cool if we were allowed quest and bosses to beat. Playing minecraft now use to be fun but theres no ending or theres nothing really do work towards to accomplish. I think the xbox version should have alot more entertaining things in it like the mods on PC. Not all of us have PC's and I was highly upset that I spent 30$ on the minecraft story mode game for my daughter only to find out that she couldnt play but one level and needed xbox live to unlock and play the others. Really?", "I like minecraft hopefully make me admin on a server", "This actually sucks, this basically hurts me being on top of USA as an Canadian and this MineChest is for USA only :'( as well its just items and a shirt that you can easily go buy at stores... nothing really exciting so its a win/lose for me", "Question I've been dying to ask, when will you guys make  Minecraft compatible with Google Cardboard? And with respect don't reply with \"It's a bit of crap.\" Sorry, heard that you guys said something like that, which comes out as exceptionally rude. It was my hope perhaps since then popular demand has swayed your minds over. Any answer aside from the \"It's a bit of crap\" would be wondrous. :D", "Random 2c worth here. Why are there not more animals in the game? Lions, bears, tigers, even a horse would be nice. How about a cat, monkey, mouse, shark or scorpion.? I just long for more variety. Or am i stuck in a world with only farm animals?", "im not amerikan but im playing minecraft pe 14.0", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "300.000 rupiahs to get minecraft premium. It's expensive, or not expensive?\nSorry for bad word. Because im an indonesian.", "How long till the next update for minecraft:story mode for episode 5 I wanna play it, is it when Ivor and Jesse do skyblock together?", "Most likely if u look u can find minecraft stuff cheaper and buy more also u can make the chest urself and set it out for your kid to find just sayin lol", "sorry about this message but I am new to minecraft. I have an autistic son, who I see once a week. He is very demanding regarding minecraft, as I am an artist I am quite creative. My son has an amazing world etc.", "when will you guys add a cape for anyone who has stuck around minecraft for more than 1 year id love to see a cool cape for that with a basic minecraft M logo on the back of it", "My son had an idea when he saw searge's message on reddit. I wouldn't let him use reddit so he used my facebook instead. Searge said that they were asking players to give ideas to make combat more fun. He wanted to say that he had ideas for some swords and a new mob. He was thinking that it might be cool if minecraft had elemental and dimensional swords such as: The aqua sword, blaze sword and an end sword (that has enough power to destroy enemies in one hit). Then his mob idea was to maybe have a nether knight, an armoured knight boss found in the nether that would wield the blaze sword. He thought that maybe these ideas might be good to make combat cooler and more fun.", "What is wrong with minecraft now ;-; I have problems to login for most of time. Why do they take so much care about the box if there are such problems with servers", "Notch, change the fact that you need windows 10 for minecraft 1.9, i cant get windows or minecraft 1.9 now and i really wants minecraft 1.9... CHANGE IT!!!!!!!!!!!!!", "My boy plays minecraft (I know zero about it) he has the version the PS3 edition, he wants to be able to build moving vehicles is there an upgrade I can buy?", "Cabros les traigo servidor de teamspeak3, esta abierto 24/7, tiene rangos y es chileno... 300 slots pa cagarse de la risa un rato .. sean bienvenidos     legendarygaming.freets.xyz", "Hey if you like minecraft come check out my channel! Type in KalebMorrow into the search box and enjoy minecraft and much more!", "Dear mojang, i believe that you should add dinosaurs to minecraft ps4 addition because I watched vidieos about it, I think that people would enjoy it very much. Thank you.", "DarkMoon Server, Run by hubby and wife. No longer whitelisted\nAccepting people to join and have some fun with us. We have a few requirements.\n1) Must be 13+ \n2) Respect\n2) No Grieving at all\n3) Respect everyone\nSlots expanded to 40\nPC Only, Not OFFLINE MODE\nIP: 158.69.122.94:25615\nPlay Style: Survival", "Any word about where MINECON is going to be? Most people have to plan in advance, its past the point of building hype, I really just want to get rid all my sons minecraft software, toys shirts posters ect... way  and have him get into something else.", "I hadn't been on minecraft in 5 months or so and i just tried to get on, but my password wasn't working! so i've done the \"forgot password\" thing but then minecraft notified me that my account had been \"migrated\" to mojang. so i go to mojang and try and get my password only to find that i need my old email that i havent used in years! but it wont let me change emails. im very angry/frustrated, i paid for a minecraft account way back when beta just came out, and i dont want to have to pay for a new one. could anyone help? any suggestions?", "The ocelots are still bugged in the console version. The \"tame\" prompt does come up, but giving them a fish only puts them in love mode. They do not turn into cats and they continue to run away if you so much as twitch. And aren't rabbits supposed to be tamable? I can't tame them no matter how many carrots I feed the little buggers.", "You guys SUCK major right now!!!! Xbox 1!!!! Just saying dont try to add a new profile and than play any preexisting land your boyfriend has been working on!!!! Its happen 2 times that it's either whipped everything out or you can't even get it to load!!!", "Hello, I'm having issues with the game. Its about Multiplayer, all the servers I had saved have a massive error on every single one. As a result I can't play any servers except for one and that is barbercraft. Please help me :c, I don't know we're to post my problems about it.", "Can't wait till Minecraft pocket edition has the end and horses, I would also like spawn able dragons to have as pets.", "I just wanted to let you know Minecraft that your game developers mojang and the owners of the company specifically Microsoft and Xbox have not gotten back to me in over 3 weeks regarding an issue I have had with accessing my main world in minecraft. The data is possibly corrupted and I have been trying to have it resolved or just given any information on the progress of resolving the issue and have not heard ANYTHING. It is unfortunate that has a fan, gamer and customer I am not hearing from the support community on how I can play the game.", "my account for minecraft on the laptop doesn't work. I tried 12 times with the password but it just keeps saying it's invalid!!! can anyone help me out here?", "could someone help me please , cannot logon to my minecraft/mojan account.. (Invalid Credentials/Incorrect Login) and even reseting my password don't works..PLEASE HELP !", "I just purchased minecraft for my kids and can't get it to launch, can't get the help part of the forum to work (can't type) can anyone help me? I'm getting this when I hit play for the first time", "i  just   got   pocket   edition    couple  days   ago     love  it  one  thing  don't  understand  why  can't   we   use  /gamerule  keepInventory   really think we  should  be  able   use   it   seems  unfair  for   people  hates  lose  stuff  and  get  it  all  back !!", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "I love Minecraft a lot but the hit delay after every hit were  bad the pvp were crazy but the new End Elytra and the second Hand are great!!!", "also add the skins pack of souls of minecraft pe !!!!", "What is the point of the windows 10 one it has no mods and you got to buy skins instead of downloading them", "goblog! gua pengen download malah suruh kasih email adress ama haritanggal ultah sama padah password.....Udah bener passwordnya sama email adress dan ultah.Malah gk bisa.bisanya registrasi.....Veriify email belum,buybelum,downloadbelum........Caranya gimana sih guys? tolong donk kasih tau yang orang indonesia...Dan yang ketemu ama gamer minecraft bilang klo gimana cara download minecraft di mozilla firefox...Klo gamernya gk punya mozilla firefox...suruh cari aja solusinya......bilang yaaaa!!!!!!........thanks yng udah bilang ke gamernya", "story mode and put minecraft episode 5 I am desperate to please and sy Mojang creates episode 5 and I give you my star wars toy minecraft 7", "My name is Hunter and Im 6 years old, I love Minecraft but would like to play with others. if you are looking for a freind please look me up!!! my gamer name is SupeRmAN. I hope to play with you soon, Thank you ;)", "I really need to know how to download stuff for my daughter.  She desperately wants mo creatures and every download gets booted out by Norton.  Is there a safe website i may use.  i thought for xbox 360 mo creatures was linked with Mojang, but apparently not.  No JB Hifi or EB games or anyone has any clue?!", "Not sure how interactive this page is but I have some requests for the next update on the Pocket Edition application:\nitem frames, stained glass options, horses, further dye options (beds, collars, leather armor), dispensers, also the ability to open and fill chests in creative mode... \nJust general improved items of that nature - again, I'm not truly sure if even saying anything of this on here will be very helpful, but worth a shot. Thank you.", "New update for mine craft android just keeps exiting to the home screen.  Before the update it worked perfectly.  Tried reinstalling and rebooting tablet?", "I might have experienced herobrine or entity 303 i was playing i spawned in playing i got on creative and i spawned a boss got off of creative (this was still the 1st day) and i heard arrows shooting me then i heard a lighting strike with no rain then my game crashed PLEASE HELP I AM FREAKING OUT (i dont have a mod for them i checked)", "hi was wondering if someone could help me my sons minecraft should update on its own on the xbox 360 but it dont seem to have the 1.9 and i dont know how to get it  dose anyone know what could be wrong", "i love minecraft only thing hate about minecraft is way does everytime you die you loose everything to me seems like big un fair  we shouldn't  to get everything again then lose it again  !!! what heck you think  know little kids play it too", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "just saying why does't minecraft  ps3 have mods because u can just go into play station store and buy them because it's really annoying to have to have a PC or MAC to get mods  and it would be really fun to have mods in minecraft ps3 and it's unfare for the people that have a ps3", "hay guys i have make a new server and i need staff \nthis is the server ip : TeamKanji.mchost.pro\nit's beta for now but i need a dev and builder and admin's come to the server and talk to me and you will be anything you want :)", "Why can't I get the extra's when I enchant now?? I'm trying to get infinity on my Bow, but the only thing to come up is 'Unbreaking 3'. I add the Lapuz but the ? doesn't add anything. Tried too many times without getting anything and it's pissing me off. Can anybody give advice or is it a bug??", "all i get when creating a new world is desret and savana  I have been playing since 1.6.5. where are the grasslands and epic mountains. deep caverns with lava and water falls.  jeb sold out and bill gates is going to sink the bismark.    I have turned temples into condos and uncovered the seatemple from the depth of the ocean.       now you are going to loose a player", "I bought Minecraft for PC but no longer have the computer I now have a tablet and was wondering if someone could get in touch with me I have a question and need some help", "Im Playing on Xbox one right now just started a new world if anyone wants to join~ (16+ only please!!) Send me a Message My tag is Blood Promise", "Downloaded most recent update (auto on PS3) and now am unable to view map. New/Loaded maps both. Can create, move, place in usable inventory/hand, but unable to view onscreen. thanks", "tengo un problema compre minecraft me registre en mojang y cuando quise acceder a mojang me de cia que el correo o la clave estaba mal luego cambie la clave y siguio lo mismo ayudenme !!", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "When will there be a fix for xbox one cloud syncing? You make BILLIONS and there still is not a fix? Do all the xbox customers not matter?", "My son is locked out of his minecraft account, the email he was using for that account is no longer valid ( the company sold to another 3 times) its not letting me log in at all and will only send a change of password to the old email we can't acess! Help", "i have mine craft   and i need to login with that account (log on to Technic) but  it says my Morgan account has no perches copy's of mine craft.", "PLEASE HELP US!! We've been playing fine on LAN since yesterday but now I just can't connect. NOthing changed but just don't know what to do anymore!!", "That moment when you realize Microsoft owns Minecraft But you Can Play it On the PlayStation 4 in higher definition 1080p 60FPS!", "Hahaha it's so funny to see all these people complain that this game is too much like a movie or isn't as good as the actual Minecraft game. Obviously you guys have never played a Telltale Game before, all their games are like interactive movies. Games like Tales from the Borderlands, The Walking Dead, TWAU, and others were amazing games and this game is just as good. You guys should do more research before you start complaining online. It's awesome that this game is coming to Wii U, glad to see TellTale expand their platforms even farther.", "But story mode was created by Telltale Games,but  still love minecraft for sure..must downloadbit from Mobogenie to save money thab you buy from Google Play Store..", "Need help. My some minecraft wii u editions language changed and I can't find anywhere where it tells me how to fix it. Help", "Just a question from my son; he wants to know if the Wii U edition has the Ender Dragon. He has the iPad version that doesn't. Thanks.", "You Should Make A Minecraft Game (Not Story Mode) For The Nintendo 3DS! That Would Be Great! =D", "Hahaha it's so funny to see all the people to save the world. It look like film.It's so nice.This is very indispensable in my life.I love it a long time ago.But i think the Minecraft Story Mode should in the game itself.I think if it can in the game itself the game player will happy in the every time.I from the China.", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "Dont have any wii u \nbut have a 3ds\ni hope there will be minecraft in 3ds", "When will Minecraft 1.9 be coming out for pc?", "When does story mode come out dor the PE verson of minecraft?", "Hi all anyone know the release date for minecraft story mode episode 5?", "Wonder if you have to buy the special Wii U Pro Controllers for this?", "I have  minecraft  story  mode", "It's gonna be awesome on the Wii U", "Can I ask you something?! If I have the WII U version, can I play with someone who has the PC's version?!", "Please make this for 3DS cuz I dont have a Wii u", "can we find minecraft  somewhere for nintendo ds oor 3 ds", "minecraft story mode e um jogo facil de jogor eu parei no episodio   3 .", "Can you make Minecraft Pocket Edition to 1.4.0?!?!?!?!?!?!?!", "I know this has nothing to do with the Wii Mode, but I need help trying to get my sons account to work with Realm.  It keeps asking for parental permission and I put in my email and then try to confirm with my cc# but it keeps telling me there is a card error, when there's not.  Therefore I can not give him parental permission.  Any help would be greatly appreciated.", "Its great for wii U users no need to buy a computer or pc or whatever :D", "This \"game\" came out defected! Not happy....returned it 3 times at different stores and each New Disc was defected with freezing and bad time lapse with voices. Returned last one and got different game for my daughter.", "I can't space in minecraft. Minecraft help me because I cant play in servers because i have to register and theres a space when", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "does anyone happen to know when 1.9 comes out? a few of my friends and I have shared a server for a while now but i dont want to build anything new until 1.9 is out. however i havent been able to build since november because i heard it would be released some time in december. its really draggin on and i havent heard any release dates.", "Hey if you like minecraft come check out my channel! Type in KalebMorrow into the search box and enjoy minecraft and much more!", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "Mojang can you just add it in the minecraft in the steam", "Can anybody tell me where I can go to get some tech support. I can't log in - apparently my password is wrong - and I am not getting any emails when I try to reset my password.\n\nI only have a few days every month when I have time to play and this is not the first time my password has apparently changed for no reason causing me inconvenience but it is the first time I haven't been able to do what is needed to reset a new one.", "I need some help if anyone can pleaseeee. My son plays mine craft on the xbox360 but when I wanna put it on 2 player it won't let me split screen another person in. Every time I press start nothing I changed his leads to hdmi and still nothing. Yet soon as my niece does it on her p3 it works perfectly fine. What am I doing wrong haha", "I have a premium account, and whenever i join to servers it says /login password, but actually im not already registered in a server, i tried to join to another server but the server keep saying me to login my password. need help please!(sorry for bad english)", "Purchased in 2011 via paypal, because it migrated across to mojang   had to re set everything and download again following instructions, and now get told oh sorry you will have to purchase again as file has been damaged! just seems to be a scam to get more money!!!!!", "Notch please my account never log into my minecraft ( NO ACCOUNT !) I tried several times , and does not work if the launcher is buggy or not, need to have an error , please , was the only game I could BUY in time , it is impossible to buy or find another game, you have to fix this ERROR\n\nTo be more detailed, I put all my cousin all, and my , but not logs , load , lock , and not log :( please ( I'm Brazilian)", "Same as terraria, Becuz terraria has cobalt in it", "Whos playing minecraft could you guys help the minecraft name Orc with something with the skin of wood", "Can someone PLEASE tell me how I can get crazy craft?? My son wants it so bad and I thought it was a mod but i've been searching all day and just keep running into spam and adware. :-/ PLZ HELP.", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "Hi Im just wondering why my minecraft pc wont work when i load it it just says Error and wont load the world sucks i spen 25$ buying it and i cant even play it :(", "you guys should let us play hunger games, or skyward on ps4 please.", "192.99.33.205:26716 a new server Please Join Us I Hope You will Enjoy IN a New Server", "the minecraft windows 10 beta is a load of crap it as why to many problems it not worth $9.99 it is almost not worth giving away right now to many thing needs fixed", "Why cant you guys add minecraft to steam? So we can buy the premuim account there and no more credit card. Just steam wallet :3", "I have access to Minecraft 1.8 Client Metro download. PM me if you are interested, I'm willing to share it with you. :)", "Cabros les traigo servidor de teamspeak3, esta abierto 24/7, tiene rangos y es chileno... 300 slots pa cagarse de la risa un rato .. sean bienvenidos     legendarygaming.freets.xyz", "When is minecraft putting future and more cool things to Xbox one and ps4 and if you do that you are the best minecraft creator on the world thanks for everything", "Thinking of getting Minecraft for PC - Please can you guys let me know if it is worth as I never played it and want to play and put it on my channel. But before i buy it i want to know if I have to get Server or just normal download?", "Hi minecraft can you help me i downoloaded minecraft but i cant join its read downoloading i wait 5 10 minutes and next was play i press play and again downoload please help! :)", "been playing minecraft for over a year on xbox 360 been working on a map just about that long. now when i try to get into map i get freezes out.did just about everything i can to fix this with youtube help and micro soft help nothing works. it's no doubt that the xbox 360 version of minecraft was not developed for long goal gaming and with updates just made it worst.what i had read is a lot of xbox 360 gamers are having the same problem.", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "Can you do so in Minecraft Pocket Edition you can play with your friends together in a world but at distance?", "so it seems you guys forgot some stuff in the windows 10 port , like maps, and enchanting tables.. anything else NOT in it?", "Can you make MCSM skin pack in MCPE hope you reply it thanks", "I downloaded Minecraft  PC for my son but every time he gets to play it, it keeps crashing. What a waste of money!", "After the update for PS3 my existing  survival world did not generate the new blocks or trees, at least not that i can find. The only new thing i have are the fish and items you can get from fishing. Do i need to create a new survival world? If anyone knows anything about this please let me know.", "What happened to updating minecraft pocket edition, the game does not work, it does not work on my phone and my tablet also", "Thanks Minecraft For giving Grand Game this game is the Good Game For Kids and Gamers I like DanTDM,PopularMMOS and Recabilly I like those guys and ilove so the minecraft", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "I hope that answers and knife this in minecraft pocket edition porfavor minecraft pe had been much better with these things porfavor ask notch several people of Brazil asked it to me", "my friend live in venezunla, and pay for minecraft premium and he's can't login.\nHelp me answer down here?", "Join A Nice Rpg/Custom Survival server!\n------------------------------------------------------------\nIp: godlytowns.hosthorde.net\nGenre: Towny RPG Survival Custom_Items\nVersion: 1.8.x\nDesc: We are a small server looking for a good community. We have around 75 plugins and we \nhave so many custom items that we have double\nthe amounts of items in vanilla! We also have some RPG and Towny plugin where you can advance in our society and earn many new friends! We look forward to seeing you!", "Hey Mojang! I have some ideas on Minecraft 1.9 and I would like to share them with you if you ever have the time", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "I have all the skin packs and all texter,packs my dad got me them and are girls aloud to play it I'm a girl and boys say it's only for boys.", "hello everyone , i have some problebs amout playing online, when i try to join seerver its write me internal exception: java.lang.nullinternalexception , so if someone can help me write me in pm        and one more thing i am usin keinett as minecraft :(", "Is there a stampy skin for ps3", "I have a question , Today I was playing minecraft afternoon but a friend asked me to look at something on your premium account and I spend but apparently I avia gone wrong password and coming and coming and not mejava but when I step While password and coming and I did not even entered my premium account I do ? I blocked or happened ?", "Hi guys. I have been able to play Minecraft on PC just fine for several years, then formatted my computer sometime last year; I was still able to log in to my account just fine at the time, however after a break I recently decided to get back into it with some friends, at which point I discovered I could no longer log in. The saved credentials were no longer working, and none of my passwords worked either. I thought, okay maybe I've forgotten my password or something, so I went to try and access the password reset function. I have tried this over twenty times and the email does not come through after about a week of trying. The fact that my email is not registering a reset option is I think pretty clear proof that my account has been compromised in some fashion. I have therefore contacted support to get my email reset back to its original, and yet I am still waiting several days later with absolutely no contact. I understand it is a busy period, but it would be really nice if the website at the very least registered an automatic response to the support claim, so it can be tracked. Ideally I would like a response sooner rather than later though, as it is getting close to a week now with no response whatsoever.", "It's like Lego and minecraft were made for each other.", "I don't play electronic games, so I have almost no understanding of what will play on what machine and my wee boy wants to play more than pocket edition; if I buy minecraft pc will it work on an android tablet? Thank you", "Hey trying to figure out anybody can help me out on minecraft trying to figure out how to play the game if you have a Playstation 3 and a microphone so you can talk to me to explain some things in the game hit me back my gamertag is kevikbb shooted message first to my username and I'll hit you back", "Problem switching Minecraft Pocket Edition to new tablet. Old tablet broken and new tablet comes up with \"My World Can't be Opened\" Any suggestions?", "I don't like Lego's or  Minecraft... Have fun Building, come on you do all by yourself......I'm in a rather per care us. Postision.", "my little boy loves minecraft but your toys are cheaply made,vinyl creeper and spider already broke one very upset little boy now i have to go buy more as ive lost the blinking recite", "Can someone help me I am looking for a song to download apparently used on minecraft and heard from a YouTuber little lizard gaming lucky block challenge is a funny flute sounding song", "Entre a este sv de minecraft, mientras mas jueges mas rango tendras y ganaras cosas, con un muy buen sistema de survival y proximamente mas cosas 62.210.102.214:25657 tambien denle like a mi pagina y estaran ayudando mucho", "Join A Nice Rpg/Custom Survival server!\n------------------------------------------------------------\nIp: godlytowns.hosthorde.net\nGenre: Towny RPG Survival Custom_Items\nVersion: 1.8.x\nDesc: We are a small server looking for a good community. We have around 75 plugins and we \nhave so many custom items that we have double\nthe amounts of items in vanilla! We also have some RPG and Towny plugin where you can advance in our society and earn many new friends! We look forward to seeing you!", "You know the Lego companies are desperate, when the start making Lego minecraft stuff. Legos are cool and all but kids are more interested in electronics now a days.", "We got 4 Lego Minecraft kits for Christmas!, my son and I have a great time building them together!", "Hi All. My daughter was modding a skin - I think - while her PC was downloading  1.8.9. It now won't startup. The PC is fully updated with all software related to Windows 10. Every start up has a different error and I don't think the \"report to Mojang\" button works. I have been told that she should be able to play the game from Minecraft.net if she logs in but that doesn't work. I have downloaded the game onto my PC but it starts with nothing in it. Can anyone help because she will lose 2 years worth of work? Thank you", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "If everyone who has ever bought the game paid the current price, you guys would have made over $591 million, phew! lol. Will be buying this for pc in a day or so!", "why does minecraft needs to pay if you want to download it?", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "I have a question , Today I was playing minecraft afternoon but a friend asked me to look at something on your premium account and I spend but apparently I avia gone wrong password and coming and coming and not mejava but when I step While password and coming and I did not even entered my premium account I do ? I blocked or happened ?", "why  the minecraft didint let the snowman follow you or you command hem or at lest let hem talk. let hem talk that will be soo coool if they but it", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "Minecraft i have a question cann you make please a demo for browser i have problems tho download it and the cracked version is not starting please help!", "Wow amazing i love lego and minecraft  both of them is the best:)", "Anyone want too join my server its 16+ up Must be Able to follow the rules but im looking for new minecraft buddie i have no one to talk too in my game if your interested pm me :D", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "I don't like Lego but I love minecraft", "Hello, I have minecraft on my xbox one and also have the windows 10 version, I want to play with my wife in the same world, I use the xbox one and she uses the windows 10.... is it possible?", "I had a glitch in my game while making a video about traps there was some kind of forcefield and two minutes after i was done recording there where burning logs on my trap that werent there before\n\nThis was on console edition\nMaybe it was a glitch in the new upgrade", "Cabros les traigo servidor de teamspeak3, esta abierto 24/7, tiene rangos y es chileno... 300 slots pa cagarse de la risa un rato .. sean bienvenidos     legendarygaming.freets.xyz", "want to download minecraft for PC on your homepage. But it wants me with no refuse option to entitle you for further payments via PayPal??? no way!", "I play on the xbox one and yea this is cool and all. but is anyone else having problems with villages not spawning in anymore? started a new map for the new update and poof, no more villagers or buildings to be found.", "I play on the xbox 360... I have noticed that doors/fence gates/probably trapdoors make no sound when they close. Can you fix that?", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "I don't play electronic games, so I have almost no understanding of what will play on what machine and my wee boy wants to play more than pocket edition; if I buy minecraft pc will it work on an android tablet? Thank you :)", "Any word on when they'll launch Realms for Windows 10 Edition?", "What are some family friendly pe servers my daughter can join? She was on lifeboat but there's waaayyyy too much nasty stuff being said on there. Thanks", "Got the latest patch for PS3 awesome but the world is already rendered. Any plans to make the PS3 world bigger so the game will add the new biomes and underwater temples?", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "Anyone want too join my server its 16+ up Must be Able to follow the rules but im looking for new minecraft buddie i have no one to talk too in my game if your interested pm me", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "I have a idea for minecraft 2.0 !!My idea is in minecraft 2.0 you can use magic to create spells wich you can atack or mine faster", "Ce tare sv de minecraft ! La 20 playeri on event cu grade !!!\nmc.eliteroyal.ro", "Hey if you like minecraft come check out my channel! Type in KalebMorrow into the search box and enjoy minecraft and much more!", "I wish the TU31 didnt render my game non playable! You need to fix xb1 TU31 with a patch NOT FUN \"NOT\" BEING ABLE TO PLAY MINECRAFT NO MORE!", "Like yuo mojang i played mincraft when i was 4 on my pc and pe", "The new update on console version is so epic i wish that stampy's house is still there", "i love minecraft Pocket edition/pc can it come more updates on Pocket edition", "PC players, why are you complaining? We have access to mods!", "So you keep releasing new gamemodes like storymode, windows 10 version, you update other things but leave the pc version  not updated for at least a year, no wonder why people don't play it anymore, I used to play it all the time but have gotten so bored of the game due to no updates, looks like Rising World is the new game for me!", "I love the QQ from PC gamers. I'm a PC gamer and am beyond thankful for the staggering amount of mods we have. If you're complaining about Minecraft not getting an update on PC then you're doing it very, very wrong.\n\nPS. If you're still playing vanilla, google \"Technic Launcher.\" You're welcome.", "Hmmm. Go out tonight or play Minecraft...", "I just got on minecraft and no update really", "How is it that almost none of you noticed that the update from this announcement is for \"1.8.8\", the same version number that PC has had for a while now, and that most of the added features in this update are things that the vanilla PC version already had?\n\nCome on, people, learn to read.", "Minecraft/Mojang well i\nMean yes it is a huge Update but when Will\nYou let us join and make servers!!! ON CONSOLE and Playsation platforms too i mean PLEEEEEAAASE JUST MAKE THAT UPDATE", "This is great for the game as a whole. The more console players means the more attention the game gets. The game gets attention and the staff grows. Most minecraft anything is developed for pc then modified for console, they barely had Redstone while we're making hundreds of various machines. Their maps are truly limited whole ours are limited to some trillions of cube^2.\nAny additional content for any version of minecraft is good for everyone. \n\nYes, I too have been anxiously waiting for 1.9, but it's okay. I'd rather them push a working version in January  (maybe jan) rather than have 1.9 now and they're getting attacked because 1 out of 1000 will enter the end and die or some random bug.\n\nMore development begets more development. Let's be happy", "I've been out of the minecraft game for about a year now (360). Is it possible to play on a world even though the host is offline yet? This update looks cool and I want to get back in, I just can't play minecraft by myself though. To me, this game's entertainment value relies heavily on building communities and sharing with others.", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "This is what modded minecraft on the PC is for. And microsoft knows this. They have been silently taking certain things from mods like for instance the hopper. It was originally a modded item on pc. The extra biomes are mostly from a mod named extra biomes. And if people feel that online pc multiplayer is falling their are plenty of modded servers out their mainly on ftb or tekkit packs.", "I also had another idea for a new update for PC and console editions. With the Minecraft story mode game, canbu try to add the wither storm, command blocks, giants. Mods like ships but its in the game it self. And since I like this game as well, slender world that is a trial and ability to buy its as well. Plz reply back and thank u.", "Thank you, Mojang and 4J studios! I was already considering returning to Minecraft on my Xbox 360 after a long pause, due to the few updates I had seen, but now I am convinced! I'm off work at around 10:30 or 11:00pm tonight, it's time for Minecraft!", "Heaven forbid they bring the other versions up to speed with PC before continuing to update it. Get a grip, PC players. I play both PC and Xbox versions and I'm ecstatic Xbox is up to date now so I can use all the new stuff with my friends instead of alone or with random people on my PC.", "I play Minecraft on ps3! I've been waiting for a new update for a long time now!", "So when are we getting Mods like search in the search bar of Xbox or PlayStation. Like When are we getting it cause I really want crazy craft in Xbox and PlayStation and maybe wii U", "Who ever has a Xbox one , go over to YouTube and check and subscribe to box turtle gaming. His server is awesome, organized and fun with survival and PVP zones", "The game is awesome! It just needs one more thing . . . Now that the console versions are the same version as PC, can you please bring cross-platform multiplayer between them all???", "So many whining pc players. Get over it. Consoles have been lagging behind for ages.\n\nGood job Mojang for getting everyone up to speed, taking your time and doing it right.", "i can't even play it on xbox one every time i go to load up a world the game crashes on me am my old xbox 360 world's freeze and send me back to the dashboard have the time plz i love playing minecraft i hope this can be fixed soon !!! or can any one help me on this ?", "i had a great idea for a new update for consol and pc editions. mabe there can be a way that u can build over minecarts to make them look like trains or cars. also put most of the mod that are on pc, and build them into pc and consol editions. its just a litle thing i made up. plz reply back on what u think.", "We just bought several texture packs and a skin pack for xbox one and none of this is working. EVen did a hard reset of the xbox. I want my money back if it isn't going to work properly", "Minecraft creators ur the best!!! I have minecraft on iPod minecraft Pe and on Xbox 360...lost my controller tho so when I find it minecraft here I come!!!!:)", "I am having a huge issue getting minecraft to play on our xbox360 for two players. Understand I am a total noob. My kids both want to play same time split screen. I have an HDMI cable, display set for widescreen in the display setting and HD,  we have two controllers.  My kids are young soo we are not \"online\" so how can they  both play at same time? I cant log on my son when my daughter is logged on, the game does not recognize him from player list.  My thought was does this only wotrk if two Xboxes in the house? that seems crazy if game allows two player and split screen.  What am I missing? Please be kind if I got this all wrong, I am not new to PC gaming just Xbox", "for gods sake, they say they're getting 1.9 and instead they update other consoles", "Apparently, I've heard you cannot use the Wii U gamepad to manage inventory. It would be a feature that would make the console stand out more. Not sure though.", "So sad.. i just had to realise that the Minecraft Wii U Edition is only a carelessly made xbox360/ps3 port. it even stutters in local coop. thanx for grabbing my 30 bucks.", "I have an idea to make it so minecraft Wii u edition can attract players to IT and not just old PS3 and Xbox 360 editions.\n2 Words, NINTENDO, SKINS!!!\nThen people can play as Mario,Luigi,link,toad,Kirby,and more!! Please add this!", "If you make skin packs in the Wii U then I don't care, it's enough and I already have minecraft on my pc so I don't have to.", "So, I have been hearing that Minecraft Wii U edition will be available as a retail disc on a later date.", "Words of caution... 1. Local multi-player doesn't work unless you have Wii U Pro Controllers (wii remotes are not supported) 2. If you buy a 3rd party pro controller (like the Afterglow) it has a problem with the analogue sticks not working correctly.  MOJANG, you need to sort this out ASAP.  Not happy!", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "I actually held off on the PS4 and XBONE editions just so I could get this on the Wii U... only to find out you made this the size of the 360 version (I'm sorry, but there is no excuse for that.. Xenoblade Chronicles X proved that hardcore) and my desire for this version plummeted.  I know everyone's upset about the lack of gamepad management (I  mean.. that would have been smart), but I'm disappointed in the basic game size limitations you implemented that was based on last gen file size limitations that are NOT present on the Wii U.  \n\nLazy... Lazy... Lazy.", "Reading through the Article, the \"Remote goes missing\"-Line is invalid, as you can use the WiiU-GamePad for that (it's that little TV-Button next to the Power-Button on the WiiU-Gamepad, that gives you an overlay, that actually controls the TV like a Remote).", "I've already bought minecraft for my daughter for christmas, she is getting a wii u and a million other things with it this year and we made sure to download minecraft before wrapping it.  My question is (and it is a stupid question. I already know,  please no rude comments.  She will still play it either way) her father noticed that it had wtf comments being said in the game and wanted to see if expressions like this or worse are said in the wii u version.  I've tried researching it and seeing that wii u is geared toward family more,  I figured that they could have taken that out.  Just curious. It won't make or break her playing it unless it's actual a ton of real cursing.  (She's 8... if she was 14... it might be different in our household.. idk yet. .. she isn't there. ) anyway, thank you in advance", "So if he already has minecraft for PlayStation can he just download the Wii U version? And he wants it for my Mac but I'm worried about him messing up my computer?", "Yes, thank you for not supporting the biggest feature of the Wii U, and thank you as well for forcing us to buy texture packs we don't give a crap about.", "When will Mojang release the Nintendo 3DS Edition of Minecraft?", "I take it that it only runs on Wii U and not the original Wii?", "Whoa? Now wii u? Minecraft doesn't look like a Nintendo game to me", "This needs regular controller support for multiplayer.  When we have the classic pro controller and regular Wii motes there should not be the requirement to have to shell out fifty dollars for a new controller for two people to play.", "Minecraft... Y U NO MAKE MINECRAFT 3DS EDITION YET?", "when is minecraft wii going to come out", "I've  going to buy minecraft wii u edition", "Yeahr  but Microsoft can make it better / but they wil win with Xbox not with Wii U", "My Nintendo e-Shop says Minecraft dosent exist!", "Minecraft Wii U version is having issues with saving files. The file appears saved, thumbnail is correct picture of progress, but when you open the file it is gone. Everything is gone. It has happened to my daughter now three times. I have looked online and it appears to be an issue with no answers. Very disappointed. :( She makes sure to save each time before she exits.", "Bought the Minecraft Wii u as soon as it came out expecting the same as what my son has on his PS4 and am very very disappointed with the fact that I do not but paid more for mine?!?!?! I doubt it would have been hard to have made it the same!!! It's way too limited! The update 1.8.8 needs to hurry up and get here!!!!!!!!!! This is just flat out ridiculous!!", "Anyone want too join my server its 16+ up Must be Able to follow the rules but im looking for new minecraft buddie i have no one to talk too in my game if your interested pm me", "I updated to the new version. The windows update is great, but the pocket version for my ipad won't load. I get an error saying \"invalid or corrupt skins\". How can I fix this? I went onto some forums and they weren't any help.", "Man, you guys really love your micro-transactions. Pretty disgusting when PC players have access to whatever skins while the console are restricted to  some default skins and DLC packs.", "Good skin pack i liked the skin of steve:D", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "Is there anyway for my kids to use voice chat with each other with microphone/headphone combo when playing together on LAN on pocket edition using separate tablets?", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "they should add the ability to craft diamond,gold,and iron rods so that you can use diamond sticks e.t.c to have even more durability on items that need wood sticks to craft", "I have  minecraft pe but I don't have minecraft pc", "My daughter wants Minecraft for PC for Christmas. I found the download card in Game Stop but how would she purchase different packs/skins for that version???", "I can't wait till you add stained glass, dispensers, prismarine, pistons, and other red stone items for pocket edition", "its in the minecraft ps4 edition too i like it :D", "Invalid or corrupt skin show when i play multiplayer??? Please fix this...i tried to use steve skin but ot still the same please fix it", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "Why didnt you reals  the the playstaion skin pack", "Hey if you like minecraft come check out my channel! Type in KalebMorrow into the search box and enjoy minecraft and much more!", "Very good minecraft but \nwhere is the minecraft 2.0", "Why do i have to pay for skins when i can actually change my skin? Oh yeah, ITS BECAUSE IT HAS 3D MODELS.", "I like skin in minecraft is stampylonghead", "Play this server 162.244.165.91:60540 Very fun factions server mini-games comming soon!", "I miss the days of Notch. Buy it once, and everything present and future is yours.", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "Guys so yeah if there was a minecraft game that could put a game mode that puts in real life  put a disc of Xbox of minecraft that puts in \nReal life okay", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "i'm just the mom so please don't  yell at me if this is a stupid question but are realms on xbox live???  my son has been playing windows 10 on the pc and has been dying for an xbox so I am getting him a xbox 360 for his birthday (can't afford xbox one, so sad  :(     any info anyone can give me about what minecraft on xbox 360 would be awesome!", "why cant minecraft be a steam thing ? i still have minecraft cracked version.i really want minecraft on steam.i can only buy games on steam (trust only steam)", "Chicos! entrad en play.minecloudnetwork.es servidor minecraft no premium y premium sin lag y skywars igual que cubecraft y Factions hay youtubers famosos! a que esperas UNETE!!!", "Pls help me i want to join minecraft on pc  windows 10 but the minecraft has a problem with the graphix crard and i updated but there still the problem help", "This is amazing works by amazing people and the best learning tool for the brains of children with adhd, add, and autism! Thank you to the creators and God bless them! Have a most amazing and blessed webtime everyone!", "LOGIC GATE QUESTION: Ive developed this logic gate, but I dont really know what it would be its classification.  Two inputs. lets call them A and B.  in order to turn it on, A and B must be on. So its like an AND gate.  But then to turn it off, ONLY A will end it.  B has NO SAY.  What is this thing?", "Could you see if someone maybe has a minecraft account not in use? I know someone who really wants to play, but is unable to buy it </3 it would go to  good use, I would be sure they didn't mess it up", "Where can I please Minecraft Realms for 30 days I see no testing Button.Was is that !!", "Great I was just charged full subscription price 5 days ago and to top it off we cannot log in on minecraft.net - but can log into the game and play??", "Hello I've sent you an email about forgotten password and I was hoping you could reply to it, I included all the information just it's been two days and haven't heard a reply.", "Yet another price in the world, which is now ending with a .99. I see the marketing department got it's hands on the product.", "got it today. my 5 yr old grandson loves it, i also got the halloween realm, he likes it even more and so do i,, we love the secret tunnels", "Never take a trial from Microsoft.  Even if you remove your payment method they'll wait for you to add another one for something else and then charge you for three years without your knowledge. >.>", "I'm all for online play, but with PC why can't we just host it ourselves? Am I not understanding something?", "Hey can you please Inc. a block gun.\nIf you do please make the gun where you shot 1 block then shoot another block for large areas.\nPlease Inc. it", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "Hey Mojang -- is it somehow possible for people to download maps your testing team make and use? (Just a map copy)", "Hi there at Minecraft, have you produced a calendar for 2016, I can't seem to track one down anywhere???", "Can you on the next update of Minecraft Playstation3 Edition can you put Armor Stands and the morph mod and new mobs and new dimension's.", "I get the feeling minecraft has turned into a giant windows 10 advertising campaign.", "coooool i play minecraft pocket edition for years and you do the trailer", "Awesome trailer. Also please make a new one for the PC edition too.", "When will minecraft Xbox 360 edition update???", "Minecraft pocket edition is easy for me now I'm one of the best players in minecraft pocket edition", "So I hadn't played minecraft on my steam account for a long time and I felt like playing it today and realised you removed it!! What the hell guys ?! I paid for it and everything and don't even have it on my computer anymore", "Am Excuse me Sir, Iam A filipino minecrafter and my minecraft did'nt work it has crash report, I Did all the youtube videos on how to fix this, it did'nt work, the crash says that \"I think you are modded\" and more crash reports, I am sorry minecraft makers, But CAN you message me? on how to fix this? Step by Step", "I love minecraft. Me and my friends can't stop talking about it.  I like having my friends over in my world's. Me and my friends love my Disney world I made! I will make it a server soon. Release date: the 29 of June, or Today! Look up servers, Disney world, and enjoy!", "i played this when it first ever came out of course i didnt pay for it and well the game was probably best in 1.2.5 but after that big bugs in the game appeared everywhere and i play 1.5.2 with alot of other people because people dont like updating", "looking outstandingliy good - now stop using time on mobile devices and bring more content for the REAL Minecraft on PC XD =D", "Hi, we made a new building guide for Minecraft. Look here please :)https://play.google.com/store/apps/details?id=sayzen.buildguide", "My 8 year old granddaughter has Minecraft for Xbox 1 but she also has it on her iPhone and her iPad. I asked her what she wanted for Christmas and she said \"Dogcraft Mod\". I don't know what that is and I have searched for that term for the systems she has but not found it. Can anyone tell me what (and where) it is?", "hi mojang ich hab mier jets auch hax heruntergeladen und es stimmt das spiel spilet man mit haxs nur richtig ich kann im nachihnin die leute nicht ferstehn die sich denken ahhh der haxt dan sind sie auch selber schuld wenn sie sich keine haxs herunterladen wie wollen sie denn sonst gewwinen etwer ohne hax :(", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "I love minecraft multiplayer sky wars", "Pls fix the bug with pistons. It is getting stuck. If u stack sticky pistons for example 3... The have red stones to activate the other two as they stretch, those two get stuck and does not retract.", "I'm still learning to stay awake while playing the game, that building is amazing, i wish they had more feature's in the game in itself.", "Look, I own Pocket Edition and it causes major strain on my thumbs to play on my smartphone for too long. No trailer can solve that issue.", "Come to New minecraft 1.8 \nwe got here:\n\nKit-PvP\nFaction\n\nSoon: Op Prison and sky Block!\n\nwe got all day DP we got good staff and we search for staff so come now!\n\n85.65.111.184:25565", "hello and ask yourself how you can dowload minecraft link is not? many links out there just did not use it. If anyone knows the link then send links to your inbox", "Here are some things I want to be added to Minecraft PC, consel, ect.\n\n1: Making the Ender Dragon egg hatch\nI really want the Ender Dragon egg to hatch after a few Minecraft days. What's the point of keeping the egg if nothing happens? Plus, you could tame the Ender Dragon and keep it as a pet, and you could fly it to places that are far away from your house, say you had a big world and it was hard to get around the place.\n\n2: Different dog breeds\nPlain wolves are getting boring. We should have different sized, colored, and shaped dogs to play with. And I hope they'll be respawnable. The same goes for cats. (And there should be Nyan Cat and Grumpy Cat skins for the cats)\n\n3: More skins\nTheir should be more skins for the players, like Creepypasta skins, FNaF skins, and TV show character skins. For example, a Rebornica's Mike Schmidt skin, Rebornica's incent skin, MLP skins, Steven Universe skins, Star VS the Forces of Evil skins, ect.\n\n4: More blocks\nThey should add more blocks like checkered blocks, sapphire blocks, ruby blocks, ect.\n\n5: More paintings\nThey should add more paintings like Youtuber paintings. For example, Stampy paintings, DanTDM paintings, Pewdiepie paintings, Markiplier paintings, ect. And paintings of video games like FNaF, Skyrim, Slender, Nyan Cat, ect.\n\n6: Minigames\nAnother thing I hope Mojang/Microsoft add is minigames, so you can play minigames like Block Party, Hide and Seek, ect with friends to keep every Minecrafter amused.\n\n7: Emerald materials\nThere's only one use for emeralds, and that's trading them with villagers, which is kinda useless. We should be able to craft emerald materials like swords, pickaxes, axes, shovels, ect.\n\nSorry if there's too much scary stuff in my list. I'm just obsessed with Creepypastas and FNaF. I hope everybody has a nice day! :)", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "Can one of the mojang people help me? When i tried to log into minecraft on pc it said in correct password or username when i typed everything in fortecy the i went to minecraft.net tried to log in and it said user or password is incorrect, so i pressed forgot password typed in my username and it said it was migrated and gave me a link to mojang to reset my password there. I sent the request to reset the password to my e-mail (this was about a week ago now) and nothing came. Its as someone changed the e-mail to the account. Help?????", "I need help setting up mods for my game. Never done this before. Yes I've watched YouTube and read forums. Doesn't help I'm not PC savvy. Help Anyone?", "A few weeks ago, I filled in a contact form about a stolen account, but I haven't got a reaction yet. How can I get my minecraft accounts back?", "OMG I did this in science the other day and all the kids in my class were asking me who was better steve or alex cause I'm the only one that plays and i said steve cause the alex arms scare me lol", "Here are some things I want to be added to Minecraft PC, consel, ect.\n\n1: Making the Ender Dragon egg hatch\nI really want the Ender Dragon egg to hatch after a few Minecraft days. What's the point of keeping the egg if nothing happens? Plus, you could tame the Ender Dragon and keep it as a pet, and you could fly it to places that are far away from your house, say you had a big world and it was hard to get around the place.\n\n2: Different dog breeds\nPlain wolves are getting boring. We should have different sized, colored, and shaped dogs to play with. And I hope they'll be respawnable. The same goes for cats. (And there should be Nyan Cat and Grumpy Cat skins for the cats)\n\n3: More skins\nTheir should be more skins for the players, like Creepypasta skins, FNaF skins, and TV show character skins. For example, a Rebornica's Mike Schmidt skin, Rebornica's incent skin, MLP skins, Steven Universe skins, Star VS the Forces of Evil skins, ect.\n\n4: More blocks\nThey should add more blocks like checkered blocks, sapphire blocks, ruby blocks, ect.\n\n5: More paintings\nThey should add more paintings like Youtuber paintings. For example, Stampy paintings, DanTDM paintings, Pewdiepie paintings, Markiplier paintings, ect. And paintings of video games like FNaF, Skyrim, Slender, Nyan Cat, ect.\n\n6: Minigames\nAnother thing I hope Mojang/Microsoft add is minigames, so you can play minigames like Block Party, Hide and Seek, ect with friends to keep every Minecrafter amused.\n\n7: Emerald materials\nThere's only one use for emeralds, and that's trading them with villagers, which is kinda useless. We should be able to craft emerald materials like swords, pickaxes, axes, shovels, ect.\n\nSorry if there's too much scary stuff in my list. I'm just obsessed with Creepypastas and FNaF. I hope everybody has a nice day! :)", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "Remember when Minecraft said we would be getting huge console updates at Minecon this year? Where is that promise at?", "Hello minecraft peoples where should i go for questions about system requirements of FTB  or how much ram/ video ram I need for \"x\" mods? I thought I had a powerful PC until it kept struggling with minecraft. it would stutter and take awhile to load things. I play with alot of mods and play in windowed mode while i do other things (surf the web, watch movies, listen to music, play WoW, work from home job, etc) so is a 2.9ghz dual-core cpu, 1gb video card, 16gb of ram not enough? how much do i need? probly at least double that huh? I'm pretty sure that the more things you add- the more it taxes your system. :/", "hey i have been trying to get on minecraft for a few days now but it says i have demo version only. i dont i bought the game in 2011. plz help", "sorry, but i have a lot of trubles with minecraft in windows 10, please help!", "When I try to load a multiplayer map, my game crashes and my launcher says, \"Unable to laod block....\" and so on. can anyone help me?", "Awesome! My 10 year old does a lot of coding. He'll love this", "Did this few days ago :)", "Did this in class it's actually pretty cool", "I need help on knowing how to buy Minecraft for PC", "We use it at school it is really cool I use it a lot", "Is there any movement animations like steve points a creeper with his fingers visible?", "can i have minecraft for windows 8", "We do coding at our school", "Everyone knows a minecraft creeper has tnt in its head", "Hey.Minecraft PE has a bug/glitch.I built a Cyristmas tree in my village and placed 6 snow golems with 4 iron golems.I tested a security feature by spawning a creeper but he went too near and my game crashed when the creeper exploded.Please tell Mojang to fix this plrases because I worked hard to make a big modern village.Thanks I hope to see a new update about the bug fixes.", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "guys i can't play online :'( whenever i try to login i won't let me login and whenever i try to register again i won't let me ......please help !", "So that's what is in a creeper", "Can anybody help me!How to install map in Minecraft", "Minecraft, PE has not been working properly on iPad Mini. Me and my little sister has has worked hard to build our land. When we try to add or delete stuff it crashes. Please fix it.", "Here are some things I want to be added to Minecraft PC, consel, ect.\n\n1: Making the Ender Dragon egg hatch\nI really want the Ender Dragon egg to hatch after a few Minecraft days. What's the point of keeping the egg if nothing happens? Plus, you could tame the Ender Dragon and keep it as a pet, and you could fly it to places that are far away from your house, say you had a big world and it was hard to get around the place.\n\n2: Different dog breeds\nPlain wolves are getting boring. We should have different sized, colored, and shaped dogs to play with. And I hope they'll be respawnable. The same goes for cats. (And there should be Nyan Cat and Grumpy Cat skins for the cats)\n\n3: More skins\nTheir should be more skins for the players, like Creepypasta skins, FNaF skins, and TV show character skins. For example, a Rebornica's Mike Schmidt skin, Rebornica's incent skin, MLP skins, Steven Universe skins, Star VS the Forces of Evil skins, ect.\n\n4: More blocks\nThey should add more blocks like checkered blocks, sapphire blocks, ruby blocks, ect.\n\n5: More paintings\nThey should add more paintings like Youtuber paintings. For example, Stampy paintings, DanTDM paintings, Pewdiepie paintings, Markiplier paintings, ect. And paintings of video games like FNaF, Skyrim, Slender, Nyan Cat, ect.\n\n6: Minigames\nAnother thing I hope Mojang/Microsoft add is minigames, so you can play minigames like Block Party, Hide and Seek, ect with friends to keep every Minecrafter amused.\n\n7: Emerald materials\nThere's only one use for emeralds, and that's trading them with villagers, which is kinda useless. We should be able to craft emerald materials like swords, pickaxes, axes, shovels, ect.\n\nSorry if there's too much scary stuff in my list. I'm just obsessed with Creepypastas and FNaF. I hope everybody has a nice day! :)", "Hello i'm problems a Minecraft :( Help please :( :( :( :(", "I have a question, if I buy my minecraft premium online then I can get my minecraft premium from another computer?", "Guys how to update minecraft in 0.14", "hi I like to talk to you guys because I naum I can put my original minecraft account of which I paid for it?", "can i have minecraft for windows 8", "They are improving combat mechanics, they are fixing the boats, and minecraft is coming to Wii U. Now you don't have to watch the video.", "Well... I think maybe Minecraft needs a little bit more colour... Like more blocks, more possibilities. New biomes, new skins, new mobs! This may put your mind thinking! :D (Yes I know it takes a lot of time and effort for making a game. It's just my honest oppinion and I really think all of the MC staff is really great and they are doing anything possible to make the game even better!) PS: At least make Herobrine a boss because I really want to defeat him!", "Here are some things I want to be added to Minecraft PC, consel, ect.\n\n1: Making the Ender Dragon egg hatch\nI really want the Ender Dragon egg to hatch after a few Minecraft days. What's the point of keeping the egg if nothing happens? Plus, you could tame the Ender Dragon and keep it as a pet, and you could fly it to places that are far away from your house, say you had a big world and it was hard to get around the place.\n\n2: Different dog breeds\nPlain wolves are getting boring. We should have different sized, colored, and shaped dogs to play with. And I hope they'll be respawnable. The same goes for cats. (And there should be Nyan Cat and Grumpy Cat skins for the cats)\n\n3: More skins\nTheir should be more skins for the players, like Creepypasta skins, FNaF skins, and TV show character skins. For example, a Rebornica's Mike Schmidt skin, Rebornica's incent skin, MLP skins, Steven Universe skins, Star VS the Forces of Evil skins, ect.\n\n4: More blocks\nThey should add more blocks like checkered blocks, sapphire blocks, ruby blocks, ect.\n\n5: More paintings\nThey should add more paintings like Youtuber paintings. For example, Stampy paintings, DanTDM paintings, Pewdiepie paintings, Markiplier paintings, ect. And paintings of video games like FNaF, Skyrim, Slender, Nyan Cat, ect.\n\n6: Minigames\nAnother thing I hope Mojang/Microsoft add is minigames, so you can play minigames like Block Party, Hide and Seek, ect with friends to keep every Minecrafter amused.\n\n7: Emerald materials\nThere's only one use for emeralds, and that's trading them with villagers, which is kinda useless. We should be able to craft emerald materials like swords, pickaxes, axes, shovels, ect.\n\nSorry if there's too much scary stuff in my list. I'm just obsessed with Creepypastas and FNaF. I hope everybody has a nice day! :)", "The WiiU has been an obvious ideal platform for Minecraft for years. \n\n3 years later, I sincerely hope the fanbase treats the game as an afterthought as you did them. \n\nRidiculous that it took this long.", "hey minecraft can you put helping villager that mine stuff or listens to you that would be great and a new ore like amber please do it it would be more fun.", "Is Minecraft available for Nintendo DS?", "This'll make Minecraft like EVERY OTHER GAME EVER.", "Yes, destroy minecraft even more. Thank you Jeb!", "When are you going to put horses in the game of Minecraft PE???", "I have all handbooks of minecraft they are very cool", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "can i have minecraft for windows 8", "before i get hyped, will the seeds on PC work the same way on wii u", "Jeb do you have PC edition? if you do please advertise mineverse.com server please!!! its an amazing server!!! from (Quoik my Mc name)", "I have a question, if I buy my minecraft premium online then I can get my minecraft premium from another computer?", "anyone want to play minecraft on ps3 btw username is sabrina_levy", "Play this server 162.244.165.91:60540 Very fun factions server mini-games comming soon!", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "league of legends is better than minecraft :)", "+Minecraft  can u plz tell the creater to make a way where u just click a button on ur console in the game to download a Mod!", "Hey there!!!\n\nBuy The Minecraft And I want to play, how", "HELL yeah minecraft wii u edition so getting it so coool omg omg looking forward to playing ot on the nintendo wii u Yesss thanks mojang", "The WiiU has been an obvious ideal platform for Minecraft for years. \n\n3 years later, I sincerely hope the fanbase treats the game as an afterthought as you did them. \n\nRidiculous that it took this long.", "If minecraft is at Nintendo  wii u it will be so good if have it cause I can play in it also # happy", "who cares when nintendo is making a new console?\nwhy buy wii U games when the wii U is about to be obsolete\n\noh also there wont be any mods and there will be DLC which i hate\n\ngive me a full game, not half a game and then charge me more for the rest of it like you did with smash and mario kart 8", "Really? Microsoft is publishing one of their games on a non microsoft console? That's a surprise... Like I can get playstaton, because I'm pretty sure minecraft was available on playstation before microsoft acquired the IP.", "When will Minecraft be released on Nintendo 3DS?", "I think we all knew it was coming really. And who is going to buy it apart from Wii U owners when you could easily just buy a Xbone or a PS4 and play it on there?", "You bring it to wii u and you don't use the selling point of this version, the gamepad inventory control?!?!?!?\nDon't wonder why it won't sell after SO MANY YEARS and without the most obvious feature you could add!!!?\nJust like watchdogs....", "There, Minecraft for the Wii U. Happy?", "I cant treat the wii as a serious console... xbox (xbox one in particular) and sony have raised the game to such an extent that the wii looks and feels hopelessly outdated", "Yes finally they made minecraft wii u edition", "I can't wait for it to come out on  the Wii u", "Lmao Wii U? Barely even a games console! Nintendo need to stick to hand held devices, they're consoles have plumeted since the gamecube, its a surprise they're even still in business let alone releasing new games lol #MicrosoftSonyOnlyRunners", "if minecraft is coming out for wii U then it might come out fo 3ds/2ds", "Ask them to let people upload lets plays for it since Minecraft has a huge amount of YouTubers. It'll help advertise Minecraft and the Wii U.", "What's the point when they haven't even sold as many Wii Us as copies of Minecraft?", "I can't wait to buy this game for my wii u", "Minecraft Wii U edition comes out 3 days after my Birthday wow.", "I swear to god.. If you can't mine by swinging the Wii controller i'm going to be mad. xD", "Evrybody says that the wii u suck but ots not true is awsome i like it  coment what you tink or if you like the wii u too", "My daughter and I are looking forward to this!!!\nI hate messing with the Xbox 360. My daughter has a Wii, but my husband bought me a WiiU a couple of years ago for my birthday, and I share it with her (I've always shared things with her... more fun that way).\n\nWill this version have texture packs available?", "You should make one for wii", "what I am finding to be a pain about minecraft is that I own the xbox 360 edition both in hard copy and live edition I also have it on my ipad in normal and story mode but if I want it on pc I have to fork out for it all over again, olus when I upgrade to xbox 1 I then have to pay nearly 80 for that edition too", "in my opinion, minecraft story is not a very good game at all, it has the game play of a 2001 online flash games. and honestly the demo bored me to death.", "I saw achievement hunter play it. There's four kinds of heroes in the game and you could only be the one who follows the footsteps of the one who fights monsters with swords and shtuff.\r\r What about Redstone? I would totally beat the bad guys with Redstone contraptions.", "Sigh... i just dont get why they didnt make an original game?\nAs they had to come up with all characters and the plot, why not also make some original graphics? (As i am sure the game is not run in the java engine anyways)\nThe only reason for this to take place in the minecraft universe is to get into fans of the franchise pockets.\nI aint saying it is a bad game, i just dont see why it has anything to do with minecraft -.-", "Dear Minecraft fans,\n\nmy 10 year old son Jonathan is a huge fan of Minecraft. I have been working for over 11 years as an architect myself and I was very happy when I heard that he wants to play Minecraft (instead of some killing games...).\nFrom the very first time I heard of Minecraft, I thought: what if there was a possibility to give players the knowledge, in the same way like Minecraft, on how to build buildings or other things in real life?\nI have created a concept and I would really appreciate your feedback before I go and spend money (which I don't have) in making it happen.\nWould you be willing to have a look at our concept?\n\nThank you and best regards from Berlin,\nGeorge", "Will there be episode 4 which that after Ellegard or Magnus dies,the Witherstorm is still alive,then what next is unknown.........", "Minecraft Story Mode's third episode is the best so far,but that brevity is the biggest complaint, which, if you look at it from the most charitable view, means the game never outstayed its welcome.", "Hey Mojang, in real life.. eating raw meat could be dangerous.. so why in minecraft no bad effects when somebody eat raw meat? Also why Grum remove dirt and couarse dirt in minecraft? Couarse dirt can be used as decoration. Well.. not alot of people use it as decoration. Why would minecraft be akward? ._.", "If anyone is interested in joining my Minecraft realm, just direct message me your Minecraft name and I will add you ASAP.", "Hi everyone i have a problem with minecraft i would love some help becouse   \nEvery time i click the multiplayer button it crashes my game", "I love Minecraft but Mojang is Horrible they don't respond to any email and they just suck I have lost 2 accounts now to Mojang for no reason and they don't care about any of us players...", "Believe me Minecraft Story Mode is really awesome. It has a bit of jumpscare. Its funny alongside its gripping storyline", "cannot download minecraft story mode episode 3  on ps3  is there  a delay", "Its not even Minecraft. Its a story with a Minecraft theme to it.", "What Funs of Game (Minecraft Story Mode???) :)", "minecraft is the best game in the world ever", "do a new mon its called wither storm like on minecraft story mode", "Leave a like who wants to see the legend of minecraft 'HEROBRINE' srew u minecraft sice u deleted herobrine the game sucks", "Minecraft story mode is terrible, I would never buy it", "I been have minecraft story mode it's cool", "Fwoof.  80 bucks is heafty for a watch.  Even counting in Vanilla Minecraft PC's cost of around 30$, that's 50$ watch.  I could buy a fairly large external hard drive or USB and a watch and do about the same with it, maybe buy a sticky of the Diamond for flare.", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "Minecraft Hello there. Im a work from home mom with 3 kiddos. My son is 9, and daughters who are 4 and 5. They all have really been into watching YouTube videos on toy reviews. and have even expressed interest in wanting to make their own videos. So... Here I am. I am writing to see if your company will be looking for any reviews on new product? Thanks so much!", "hello, Mojang, Pocket Edition game and enjoyed congratulations execelente game but like any player I wonder if you guys will put the portal end, this version would be really cool and good for the players this version know the work but this in leave very cheerful and happy to help us it please mojang put the end to be happy .. thank you.", "Hehehe,have some questions,why on sed:\"90210\" inside the nether world that have a giant castle/ruins,I found a saddle,but my version was 0.12.1 build 3,pocket edition,I need some answers...", "Anyone know where I can get a Minecraft Case for a 7\" Kindle Fire????? My son really wants one!!! Please and Thank You", "My minecraft is not letting me load my world. I play the xbox one edition, and all my worlds are saved with a dirt block", "So you pay $80 to play minecraft i already own? Whats wrong with putting your savegame on a $5 flashdrive? People buy everything af long as it had a brand on it... You guys are just abusing simpleminded folk who are gullable. Shame on you.", "If you actually look it up, for all the nay-sayers, this thing is WAY more durable than any standard usb drive.  No you don't play it ON the watch.  The whole watch feature is just a sidenote to what the product is.  The point is to have your MC on the band, so that you can plug it in to any computer, anywhere, and play on your world with your account, without having to be online and host a server.  the computer doesn't even need to have MC installed.  80 bucks is 80 bucks, but if you got it to spend, this thing is awesome.", "My user interface controls in my  Mine craft realms do not operate properly, I have imported one of my worlds twice & it claims it is downloaded but does not load but loads a completely different world from its own data bank.  Makes me think twice about the watches capabilities all in all.", "I'm trying to get more animals in my world, but when I try to breed them it says the maximum of animals in the world has been met. I barely have any animals. And I tried going around to see if I could kill wild ones and I can't find a single wild animal. Is this a common problem? Is there a way to fix it? I'm on ps3 version.", "So, what's the difference between this gameband and a flash drive?  You can wear one for 80 bucks with a watch on it, or you can buy the other for 10 bucks and put it on a keychain. You can literally buy anything better than a gameband for what it's worth.", "Anybody have any advise? i bought minecraft for my Pc around October 4th and have been playing it for a while and i got on it today and it logged me off and now when i log back in it says play demo and it says i need to buy it??? help.", "Hola, disculpen.. Tengo un problema.. Instalo minecraft en mi pc y al abrirlo me dice que hay un error, pero pues me han dicho que mi pc si aguanta el juego", "They should make a minecraft trample run where u have different skins and having the ender dragon chase u", "MCCE - Mc clock edition, with HD display 1x3cm (advice: you need a microscope to play on it)", "I love this thing I got one and I am a computer nut and I did something fun . I put it in to a windows 98se and the game ran fine will 45fps at a high and 20 fps low it is not a computer  i would play on all the time but in a pinch. so I am going to buy one for my wife and two kids. and the price is good you are paying for a mini computer the taps into your  video and mouse and keyboard and the game runs off the band is self that is way it is 80  for the diamond and i think 50 for the redstone. I am sorry but people need to read the specs of some thing before saying it is over priced . gameband  is cheap for what you get . and i tip my hat to them for making the band less then 100 not more .  the band is a tool just like buy a ps4 a nintendo wiiU,ora xbox 360 or xbox one to play minecraft on.  .", "Big awesome smart gameband i like diamonds ore but now you can made good idea mods Glow or Black redstone", "This is an the intended same thing as a well preserved known as to the intended recipient only and for your time to meet get the a and team to help", "My Stream Name xRuSHeR_19 live Playing minecraft", "Hello,\nJust log in and you will earn great prizes in Heroes of the Storm!\nFor further information check and join the Nexus! https://battle.net/recruit/VXPWWWQTT7"]