["I guess what you're asking is, if he'll be after his own interest...", "Read the article lol not the heading. Wow. People are dumbasses. That's why you should have to pass a test to vote haha", "Isnt this largely the gypsy community? Not going to break down centuries of tradition.", "Ha! sauce for the goose. But I can just see all the GOP extremist heads exploding that blue states are now going to use the same argument red states have been using for 8 years.", "Mainstream media is churning a lot of fake news. I don't even think news from a website run by a teenage from his mother's basement is a problem. The real problem is with mainstream media throwing away the journalistic book and playing propaganda on behalf of special interests", "I  saw her in concert a couple of years ago. She was so good and her connection with her audience was wonderful.", "Racism is a minuscule part in what people see as mismanagement of globalization. It enriched only a small part of the population leaving a lot of people feeling short changed.", "Obama needs to get his butt out to Standing Rock and put an end to the police brutality going on out there. He can afford to take a loss on his investments and stop that pipeline.", "I cant in good faith pay my federal income taxes, or for medicare or Medicaid  (after all, I don't use them and have no plans on doing so)\n\nAnarchy\n\nSee how that works, muttonchops?", "I so fear the transition. The idiocy is amazing.", "Martin Garcia Kevin Ripley Bryant Kyle Goff\nColton Smith New Year's resolutions are right around the corner...", "a complete master piece directed from a genious who turned Gucci around completely", "You can not be a populist and \"not give a shit about human rights\". They are opposites.", "Every gym, every January. (New Year's resolutions that noone keeps.)", "Why should anyone be surprised? Hell, if Trump can be elected President it's only a matter of time before one of the Kardashians runs for the office.", "Anyone familiar with narcissists knows adulation is a sign of their neediness. Love? Never enough without it. They berate others to show who's boss which just shows they're weak and pitiful. Oh and money is usually their preferred \"drug\".", "Our daughter was part of the NOLS group on the Clarence River that they were searching for. All found safe and evacuated out by helicopter. Fortunately they were on the right side of the river because they watched a cliff on the other side collapse. They were very close to the epicenter and it was violent.", "Really? I read some of this article, the paragraph the the liberals have \"applied\" to Mr. Trump. First off, he isn't going to put Hillary in jail even though she really belongs there! OMG get a life already. Why, oh why, oh why can't you all just STOP THE HATE!! It doesn't do anything for your cause except make you ALL look like a bunch of spoiled 2-year-olds who need a time-out, a nap and a blankie! I am sick to death of seeing this kind of crap!", "Please stop referring to them as the Alt-right. They are Facists. \n\nUsing this watered down label is part of the problem", "There's no estimate for how far the leftist Marxist traitors will go , nor how far their delusional psychotic enablers will follow them !", "I think it is up to each person to do a little research and not be so naive (or STUPID) to believe everything they see/hear/read.  Maybe it isn't stupid.  Maybe it is just flat out lazy.  It takes some effort to think!", "Excuse me ! But this is how the government of the united States of America operates, any thing that trump wants to do has be approved by system of checks and balances people!!! Meaning that just  because trump says this or that does not make it so without congressional approval, mean!!! If you have a problem with any requests of the president trump then pickup your for or go online to your state represenitive and Senator and state concerns and ask about transparency on the issues you raise build a relationship with state elected officials that you vote to be in the position that they are and grow up and these complaints in the way this nation has established for you to , and quite acting like these government agency that are for the people & by people don't exist because they do!!! I believe that everyone of these protesters / rioters has forgotten how this government works! Because you sure as hell are not going about it the smart way or the mature way,", "America is the world's largest terrorist state.  Hillary Clinton is the status quo candidate.", "Alternately titled: A Study in Relative Sociopathology.", "Trump is a fraud. And democracy and the establishment?", "Reading the comments obviously written by single-digit-IQed people, one would wonder if this article was actually meant to be published in any b-rated tabloid rather than in The New Yorker magazine? This attempt to discredit one of the finest theologians of the XX Century is simply pathetic; it doesn't do justice to Benedict XVI, much less to truth, accuracy and intellectual honesty.", "I'm proud of Glenn I think he genuinely sees a problem with the new white supremacist dictatorship we have, that makes him an ally in my mind.", "Karl Rove and Strom Thurmond had a love child and named him Steve Bannon.", "Congratulations! Do your best and leave the less informed to their own internal hatred.", "He's the prez. As long as you know that marching is for yourselves. If it gets violent, you are playing right into Trump's hands. March, but beware of the Anarchists. They are not your allies", "The question is when resiliency runs out....then what....there is only so much one can sustain", "Just watch predators or pedophiles come to the rescue! Real Background checks are a must to protect all children!", "It was just an item on his bucket list and America helped him acomplish it.", "This zuckerberg  guy is another one with too much money living in his own little universe!!! \nI don't think he really cares about this in any way, shape or form...  People with some intelligence do research and look for facts and truth , is not that hard....but they do bear some responsibility as what is put in FB....", "CONTACT YOUR REPRESENTATIVES! SPEAK UP!!! http://www.senate.gov/senators/contact/ http://www.house.gov/representatives/find/", "Where are democrats defending the working class that does jobs others won't do?  Where's the Justice to get AMNESTY back again?  Work permits and NOT to break families apart?  People need their representatives and minority leaders to stand up for JUSTICE  not a quick fix and RACISM!  \n\nIf the immigrants' native countries are not supplying work for their poor, these countries ought to be ostracized and be given sanctions to help their people. But the reality is now...\n\nTrumps evil machine would rather deport immigrants that could be working bringing back industries that can pay these immigrants and have a work contract...let's all protect those hard workers that have been here to help businesses make it without a voice or unions or equal pay! \n\nThey can bring back millions of industries if we could only make the system work for everyone!", "OMG <3 finally found the link original M0vie.\n\n(Y) Almost Christmas Full Movie\nhttp://xixixi-onplay.blogspot.com/2016/11/almost-christmas-full-movie.html\n\n(Y) Boo! A Madea Halloween Full Movie\nhttp://xixixi-onplay.blogspot.com/2016/11/boo-madea-halloween-full-movie.html\n\nDoctor Strange Full Movie\nhttp://xixixi-onplay.blogspot.com/2016/11/doctor-strange-full-movie.html\n\n(Y) Fifty Shades Darker\nhttp://xixixi-onplay.blogspot.com/2016/10/fifty-shades-darker.html", "Terminal illness. Or, near fatal car crash. Or, daughter just got knocked up by black guy. In any case, too little, too late. This is post Kathy Griffiths, San Bernardino, half a dozen school shootings. You deserve your place in hell, Glen. Nice try, though.", "\"Make America Great Again\" harkens to a time where \"great\" was separate and distinct. When hate was cloaked in \"justice\" and supremacy was \"law\". In many ways this still exists, and to be told that in a \"post racial\" society that such animosity is a collective imagining is a callous insult.\nThe language is key.\nThe action is key.\nThe thought is key.\n...and have said simply, \"I exist. I matter. I'm equal in every respect deemed less. I will strike when threatened. I will love when loved. I will embrace you as my kin, or I will cast you out as my enemy.\"\n\nAs was said in the 60s....\"Can you dig it?... E. Robert Royster III", "\"The bigger the hat, the Sillier the FOOL wearing it!\" - Me -", "But it certainly the end of the so-called Obama legacy", "Cmon fellow liberals, you cannot profess to know his true intentions or genuineness, he's an ally in the fight so let's not burn him on the liberal altar of political correctness and past grievances. Hey if Glenn can change then there's hope for this country.", "It hurts to know your being replaced by a soulless monster", "Trump supporter here. I'm outraged about Mike Pence not having a safe space in a Broadway theater but don't care about Trump defrauding thousands of hard working Americans through Trump U.", "Illuminati will stage an alien invasion in order to usher in their nwo", "And all his little followers thought he was going to drain the swamp.  So many stupid, hateful little people too stupid and too hateful to see the truth.  Now we all get to suffer. #notmypresident", "We'll give Trump the same chance that Conservatives gave Obama.", "Don't know whether to laugh or cry!", "He is neither Republican, nor conservative. Trump wears whichever hat suits his own personal agenda, nothing more.", "the story was lazy and nothing added up. it took nearly an hour for her to write her name. the droning pace was not worth the loose ontologic reckoning or what have you.", "that's the truth. a force of nature!!", "Any type but Marxist eco-Nazi zombie walking dead Democrats.  Ann Coulter would be a great choice for the USSC.", "What is wrong with ladies maintaining their virginity and staying in their parents house till they are married ? Hmmmmm", "Johanna Holtan - thought this might be of interest", "I succumb a bunch of times and then ultimately when the succumbing becomes too exhausting to take, I surmount.", "Idk, there's a large demographic of adamant \"vulgar\" Leftists in the realm of Podcasts. I'm not sure where you draw the line. Marc Maron was apparently big enough to get the president on and apparently get him to say the N-Word. Idk if that particular demographic of the left is ever going to die out. I'll say that there are some like Citizen Radio that may be conglomerated into that. I'm not personally too fond of it. It think it's very tropeish and kind of dastardly in it's approach. And I think a lot of it is the \"Echo Chamber\" that a lot of people in the realm of Legitimate Political Journalism would deam counterproductive. A lot of the times they're willing to make exaggerated hyperbolic claims that carry more weight than a lof of conventional journalists can't achieve. Apparently that's bad but you have to admit or at least recognize, right now more than ever, there's a populist movement that would be gained from trying to appeal to these people's sensibilities. Bill Maher has a very openly sometimes \"intolerant\" view and trust me this is the same core Liberal Demographic that has a tendency to parade in it's own pretentiousness, avoid pretenses of classism and anti-populist lay rhetoric and there is usually a pompous demeanor there. What makes you think this entire Liberal demographic, which I even find just as deplorable as many of the \"deplorables\" named by Hillary, are going away? And what makes you think these guys haven't monopolized much of our Entertainment Industry. I hope they shape up. They've been a complete disconnect to me for years. Aside from Bill Maher, Citizen Radio with Jamie Kilstein and Alison Kilkenny. I think there's a whole revamp that would useful. No minority as well-read as I am wants to hear white guys talking about how intolerant the Republican Party is while they revel in their insulated peer groups and claim to be advocates for anyone but their own coddled selves. It's become a pretty disparaging look. And best believe it trickles into many aspects of Nerd Culture and supports a whole sleui of Journalistic Culture. \n\nI will say though that despite their monopoly on Liberal culture as a \"Subculture\" that they really do dominate pretty well in I don't mind hearing some disparaging remarks that harshly condemn a lot of Republican thought without remorse. That's unfortunately a lot of the ironic \"Politically Correct\" enclave of a lot of Liberalism. I can't imagine them being any less relevant this time around.", "Tried to avoid this bulls##t  but no oooohhhh the freaking idiots could not be swayed", "Be afwaid.  Be vewy vewy afwaid.  Twump is a wacist and a wapist.  Be afwaid.\\", "Maybe they've improved some, but I gave this a try and it is three obnoxious bros who are very, very funny...to each other.", "Is there a mandate that we fact check everything now before we discuss it? Before FB, when we watched a show or read something in print, we never asked each other about the validity of the information with such vehemence. Fake news is not unique to Facebook. Fox News reported false information, then apologized, then reported false information then apologized. only paying attention to what you already believe is not an invention of FB. Many people like to watch The O'Reilly Factor as their main news source. I don't but I know people who have it on pretty much all day. Both sides have blamed fake news for election results. Both sides have claimed inaccurate information from media. We should point out mistakes but I think it's interesting to hear the definitions of what constitutes a \"valid\" source. I know some sources are fake and serve no purpose, but how many are just lesser known? How many are quiet voices of dissension with valid messages that just don't have our respect yet? How many can be compared to the random leaflets produced by independent people who used to stand on the street because no one would publish their radical ideas, who are not journalists, but who are trying to get the word out? Remember William Randolph Hearst? The media tycoon who \"invented\" a war so he could sell newspapers? For profit media is not here to protect the public. We have legal precedent that allows the media to report false information. Whether it's a FB feed or a string of shows on TV, it's a good thing that we have the ability to choose what we watch and read. It's a good thing that FB is a forum for virtual leaflets from the voices of dissension from all sides. Read what you want. It's your right.", "This is why I have sympathy for immigrants here's an old British sign that is still up in a corner store. 'No dogs. No blacks. No Irish' is now Ukip policy. I'm irish", "The rural West is anti-authoritarian too. Try to figure that out with Trump's Putin tactics.", "Had the Democrats chosen Bernie Sanders, the outcome of this election would have been different. But the DNC wanted to \"make history\" with the first woman President. Lesson learned for 2020? Probably not.", "A worthy read, but little consolation. A reminder, though, that we don't learn from our mistakes.", "They're not \"draining the swamp\" - they're just letting all the scum rise to the top.", "I just read this to my husband and he said \" at least she asked\".", "I still think Roz Chast is the only cartoonist that is funny. New Yorker- step it up. Your cartoons are mostly terrible anymore. Meaning- not funny. What happened?", "And speaking of bald eagles, Rockwell Torrey this is always good for a laugh, to see that fat wuss Trump frightened of a supposedly tame Eagle that is tethered. This was highly symbolic I think.", "Duh. He lied.  And all the stupid people and the racist people in this country bought his line of bullshit. Unfortunately, now the rest of us have to eat it too.", "I would be at the protest if I were physically able to.  Iwill be there in spirit.", "Trump will prove to be a great President and America dodged a bullet by not letting Hillary in", "Is this where our work \"kack\" comes from? Or the German, \"hast du kaka in der hose?\" This is what a mum would say to a wee toddler still on nappies. No further translation needed I think!", "The good news is; the average Republican, as far as I have seen in my own life, has absolutely nothing in common with Trump.\n\nThe bad news is; the average Republican, as far as I have seen in my own life, doesn't seem to actually realize that, on any level.\n\nMonkey see, monkey do.\nBut hey, that's how fascism works, as I have learned this year.", "Chris Dowson \"massively successful Alt-right memes\"? Like which ones? I've been following the meme markets for quite a long time and I have yet to see a certifiably dank Alt-right meme.", "WHO is THIS?? Seriously! I grew up on Rap Music, WHO IS THIS?!?", "He googled it? He's been saying for a year and a half he is going to get rid of it without even knowing anything about it. How can we get rid of this moron?", "Con man...rips off everyone he does business with...", "So they're pretty much the \"Storm Front\" right now, lmao", "It is now quite clear to me that the kkk and white supremacist have taken over and are now in charge of the United States of America. We have a lot to pray about. See you at church Sunday.", "Tsunami & J Hiroki business idea for you two", "Shouldn't even be news. A person is reading stories. Period.", "Human right comes after restoration of order...best option for a disorganized society.", "When children have children, society is failing those children.", "Republicans always cause recessions. A generation of financial incompetence and they still get in office.", "I will not let nazism be my  \"new political reality\" . What about that?", "Brainless U.S. Liberals. If they keep going with their anti-American madness, they may just succeed in destroying their country for themselves and their children.", "\"alt right\" makes it look like something... cute. It's not. It's fascism on the rise and you better stop calling things by it's names before it's too late.", "There is no business like show business! Another marketing effort to adjust the product to a wider audience. Why is anything this person states or issues considered newsworthy?", "Well-written and researched article. The Loving film is also well done. If not for this case and the work of civil rights attorneys and the ACLU, my own parents would have had an even harder time living in the US. Regardless of what the law determined, interracial couples met many challenges and outright discrimination; yet, many marriages persevered. Some of the comments indicate just how simple people can still be--grateful to the ACLU and the Lovings.", "Let him go. The more he fucks up, the more opportunities to get the idiot impeached.", "As a Greek I know what that really means and they're right.", "I just saw that word on 'word of the day'..fits the idiot's 'administration' perfectly!", "Hillary sold uranium to the Russians.  She belongs in jail.", "There simply are no worse people on the planet, aside from Moscow, Pyongyang, & Damascus.", "Oh so just because it's satire we're supposed to think it's not true", "You made me feel  so good !!!", "Spiced beef is my favourite part of xmas dinner - very popular in Dublin and cork. You need to do more research", "Sounds like someone's trying to find an angle into career revival.", "Good. The New Yorker should be alarmed as it is endagered because of its yellow journalism.", "Awful lot of trolls the comment section, especially from over seas. Almost as if they are getting paid. If you have never set foot in the US (let alone been raised here) you do not comprehend our situation in any tangible sense. Your indignation is a farce. Too bad your lives are so very empty you don't have anything better to do than to stick your nose in something you are not actually invested in...", "We all need to keep a keen eye on every single move he makes. Our democracy is on a very thin thread.", "BS but then we knew evil would try to BS fools", "our only hope when economy collapses...", "Obviously not for viewers who like their drama served in nice and tidy little packages. Lifetime and Hallmark Channel viewers, move along; there's nothing for you here.", "\"GIVE HIM A CHANCE THEY SAY\"\n\nAaaaaaaannnnnndddddd he continues to recruit Klan members", "According to Hamilton, the EC was supposed to get us out of that mess; but the giant corrupt repub pol machine was yet to arrive on the scene when he wrote his paper.", "I think you completely miss the whole point of the movie. The Novel that Susan read is her life with his ex-husband Edward, not a guy that lost his family in the desert, that is just an analogy of how Susan destroyed his life (and his future family) woth the abortion. Is all about revenge, because at the end, she misses the whole point of the book and goes to the restaurant, with a miserable life and an expectation for escape, and by not showing up, his revenge is complete, just like in his book.", "The actual \"basket of deplorables\" comment was not referring to the voters or supporters.", "What do these remarks here have to do with this article\n?", "It's just jealousy that these inspirational people are more gifted \nThey will insult and bring all minorities down to make themselves better. They don't cease to be idiot assholes.", "Can you make chicken salad out of ?", "what f$%king devicive bullcrap done with you Virginia Harney Leone", "Matt Lewis is quite possibly the dumbest man on cable news, dumber than the Trump nuts, who are mostly very clever (however evil they are). That the NYer would think he's qualified to speak about this issue is astounding...", "Make America GREAT again! What does it mean when a demagogue says it? In demagogue's point of view greatness is always about him or the selected few around him. Make America GREAT again is never about you, never has been, never will be. We don't need to go back in history to believe in it. Yet again the dark history is unfolding in front of our eyes as we speak but, nobody seems to notice, nobody seems to care. We like to entertain the idea that a demagogue will take care of everything and bring back prosperity. But this right here right now, is the greatest country on earth. Come back HOME!", "The Greeks???  The same Greeks with the worst economy in all of Europe?  Crushing Debt? Astronomical unemployment especially amongst the young?  Clearly they are the kakistrocracy.", "Going, going, gone and America sold to the abnormally tanned elderly gentleman in the back for a much lower price than expected.", "Oh, my God... <3 yess finally found the link original Movie.Watch FREE Live (y)\nAlmost Christmas\nhttp://5ky12.blogspot.co.id/2016/11/almost-christmas_19.html\n\nBoo! A Madea Halloween \nhttp://5ky12.blogspot.co.id/2016/11/boo-madea-halloween_19.html\n\nFast 8 \nhttp://5ky12.blogspot.co.id/2016/11/fast-8_19.html\n\nDoctor Strange\nhttp://5ky12.blogspot.co.id/2016/11/doctor-strange_19.html\n\nDon't Breathe \nhttp://www-4lexasky-com.blogspot.co.id/2016/11/dont-breathe.html\n\nKevin Hart: What Now?\nhttp://5ky12.blogspot.co.id/2016/11/kevin-hart-what-now_19.html\n\nFifty Shades Darker\nhttp://5ky12.blogspot.co.id/2016/11/fifty-shades-darker_19.html\n\nWhen the Bough Breaks\nhttp://5ky12.blogspot.co.id/2016/11/when-bough-breaks_19.html\n\nResident Evil: The Final Chapter\nhttp://5ky12.blogspot.co.id/2016/11/resident-evil-final-chapter.html", "Jane Mathew \"If a majority of Americans are getting their news from Facebook, then Facebook surely has a civic obligation to insure the information it disseminates is sound\"", "He's draining the swamp, replacing the monsters then filling it right back up.", "He's not draining the swamp, he's filling it.", "He's an opportunist he is not concerned with making America great again but making himself great again that was his whole purpose and running and people better wake up to the fact.  He's just a puppet of Bannon", "I thought facebook just made a big announcement that they were banning fake news?", "No offense to mentally handicapped folks, but America has elected a retard as our 45th President.....", "Try to understand the American election was about jobs and the lack of. Western governments in general, allowed in immigrants, temp. workers, refugees, people on work visas etc, to facilitate a drop in the cost of labor. Problem: with higher unemployment rates and the increase in poverty, people stopped spending, and economies stagnated. Now, voters who supported Trump are hoping that with the deportation of at least some illegals, they will be able to get work.. And unfortunately, the left, largely from the upper middle classes actually helped make all this happen, they can thank themselves for the fact that Trump was elected.", "I am so honored to have a sexual predator and racist as our predorsent", "cheeky is the word for it.  cheeky.", "Accept the change, it will be for the better, for your country and its people.\nYour country needed someone who cares about its sovereignty, you now have that.", "Look who his choices are enough said.", "Not surprising. The dems have always been the party of Nullification and Secession.", "I Don't understand some people up to now Continue fighting with Facebook for the loss of elections to DJ Trump but don't they it was poor fielding of their candidate hahahaha!", "It's t-minus five. I can't wait actually. Just to say \"see assholes\". Lol", "Anyone who thinks he won't be making the big strategic decisions - and essentially running the company - needs a blinders removal service.", "He will be a Trumpservative - whatever is in it for me, my family and my friends. Like his pal Putin. We are just a richer version of Russia.", "What's even more frightening is fake news sites can be created, then set up a FB page, pay for misleading ads targeted at their demographic and exclude those who might not agree with it or investigate it (FB advertising algorithms are that sophisticated) and as long as it is under FB's oh-so-important 20% text rule (sarcasm) and they pay - unless someone you know shares it -- you will never know what is being sold as truth in feeds behind the FB curtain. All other advertising comes with govt regulations (oh no that awful word that seems so unpopular right now) but not on Facebook. At least on Twitter everyone sees what's there...", "I believe things are gonna rattle him so bad, he might just come out of character and we will all see the real ugly...", "Not that it matters but you know why oppression occurs? Because assholes on all sides can't see past color and use it as a shield when possible and a weapon when applicable. The fact you see color in and of itself means you're more racist then the worst in history (off the top of my head I'm going to pull Hitler for that title) and don't even fucking act like \"the white opressionists\" are the only ones that do it. To many of all colors are racists and supremacists. The day you stop seeing and judging by color is the day this world gets better. Don't believe me that whites are not the only racists? If your black go to a Latino gang controlled part of town and tell me that won't be an issue.\n\nOh and here's a disclaimer for every wannabe fuck who's going to try to be cool: I didn't vote for trump, I think he will fail miserably and I hate law enforcement more than most because believe or not I'm a white male (\"uh oh the sexist, racist bigot who I deemed that way because I looked at his profile picture but have never actually conversed with can actually agree with me? Oh shit\") who has seen first hand what an overreach of power will cause in one's life. You wanna keep being racist? Not that it matters but *unlike*", "Glenn Beck needs to be \"In Opposition.\" It doesn't matter \"to who.\" Ratings.", "Change the school system for starters.", "Well since a Republican was Elected to the Oval Office. All those Conservative Media Talkers are Going to lose Millions of Dollars. They made Money Hands over Fist. When the Democrats had the White House. That's what it's all about.", "Better to ask about the Dirtbag Right that actually exists and makes good money on radio, starting with Rush Limbaugh and on down a revolting array of piss-ants right down to your local station (if you have one that is not a Clearchannel clone).  Plus the handful on TV at Fox News Channel.", "He should Google narcissistic behavior, sometime soon.... his picture should be right next to the definition.", "Ha, in this new world order NZ's geological woes suddenly become relevant to the New Yorker. But you know, Australia has drought and bushfires...", "impeach trump trial then firing squaud", "Lillian Blouin i feel famous nz is on the new yorker lol", "You know the good ole GOP!!!!!", "Beck is only doing what he thinks is best for his career. in the food chain that is Media Talking Head-ism, Beck has fallen out of favor in an overcrowded field of Pro-Trump Ranters. its a matter of survival for someone who has fallen out of the spotlight,, to draw attention to himself, again.", "Failure? Soon there won't be any Palestine left to occupy...", "PC is the disease,\nreality the cure\nfacebook.com/ThePCPolice", "He lives in his own stylish bubble of pomposity.", "dreams can go beyond frustration and Booing as \"a creative outlet.\" But dreamer must log-on & participate, interactively.", "Reminds me of Saul after his return to Jerusalem. For awhile everybody wanted to kill him for different reasons. People who's eyes are opened are often insufferable.", "Whether the articles are true or not isn't the issue. Lack of education isn't even the entire issue. The fact that half the country chose to side with racism, false patriotism,  and greed, is. Half. That's half the people at the grocery store. Half the people at work. Half the people at the mall, in your neighborhood,  in your town/state. Why? \n\nFear.", "Are we going to rehash the entire civil rights movement now? Awesome... Hey, Bernie bros and the rest of the never-Hillary camp, over the next four years, please take note of the magnitude of the greater of two \"evils.\"", "Pffff, ha, ha ha ha!  \nFor the record, the man read something!  \nHere's a lollipop, Little Donnie!\n---\nMore signatures needed! We're almost there!\nhttps://www.change.org/p/electoral-college-electors-electoral-college-make-hillary-clinton-president-on-december-19?recruiter=630505748&utm_source=share_petition&utm_medium=facebook&utm_campaign=share_facebook_responsive&utm_term=mob-sm-share_petition-custom_msg", "Of course Goebbels gets a corner office.  Now I wonder, will he head up the Department of Purging or the Office of Registry and Internment?", "It seems to me that you are one of those people who claim to know more things than you will ever understand. In fact I believe that the boiled potato that I'm about to eat has a higher IQ than you. Good day sir.", "Guess who has the bigger brain, the more experience and the motivation and love to create the feeling of independence without sacrificing safety. It is wonderful to see this in action. In contrast to these 'free range' parents who want everyone to give up parental responsibility to increase their chances that their unsupervised child wont become the target of very real predators by overstating the value of 'independence' and by using stats to equate the improbability of attacks with safety. The chances of stranger abduction are slim. Stats tell us that they are more likely to be harmed by an acquaintance. But two considerations: an unsupervised child, especially one with a repeating schedule, has a greater chance of becoming a target and the consequences are life changing if they survive even it and 2. Unsupervised children will also be more vulnerable to these more statistically likely acquaintances as well. You don't have to let parents bully you into creating 'herd immunity' for their lazy parenting - that is only reasonable against microscopic threats. Creative people are smart enough to garner the benefits of creating the illusion of independence for their pocket sized kids without engaging in social darwinism.", "yea I know.... Just might be the end of the world to some people...", "someone tweeted that he was draining the swamp into the cabinet!", "Geez, too bad the DNC didn't sh-t the bed and go with Bernie... :P", "Does this woman have any proofs of that? It just sounds like fear-mongering and that's it.", "Lesley, that's actually what I thought the headline meant, and it isn't that far from recent reality, if not today's.", "As with the loss of Tim Russet, Gwen leaves a huge void left in the objective field of reporting the news as it is, not as you'd like it to be.", "So Trump makes Putin most ambitious dream come true: to break the unity of the Nations.", "On my list of favorite films", "Hey Americans look on the bright side of vote for Trump is a vote against Snow.", "Which person is responsible for their own behavior this child cannot be saying those things and using the excuse that it's someone else's fault where are the parents and what are they doing about this", "The rednecks will be sadly disappointed when no wall gets built, and there are no mass deportations. Donald Trump is a salesman, and he did a good job stirring people up. He got the vote. Now he will settle down. It's all about rhetoric. And the Democrats should have gone with Bernie Sanders but they are more about \"let's make history\" with the first woman President.", "As meaningless an article as your article on the Venezuelan Socialist FAILURE was TIMELY. That's why you should stick to cartoons and fiction, New Yorker.", "The New Yorker, you are a propaganda instrument. I 'pray' that the number of your readers shall become insignificant.", "\"His level of egotism is rarely exhibited outside of a clinical environment.\" (Electoral College, please save us from this nightmare!)", "Trump administration = trickle down hate.", "Katya Kazbek this is what dreams are made of. also: lil miss hot mess is all of us.", "Old farts keep coming out! Lots of skeletons in the closet! Good grief this is so immoral, wrong wrong... I am still in denying...", "What type of Republicans? The hateful, racist, bigoted, misogynist,  xenophobic kind, in other words, typical Republicans.", "what kind of conservative? the sociopathic senile kind. Just with Evita Kushner, instead of Nancy Reagan,", "Why deface natural beauty with this absurdity?  The decline of art is a real sadness.", "Foul language is a disgrace to our nation.", "Writing in first person is a total bitch move", "Better late than never. Well......... one day he might have time to google Hillary. And others. Disabled people for example, and women.", "I've run out of my free New Yorker articles :( but so wanted to read this. \n\nWas this for the children or was it entertainment/public commentary for adults?", "Troubling, but there is more urgent business.\n\n It is high time to stop paying attention to Trump and devote our energy and communication to demanding that the current leadership of our government, the department of justice, all the organs of democracy, show leadership and begin to take the steps necessary to rein in Trump's illegal march to the White House. The real story is not Trump, it's the vacuum of leadership we're witnessing that is allowing him to dominate our national conversation with his insanity.", "\"Everything must be manufactured in U.S.\"", "So he was the only one who knew?...Bullpoo...dems were overconfident and depended on biased polling...the were deluded!!!!", "I was raised in a family that discussed politics and international relations every night at dinner.  We have raised our daughter in much the same way. We have fretted that more people don't vote.  Not sure that I will worry about that ever again. However, I will be an everlasting supporter of public education!  It's our hope for a well-informed public.", "Lol complain about fake news then go read the borowitz report... gotta love the left", "Good on her! She's making a contribution by reading to kids. How many parents do that nowadays?", "Andrew Marantz does not have the intellectual capacity to understand the truth and be fair and balanced in his journalism. Maybe he should try fiction.", "Walk that talk, Glenn, and maybe we'll buy it.", "They ARE the swamp! Gators and serpents every one!", "Isn't \"alt-right\" really just old-fashioned white supremacy? If so, let's call it what it is. \"Alt-right\" sounds far too polite for the darkness and fear that it embraces.", "At the first sign of a squirrel on the White House lawn we'll never see this cat again", "He's the coke snorting, people shaming, overly exaggerated sense of self importance kind. Why? What do you see?", "They'll get writing gigs at Jezebel.", "President Spineless had a Supreme Court nominee that he did nothing to defend or fight for.  He just gave up.  Now we have Trump.", "They don't even know what they are protesting for ... WOW", "I can't read Roz Chast cartoons on the randomized. I'm sure you've gotten complaints. Fix it already.", "Just visited the Zeppelin field where another racist fear monger received adulation from large crowds, Nuremberg, Germany.", "Guys, Glenn Beck might legitimately be mentally ill, but he's still sane enough to realize he's done real damage to this country and wants to atone. I never thought I'd utter this phrase, but let's give Glenn Beck a real second chance.", "If these protesters were to put as much time and effort into taking on the challenges they claim to face in daily life perhaps they could make a real difference. When the cameras are turned off do they go home organize groups to help and support those that need genuine help. My gut feeling is they just sit around, ring their hands and blame others. Pathetic. What most all suffer from is FEAR\nFalse Evidence Appearing Real.", "Yes, a too little too late, but for those of you bashing-this is exactly what is needed to turn the tide in the next election. There needs to be more like him-changing their minds. Hold him to his admiration of Michelle's speech.", "Because we don't have any American techies?", "My conservative friends, the few I have, have been so unhappy for years.  I wish for them the final happiness they have yet to attain until this moment in our history.", "STOP IT! People need to stop giving this man a voice just because he is suddenly pretending to be on your side. Please remember how this man help drive the racist narrative that Obama was not born in the US. He also spent years on Faux News pushing his conspiracy theories on how Obama was trying to usher in \"The New World Order\". He's just doing what he does best, playing to people's fears. He has been relegated to the fringes of the internet where he belongs and now he's trying to kiss the popular narrative's ass that might get him back on TV. Stop helping by posting anything he says.", "That is one ugly mug just wait and see what he looks like after his four years is up. How could anyone vote for a man that is that insecure about losing his hair? It shows a great personal weakness.", "Umm actually The Great Meme war was won by the right. It will be in your children's history books and they will drink the ambrosia of your liberal tears when you ask them what they learned in school today.", "Lilit Arakelyan great review and we must see it!", "Debra A Mcneese i thought of you when i read this!!! Don't know why...", "This wasn't the weakness of democracy. The majority voted against Trump but a minority was able to override the democratic will of the American people thanks to a rigged system designed to reward slave states for buying and breeding slaves.", "Thank you Ms Jones for your beautiful voice and music.  Deepest sympathies and blessing to her family and friends.", "He had to do what he was told on FOX..Murdoch tells all his pundits/editors what to say. But I still find this hard to believe.", "Believe it or not. this is really magical", "Trump's brand of corruption-not-corruption: \n\nTake full and absolute advantage of the situation to enrich yourself and your family unabashedly, unapologetically and right in everybody's face...so then it isn't corruption, just good ol' American opportunistic capitalism, being \"smart\", and #winning.", "In my view it already has an obligation to remove racist and offensive comments and news but it doesn't. Removing fake information is dangerous (who decides?)", "This idea is funny.  Does that count?", "In dollars, that is!  How much profit can be made from a 4 or 8 year term?", "This article strikes me as kind of sad for a couple of reasons. 1. Isn't a more optimistic path to aspire to a new standard for education in the developed world instead of being satisfied with our mid-pack standing? Instead we prioritize building prisons and killing people in the middle east with our wealth. 2. I think there's a much stronger case that democracy has failed us because we have allowed money to enter the system and corrupt the process.", "WRT Obama (who I had truly hoped to be a good, competent president, which he hasn't been): Unfortunately, no matter how much worse (encouraging protests based upon non-factual claims) behaves, no matter how unqualified he proves to be (producing incompetent programs and creating easily overturned pseudo-law by executive fiat (order), etc), no matter how far he spirals our nation into hatred and chaos... (yes, take a look at the misleading nonsense that conflates Islam-hatred with caution -- take a look at 'holding off immigration until we understand the threat -- that is what Trump really has been advocating.)  Of course, Obama doesn't take care of the people over here, right?  (How many effective initiatives which in his bully pulpet did Obama help Chicago and other places with the HORRIBLE violence?)  We need JOBS -- sure there was a bubble before Obama, but the very mediocre recovery has been badly mismanaged.", "Can this be titled, \"The Ideal Gym Customer.\" They go crazy looking for the people who will join and stop going after a few weeks but keep paying", "How did the USA become a family business?", "Unbelievable. How can someone that was against civil rights and tried to prosecute activists because too many blacks were voting get into the administration.", "He just pulled the biggest con ever..", "Got to love TNY, which is also why I will never subscribe", "Perhaps you need to focus your energies on stopping the war in Syria and Libya, both wars funded and supported by your great Democratic Party leader Obama and Clinton", "Waaaaa-waaaaa! Let's blame anyone we can because Hillary didn't get elected! This is a typical piece of liberal BS. Didn't you notice all of the false and misleading \"news articles\" that came from the Left Camp? Talk about a blind eye!", "Thank you Florida citizens for 71% of the vote <3", "I am a little tired of blaming social media for the election results. Voters are responsible for doing their research and finding the truth. When can we make democracy the responsibility of the voters? It is not FB's job to spoon feed people accurate snippets of news. Wake up America democracy requires education and participation!!!", "interesting idea but i'm not sure most kids of the age going to storytime are really going to get it. my kids would just think it was someone wearing weird make up.", "You didn't loose the internet. You gave it away. Foreign nationals are now in charge of domain names. It wasn't started on Obama's shift but he didn't stop it either.", "My brother is the smart one. He has never been snared by Facebook. Wish I could break the habit. It brings out the worst in humanity and is more destructive than any redeeming qualities it might have once had.", "Didn't Greece all but go bankrupt last year?  Wouldn't put a lot of faith in what they say about any government", "Couldn't agree more & to think there was a choice between forward & horribly backwards...Divided we are!", "The White house will be literally the \"White house\"!", "How can the president elect be so arrogant and not address what's going on? I realize he got elected, but he still has to govern the other half of the population as well!", "Israel is a land torn against itself just like us. It is a largely secular country ruled by hard liners and Orthodox Messianists. But unlike us it has neither a Constitution to give guidance nor laws against hate speech to tamp down the rhetoric.", "Yeah, this may not be about Tbilisi but Georgia is more than just Tbilisi. The country is not defined by selecvtive values and we can't hand-pick identities to brag about. There are a lot of articles about pretty mountains and supra and food but we have to embrace good, bad and ugly if we trully appreciate the country. The article in my opinion is not balanced well, it also doesn't show how ethnic heritage influences the outcome. But nevertheless, it exposes something we all know but chose not to talk about!", "I predict the country will wake up, probably in late January. If not, it's gone permanently asleep.", "Together they are the pinnacle of impotent ideology.", "I've read some of the other comments and most people know that this is satire. Don't read it as real news. It is not.", "It makes me sad to say that Donald Trump is the greatest con man ever.  He had a lot of help, but it was all for him to pull it off.", "Knew this was satire the moment it said he googled something lol -- Trump embarking on substantial research? LOL's for days", "I love Kathleen Madigans' riff on this subject. When she was trying to get her eager young trainer to leave her alone, she said that the reason for her being at the gym was not \"fun\", but to delay the date severity of her impending stroke\". Her game was defense, not offense. https://youtu.be/WrmZsJI-a7w", "We should have all voted for Bernie Sanders, so even Trump voters would have gotten an education. Joke aside, if we increase the level of education than the people will be better informed. This time, though, it was the issue of economy that decided the election. All these people that bring up other issues don't really appreciate the level of hurt that large segments go through. Reality is tough now because they helped push Bernie aside, not realizing that he was the only candidate who could beat the Donald.", "The people voted to burn it down, I say let them. It's every man for himself...", "You do realize how close the election was even with the popular vote (that really hasn't been fully counted btw) that half the people who voted elected Trump. So A) You are offending potentially half of your reader base. And B) Reporting an opinion and no factual information. Is this a news site or a blog? FYI I didn't vote for Trump but I'm not wining about it. The president does not a wield that much power. If he did Obama would have taken the guns, and given himself a third term. Learn how our Republic works so that you can teach others, stop feeling frightened and scaring others. It's not the end of USAmerica.", "I haven't read this yet, but I'm very afraid of all the abuses that will happen to our country with Trump in charge.  His choices so far tell us he hates women, minorities and the LGBTQ community.  Abortion rights are in peril.  He will probably retaliate like a bully in high school.  I keep having nightmares about his \"reign \" of terror coming down the pike.", "Stop talking about this story\n\nStart talking about the unavoidable unresolvable conflict of interest Trump has to serve this country that's the headline of today, tomorrow , until he is in a position to no longer serve, not ever , not in January , not ever. \n\nThis headline is the only one that matters right now.", "The parade of fascists continues to grow.", "Nor do the people who voted for him. They don't seem to care about anything he does wrong.", "Erica Schlesinger, Melanie Pace, Selenia Garcia-Oliver", "Decent people all around the world need to do the right thing, not necessarily by marching on Trump Towers or demonstrating, but by treating everyone everyday with respect.", "Very good article, Thank you so much for sharing.", "Trump is nothing without the white supremacists that anchored his campaign. He'll never condemn a word or an action, until it is much too late (if at all). Those who voted for him will have to live with that.", "A con man. A great con man. The GREATEST con man.\nAnd man, did he con a lot of people.", "The Internet access to news from reputable sources is fantastic. We access any number of verified sources daily.\n\nFACEBOOK proved useless and irritating these last 6 months for news. \n---The Pope was \"for\" and \"against and \"neutral\" for Trump depending on which \"Breaking News\" from blithering idiots to people hired to perform fear mongering. \n\n\"FACEBOOK NEWS\" should be viewed as the NATIONAL INQUIRER\" of the Internet. Sometimes Aliens land in Area 51 other times an ignorant narcissist gets nominated for president.", "boo fuckin hoo....nothing like a chat between jerks", "Good Luck to my Southern Brothers!", "There's something happening here \nwhat it is ain't exactly clear \nthere's a man with a gun over there \ntelling me i got to beware \ni think it's time we stop, children, \nwhat's that sound everybody look what's going down....\n\nThere's battle lines being drawn \nnobody's right if everybody's wrong \nyoung people speaking their minds \ngetting so much resistance from behind \ni think it's time we stop, hey, \nwhat's that sound everybody look what's going down....\n\nhttps://youtu.be/gp5JCrSXkJY", "Harry Connick's dad was a prosecutor down there and was doing the same thing.  He kept an electric chair on his desk as a paperweight.  He had a ton of false convictions.", "Yes. Those lobbyists are bound to do a whole lot to help out middle America. They're going to help us out of our jobs, our homes, our health care and our social security, just to name a few.", "Interviewed on Cdn CBC-Radio  \"Writers and Company\". She is amazing...imo.", "Yea, I'm buying a house just so as many as I can will stay there. Fuck that nonsense.", "just another self serving raghead...nothing more...they must not be getting all of their free shit the idiot you people call your current president has been handing them...AND THAT IS ABOUT TO STOP!...:)...LOVING IT!", "Media needs to report accurately and maintain the highest of journalistic standards. \n\nUsed car salesmen are viewed as more trustworthy than media. Only 6% of America trusts mainstream media.\n\nThat's bad.", "Well hell of course there is fear. There always has been but most certainly not just White fear include everyone else in there who is not Black.", "Contrary to what many commenters are saying, this isn't whining.  This is people standing up for their rights.  \n\nIf you want to see whining, go to the President elect's twitter feed.", "I grew up in a conservative home but as an adult inexperienced real life, real people, and educated myself about society and sociology and then made a hard left.", "Well, these comments turned into a game of 'spot the homophobe' pretty quickly.", "I kept hoping the Electoral College would vote for anyone but him to be president.  I guess they couldn't muster enough balls to do that since he has already picked every viper from the past to be in his cabinet.  Fear of retalliation I suspect.  Hillary has exceeded more than a million popular votes over him already. Electoral College is  joke. I hope everybody who voted for him is as satisfied with their choice this time next year, as they are now.", "Ann Coulter for USSC Chief Justice!", "Nothing more than a reality show hack, born with a silver spoon in his rectum shaped mouth.", "RUMP keeps saying in this article \"this great country\"  \"our great country\"..... I Thought he was going to make America great again! Our duped RUMP supporters!", "Best movie seen in a long time!", "I'm against interacial marriage, blacks should get married with blacks, whites with whites, Latinos with Latinos and so on .", "Yorker, mecca of fake news and rage mongering", "The best leaders and the best policies are good things, but secondary. The primary point of democracy is the consent of the governed. Limit the franchise and you threaten acceptance of the entire social system.", "Do you think we'll make it that far?", "He is NOT a conservative. Nor is the modern GOP. They are far right radicals who plan on smashing, not governing.", "So tell your followers to keep rioting, destroying property, attacking innocent people who voted for Trump. This reign can't end soon enough. All your spoiled brats rioting in the streets may have to get employment.", "#Zuckerberg owns world's most powerful media platform, which floats content without context. That's a global problem, symptomatic of the chaos of this Information Society. Could #Facebook transition to the Knowledge Society, a media platform of content within context? Google and Microsoft seem setup for that longer vision. Social media, not so. So we're in for a new wave of digital startups that will disrupt the global titans and their playing field. After the chaos subsides, though.", "I assumed Benedict had dementia and was therefore retired.", "Good article! Yes we KNOW THE CHARACTER  OF TRUMP!", "I fail to see how FB could monitor was is posted as truth or fiction here. Its a free forum and should more be a literary caveat emptor to the reader.", "This doesn't happen in Tbilisi any more.  I left Georgia 25 years ago, this was the story in olden times. These girls  live in small towns or villages. Things didn't change much there. Tbilisi is very cosmopolitan city these days. Guys dont' necessary look for virgins any more. They look for smart, independent girls.", "What types of Republicans? White males, of course. Silly question -  no one else is qualified. Just ask the white males Drumpf has already appointed.", "Sessions' nomination celebration. Trump is second from the right.", "No, it's not. Because it will initiate the self decomposing process of the Republican party. It is therefore a Pyrrhonic victory. First will come an impeachment supported by one fraction withiin the Republicans, then a fight will follow who's going to gain the upper hand in the party, thirdly, if impeachment gets enough consent, Trump will be dismissed, if not the party will fall apart, and elections will be hold or a new president will be appointed. However, the reputation of the United States will suffer a tremendous damage.", "Resilience is important, to be sure, but it can come at a cost. Resilience requires a level of detachment and this can become a way of going through life.", "I wish her well, but she needs to be very careful", "He should get along well with the Trump regime.", "Of course he is. Who really thought he'd follow through? Oh wait, half the country did. Well the jokes on them.", "I was always told that he was much more liberal than what he 'played' on Fox News. You can tell by the book he wrote, which I never read.", "What evidence do you have that this was done by Trump supporters? Copy cats?", "\"...great weakness of democracy is the ignorance of the average voter...\" And we call the 21st century 'the information age'?", "If Ann Coulter is for it then I'm against it.  Subject doesn't matter.", "They in for a rude awakening!!", "Same as he's always been: Conservative with his money, and Liberal with ours. Why are we even asking? Observe his history.", "This is what America should be about!", "Great article! This really gets to the heart of the problem in American politics today.", "Go home ...come back the legal way. Dumbass.", "Here we go, so in Poland we have kakistocracy now. I'm really sorry for American citizens - it's bad, it's REALLY BAD.", "Shoulda woulda coulda reporting, how about responsible journalism?", "In the LAST DAYS a Trump(et) will sound for the beginning of the END. lol Matt 24:31", "Sounds like the new American president", "We won't go after crooks on Wall Street, we won't go after Trump for fraud or bribery of Florida AG, we won't go after the Clintons for pay to play, we settle with Wells Fargo, no admission of wrongdoing \n\nWe have a government that will no longer guarantee the water our children drink is safe, that won't go after the public officials when they are caught trying to cover it up! \n#LeadPoisoning #Chromium6 #PFOA\nWhat is remarkable is that both parties voters, fed up with the establishment came close to nominating the outsider \n\nYet the elite politicians are still living in their bubble and the best way to pop it is by bombarding them with phone calls:\nCall your representatives and tell them no more Wall Street Democrats, no more Wall Street Republicans & tell them you are ready to jump ship for a third-party!\nWe need new leadership in both the House and the Senate!", "Jody Vines  this will be an interesting read", "There are some who say that the Greeks invented everything, or at least the basis for everything, and that includes great words!!!", "Glad to see somebody is pointing out this obvious conflict of interest.", "The greatest trick George W. Bush did to America was convince that he was too stupid to be actively involved in his administration. In that sense he was a more tactful leader than Trump, who flat-out doesn't give a shit.", "It's in the responsibility of every Facebook user to check if the information is right, to do some research and compare the information gathered. It is what the internet is about, telling truth from misinformation. Facebook should not be made responsible for all of this. It's just directing the issue to a scapegoat and turn the bling eye to the source of the problem which is how uneducated people are and how they are not trained how to use the internet and do some fact browsing.", "Yup the guy loses by almost 2 million votes and he wins. Elected by an outdated system primary created cause back then the govt was concerned that the average voter wouldn't have enough info on candidates. We live in an age now where we have to much information", "The world is fully upside down, so all of this makes sense.", "Twump is vewy vewy scawy. Be afwaid. Be vewy vewy afwaid. Twump is a wacist and a wapist.", "He can talk the talk, but I'm not buying it until he walks the walk.", "I still don't know the difference between publishing racist material and pushing racist theory and being an actual racist yourself. I need help with that one.", "I take Glenn Beck's emergence from his Long Dark Night of the Soul to be less than convincing. The Tea Party years had him indulging in every known conspiracy theory about Obama, growing fat from book sales that tested the intelligence of no one over junior high school age, and helping to create the climate of hatred that FOX and Friends so cleverly nursed, ending in the election of the despicable con man. Did he ever call out The Donald during the birther outrage? I think not. That it took a speech from Michelle Obama to 'rethink' Trump's treatment of women makes this a little too convenient an epiphany. Former FAUX News broadcaster, heal thyself.", "More fake news from the new Yorker", "Cut it out.....we have had enough of your anti-Donald propaganda...He has won the elections despite of you....WE, THE PEOPLE, HAVE HOPE IN DONALD...The hell with your money and media  power..Donald is the living proof that money can not buy everything", "What an asshole he was and is.", "Unfortunately, I can relate to this.", "Rustbelt beware. Nothing you thought you would've been  getting will happen, your lives will not improve and soon you will see the truth and regret the day you marked the name Trump in the voting booth. And, what I'd like to know is what will you do about your disappointing President Trump? Will you say anything or do anything? At least with the Democrats they try harder to keep democracy and protect us. I do not feel sorry for any of you Trump voters. You deserve everything you get. Trump will be a fascist and authoritarian leader and continue the fascist capitalistic takeover and undemocratic rule of America that the Republicans began with the Tea Party. Enjoy the next four years whether it is Trump or Pence. A repulsive thought.", "I hope and hope he's found not guilty.", "Spoken like a true repulibot where facts become lies and functional reality becomes crap. Plug yourself back into the Matrix, you obviously can't handle the truth.", "Exceedingly interesteing movie. We saw it twice. The messages were profound and can be applied to today's dilemmas.", "Ami to Baba ...every single time lol", "The world is in worse shape than ever in living memory. Maybe he should think about that.", "Except,.....his OWN rights and privileges.....of course !!!!", "His positions on trade policy aren't much different from Bernie Sanders. They were both largely protectionist.", "Yasmine El-Achkar January is right around the corner", "Umm, you're expecting a change in persona?"]