["Share your thoughts on the resolution here.", "Does plan Colombia even hurt the US? The only way I could see it hurting the us is through costs, but considering that PC is only 1% of our foreign aid budget, I don't see how costs could be an argument. What other points are out there?", "For PC being 1% of our foreign aid budget? This might not fly in a good tournament, but if you take the average of the total expenditure of plan Columbia it's about 625 million a year, which out of a 50 billion budget is 1%", "Does anyone have good cards on the balloon effect? I've seen some non specific ones but none that are really good", "Is anyone using the leahy law as a part of their case? I want to use it but idk how I would manage to run it ", "The way I've heard it used is to say that Colombian troops aren't vetted enough for human rights violations, so Plan Colombia is in violation of the Leahy Law.", "Of course, there's conflicting evidence as to how much they're vetted, just as with every other issue.", "What is the link between Plan Colombia and Foreign Direct Investment?", "There's one card that people cut out of a google book that says that PC restructured the economy in such a way that other countries see it as more stable and invest more.", "There isn't really much of one, people just say there is", "I have not yet debated this topic (I will this weekend) however, after looking over all of my contentions, I no where mentioned the (very obvious) decrease in drugs or violence (I have evidence that shows this, it just never made it into my case). Would not having this look bad? Should I add it to my case?", "Up to you, but there are also sources that say the production of cocaine in Columbia has increased.", "how is it possible to win on aff now that peace colombia is in place? What contentions would still be able to stand?", "Ok, first of all its still possible. We may still need the Plan because FARC has still not laid down its arms, and keep in mind that FARC is NOT the only cartel out there. There's still FARC rebels who may leave and join other cartels, and other cartels could take FARC's place and become another drug empire. The link talks about it. Just written today.", "I'm confused why you think peace colombia makes aff impossible", "Now that peace Colombia is happening our funding is now going to be mainly allocated to humanitarian aid. I was planning on running things like human rights violations and how plan Colombia is ineffective, but now they are stopping the practices they had in use before, and setting their goal on mainly helping the people of Colombia. Even mentioning illegal mining or Colombian dependency would not work because peace Colombia is planning on helping those things. It threw basically our whole case out of the window and now we don't know what contentions we could run that could actually hold weight in a round. ", "Then what is your link that proves Plan C to Peace C?", "any blocks against peace colombia?", "well its not really in effect yet bc its only been ratified by their congress. so we dont know for sure what the provisions will be and if it will even work in the first place. peace treaties can be broken, and have been before. and in PF here we only debate facts and not conjecture. that seems to be the strongest block ive seen so far.", "just an update there's something today about FARC refusing to cooperate also", "Also, the guerrillas possibly believe that the Colombian govt is the US's puppet, so they will defect", "do u have a card that says this?", "If I'm planning to run false positives on aff. how would I respond to some of the rebuttals? I feel like because of the new peace deals FARC and the guerrilla groups won't have the same monetary incentive the plan offered them anymore and thus the false positives would stop under a neg world and I lose my impact. ", "When I run False positives in my pro speech, I try to argue less about the events themselves but more of the accountability for them, because the majority of them happened years ago. There's a human rights watch report you should read (if you haven't already) about how 22 something generals are implicated in false positives and haven't been charged for anything. Meanwhile, when some of the soldiers they commanded accused them of false positives charges, there are accounts of them getting murdered. I combine this with a card saying accountability and belief in the justice system in necessary for real development and you end up with a pretty good impact.", "Could you link the accountability card or pm it to me please?", "Could you link that accountability card here?", "It's got resolutional analysis, background info, discussion of strategic options, and lots of evidence for both sides :)", "I read your briefs, and i think it's pretty good! A small suggestion: It would be great idea to add a table of contents so that I don't have to scroll through 79 pages of cards to find something.", "could you argue that since the Colombian congress has ratified the peace deal there isn't a need for Plan Colombia?", "You could yeah, but it's pretty easy to refute or turn it with stuff about bacrim/eln after peace deal or even just development in previously farc controlled territories.", "But there is a plethora of cards out there, including that infamous white house release, that says peace Colombia is an extension of plan Colombia. However,you could argue against having peace Colombia, if you so desire.", "could you say that the colombian/farc peace agreement was only able to succeed under plan colombia? since plan colombia has somewhat stabilized the country, could you say that without the plan, peace deals might not have been viable?", "Yes, but instead of debating what happened in the past, its better to debate the necessity of the plan. It's like debating whether or not you  still need to take tutoring for math if you've already passed the class: it was good for you (because obviously you passed the class) but it doesn't necessarily mean that you should keep taking it. If I went up against your argument, I would argue back that just because it helped the process doesn't necessarily mean that it is still needed.", "Yes, you could. One thing I would do if I went against this argument is sure, I can concede that these peace deals might have not happened w/o Plan Colombia, but it doesn't prove that we should keep it right now in the status quo. In fact, because Colombia is beginning to stabilize and make treaties like this it could go to show that maybe a 15 year old plan isn't the best option for this developing country and could even be considered outdated. It's one thing to show that it was good, but another to show that it is necessary. ", "as we all know, aerial fumigation has been stopped. does that mean i can't run aerial fumigation on pro anymore? like i have a card saying they're restarting fumigation, just not aerial, but they're still using glysophate so i don't know if i can still use the aerial fumigation argument or not..any help?", "Could i get this card as well? thanks", "You can't impact any of the harms of aerial fumigation since continuing plan colombia would not include aerial fumigation. However, if you can show that manual use of glysophate has similar harms, you can impact those.", "Could you send me this card? ", "Can I have the card as well?", "could you pm me the ground fumigation card please :)", "could i have the card also?", "could you pm me the card please?", "They still use the same glysophate through ground extermination, but it probably isnt as vigorating as planes dropping it on civilians...", "true but i can still talk about the harms the past aerial fumigation did and about the health harms of glysophate and how it's still going to be used ", "i would think that ground extermination is much more accurate than aerial, if someone hits you with that card, I think a lot of health harms go away unless you can show people regularly eat coca plants or something weird", "It doesn't matter if they eat the coca plants. Glyphosate still poses a risk indirectly, such as contamination of water resources and soil. You should be arguing that glyphosate is bad altogether. Or you could Monsanto your way through your round and say that glyphosate is good.", "It does pose environmental problems, but nowhere near as impactful as it would be with aerial fumigation. ", "you still can't ignore the impacts with ground fumigation, as it still gets into water sources, just like aerial fumigation. ", "Actually, some scientific sources state that glyphosate cannot travel into water sources since it is a chemical that is not so easily leached past soil. You can certainly argue the environmental impacts glyphosate has on this soil though", "I have the official agreement between clinton and the president of colombia at the time if that would help at all...", "can u plz pm me the link too?? I'll give you some of my prep.", "Maybe cuz it doesn't exist ;)", "Has plan colombia lowered the amount of cocaine in the us? Ive already found that pc has lowered the production of cocaine in colombia, but i haven't been able to find whether that has translated to lower amounts of cocaine in the us.", "i literally found the opposite lmao. i found that production of cocaine has increased in colombia", "I've found evidence for both, but I've done more research today and I think you're right. ", "aren't most pro contentions now kind of void? Anything talking about the negatives of plan colombia can be rebutted by saying peace colombia fixes these problems. are there any pro contentions that aren't blocked by peace colombia?", "That's why you have to find harms of Peace Colombia.  ", "What harms would there be? we can't really tell since it hasn't been implemented ", "If im on the pro and my case talks about intradiction prevents peace, and human rights violations, how do I answer the Argument against me about the Peace Accord", "Say that there are still other groups, like paramilitaries and organized crime groups, which will continue committing violent acts. ", "By revising your case.  Any case that says \"Plan Colombia is bad because it will prevent X from happening\" if X happened 5 days ago, needs to find other reasons that Plan Colombia has outlived any usefulness it had.", "does anyone have any good ideas on how to block human rights for the neg (like the aff argument of human rights) because i can't find any direct responses", "ask the aff how ending PC would end human rights violations from happening", "Anyone have a definition of Plan Colombia and FARC they would like to share?", "I used the wikipedia definition.", "Why do you need definitions?", "No like, you shouldn't spend valuable constructive time defining it unless you have a really specific reason.  If you talk about FARC, you could probably just say \"FARC, a politically leftist rebel group, ...\" for context.  But that's just my opinion.", "I agree;however, for lay judges in the first round of the tourno might really appreciate having one. Especially if they have no clue what it is. So maybe only define for the first round.", "I disagree, I have seen definitions are much better utilized in case. Just think about it this way, if you define FARC in the first 40 seconds and the last minute of your case deals with FARC, they've already forgotten your definition. Placing it in context will help the judge better understand the points your trying to prove.", "This is probably a bit of a stretch, but is peace colombia dependent on plan colombia? Like if plan colombia was suddenly discontinued would peace colombia still exist in any form?", "Depends how you define it but probably not.", "https://www.whitehouse.gov/the-press-office/2016/02/04/fact-sheet-peace-colombia-new-era-partnership-between-united-states-and", "Thanks dude that makes a lot of sense", "Depends on how you define plan colombia in the first place; my post below makes it so neg wins that card", "Is an aerial spraying argument no longer valid since the practice has ended?", "It's been banned but it doesn't mean they can't do it still", "But doesn't that mean Plan Colombia isn't going to financially support aerial spraying?", "It's illegal and we're funding their government, so wouldn't illegal spraying be irrelevant to the topic because neither upholding nor terminating PC would solve for it?", "Unless PC somehow funds illegal spraying", "there are cards indicating the government would like to restart aerial spraying, but status quo is nothing and so i don't think any health impacts stand. environment issues still stand, however.", "Nor does it mean that Plan Colombia didn't allow that to happen in the first place. ", "Has anyone on the Neg figured out how they are going to make their contentions? I have some ideas on what to mention (The FARC Peace treaty, Peace Colombia, basically just stuff about an improvement on peace) but no idea on how to separate this into 3 separate contentions with their own points. ", "Contention 1: Plan Colombia is needed to promote peace", "Contention 2: The harms of Plan Colombia are solved through the reforms of Peace Colombia", "Reword how you need, but there ya go.", "What are the differences between Plan/Peace/Conflict Colombia?", "Plan colombia is the plan that was agree by the us and colombia in 2000 or 1999 i cant remember while the peace colombia is the new one where obama want to put 400 something million dollars for a plan colombia 2.0. So it is basically plan colmbia unless you want to be that team that everyone hates and try to argue that they are different and lose. Also, I have never heard of conflict colombia but I assume it just refering to FARC", "The only thing I could find on Peace Colombia was a White House Press Secretary Fact Sheet.", "LOL. Read through that paper all the way. You'll get your answer.", "Read from Section III onward.", "Check the news buddy. There's a lot of updates on Peace Colombia", "The Colombian government just signed some form of peace treaty with FARC yesterday (11/24)... Will this have a big impact on the topic?", "It's going to have a very huge impact. All of Peace Colombia's impacts have now fully opened up to neg essentially.", "I can't think of any good ways to run neg. Every idea I had seems plain and not that good. Any ideas to run neg?", "I notice a problem when doing research with this topic, if the aff advocates something that had already happen that is bad, could the neg say that the PC 2.0 is going to be different and that the harms in the past won't manifest?", "Make them articulate what has changed.  ", "Neg would have to prove that it is going to be different; aka signs of reforms..even then they don't know for sure.", "Reform wouldn't work though. The resolution is asking if we should keep or remove Plan Colombia. So reform would go to aff not neg. Aff could argue that since Plan Colombia is a failure we need to focus on humanitarian aid. Effectively, we remove Plan Colombia and instate a new plan that would still help Colombia.", "Peace Colombia is still Plan Colombia, it is just a new stage. Because of that, I interpret Peace Colombia as being neg ground.", "That's called a plan though... Not allowed", "Advocating for the status quo is not a plan. ", "yeah but the status quo isn't \"remove plan Colombia and instate a new plan that also helps Colombia\" its peace Colombia, which is just an extension of plan Colombia, not an entirely new idea.", "NSDA rules say no plans, however they fail to specify exactly what a plan is, so floating plans are allowed because the only way to know for sure if it is a plan is if you call it a plan. Cheeky, but true", "Anyone have a source that says Plan Colombia is the form of ANY US to Colombia Aid packages? I think you could make a good framework off of that.", "No one has a source for that because that's not what Plan Colombia is", "Yeah that kinda is what PC has become . . .", "i actually found it; but thanks for your response though lol", "I'm so sorry to be like the 100th person to ask you this, but could you please PM me this as well. I'd really appreciate it. Thank you so much", "If you have any really good cards to trade that would be nice too. I'll take any good ones you have.", "Dope man thanks so much. Yea im down to trade (cards or other stuff) where r u from?", "AZ. Just send any good cards you have.", "sorry lol i thought this was a PM but pm me", "could you PM that card too?", "If you could PM that to me, that would be pretty helpful. I'm rather curious how you found a card that says that. ", "Your flair triggers me 'cuz it sunk me at Scarsdlae. And yeah, if you could PM me the card that would be pretty cool. I can give a few back.", "Can I also get the card pretty please ??", "Not really. You wouldn't necessarily garner any offense because it's not a unique harm of Plan Colombia it's a harn of any foreign drug policy ever", "But it still applies to plan colombia. So if we are seeing this balloon effect, keeping plan colombia shouldn't be a priority if it is only spurring drug cultivation by other countries", "Just like every non-unique impact still applies to every resolution we have...that doesn't mean anything", "No, unless you have a non cb analysis fw intent is irrelevant.  If your whole case is just PC hasn't achieved its goal, besides just claiming the judge can default neg, if neg has a single link, the strength of which is irrelevant, into solvency in the future, they could beat you on risk of offense because you can never demonstrate that it will 100% never solve.  Especially if they have disads outside of the goals of PC your only path to the ballot would be turns.  Thats not to say however, that showing that PC has undermined its own purpose is not compelling offense - you just need to demonstrate the US has had a negative affect on that purpose, not a net neutral one.", "I am also wondering the same", "Can something that is \"built on the lessons learned from Plan Colombia\" be considered as part of the modern \"Plan Colombia?\"", "Is Plan Colombia still in effect? Was Peace Colombia an expansion or an evolution/replacement?", "Do you think there is potential for a modelling contention on the neg? I am really struggling to come up with good neg ground more than Peace Colombia ", "Okay, so I started considering a joke argument and then it somehow started sounding like something you could maybe twist into making sense.", "Basically, we build a wall. Because when Colombia sends its people, they aren't sending their best, folks. They're bringing drugs. They're bringing FARC. They're communists. And some, I assume, are good people.", "This has the effect of halting the flow of drugs over the border, which means we can end Plan Colombia without any consequences, especially since Mexico's going to pay for the wall anyway.", "Add a framework of prioritizing American interests and change it to \"Trump was elected president and he's going to build a wall\" so it doesn't sound like you're proposing a plan, and suddenly it only sounds squirrely instead of wildly outlandish. It's more plausible than the \"communism is good\" or \"drugs are good\" kritiks I was considering before. Could this work?", "i doubt it's gonna work, the debate community is generally very liberal and anti-trump", "how liberal though?? Many lay judges are not well-educated, and look at how many stupid people who had no college degree and voted for trump. Lay judges aren't necessarily very liberal. Many just want the credit because they're failing comm class at a community college.", "Its actually pretty valid - but dont make it a centerpiece", "Community colleges are pretty liberal. I'm gonna run it in a practice round and see how it goes. ", "apart from human rights violations what other options could i run for aff?", "You can run human rights violations on aff. All of the \"false positives\" massacres in colombia and stuff.", "do you have a card saying false positives are still going on? afaik, they ended a while ago and the impact is quite minimal, if anything at all, since the status quo no longer includes it.", "That is what I am doing. Human Rights violations have lots of impacts.", "other than the human rights violations themselves what would the impact possibly be?", "That's the question, isn't it. There aren't many great arguments for either side in December. You could run drug trafficking? Idk. ", "If anybody wants a killer banger to kick off December topic analyses, I highly reccomend:", "https://www.youtube.com/watch?v=twhsXdfpBoE", "Pablo the Colombian \"king of cocaine\"? ", "What exactly is the difference between Peace and Plan Colombia?", "Are they to distinct programs or is Peace Colombia an evolved Plan Colombia?", "If the latter, does that mean Peace Colombia is neg ground?", "i would argue that peace colombia is aff ground too. would the aff be able to argue that peace colombia should end as well, since its just a continuation of plan colombia?", "PeaceC is neg (it's an evolution)", "Does the US ending Plan Colombia mean that the involvement of Europe and Japan ends too, or do we just pull out and the others continue aid?", "if europe's and japan's involvement relies on plan colombia existing, then yes. if their policy never mentions plan colombia, then their efforts would likely still exist even in a world without PC", "This topic feels like it'll be very complex.", "Lot's of possible arguments and more intense rounds based on the many variety of possible arguments.", "It'll certainly be a harder topic for sure.", "The IoT topic was one of the easiest to debate on  ", "i like Int'l topics, it gives us a chance to really understand issues outside of our bubbles, and I think it can allow for a more nuanced debate.", "IoT: just concede if you flip con!", "What do you guys think of using Colombia as a model for other countries on con? ", "There has been talk of modelling the program in Central America.", "Can someone explain what people are referencing as \"Peace Colombia\"?", "https://www.whitehouse.gov/the-press-office/2016/02/04/fact-sheet-peace-colombia-new-era-partnership-between-united-states-and", "TL;DR instead of the focus being on \"get rid of FARC\" it's shifting to \"promote peace and prosperity in Colombia.\"", "Anybody have any ideas about running a media contention on neg? For example the ending of plan colombia is supported by the media and incumbent president(obama) because it would support the idea that the plan has worked and would bolster support for them.", "I feel like an impact of \"it makes Obama look good\" is pretty strongly outweighed by \"terrorists are murdering people.\"", "Any aff counterarguments for lack of success/failure of mass fumigation?", "Fumigation is bad, because they've all but moved on to manual eradication, which is also more cost-efficient. As for success, just look around, you can probably argue against lack of success with straight empirics (a lot of this topic is empiric)", "Can anyone share me briefs?", "Go to the PF Drive in the sidebar, same for everybody else who asked", "If you get them, can you forward them to me, that would be great.", "Can someone share them with me too? I can't seem to find any briefs :/", "Any way to run a unique case for this??? Ideas???", "If someone told you \"unique\" ideas, they wouldn't really be unique anymore. ", "depends. what do you define as \"unique\"? ", "Is it just me or is this VERY pro sided?", "not at all. especially with peace colombia being all brand spankin' new, the con can argue that peace colombia's policies would be really good.", "But peace Colombia is not \"brand spankin new\" according to the White House article posted a little bit above the peace Colombia initiative is a \"new framework\". Basically just new direction by which to take the United States action in the region. But it would technically still exist under the current legislation allowing plan Colombia. It is perfectly within aff ground to advocate for ending peace Colombia as well because they are effectively the same thing. ", "the aff can't advocate for ending peace colombia since peace colombia relies on the peace deal going through. The earliest peace colombia would ever be initiated is 2017, meaning aff can't advocate for ending it b/c it currently doesn't exist. the neg however can argue for it since the neg can argue that plan colombia pushes the peace deal through, enabling the \"benefits\" outlined in peace colombia.", "hey man, where is the card that says peace colombia would be initiated at the earliest in 2017? it'd be really helpful, thank you so much. pM me thank you :) ", "I would also like that, thanks :)", "Not really. Pro has to argue that Plan Colombia is bad, but con doesn't necessarily need to argue that it's good (although they can if they want). They could just say it needs reform/isn't feasible to end/still needs time to work fully/etc. Pro must specifically prove why the only solution is to completely end the program. At first glance that seems easier, but depending on what con runs, it can prove to be a challenge.", "Can you explain why the aff can't argue for reform? Because if they end Plan Colombia, and introduce Peace Colombia, wouldn't that count as ending it? ", "Edit: Downvoted for asking questions. Nice.", "resolution implies that aff is defending ending it, no questions. aff can't defend another interpretation without becoming non-topical, or at least thats my understanding", "Alright thanks, that makes more sense", "Hi, everyone. I'm currently a Congress debater, though I also did PF for one year. My district is fairly competitive and so far I've gone to 2 tournaments and I'm already feeling the weight of it.", "For Congress, I have to write and memorize four speeches per week for perfect delivery at the tournaments (which is impossible for me as I always struggle with delivery). Unlike my captain, I can't write a speech in 30 minutes. I'm still new at this, so it takes me about 2 hrs. I'm in other time-consuming activities too, and I don't deal with a lot of stress very well. How can I continue to compete regularly without burning out? Any advice is much appreciated. Thanks in advance! ", "In Congress, I think that it's better to not memorize speeches or have them prewritten, because being able to go off of what someone else says shows that you're really engaged with the round", "For example, going up as on the fourth cycle and giving a your three points in support of passing the legislation is a lot less impressive and constructive than refuting a point that someone on the other side makes, or doing impact weighing. If you're memorizing your speeches, you often end up saying the same thing as someone else has already said, making you blend in with the crowd.", "Being adaptable and versatile in Congress is really important, and it makes you a better speaker overall.", "One way to be better at speaking off the cuff is to try a spontaneous event, like Impromptu or Extemp. By switching it up and trying new things, you're less likely to face burnout and maybe you'll even discover that you've found a new event you love!", "Putting more emphasis on being a dynamic speaker that can adapt to any situation is going to bring you a lot more success than memorizing a speech that you're going to use in one round on one piece of legislation. At tournaments on the National Circuit, very few people even go up without their evidence printed out, because it's so easy to forget.", "Overall, develop your speaking skills, do good research for the legislation, and give yourself breaks. Slaving away won't get you anywhere, but enjoying what you're doing will!", "Oh of course--I always extemp my speeches to some extent (one of the only things I'm good at according to my ballots) but for unpopular legislation I write out a first aff speech and usually give it first unopposed. Extemp (the event) seems very hard, though maybe I will give it a try. Thanks :) ", "Even a speech intended to be given as the first affirmative (usually an authorship speech where those are permitted) shouldn't be fully written word for word. Extemporaneity is still important, regardless of which speech you're giving, and relying too much on reading the paper can hurt this.", "If you struggle with delivery, make that a core part of your practice. Work with your coach. Deliver a video-recorded speech so you can analyze your presentation after the fact (way back when I competed, this was particularly useful for me). If you have enough people on your team, run practice sessions. The more you practice working specifically on delivery, the better you should become at it.", "Doing Extemp is fine advice you were given, but that comes with an important caveat. If you don't already have teammates doing Extemp, you will need to start your own file from scratch. If your events don't allow the use of computers in Extemp Prep, all of your files will need to be physical. For a new extemper, this can be quite a challenge, especially if you on your own don't have the resources to build up a good file from scratch. I don't say this to discourage you from trying Extemp, but rather to inform you that depending on your situation, it may be a challenge even to get started.", "Impromptu if it exists in your circuit (it died where I judge a few years ago) may be less stressful because you don't really need a huge file of content. In exchange, you will want to be well-versed in general knowledge to be able to answer a wide variety of questions with specific examples. This, as with any event, will require practice.", "Yes, I never have any of my speeches word for word, just an outline, but my transitions are very bad. For some reason, many judges in my district prefer it if you give a perfect speech looking down at your paper than if you try to extemp and don't do it perfectly (which is what I do). ", "My team actually does have an okay extemp section, so it may be something I would like to do. ", "Well, thank you for the clarifications! ", "For some reason, many judges in my district prefer it if you give a perfect speech looking down at your paper than if you try to extemp and don't do it perfectly (which is what I do).", "If I had to guess, those judges either place a higher priority on someone delivering a speech without stumbling over themselves, or haven't specifically stated anything about reading from script and are just making comments to help you improve your extemporaneity. I wouldn't know since I haven't seen the ballots, but I would just say that ideally, speakers in Congress are extemporaneous, which is never accomplished by reading word for word from a script. If your judges do indeed prefer \"perfect\" reading over some unpolished extemporaneity, I think they're sending the wrong message. From my perspective, someone who's clearly trying to be extemporaneous, occasionally stumbles when speaking, but recovers is miles ahead of someone who relies solely on their paper and delivers an otherwise fully polished speech. Polished extemporaneity takes time, but the effort is always appreciated.", "If you do decide to try Extemp, I wish you luck; it's something of a change of pace compared to Congress, but hopefully you'd enjoy it.", "I also realized this...I'm taking a break this week especially since I have a test every day this week except Friday, and getting a head start on next week's legislation. Thanks :) ", "I'm in other time-consuming activities too, and I don't deal with a lot of stress very well.", "Of course. I don't believe I'm as overloaded as some other people in my school but during competition season I am at my busiest. It's really that I only have 3 time-consuming activities but I value my schoolwork/studying, so there's that. There's no shame in taking a break once in a while. Thank you :) ", "Put jokes in your speeches, make them fun for you to read- i guaruntee you'll do better if u actually care about what you are saying", "Lol I actually did have a pun for a legislation but it wasn't original enough ;( ", "Doesnt matter- the cornier the better", "It sounds like you are putting a lot of expectations on yourself. You don't have to be as good as your team captain. You're in your 2nd year of debate you should be having fun, cracking dumb jokes, making wild arguments and other stuff. Good delivery is something you work on and it will get better with time and practice. Do yourself a favor and just have fun at your next tournament and don't worry about winning. I've been in debate for almost 11 years now and when I feel burned out I chill, hang with coach friends, tab a few tournaments instead of judging, and get back in touch with the reasons I like this activity. ", "Oh, thank you for your comment! I'm taking a break for next week, but I genuinely do enjoy debate. I joined to improve my speaking skills, and it has helped a lot. I think a small break will be good for me-I can already feel the stress seeping out. ", "Just write an outline and impromptu dat shit", "Don't do congress, there is no pay off unless you win the state champs or better. It is so boring and you are only making it worse by memorizing speeches, if you have the choice, don't do it. You won't be engaged in the round if you are giving canned speeches, just know what you want to talk about beforehand. Also do a different debate if you don't want to be bored out of your mind at tournaments. ", "I'm just curious if anyone else has this problem. I find myself researching for debate topics at all times of the day: when I'm in class, when I'm at work, on the bus on the way to school, and most problematically, instead of doing school work. It seems like I can never have enough research on the topic or my prep file can never be efficient enough to read from. My philosophy is that debate research is a win-win because you gain a whole bunch of new information and you're constantly working towards a higher ranking at a tournament. If anyone can relate, have you found a way to solve this to a certain degree? Thanks in advance.", "I wish I had your problem lol ", "What do you think about an app that you'd socially bookmark articles shared with debate community to comment and cut and upvote. It will establish a reputation like reddit points and the year's winner gets some trophy ", "I think that sounds beautiful. Make it and I'll join.", "I feel like some of that functionality is in highly highlighter (mobile app and chrome add on)", "Ya I literally took a month off last year to stop this", "There's nothing wrong with hella research.", "I hate it when school interferes with debate lol", "Yeah, I hate it when I ignore school", "Same here, that's me. I cut cards all the time and have a separate tab open to read stuff while I'm waiting for stuff to download at work ", "I do this with pieces, and I'm now my teams piece source\nAt least it has some good coming out of it ", "You wanna hit me up with a humorous interp ;) ", "Ya same I would trade all my research for an OO if you have one", "Make a career of it? My job right now is pretty much just cutting cards", "Opposition research for a campaign ", "That's a job? Is it actually good pay, and can I do it?", "Horace Mann debaters are known to have this problem on occasion - hit them up for some advice (and more ;) )", "Haha, I wish I was like that "]