["For me War and Peace remains the greatest novel ever written!", "International trade is one thing but to be minimal with multinationalism at the same time.", "Although the film is certainly extremely beautiful and unpredictable, personally I think it comes nowhere close to Mr Miyazaki's works.. Photorealistic views of Tokyo and rural Japan are of course nice, but Mr Miyazaki's strange steampunk world is a beast of its own", "The American school system allows all talents to be developed. It so happens that I can swim, speak in public and do math.", "\"ABC faces a mere $215m fine\"\n\nare they financing American political campaigns and enforcing their interests through contributions (ahem-bribes)?\n\nno?\n\nthen who cares, there are bigger fishes to catch.", "\"...concerns about a resurgent, nuclear sabre-rattling Russia\" -- whose concerns are those I wonder?", "How can society start expecting the same from men in childreering, as they do of women?", "Nothing in the article suggests any benefits from being more egalitarian. Is life in Japan dramatically better than in Sweden? \n\nThis headline and the article itself, just like socialism, is designed simply to appeal to people's resentment and jealousy as a means to achieving political power. There is no correlation, much less causative evidence that being more egalitarian is better for citizen's standard of living. \n\nChina, a very unequal country, has managed massive increases in living standards for literally a billion people and economic growth the envy of every developed or developing country in the world. All evidence suggests that the quality of life and living standards are much more affected by less flashy indicators such as rule of law, corruption and individual liberty.\n\nBut you can't push socialism on those values, am I right?", "Disagree completely. I think it was a worthy addition to the franchise, and expanded the HP universe in the best way possible.", "Nationalism, Racism, Speciesism - all this to separate yourself from someone else - for what? From dust we come and to dust we go, then wherefore this division of borders and religion and race?", "Wasn't this Hillary's \"success story\" before the election?", "How can 'US nationalism' actually exist. A very large part of the population is from very different origins, indeed many of them very few generations since their direct ancestors arrived there. Not a few of them would also have been illegal. Nationalism implies excluding the Hispanic parts of the population which are the most rapidly growing and may soon overtake English speaking people. Indigenous people are of course excluded as ever and again looking at supposedly Hispanic people, a very large part of that group has indigenous roots in the continent itself if not within modern political boundaries. Afro-Americans are largely the descendants of slaves, many of the 'Celtic' people were little better having been cleared from their lands in Ireland and Scotland and transported there and many of them either made bonded labourers and a few even slaves, so not really eligible for anything that would define them as potential nationalists because they retain a strong identity with their origins. So, may I assume a sizeable number of fanatics consider themselves 'nationalists' and whilst having apparent power and loud voices are actually a minority who would be crushed if ever the mass turned on them? The likes of Thomas Paine and Benjamin Franklin must be spinning in their graves.", "Without the TPP lead by US, it's now China as sole option.", "proof that ISIS is NOT muslim... it just attacked another Muslim state", "Why not kill the enemy and take over Libya", "Dangerous nationalism? Maybe dangerous globalization? As time has moved, as countries embraced globalization, things have gone worse instead of better. Europe is a great example, crime increase and employment decreased? Maybe this new thought is the problem?", "Why would they be confused that Trump won the election?\nProbably because they relied upon The Economist for information lol!", "This is act of bipartisn politics. He know exactly when to show the door to this disaster Obamacare ...along with lousy Obama Presidency.", "Progressives clearly believe that this is Trump's fault...", "National sovereignty gave us civil-rights, remember that? That wasn't a P.R stunt, it was legal professionalism. We have hitched our caboose to Globalization now, flipping the bird to what gave us civil-rights, based on what? What has globalization done for us lately? I think I recall it saved us from that monster that gave us civil-rights, how dare national sovereignty give us civil-rights? What a jerk national sovereignty is, no wonder we left it for globalization...", "I love seeing the liberal commie scum in full meltdown mode.", "Think of all the good jobs created to shovel the coal into giant boilers...", "I don't get the fetish of women in top business positions, if a woman choses to take care of her children instead of pursuing a carrer it should be fine, SJW are forcing women into the workforce, almost against their will.", "STOP! IT WAS A BIPARTISAN PROJECT WITH ROOM FOR Improvement.\nWhat? You actually have sick for now? Be real.", "Donald Trump will not want to play to the commercial war with China.", "I keep seeing Trump's face during Obama's briefing. The Donald looked like he'd been run over by a train. \n\nThis president will make George W. Bush look like Franklin Delano Roosevelt.", "Good. By Conservative you mean interpreting law not making it up.", "Great man and he will always remain with us.", "China is looking for outlets to export and sell a part of its surplus production, with steel and cement on the top of their selling list. With so many state giants operating in heavy industry the government needs to keep milions of workers in factories to survive.", "Their way of trying to look like they are competing with the more economical, no frills carriers, but not.", "Imagine ! Can anyone begin to wonder why in a World of plenty , so many will  starve in both physical ...and mind matters ?", "Until Federal lands are handed over, with extraction subsidies rather than fees.", "I have a very long and opinionated post against what the Trump's supporters are writing here but i won't write it. I will let the facts to speak for myself and in just 1 year they will go back hiding while US goes down the drain.", "Good thing there's no history of psychologically unstable leaders like this starting global wars that kill millions, amirite or amirite.", "Beauty and the beast,,Jean Cocteau..one of my favorite all time films...and a good message about acceptance and not judging", "Jessica Driscoll didnt read it but maybe its something you might enjoy", "Just like lenin and stalin did.now he is the orange cheetos useable idiot", "Standing room only. For twenty bucks we'll strap you to the wing. :/", "How do American and British oligarchs cling onto power? Now that would be a read", "Well, that is where we have arrived: Nationalism vs Globalism. That is gonna be the global dilema of the future, and its gonna be up to all of us to decide. But I will tell you right now that no one in this world wants to live in a world of NATIONS WITHOUT BORDERS, governed by a global centralized elite. Think about it!!!", "I completely agree with the review. It was more to show how muggles see the wizard world, and guess what? We already saw this, when harry discovered that he was a wizard.\nReally weak movie, made just to catch more money from the fans.", "What does the world think about globalisation? Ironically, I shall never know, owing to the distinctly protectionist firewall around this article", "Please say something about Ruhinga people in Myanmar. Myanmar government is killing them. Please wake up and open your mouth and eyes. Please report about it. Ruhinga people are helpless. They need our help and support. They are human beings like us. Please wake up and make pressure on Myanmar government. Please wake up before it's too late.", "Simple: t is so over his head and insecure that he had to bring his daughter to his first serious meeting of a foreign dignitary. who may I remind you should never have been there due to separation of his business versus governing the country. He handed off responsibility to pick his cabinet to any number of people who change with every moment. So much for being elected to the highest point to govern. Worrisome. He's terrified of not being \" liked\" his flailing around searching for the \" right\" answer rather than what is best for the people. Terrifying.", "Some of those,children, on their way...", "Capitalism without a guiding hand to correct it when it abandons the poor and unfortunate is Disasterism. We are in an era when the guuding, correcting force is being removed in order to chase the last few drops of profitability, and a collapse will soon follow.", "It is not much about the book as much as what's written therein. Islam is just a problem everywhere!", "But he's still / always campaigning. The Q. would be : when / how will he step from campaigning ?", "Trump builds wall against Latin America , bans all Muslim , cuts relationship with Europe , wants to kick Asia , hate Africa, and finally he might give some money to Russia .", "Any class beats 48 hours across America in a PT Cruiser with a passenger seat full of empty cans, fast food wrappers and a bag of chips...even if you DO get to stop at a Motel 6 every 20 hours or so for a 5 hour nap...", "\"Oddly, it might seem. the Anglo-Saxon critics of central bank policy seem to think that central banks have kept interest rates too low, even though inflation has tended to be below target.\" \n\n- Bad article, you too believe that artificially inflation driven growth is better than natural growth without interest payments on the debt. \nBad article, The Economist.", "Globalization is antidemocratic.  It is an authoritarian creed similar to National Socialism, another execrable ideology of the left.", "how would the Economist know what Trump can or can't do,I thought you were certain Clinton was President elect now", "Who can truly say they are 100% British? Do we all take a DNA test. This world is for each and every one of us. As long as people are willing to work hard. They should be able to live anywhere.", "Sorry, #Assadcurse will strikes one by one, David Cameron, Hillary Clinton, who's next? Establishment deserves karma for messing middle east", "Immune to the threat from ISIS because the Taliban and Al Qaeda are in charge there?", "concorde technology will come back \nAmazing after 25 years of bashing by the us aircraft market.", "Technology making us less humans. It leads to lack of respect for other fellow human beings.  I still have a fear of Computers.", "Remember, when you forgive, you heal. And when you let go, you grow.", "Neither should be the business of the federal government. You can't have instant consensus on such issues. These are highly charged social issues that should be decided State by State. It's my opinion that Gay Rights has been doing a pretty good job of winning over public opinion while abortion is slowly losing support. A Federal law will only cause pushback, entrenchment and polarization of the issues. You have gained nothing if you have not captured the hearts and minds of the public first.", "Hey look...thats a pic of a bunch of morons that are not scientifically literate.", "What you see is what you get with the President Elect. His unpredictability is a great weapon, the sabre rattling countries will think twice before they try any of their show-boating stunts as they couldn't begin to guess what he would do.", "Ana Karenina and War and peace are seriously books  any man needs to read. However, I think now Tolstoi has become a bit a basic author whose knowledge is easier to understand because people realize reality in a 'sofisticated' way than before, those who read and think a bit more.", "Sad about some of the comments- frothing like a badly poured beer.", "No investment in the 70's, no efficiency improvements in the 80's and 90's and finished in the 2000's, the actual reason why US steel is failing and along with it the raw materials", "Can you read his mind now? Or are you still underestimating things like you have always done and constantly failed?", "So according to The Economist, being against illegal immigration is \"anti immigrant\" even if you have said repeatedly that you are 'for' increased legal immigration. SMH", "What a piece a crap by the economist. They just had to write something about the story without any genuine views or analysis.", "People would globalize through destruction than peaceful trade.", "YES!!! I <3 (y) finally found the Official link to watch Movies FULL HD\nAlmost Christmas \nhttp://gph.to/2g6WUKM\n\nDoctor Strange\nhttp://sxay.vroh.me/play.php?movie=tt1211837&sub=xy", "But far left policies don't work in the real world, which is where the Democratic Party is now. Hence why trump was elected.", "Ladies and gentlemen,China stands firm on its own foundation.CHINA has the capacity to grow industrially with or without trumples", "Sadia Taking from our talk the other day about where to draw the line", "wait until he starts limiting their exports we'll see how Chinese people react", "And this article is even more nebulous than any populist promises. It also rehashes the tired argument that Sanders would have faced withering attacks on his past, as if he hadn't already. And just because many people made the wrong choice to solve their problems doesn't make their problems less real. It's easy to accept quaint little quips about the inability of politicians to deal with the problems of rich-country industrial workers when one has a home, a job, health insurance, and a secure retirement in the offing. Perhaps those leading Democrats in Washington need to drive beyond the beltway a bit. I guess that is the real unrealistic expectation.", "In Africa, ethnic wars occur inside countries, instead of between them, as they do in Europe", "Funny how just a few scrolls up I saw an  Article from The Economist where it was talking about how better capitalism is in compare to the other systems. \nNow \"American news paper\" talking about how unequal one of the most equal country is because of capitalism itself... does anyone see the inconsistencies here? The 1% controls 40% of the wealth here in America, maybe we should do what Sweden is doing and change to democratic socialism to even things out here?", "Pichakorn Jirapinyo hooo say... can u seeee?", "they racist!!!! They need blacks, women, muslins and trans on that team. And they need to lose more, so everyone can have a medal and the world of rugby will be fair.", "Indonesia is a country in the East whose democracy movement has been far much more progressive than United States. For example, the big Islamic and most militant party in Indonesia, PKS, has proposed a Christian candidate to be Local Leader in a province with Christians as majority, and they made sure he wins.\nWe all know this would not happen in Western countries who proudly claim to be a democratic nation.\n\nSo, Ahok being elected is not a benchmark of democracy system in Indonesia. But it is rather to attest that Indonesia's law also enforced justly even to Ahok, who is one of the President's close friends. All Indonesians know that all this time Ahok is always being protected by the President and his allies, and supported by Chinese-Indonesian tycoons.\n\nAhok's case is not about his religion nor his race. It is not about politic either. It is about his act of blasphemy.\nWe have a lot of non-Moslems as ministers and local leaders. We respect them, we support them, because they are good and have the capability to lead. Unfortunately, Ahok is not a good Christian.", "Or..................Russia is doing something that no western country is doing: prosecuting corrupt oligarchs not pretending they are liberal, progressive feminists who should run for president against Bernie Bros and Buckets of Deplorables.\n\nThe spin you are putting on this is juvenile.", "Gina Archer Borriello dogs are so good", "Germany has a banking system that prioritizes price stability before economic growth. It is much more effective, and is what makes them such a powerhouse. Are these writers even economists? This magazine is so liberal, and only 20% of economists are liberal.", "Well Obama promised everyone an unicorn and we could keep our doctors.", "Donny Darko's in deep, so it seems.", "We see it coming all over the world, yet we did not stop it. Some did not go to vote, some got cheated into vote against democracy, some places education failed to bring us up into educated citizens...but in fact it is now that the fight for democracy, human rights and our civilization starts. It is again grass roots movement in every country. Good luck America.", "\"Decimating\"? As in, killing 10% of them? I hope that Economist author is getting a dictionary for Christmas.", "There has always been a backlash against globalization, but now everybody is paying attention to it just because the \"developed world\" is starting to see that it may no longer benefit them as much.", "Tear down the Vatican's wall first... Then talk about the others...", "Gaga is a far better human than Teresa who can't be a Mother except for brand building.", "The Economist of course cares nothing for democracy or national sovereignty preferring continent wide empire.", "The Trump administration is taking shape. A never ending parade of racist, white supremacist, corrupt, incompetent, Washington insiders and yes men. Way to go America. This is the poison you chose.", "We know Dumbledore's story too well to make it the central story. Newts story is interesting, opens up a wider window into the potterverse and has enough of Dumbledore & Grindelwald to entice the casual watcher.", "Some degrees should be significantly shorter. Teach them things they actually need to know then get them out in to the world.", "well thats what theories were saying but lately there is evidence that misery is chemically toxic for the body.....", "I do not think so that the Brazilian economy is so weak and poor. That' s why China wants to make money with us.Also, it is beneficial for both sides. We are not the backyards of the America continent.", "When it comes business things become complicated..", "COAL? lmfao. I'm also so excited for the steam trains and 1880!", "American Universities see a never-ending source of profit in student use of financial aid subsidized by the Federal government. It's a huge shell game. They raise tuition beyond what anyone can really pay, force students to take out thousands upon thousands of dollars in loans, and pass that money on to their administrators and sports teams. It's one of the biggest shell games in America.", "... No one thinkings of changing himself...", "With this new selection, can it be expected for either Roe vs Wade or Obergefell vs Hodges to survive over the next few years without at least pretty extreme watering down/restriction? \n\nHonestly curious as to how they could be protected if the intent is there to eliminate them, if indeed there is a way.", "That's why I feel so unsafe under Chinese rule", "Not only does the market prefer renewable resources now, our coal resources are actually dwindling and if trump goes through on his plan to \"make coal great again,\" we would probably run out of reserves by the end of his first term.", "Islamophobia: A condition exhibited by those that understand that Islam is not just a religion but a complete political, economic, legal, social, and military system which is intolerant of all who do not follow it. The views of Islam on women, homosexuality, and most aspects of modernity are rooted in the 7th century. Islam has spawned numerous factions that are extremely violent and have spread across the globe causing death and destruction wherever it appears. Even \"mainstream\" Islam is violent, sexist, and barbaric by all modern western standards. This is what Gen. Michael Flynn understands and why he is hated by the left.", "My children were never an obstacle, rather a privilege and a blessing and also the means of receiving a broader, real life education which has been a positive advantage to me.", "Globalization is faltering. A shift is happening for a reason. If the average person (mostly referring to the leftist) understood the economics and implications of not only the mindset you've created, but fiscal, social and foreign policies, you would think different otherwise!", "You know things will get done once the Botanists take to the streets .. :-P", "That man, is the main reason Trump was elected.", "36 years ago.....not condoning them but people change. Hell I'm only 30 and am half as crazy as i used to be.", "The problem is the DNC - it is not just a matter of learning the wrong lesson it is more a matter of not learning anything that might compromise self view, esteem or safety. They have been\"taught\" ithrough the last mid terms and presidential race and a slew of state votes going back years - but they have avoided action in order to preserve their own positions. This is not changing now, as obvious in first action of Election by legislators of the minority leader. The status quo fix is in ; so the party is not on the brink as a result of this  it is effectively over the edge ...  for in too many instances it appears that party leadership is actually trying to climb down the cliff and just  hoping not to lose their grip lest they falll .... personal status has won over country, party people and even ideology in many cases unfortunately.", "Translation - a comic book for those who can't read the real thing, and another sign of the age of post-literacy.", "Obama is not a fool, TPP was a multinational trade deal, but by economics China is a huge rival and if you start to leave worrying trade gaps around the Pacific on guess who is going to fill em?", "Don't know any place that serves pure ethanol ? And is this per hour per day per week ? . How. Many glasses of merlot is this ( 6 oz glass ) ?", "Hell they could at least give you a sleeping pill and shove you into a sleeping coffin rack to store you properly.", "This author is making blanket generalizations about American education through anecdotal evidence that only reinforces stereotypes about how my generation was raised.", "Oh please. If you don't want to watch it, do-not-watch-it. End of story. Let people love magic world enjoy a fantastic extension of Harry Potter's world. The storyline is brilliant and intriguing. I absolutely adore Newt and want to know more about him. The movie itself is incredible. Plus, it's obvious that Dumbledore will play an important role here as well. And also about nostalgic, who says it needs to be a long time till people feel nostalgic?? The number of years isn't relevant in the tiniest sense. Let us enjoy our wonderful time with less critiques like this please.", "Meh.. you pay what you get.\n\nI like an Indian airline new idea: pay an extra to ensure you are not seated in the vicinity a small child.", "Ellen, this is the movie I was telling you about!", "So why isn't Soros trying to erase the borders on that continent?", "Jennifer Endres reminds me of you and your lovely neighbor", "The Economist has confused a retrenchment from economic globalism with ethnic nationalism. Agreed that Trump's message has elements of both, but equating the two, and their purposes, is not accurate.", "But it was okay when.He mention that I should gave an.abortion.Twice.\nAnd it was also okay when his former fiance way back.Had an Abortion that Trump.paid for.\nH", "It's bad. Like all large business they restrict innovation, close markets, artificially reduce taxes and ultimately manipulate our politics. \n\nHowever I cannot complain as these large companies lead to new innovations as competitors learn to adapt and that makes for good investments. \n\nAll the companies named naturally grow, peak and then die. Its natural evolution of capitalism.", "Jetsons over Flintstones ... well not anymore", "imagine that. a bigot stocking his cabinet with bigots. gee, I wish i'd seen it coming. :-/", "You know it's bad when your reflection in the mirror looks fatter than you.", "Samuel Mwangi very funny!!!John Rm Grout you are a thinker. At times people see what they want to see. Toolow Camelio let's see how Trump admin deals with the police shooting blameless black men.", "<3 YES!! I finally found the Official link to-wattch M0vies-1080p. \n\n20th Century Women \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4385888&sub=clili_ov_18\n\nAlmost Christmas \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4649416&sub=clala_st_1\n\nHacksaw Ridge \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2119532&sub=clala_st_5\n\nJack Reacher: Never Go Back \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3393786&sub=clala_st_9\n\nInferno \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3062096&sub=clala_st_10\n\nMoana \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3521164&sub=clili_ov_11\n\nLa La Land \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3783958&sub=clili_ov_12\n\nCollateral Beauty \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4682786&sub=clili_ov_13\n\nA Kind of Murder \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2726552&sub=clili_ov_14\n\nPassengers \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt1355644&sub=clili_ov_15\n\nAssassin's Creed \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2094766&sub=clili_ov_16\n\nGold \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt1800302&sub=clili_ov_17\n\nPaterson \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt5247022&sub=clili_ov_19", "I am a HS math teacher. I have a professional degree in the methods necessary to educate children. I use scientifically proven best practices in my classroom. My students must jump through academic hoops like circus animals - standardized tests - in order to receive their diplomas. My job is to get them test ready, confident or not.", "People always think that 1932 Germany couldn't ever happen in their own society.", "No, they see a fool, and are delighted.", "Repeal and replace its a disaster", "More likely what will happen to the millions of people who cannot afford the expensive private health insurance", "Angela Merkel has sense. We need that more than anything else.", "In other words, he wants war with all Muslims.", "No, those things don't matter. Who watches rugby anyways? https://youtu.be/YStuNiouiW4 football is where it's at!", "As of January 21, 2017 he will also be in charge of the White House.", "They actually need foreign competition but much like many markets, the US likes to dominate abroad and protect at home. The automotive market is a rare example of what happens when foreign competition is allowed in. Hence the current dislike of China.", "what do you think is happening in Tibet?", "Did somebody fail his promise to keep the \"Affordable Care Act\" to be \"affordable\"? Was it Donald?", "Nothing is harder than James Joyce!!", "Intelligent people have done a lot of the work before I was born, if anything being bored is the problem...", "This newspaper need to be more objective and less bought and paid for by Reuters. Liberal idealism is just that give pragmatism a chance just as President Obama indicated!", "Ti faresti 500 euro di sushi a Tokyo con lo tsito? <3", "If you read his book The Art of the Deal you would know that he starts with the craziest position so that the compromise will be exactly what he wants.", "It is how we see earth from above.", "It should be alarming and it keeps getting worse", "Let China help them the USA is broke !", "Although he is bringing joy and wonderful flavours to those in Beirut, let's hope that one day he will be able to return to the career path he originally chose.", "Jonny Jackson this is what I was talking about at Piccadilly Circus Station", "This is why I no longer subscribe to the economist.\n\nThis gem \"unscientific straw poll of prominent Democrats in Washington...\"\nOF COURSE if you ask beltway establishment politicians they are going to tell you that the non-establishment outsider can't win. Ya think?\n\nBut I'm so glad the Dems picked Hillary. NO WAY the Republicans could devise attack ads against her like they would've against Bernie. /sarc\n\nYou just don't get it.\nBernie is the real deal, warts and all.\nHillary is a focus group tested political robot.\n\nVoters CRAVE one thing \"Authenticity\" (or at least appearance of it) even to the point of preferring an ignorant lying orange clown.", "Don't blame the educational system for racism. Blame the families.", "Ghanaians needs change.. We are tired of corrupt and incompetent President Mahama and his NDC government.\n#change #is #coming. Change is a must.", "I don't normally comments on articles but it seems that economist resembles more yellow pages rather than a serious and impartial journal. There is a difference between taking in every immigrant or illegal in and having reasonable I migration process where people are coming into countries and bring skills and desire to work and build a civilized and future looking society. Protecting your borders FROM ILLEGAL immigrants does not mean prohibit immigration.  Seems that people forget that. Taking care of illegals is a waste of resources that has to be directed on country's needs and people. There is nothing wrong with legal immigration, the problem is illegal one. There is one serious question that has to he asked. Why do we see such mass migration by people who do not want to fight for their countries and make them better.", "Are you joking? I saw this movie yesterday with my 10 year old and my 16 year old children and we were all spellbound by this excellent film, We are all big fans of the Harry Potter world  and were at the Warner Bros studio tour this year too. An imagination and creativity like JK Rowling has can not be expected to be tied to only one story within the world she has invented. The spell continues to be woven in a new story. A triumph.", "First President elect sued for millions in his fraud case. So proud. #notmypresident", "That could be a line from a Leonard Cohen song.", "Awesome from an environmentalist's point-of-view, but how could it be any better?? Definitely better if the USA doesn't inaugurate Donald \"the fascist\" Trump. I do know for a fact that the US air force is the most polluting branch of the military. Commercial jets can't be much better--statistics will probably tell you.", "It may not survive because expert intelligence analysts make recommendations to the CiC and the president internalizes the advice and uses his wisdom and intuition to arrive at what to do next. Unfortunately our Trump will always be out of his depth when it comes to interpretation of the intelligence analysis, ha lacks the grey matter required for this!", "I don't get it. Iran got rid of all sanctions, got back all frozen funds and has a clear path to nuclear arms. The US accomplished absolutely nothing.", "I mean why would you pay working standards in the West when offshoring an entire company is easier than a typical citizen can travel for a holiday?", "What you call capitalism is actually just greed. For a paper that refers to itself as The Economist one would expect that you know such basic facts. Maybe you should stop banging on your keyboards and sit down somewhere and read the Capitalist Manifesto.\n\nThe main plank of capitalism is ensuring that first everyone has an equal chance at succeeding and then leaving them to it. You can't claim to be a capitalist nation when you have millions of your children going to rotten schools, millions of people without proper healthcare and capital concentrated in the hands of people who produce nothing and are nothing (bankers especially)>\n\nThat is not capitalism.", "Why children are assumed to be an obstacle for *women* only? Don't they have fathers as well???", "This graphic novel is not really new is it?", "Marx was a delusional guy who invented a new religion. And tried to become the pope of his sect. A fiction writer, living from donations to write his hypothesis for the XIX century context that those crazy converted says as strong theories, even nowadays, where it does not make scientific sense, and proven false MANY TIMES, costing lives every try, but faith works this way, and he still have followers trying to profit from his church. Well, at some place in earth some people still pray to a thunder god in the sky when it rains. There's nothing more to add to this fact.", "The one where he paid them $1.3 billion in small bills of various currencies that can can easily be used to fund terrorism or do you mean the one that allows them to get nukes and do self reporting on their nuclear program?", "Meanwhile in the real world, Apple is suggesting it could move some production back the U.S., Ford, has announced it won't move factories to Mexico....you know, helping Working Class Voters.", "nobody really knows, but The Economist surely does :D", "Why is anyone still listening to what the American Catholic Bishops are saying? After the pedophilia scandal and the epic denial by Bishops who knowingly relocated predators Parish to Parish, to the deafening silence by the Bishops on international issues such as the refugee crisis, the church has lost all \"authority\".", "They serv their couses for free, charges 100 grand for the paper and stamp??!  ofchause it show dedication and sacrifice to come up with that kind of money. But, future employers may want to look more into courses, experience and knowledge that schooling.", "Interesting. So those protesting and grief stricken college students are \"developing their minds?\"  Me thinks Proust might be slightly startled at the behavior of our current crop of college students.", "his name was Lav, not Leo", "Keith Rielage and David T Fischer - wasn't our junior year at Miami a lengthy drinking session accompanied by lively intellectual discussion?  I had no idea there was such an august precedent!", "Much of this article is really BS. I grew up in China and am a Chinese American. This article distorts and exaggerates too much. I myself is mostly Han but also part Manchu and part Mongolian. In my growing up, I have always had a few ethnic minorities in my class, mostly Hui Muslim, Manchu and Korean, because where I grew up. The Hui Muslims always have a separate dining hall because of their religious requirement of diet. All of them have extra scores automatically added to their real scores for the national college entrance exam, a direct and transparent affirmative action. Even during the \"one child\" era, non-Han minorities can have more children. I have a cousin who married a Hui, whose family I ended up knowing very well. My father's best friend from college is a Hui, whose daughter went to school with me and is my best friend. The government does deliberately display an image of ethnic harmony. But it does not tell the people that Han is everything. Every brain wash I received in my childhood is the contrary. Overseas Chinese community historically supported China's effort of revolution and aggression resistance. In the case of Singapore, the Chinese community drew very brutal retaliation during the Japanese occupation. But that does not mean Chinese government tries to turn ethnic Chinese overseas into its spies. There are human rights abuses in Tibet, not doubt. But the government brooms a whole bunch of Tibetan cadres to do the job, too, including human rights abuse jobs. The point is it is not \"Han is Chinese\". The article said that many people define Chinese as Han. Well, frankly that is way it is defined in countries other than China, especially among sinologists. I was really surprised to learn that when I came to the US in the 1980's and started reading books in the US about China.  I do not know what the author is trying to tell people. But it is just retarded.", "I'm sure a conflict in the middle-east will coincidentally happen to make that possible and keep Texas oil-barons in profit lol after all they've supported virtually every Republican since Reagan...", "And they're great sportsmen and ambassadors for the game. Not one excuse after losing to Ireland 2 weeks ago and gracious after re-establishing rugby world order today with their victory over Ireland. All the above apply to Ireland too", "Liberals and conservatives both oppose globalization just for different reasons. Moderates in the Republican and Democratic establishments ignore their political bases when they negotiate FTAs.", "The point is that college produce both knowledge and graduates. The markets for these gods are quite different, while the quality of the producer depends on both. The market for knowledge has been disrupted by the internet so much so that publications costs will reach  zero in a few years. However, demand (from government and privat sector) keeps the prices artificially up by subsidies and patents. For graduates, technology also plays a role. Most degrees will be rendered useless in a few years. This will increase the cost of college and this will cost be pass on to consumers (again government and private sector). High demand is positive, the problem is the supply side. Innovation should not cost a lot of money. Studies with few demand should naturally died out. Any claim that studies have a value by their own and not determined by demand, is subjective. In conclusion, we need to separate the college that operates from demand from the subjective one.", "there is no void in Asia, the new silk road will go on, from china to Spain the connection will grow, the worry some part for USA really is 70% of the economic trade will be over land, no more over the sea.", "Too much Nationalism. I fear it will lead to a war that is bigger in scope than anything we've seen for a while. History repeats itself.", "he probably said something like \"hey, vlad, maybe you should give someone else a shot at it?\"", "Erratum: it's a wax body anyway. And it's been bones already that were buried.", "So let the public pay for research and development in universities then let private industry pluck the fruit when ripe. I'm sure Uber and Google will be happy to pay back some of the profits their AI will generate to the public that made them possible. Right?", "Max Messenger you are a practitioner of the dark arts", "The backlash of America. Globalisation will go on.", "I don't much like Trump, but the libturd spin on these stories is pathetic. You make it seem like he will be worse than Barack Obama. Only Hillary would have been worse than him. The butthurt is is everywhere. Hahahaha", "TPP was awful for US Labor and was not endorsed by any labor unions. GOOD RIDDANCE!!!!!", "The propagandists of the Extremists will use every means and any single incident to demonize their competitors. Because the envy mindset of such propagandists/Extremists is bias. They view any competitor as foe !", "This is fantastic news. All the gulf Arab monarchs who controlled our ME foreign policy for so many years are shaking in their dishdashas. All the filthy money they gave to Clinton has gone to waste and we have a national security advisor committed to pounding the living crap out of al Qaeda instead of giving them a new name, arming them, and turning them loose against the stable and democratic regimes of the region.", "Globlisation has become the catch word for decreases in salary, in working conditions, in social benefits, in environmental controls, all under the guise of economic principles. It's one of the biggest lie going around in the domain and people are now coming to terms with it. Not a moment too late...", "If you have international authority over nations and each citizen then you end up with neglect. A nation is strong when its communities are strong, and a community is strong when citizens are strong, and when they manage each their strengths well. Coming from top down however, international or multinational or whatnot you are asking weak communities to carry the weight of the world.", "Whereas, Nineteenth of the ills the ignorant suffer is spring from their  ignorance...", "Goodness! I suppose at every turn one must be reminded of their place and class in life...no overhead soon it will be access to the washroom!", "dangerous nationalism? wow!  keep it up, Trump will win again in 2020, people are sick of globalist elites like The Economist destroying the middle class!", "Go Green go Green!!!! End the antiquated fossil fuel industry!!!! Go Green full speed ahead!!!!", "MBA's are for people who want to go into consulting or investment banking.", "His hair was manufactured in China after all.", "Jasper Paas interessant dit, check ook de comments. Dit zal goed gesprekstof zijn voor de joe rogan show", "Wal-Mart will go out of business and our economy will tank.", "what about all the people who became unemployed when every village no longer needed a smithy or block buster video went out of business? why not keep all the outdated professions?", "How pitiful is your magazine these days.", "Mother Theresa teaching \"business leaders about charisma\"? Are you joking? Do some real in depth research on her and you'll discovery a \"ministry\" that refused to offer modern medical assistance to the suffering, believing that living in pain was part of salvation. How many modern day hospital facilities providing basic services could have been built in Calcutta, instead of sitting in foundation coffers. Very disturbing philosophy.", "Just hire Rousteing and let Kim do the work", "It is also noticeable from your picture, that the Delacroix panting that you are mimicking in the background got a \"braghettone\" \"Daniele da Volterra\"-style adjustment - no more exposed breast.\nIs this also a sign of the times? Surrendering to the right wings also on pictures?", "White boy can't handle rice and kimchi..", "The Christian is an insult to the Koran. How dare he believe and bear testimony against the Koran with his religious beliefs?", "This is a matter of reshuffling certain key individuals..", "So much anti-communist rhetoric this week. Makes one think there is a spectre haunting Europe.", "It cost us $432B to run an unbalanced budget last year. ~ 19.8T and counting... http://www.treasurydirect.gov/govt/reports/ir/ir_expense.htm", "Yet Western ultra-liberals try to promote migration even harder, to an already messy demographics.", "Shiva Prasad N.S. this is interesting we just spoke about him", "Why is Latin America still being referred to as \"America's back yard\"!?", "Awefully, it's on the rise in Germany. And, like mentioned in the article, some of them have weapons. Beeing (Neo)-Nazi and having weapons is a bad combination as the past has shown.", "Good article, but there is quite a subtle start of a rapprochement with Trump, right? The Economist exaggerated terribly about what a disaster a Trump presidency would bring, and now they are starting to think that he might actually be good... it's hard for me to delete all those apocalyptic articles out of my head...", "Absolutely not. Those projected campaign policies if enacted will not only sink his presidency but most certainly alter America's place in the world (if it isn't already - at least a little bit).", "So silly it is beyond belief. It is the type of media propaganda that Facebook has been under fire for allowing to be broadcast. Accept that fire has been relative to more conservative agendas.", "It means you don't nominate a candidate whom a lot of people really don't like.", "Oregon is a vote by mail state with an outstanding voter information packet, making it quite easy to vote. The motor voter law makes it easier to register to vote.  The big downside in Oregon is that the primaries are closed so voters must be registered with a party to vote in primaries; the ballot measure a couple of years ago to go to open primaries failed.", "You don't know how many times I want to ask The Economist the so what question. And so what?", "Capitalism, as it is currently practiced, is not any better than socialism as it was practiced by Russia of old. Both are perversions of a system that without the skews of government have their very good outcomes. What is needed is another system!", "this Dogs lokks like you economic empty human been did you eat good Food.or just you are not in pation for your rich Food.jesus enenmy just wrote but you do not know what you are wroting", "Boom they dont want G M O s infecting them to change their sexual gender !", "I have a hemorrhoid.  Thanks Trump.", "Holy crap literally all of the comments on that article are written by the Chinese", "Brought to you by multi-national corporations that have sold out the West in favor of profits in China. While the civilized West worries about the invasion of 'migrants' from the Third World, the Chinese billionaires are busying themselves with buying up properties and farms across Europe and America. The fun is just starting...", "Hi Janet Yellen. I officially work at Whole Foods Store at home in Glover Park 20007 zip code NW Washington DC these days :). I am very happy and having a great time :). When you get a moment please make sure to check out a new facebook page that my dear friend George W Bush clued me on just the other week called Russia Insider. It is a lovely site :). Wishing you guys a Happy Thanksgiving 2016 from me and my new employer Whole Foods :).", "Anna Karenina still my favorite :-)", "Like most things in a capitalist society, with education you pay more for the name brand.  There are already many options for affordable higher education in the United States if you're willing to look at lesser known universities (and I do not mean online diploma mills).  Community colleges are a good option for getting core courses out of the way during the first two years while minimizing costs.", "Capitalism is the worst of all. It only favour just a few top most elites leaving the rest to wallow in abject hopelessness. Its nature of creating a caste system and classes where some moneyed elites are thought more superior than others is also wanting.", "We came so close to the end of nation states in 2016. Going to be interesting to see what Trump does during the next four years. It might still happen but far more clumsily.", "There are as many competent Mathematicians in USA as anywhere else.Unless you mean no one can draft the annual budget in the current parliament.", "The problem is that those in the school system don't seem to comprehend is that self esteem (the kind that makes a viable adult and a contributor to society) is earned. To attempt to give self esteem when not actually earned doesn't really create self esteem, it create's a delusion of self esteem, worth, and actual ability.\n\nThe world and life is driven on individual ability, not a mental belief of one's own worth.", "Here we go a true sign of propaganda this attempt to portray the global banking cartel as somehow less powerful than it is. The control of governments worldwide through fiat paper loans that caused all of the tragedies centuries long manipulation of everything from policy to markets bringing war at every turn but they are to be thought of as undeserving of any special attention because they might do some really nasty things and we should be very afraid... nope just buy gold, silver, heck even cartons of cigarettes in a pinch better than paper.", "Why nationalism is dangerous? Did they do something evil? Obama ans his alliance has destroyed several countries and turned its people into refugees.", "Yes, he dreams that china may fly to sky but stopped by other people.  Now she has achieved that but the dream does not end there.  He wants to take all people of the world to enjoy the same, to grow wheat and keep silkworms in outer space.", "His strengths did not lie in the dense, boring details that comprise economic theory, but In the knowledge than any economic system must be founded on respect for common workers and an understanding that exploitation is immoral.", "This is why \"Middle' America voted for him and he is fulfilling that promise. Why would we expect he would appoint a dignified clean-image AG? No surprise here.", "Brett Poulsen Time to get good at AI", "Esp. For Those who have few or no knowledge of true philosophy.", "BTW I really don't understand why the The Economist allows an obviously ridiculous \"spell caster\" fraud comments like these here?", "Because white liberals couldn't fully support refugees without vip tickets to a Syrian artisinal food festival.", "What about consciousness and civility? And the right not to be sexualized?", "What do you think of our country? Marcos did many things in our country. Visit us and we will show you the best infrastructures, etc. he built. I hope you don't mind, your country is now facing crisis because of lack of self-discipline, and out of mind especially in America. Simply because you can't accept that Pres. Trump won the election. This is totally the abuse of democracy. Mind your own business. You don't know our history.", "This is what happens when you do something completely by executive order...it can be undone just as easy via executive order...", "It will change, as technology does. What worked today will change tomorrow.", "Sure. Everything about Capitalism makes perfect(!) sense. The greed, the waste, the stupidity and putting pieces of paper (now digital artifacts) ahead of human life! Economist is not impartial here as we're talking about the propaganda rag of the elite!", "south east asian nations are mostly quite disappointed that the TPP is not going to materialise. It really is quite a big let down from one of our strongest global allies and does little to reassure us that the USA is interested in mutual cooperation to curb Chinese hegemony.", "Jay Tung we studied the wrong thing", "How is the luggage thing going to be enforced? They don't enforce take on luggage restrictions now. I've seen people get on planes with enough stuff for a three month Antarctic expedition.", "As a Catholic I've been a tad suspect of our newest Pope.", "Globalisation is not necessarily good or bad...but if it is at the cost of the individual nation's internal strength and progress, then it is questionable whether it is helpful. The practice of an ideal and the resultant reality decides ultimately whether the ideal needs to be reinforced or scrapped.", "Obama is a talk only weakest and most ineffective leader in history from whom so much were expected and so little has been delivered. He has further weakened his own bases by deporting immigrants in troves, by violating civil liberties, drone-extra-judicial killing, by siding with dictators rather than with democracy such as in Bangladesh, in Egypt, etc., by shutting the door for refugees. Merkel has been the champion of the moral leader of the word !! She sheltered refugees when everyone else was shutting the door, she stood up for free trade etc. Only fault Merkel has is her obsessive austerity polices that has been wrecking havocs in economies .", "All the top jobs are going to white supremacists, religious zealots and Islamophobes. The West must stop with the appeasement immediately. \n\nGive Trump a chance? We have.", "Guys, this whole \"a new nationalism\" editorial philosophy is already getting a little bit tiring. I'm a modest person, I don't have a degree in social studies, but the xenophobic and autarchic political current being developed nowadays is pretty much easy to observe even to me, it's in front of everyone's eyes", "All you progressives think one global leadership will prevent future wars....convince me countries like China, Russia, North Korea, Iran will be willing to give up soveignty. Won't happen. Utopia pipe dream. Better off smoking a peace pipe with your friends around the campfire.", "Globalization has increased the sentiments of nationalism. From a cultural and traditional point of view, when more people immigrate to another country, they affect the social structure and thus change the demography of that country, which results in decreasing the sense of nationality. Trumps election is an aftermath of those lost sentiments", "Fuckinfg Wanker stand up against Homosexuality", "For now, the reactionary forces in Germany have receded into the background of sociopolitical activities, but the strain will always be there and this is the danger...should they metastasize into a mainstream force; the danger lies in the strengthening of their global bonds: this portends widespread suffering for a larger balance of the global populations.. The difference now, is that the resolute forces of the understanding and belief that the quest for human dignity ought to remain a universal objective as opposed to those who would like to impose stricter limitations on human dignity and freedom, underscored by the arrogant abuse of the full hegemonic powers at their disposal...by and large, the lessons learned from the Obama years, in spite of its deep allusions of the triumph of   reason, did not see any significant reduction of the inherent turbulence \n for developing nations, who got very flimsy recognition from the so called forces of progressive change in the west...generally the argument is; that if we addressed these issues now rather than repress them, we would be better off, on our journey towards socio economic affluence...the disdain of the Trumpish way is that he would easily collaborate with is fellow tyrants in fostering 'state sponsored terror'...which will be counterproductive to the aspirations and development of the real majority.", "Yes, as Hillary Clinton said, their are four Supreme Court members in their 80's, and the next president can shape the court for the next 40 years.  If you don't like the fact that Trump will shape the court for the next 40 years, then you shouldn't like the fact that Clinton wanted to shape the court for the next 40 years.", "You have Nigel Farage in that picture WHY? He is NOT a world leader he has retired from Ukip a racist xenophobic fascist party /MEP in the U.K.", "That's fine. This year has taught us that we now live in the \"post truth\" age where appeals to emotion, prejudice and feeling trumps all and logic, facts and domain experts aren't necessary....", "We live in a data overload era. When people are bombarded with information  everywhere they turn, not only that they get lost in it- they turn to emotion to make sense in it. Trumps campaign played well on that.", "Just saw the movie fantastic beasts and where to find them.\nIf we don't act now, this movie in a couple of years will be about elephants, rhinoceros, polar bears and other magnificent beasts.", "Is there lead in all the water?", "I'm curious if folks think the genie is going back into the bottle. Millenials and the current generation of children have gotten a glimpse of the world, and international cooperation, through that pesky Interweb experiment. Does anyone really believe they're going to join the movement backward?", "Well, do you all really think all those 2 million immigrants in sweden were taken in to get a share of the country's wealth? And how many of those do you really think own the houses they have been 'given'? The swedish asylum industry is rediculously corrupt...", "Please say something about Ruhinga people in Myanmar. Myanmar government is killing them. Please wake up and open your mouth and eyes. Please report about it. Ruhinga people are helpless. They need our help and support. They are human beings like us. Please wake up and and make pressure on Myanmar government.", "Lost someone who lived every day in conflict between brain and soul.", "Snake oil salesman.. promised the miracle cure.. didn't list the ingredients on the bottle for inspection.. doesn't do as promised.. people in strife conned by the promise of an easy solution.. and so the world turns..", "Of course, the Chinese will be the great beneficiaries of the isolationist trend of the US. The Chinese don't intend to become isolationist, on the contrary.", "Globalism = predatory capitalism. Race to the bottom competition for wages has destroyed the middle-class and enriched C-suite employees and stockholders. The fantasy of the market taking care of all is just that - a fantasy. The quicker elites and corporations realize that and create an economy that works for all, the better it will be for them. Otherwise, the pitchforks are coming - you only need to look at history to see the pattern and reality.", "In cahoots with Putin to defend Christianity from Muslims. Dude is batshit.", "Of course, this is precisely what the publication he once dismissed as the \"premier mouthpiece of the European aristocracy of high finance\" would say :P", "It is not surprising The Economists still makes this cold war era propaganda against marxism. It is almost a solid proof for humanity  marxism is our only way to destroy today's brutal capitalism ruining our lifes.", "Wasn't there an episode of the West Wing about this?", "What we have seen during the campaign was indeed the Real Donald Trump. He said it clearly, those who believe he was just vying for votes have been fooled - everyone should have known it.", "Bet he knows best of all how to deal with racism. Got experience going both ways, right? Dishing it out and receiving a fair dose back.", "Luca van Berkel, ga jij anders dit ff lezen ;-)", "Many Trump supporters are excited about him \"bringing back the jobs\" until they realize that they can't get things from Walmart for next to nothing.", "Future US isolationism police will open many economic and military opportunities for China in Latin America as well as in the world. Recalling that Russia is already putting in operation several military bases in Latin America.", "I'm not sure if Donald Trump keeps getting reject because the candidates are afraid of winning so much or because they don't want to be part of fail presidency.", "What is wrong with nationalism? Only retarded people would vote for someone pledging not to put the interests of the nation first.", "If you're going to take the time to create this clip then do it properly. It is White nationalism not just \"nationalism.\"", "All those running their mouth about how bad it is for religious minorities in Indonesia, unlike in the U.S., over there you can at least bet that your place of worship don't get vandalized and got won't get shot for following a certain religion.", "So glad the adults are in control now.", "someone start a new trend that Asian dicks pounded into a fine powder cures all diseases!", "Liberals are going to be disappointed because Trump's election is the beginning of the end for liberalism, it's finished.", "Headline could be applied to The Economist, too.", "Sweden is less egalitarian now as it has accepted a lot of poor refugees and economic immigrants from war ravaged and poverty stricken nations. Whereas Japan is a homogeneous society and does not have many refugees and economic immigrants owing to economic progress in South- Eastern Asia and other parts of Asia. Whereas refugees and economic immigrants from Africa and Middle East find Europe a lot nearer to them geographically and quite a lot of economic immigrants would know languages like English or French but  they do not know Japanese language.", "AI will be the last nail", "Not wanting to be dominated by either a German dominated EU or a resurgent Russia is somehow illiberal? Nationalism is about as liberal as it gets.", "Can't wait to watch him burn it ALL\nDOWN !!...", "Trump isn't president yet, but caricature reflects \"progressive\" dream about Germany taking revenge on America for the loss  of the WWII.", "Is it leniency if you can't prove illegal stuff was happening?", "Marx come and see your theory put into practice in Venezuela, water, food, power, medicines shortages.....people eating from garbage cans ....", "Like the brilliant John Ralston Saul who should be given more consideration if we want to actually get out of this mess.\n\nGlobalism has failed according to its own standards of success..", "Data is essentially reactionary. Social media is proactive and impact producing. One clearly had the advantage.", "Ford Executive Chairman Bill Ford has told President-elect Donald Trump that the automaker no longer plans to move production of its Lincoln MKC luxury SUV from Louisville to Mexico.", "This is often the case when a three dimensional object is presented in two dimensions.", "Farewell OBAMA.that's your last international meeting&presence, I think he's very sad for losing all his power&authority .", "Nobody wants to hear such things abiut their Messiah. Putin is pure, he doesn't drop bombs or uses the Russian Mafia for what ever. The Oilpipelines through Sibiria are not rotten and there are no ecological problems becaus of Oil. Praise the Lord was yesterday,for now on and forever praise Putin. I'll bet Trump will give him Alaska as proof of their friendship.", "A comparison only click bait could love.", "It seems that the Kremlin endures with it's security apparatus, because the institutions and personalities in the Russian administrative establishment are supposed to be eventually reporting to Putin. The people in the administration and political structures don't see each other as above corruption and nepotism, apart from Putin, who is supposed to be otherwise.", "Coal mining is hard, dangerous, tough work... I have nothing but the utmost respect for coal miners... that said, we're not lighting houses with whale blubber any more either. We need to work on retraining them as solar installers or wind turbine assemblers, two of the fastest growing, and best paying (for non-college graduates) jobs in the country according to BLS stats. Clinging to the past is fun and all, but it doesn't help anyone transition to the future.", "Mamoru Hosoda is the next Miyazaki if we're speaking approaches to story and animation. Shinkai is much more unique than people give him credit for.", "Bs scare article, but if I remember rightly the left scoffed and moaned about it anyway lol now it's like oh the \"deal\"  looks unlikely to survive lol \n\nYeh the leftist media wanted war and instead got a compromise and a deal lol but hey liberals and facts are opposites..", "Trump is a weak POTUS in their eyes, they are gearing up for their next move now that they've manipulated 1/4 of the population to elect him.", "A radical party like Syriza wins referendum whereas the establishment seems to be losing referendums like Brexit and losing elections like Hillary Clinton who lost to Donald Trump. Matteo Renzi of Italy another person from the establishment is on the virge of losing the referendum.", "Emily Samuels perfect job for you?", "That's the first time I've seen the word 'portend' in print. It's nearly archaic. Such a beautiful word! Oh, yeah, airlines.....whatever. (Just read an Economist article on Twitter - opprobrium, atavistic, mouldered - loving ur use of shiny words. Next you'll be calling food 'victuals'.)", "so, so true!  But feel glad that this seems to indicate that I do indeed have and intellect!", "It s because like in Philippines we are poor country and we know that it s because of corrupt politician . But we are aware how rich our country when it comes to natural resources and good climate.. we dont have winter to pay for heating. When it s hot just go jump into river, lakes, waterfall, and best beaches.", "No one has done more for the conflicts and slaughter on the ethnic, racial or religious base, than done the left and liberals.", "Good. It's about time. The left wing socialist loons hopefully have had their day.", "Am I right in saying that Syrian food is exactly the same as Lebanese food, given the two are basically the same country?", "Some? I'm a partial student of economics and saw this coming. It's a lack of understanding and a lack of support to help people accept and embrace a concept other than zero sum economics.", "Why did you put Tibet as part of China? That's what their regime what.", "Talk about hypocricy. It's no different than your Anglo-Saxon mantra. Take for example how you were crying about Robert Mugabe.", "The  EU was founded to improve capitatilsm and democratic institutions with liberal values. Brexit ll ruin the British economy the IK ll become a miserable country like India and Germany and France ll become worlds superpowers .. Theresa May Day ll not save this Titanic STUPIDITY INSANITY INFAMIOUS DAY", "Right when the world needs to come together to combat our divisiveness, right at this opportune time, the collective consciousness of powerful countries is deciding to take a backward step. At the end of this de-globalization journey, what will become apparent though is how this error in evolution will hurt many generations to come. When the rogue nationalistic voices eventually fade, it would be too late to redeem ourselves as a species.", "Anybody who thinks Democratic Party policies are \"far left\" should take off the blinkers and take a good look at what other nations have accomplished. This country is falling further and further behind the rest of the developed world in every meaningful category, yet reactionary extremists still yammer about returning to the past. This country hasn't got a freaking prayer.", "Quite opposite to one another but important individually in their areas of operation. Mother Teresa is far more important and cannot be compared to Lady Gaga. She was moral and full of compassion for the desolate and needy.", "If youre gonna try to end the united states through subversion, youre gonna have a bad time...", "Looks like even the economist doesn't understand the nuclear deal. US can unilaterally walk away from the deal and literally nothing will change. The significance of the deal for Iran was the lifting of sanctions by rest of the world (EU, China, Japan etc). US can do whatever the hell it likes and iran will continue to do business with the rest of the world.", "Good. I'm happy that so many people are pushing back against the elite globalist agenda", "Carpet bombing isn't a particularly good way to go about fighting it, however...", "Putain, ex KGB, Famalie Farige, french religious refugees who fled to the UK. Trump, monied property developer, already paying off embarrassing situations. Real men of the and for the people.", "It's actually too small a Group to be considered a minority. Seriously, every Population has a bunch of clowns and Idiot, question is, which nations put them into power ;)", "Naturally powerful people don't want Rule of Law, but that's precisely why powerful people are idiots, Rule of Law benefits them too, in fact Law is why those idiots aren't dead yet, those idiots are citizens.", "A dictator exiled in US soil. How could that happened?", "Natalia for u de tu amado", "Same sex \"marriage\" is NOT enshrined in law, Congress would need to do it into law or undo it. The SCOTUS interprets law and in the case from last summer legislated from the bench. Judicial positivism meets cultural Marxism.", "This was not a deal between Tehran and Washington son, time to go to bed.", "Jihadism is incompatible with American values, but not a threat to our way of life as it has few adherents in the USA.", "yeah, the patience best portrayed in this clasic where he justified the murder on his wife in all disgusting precision #westendvalues", "Great move for CEOs as their defaulted loans are written off, as their e-wallet companies are poised to make hugs profit, little impact on black money as only an idiot can believe that 1000 crores of money is kept in cash (know how much space it would occupy? do the math). Extremely hurtful to daily wage earners who have to miss out on work due to long lines.", "why can't anyone question koran when we can question any other religion? Why are some people so in tolerant?", "Of course not. The gap between its electors and the government only get worse when they will realize that all that was just communication. All the means are acceptable in politics to win. In my opinion all this is just an indicator of a faster decline of the country.", "All this ridicoulus globalist leftist propaganda will lead to is more people turning nationalistic, so by all means please continue.", "the only ANGRY people I see are the lefty kooks who didn't get Hillary elected. Give it a break!! Get back to reality.", "Syrian and Lebanese cuisine have always been very popular in Brazil. Nothing to do with refugees.", "The ministers of interior of these African countries are just as complicit as the poachers. They treat ivory as a natural resource like gold, copper, or diamonds.", "\"European values\" for me is refusing to let your country be overrun by invaders", "Made an active effort to hate this film. I failed.", "Trump is doing insane warmongering against Iran and in support of fascist Zionist policies... No, worries! The Economist makes him look good again! \n\nWhy not reject wars and Trump? It isn't that hard, is it?", "First comes the fake enemy, then the fascist leader, then war, then civilization, then the public forgets the cost of war, repeat.", "Gotta love the cover pic here - guy tries to look cramped up, while in a more spacious seat than I have ever had. They should have taken the pic in a real cramped seat.", "Absolutely wrong & false idea. Almost all the so-called top ranking newspapers & celebrities have proved themselves as 'laughing stock' by their biassedness. Donald John Trump will be able to appear as a most successful & charismatic leader across the world. He is supported by holy 'spiritual power'. Don't worry !", "Good thing it will only hurt voters, and not the 11 million illegals (opps I meant undocumented illegals)", "Capitalism is the natural state of affairs when people are left to their own devices, as is socialism.  The problems only come when government become involved in either trade or social responsibility.  If they leave us to it capitalism is great.", "'Fails to mention the work of any female physicists.' Why is that a true critique of the book?", "Kimberly Tower i mean your thesis amiright", "I'm against multinational economics but I'm also against China, so it's like whatever dude, same old same old.", "Bloody Brilliant Donny and who holds most of your Government Bonds then....China does and I'm just another man in the street and I know that.", "\"If they started commenting on fiscal policy\" ha! We need to end the farce of central banking.\n\nFortunately history has examples:\nhttps://iea.org.uk/blog/free-banking-was-robust-and-effective", "Maybe that balkanization trend I've been waiting 20 years to see will start soon. Fire up the de-salination plants and nanotech.", "\"Filling America's shoes\" ...... So Germany is going to start paying for most of the National defense spending and research for Western Europe ? Start paying for and hosting the U.N. ?", "Get it Now Guys... I Finally Found Original Link Movie 1080p. Watch (y), <3\n\nCaptain-America:-Civil-War\n http://www.gozier.win/cinemax/full.php?movie=3498820&sub=cinemax_tt_31\n\n(y) Boo! A Madea Halloween\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt5325452&sub=Boo_padud1\n\nWarcraft\n http://www.gozier.win/cinemax/full.php?movie=0803096&sub=cinemax_tt_35\n\n(y) The Accountant\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt2140479&sub=Accountant_padud4\n\nKevin-Hart:-What-Now?\n http://www.gozier.win/cinemax/full.php?movie=4669186&sub=cinemax_cht_tt_2\n\n(y) The Girl on the Train\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt3631112&sub=The Girl_padud6\n\nX-Men:-Apocalypse\n http://www.gozier.win/cinemax/full.php?movie=3385516&sub=cinemax_tt_18\n\n(y) Doctor Strange\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt1211837&sub=Doctor_gocenk1\n\nStorks\n http://www.gozier.win/cinemax/full.php?movie=4624424&sub=cinemax_cht_tt_6\n\n(y) Sausage Party\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt1700841&sub=Sausage_gocenk5\n\nThe-Big-Short\n http://www.gozier.win/cinemax/full.php?movie=1596363&sub=cinemax_tt_96\n\n(y) Suicide Squad\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt1386697&sub=Suicide_gocenk10\n\neepwater-Horizon\n http://www.gozier.win/cinemax/full.php?movie=1860357&sub=cinemax_cht_tt_5\n\n(y) Arrival\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt2543164&sub=Arrival_gocenk29\n\nThe-Birth-of-a-Nation\n http://www.gozier.win/cinemax/full.php?movie=4196450&sub=cinemax_cht_tt_10\n\n(y) King Cobra\n http://www-padudgocenk-zd.ga/latifah/itil.php?movie=tt5129682&sub=KingCobra_gocenk71\n\n<3 MORE MOVIES :\n http://www-padudgocenk-zd.ga", "Too many guys with high education and no jobs who needs his habilities, only waste of money and social recourses...", "Totally sickening that humans can do this to animals, we don't deserve to be on this planet. Makes my blood boil seeing this :(", "That's OK. The current global economy rewards good public speakers while the people with actual skills are exploited.", "The women who act complaining about that will be the same women who will be waiting for adoption at an older age. Our modern societies are declining on its key principle, reproduction. What makes a person sad is definitly individualism and selfishness. Conversely, what makes a person happy and blooming is being recognised as a parent. It is disappointing to know that economy specialists consider family life as a feature of enslavement and poverty. Fortunately company life is changing for good and begins to propose new services to let worker's family thrive.", "The Iran deal is a multilateral agreement between Iran, the US, the UK, China, Russia and the European Union ratified and enforced by both the IAEA and the United Nations Security Council. No single party has the authority to scrap it unilaterally without first going to the UN's Security Council to get the consent of the other parties, and that's only when Iran doesn't fulfill it's own end of the bargain.", "You're kidding right, you do know 3D to 2D can be limiting. Are we drawing political maps or topographical maps.", "Learn how to understand people in your life: http://howtounderstandpeople.blogspot.com", "At least better than wasting money on college basketball / football teams.", "Your headline insinuates that a lack of a highly formalized managerial system and delegations of duty are pejorative things. Hrm.\n\nhttp://jobs.economist.com/article/how-to-delegate-effectively/\n\nhttp://informalinnovation.economist.com/", "The media made up the fiction, and half of the country bought it.", "why are hans always being blamed!! This is unfair, Hans suffer just as much", "Hire Donald trump to fix the problem...", "his national historical context was very politically predisposed to dualistic defaults, as was the oligarchically inclined and initiated political spirit of the working classes..... cant help but hand an inordinate amount of capital weight and leverage over to the private capitalist politics, wccs as they came to be known elsewhere of the vassal class model, complete with kkk equivalent classes, in serf position, with that amount of racketeering as presently noted in Russia, as elsewhere, requiring such a politibureaucracy and police ranking above the file of common folk from which to candidate, with the non compliant among them exluded and or lynched, as social contract, by which the most entirely disenfranchised were held as literally dead weight against themselves, as their lives were leveraged in parlay among the two lowest ranking classes, beneath the next political economic cliff up, to judges and lords, and generals and czars.... all leveraged against one another to maintain confinement to repulsion dynamics, as initiative to industrial draft of indentured labor.... anti trust its called..... hasn't changed in the entirety of human history.... whole thing never got passed the private politics....... the regime change that followed simply redoubled the oligarchy in most definitively oppressive terms..... with much the same private political class-isms overtly laundering essentially the same racketeer state with more complete military and police protection and the confidence (read Melville) of the people...", "Well one stagnation came to an end. The lying back peddler settled his university, not a university, providing course but not providing courses case. According to him, something he made clear he would never do. Like a good elitist he has thrown money at the problem to make it go away. He must have Lance Armstrong as his top peddling advisor.", "What if the world replace dollars with Euros as the world currency", "Where anti-establishment means anti-science, where it means being against evidence-based public policy and sound economic management, and where it only means being anti-all that has come before, it does not leave much scope for stability, or even for respect for the legacy of the founding fathers.", "Why should there be any 'Central'  Banks at all?", "If those bounds survived Bush&Bush, Clinton&Clintonwannabe, and Obama there are no risks", "Why? If you need to talk to somebody the other side of the world you can phone them. Surely there is no demand for this and it's just a company trying to get their name out there?", "\"Free Trade\" isn't \"free\" for the folks in the boarded up rural ghettos throughout America...... time to come to a consensus on what \"fair and equitable trade\" looks like", "The authoritarian clock back peddlers would much rather that Germany was not a liberal democracy but is forced to re arm and likley re arm Europe as well. Brilliant strategy.", "By this logic, Congressman Keith Ellison should not be a Congressman or the next leader of the DNC...funny, progressives support him...", "They both can make real tasty sandwiches.", "No one should be surprised by any appointments that Trump makes. He is fulfilling many of his scarier promises. And he is just started. God help America.", "p.s. after actually reading the article (a vom-fest in itself), i wonder, is the economist nothing more than a sinister corporate spokesperson nowadays? is that it?", "And the media continues to try normalizing a monster who is bringing white nationalists into the west wing.", "It's clearly a bad thing since the tech giants employ far fewer domestic employees than heavy industry like US steel. That, and the majority of tech parts are made and assembled overseas with slave labor conditions with anti suicide nets surrounding the corporate labor housing. The smallest % of US employees are design only.", "Since when is Nigel Farage a World Leader? Or Le Pen in France? \nFarage is about as much use to the world political stage as tits on a bull.", "Nothing wrong with renewables but forget subsidies.  We ought remoce all government subsidies in coal, gas, petrol, ethanol, all of it.  Level the field get the government out of o picking winners and losers and let them compete for the brass.", "Funny, I ate a madeleine today.", "Give Team NATO a round of  applauded for ruining another country!", "What's your idea about nationalists, do you know any thing about El Sisi in Egypt, he made it into the office through the army and false elections, he has no ground in Egypt except for some people with interests, he shouldn't be compared under any circumstances to Erdogan or Modi, you shouldn't put all the eggs in one basket, Erdogan and Modi are doing favor to their countries developing them and building on their inherited values, this may not comfort some people around the globe, but this pleases people of Turkey and India, which is not happening in Egypt. \nIn the US and Europe may the situation is a bit different, Thus the people there are feard of some terrorist org. the media has blown them up to be like a real giants, the refugees crisis is also a problem their, what firstly made this to happen, they are Liberals who just didn't put an end to some dictators like El Assad and El Sisi, they even supported them to torture and kill thousands and thousands of people just saying their views and opposing them, and they also don't let people of those countries to choose their rulers freely, people here are very desperate and oppressed they couldn't change their countries through elections as all the people do throughout the world, Is this justice ?? \nThis makes a very good soil to terrorism to grow and grow, and with some spices from the world's media, then the whole people felt as terrorists are on their doors, and Thus, the Nationalists in US and Europe gain popularity. \nFirms and Multi-national Corp. are also having a major rule, they just need to make very large sums of money even if it's on the shoulders of bankruptcy or destroying nations' national economies, they don't need to share profits which makes starvation crisis,energy and water crisis to be always on the stage, which let poverty strikes and strikes the majority of people in Africa, Asia, and South America", "Right.  And our neglect of the Liberal Arts and Sciences in a rigorous way has led directly to the election of a man as president who reflects (and thereby validates) those academic deficiencies.", "This is deplorable move by the Airline Industry. Greediness runs in their veins.", "Member when Hairy Reed was warned not to change the Senate rules? Happy retirement, compadre.", "I have to remind myself now everyday that I am not in some weird parallel universe. What is happening to us?", "They come from Afghanistan vey sad", "Nationalism is a territorial defense mechanism. This is a direct sociological effect of Climate Change. It is visceral and territorial as resources redistribute themselves, and nature redraws geopolitical boundaries.", "Driving Walmart, Hobby Lobby and the Dollar Store out of business? \nWhy punish his own constituency like that? Where will they shop?", "Make College cheaper???\n\nWhat's wrong with you, man?", "You got it Pontiac ! China's doesn't need Drumpf's permission to sell its goods to a growing market . Donny and his short pants boys can stay behind their big, biggest wall ever and make duck callers for themselves.", "<3 YES!! I finally found the Official link to-wattch M0vies-1080p.\n\nAlmost Christmas \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4649416&sub=clala_st_1\n\nHacksaw Ridge \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2119532&sub=clala_st_5\n\nJack Reacher: Never Go Back \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3393786&sub=clala_st_9\n\nInferno \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3062096&sub=clala_st_10\n\nMoana \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3521164&sub=clili_ov_11\n\nLa La Land \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt3783958&sub=clili_ov_12\n\nCollateral Beauty \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4682786&sub=clili_ov_13\n\nA Kind of Murder \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2726552&sub=clili_ov_14\n\nPassengers \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt1355644&sub=clili_ov_15\n\nAssassin's Creed \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt2094766&sub=clili_ov_16\n\nGold \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt1800302&sub=clili_ov_17\n\n20th Century Women \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt4385888&sub=clili_ov_18\n\nPaterson \n http://www.clala-clili-zd.tk/streammoviez/fullz.php?movie=tt5247022&sub=clili_ov_19", "Since when does Putin need to be emboldened to act like a dictator?", "What does that mean, \"From the archive\"? Is it a repeat of an old story?", "Rubbish. We have enough free trade agreements without corporations having abusive rights. \nStop the fear and war-mongering rubbish Economist. Salvage whatever journalistic pride left of you and start contributing to peace and sustainability!", "Totally unnecessary!!!!!!!!! This is outrageous cruel and the work of PRICKS - I'm sorry for swearing on Facebook but it infuriates me to the absolute core", "The problem with the Trump growth plan is it only benefits the one percent. And by one percent, I mean his bottom line.", "Less wars = less demand? :D", "It was there time two go....", "There are now more administrators then full time faculty. Tenure track jobs are disappearing, and classes are taught by adjuncts.", "Josh Schubert when are you going to invite me to a Schubertiad?", "Sorry, did you say China is not \"concerned\" with growth?", "Dale Harrison, did you see this?", "I think for every single thing you want in life there is something else you have to give up, and that goes for both genders . I am confident many men, for example , tend to give up valuable time with their kids in order to work more hours . \n That being said , I think flexible benefits and flex days are the way of the future . Ideally , flex benefits could be used for childcare for women who are mothers, or for massage , Botox , or whatever for women who have no desire to be mothers. \n Flex days are a good way for mothers to attend child related events and take care of sick children . Alternately , women who don't want to be moms get more days to travel or take extra online schooling . This way , moms can attend to their kids properly without it being perceived as an excuse to miss work .", "Haven't read all of it but he's black, so it may have something to do with any negativity.\nHe's turned the Co around has the Kardashians in his back pocket. Designs great clothes I gather and has made the Co a force to be reckon with again. Where's the problem?", "Wouldn't be the first time in the English-speaking world that a nation had to put down a subversive foreign plot originating in Rome.", "Kinga Derszniak ty to masz gust :)", "At least Lady Gaga never forced starving people to abandon their religious beliefs.", "It seems that mind set happens when you're being invaded but being told that to refuse is insensitive and propagating genocide and all the while it's a gigantic lie from the propagandists of leftist policies.", "Oregon's population has increased by about 4% since 2012 (3.899M to 4.087M). Voter turnout increased by about 10% in the same period (1.82M in 2012 and \"180,000 more\" in 2016).\n\nI'd say that's evidence of the value of automatic voter registration.\n\nThe Economist suggests it's a mixed result, but that's because it's using turnout as a percentage of REGISTERED voters instead of as a percentage of ELIGIBLE voters or voting age population or population. \n\nTurnout as a percentage of registered voters is a terrible way of measuring the effects of restrictive registration regimes because the reduced turnout is baked in.", "The funny thing is the ctr-left still thinks screaming racism  (or any ism) still has any weight. You're the little boy who cried wolf.", "The Russian's are emboldened, they are going to help Assad... Trump's win is going to cost more lives in Syria.  Assad will stay in power... even if there are no Syrians left.", "Marina Lazar Danai Psatha jongens. Theesessies??", "Why did they leave her fathers stutter out of the series? It was a big tension on him taking the crown and in the War.", "Poor Trumpy. Media just keep feeding you heathy what is, maybe, could do, want do, is true, not true but really they don't have a clue. Oh so sucks to be you.", "They managed to completely destroy logic by putting gender on forms here and selling fishing reels that make zero sense for casting and retrieval. Recognizing a terminology doesn't mean it's the definition. Some people go by gay, doesn't mean they're not homosexual.", "are they just peddling the old narrative to keep people distracted?", "Obama, Cameron and Merkel will all be thrown into the rubbish of History.", "They know he knows less than nothing about economics.", "Isreal is an ethostate. Any problems with that bit of white nationalism?", "It means that nobody really knows and that pundits like you and others have earned the right to keep quiet and let us think.", "Anyone caught doing this should be whacked ASAP. Anyone buying should be jailed for life with no chance of parole.", "As a Japanese, I doubt his expeience. Is it a real story ? Such a way of ordering sushi, without instruction beforehand even if you were a \"foreigner\", does not exist in Japan...He should wait for another inquisition, like pinpointing the restaurant and asking a waiter whether the way he experienced is possible on the phone.", "Glad to see TTIP terminated. It was purely designed to give the global corporates control over national governments, to the detriment of working people in the developed world.", "yet another reason why Hillary Clinton is not president.", "Libya doesn't need to be a single country.", "Muhammad Taha Sadiq bro must read... the world has given over conventional right or left... It's all about nationalism whether it's Erdogan, Putin, Trump or Me ;)", "Well done economist. That article totally misses the point.\n\nThe point is this. Neoliberal capitalism is different to the capitalism of the Keynesian period, which is different again the the capitalism if the inter-war period, which was different again to that of the guilded age etc.\n\nIn between all of these periods there is a time of interregnum when the old consensus is swept away and a new consensus is achieved; thesis and antithesis leading to synthesis.\n\nThat has been the strength of capitalism, it's ability to adapt as necessary, but rather than behave pragmatically and and adapt since the financial crisis, neoliberal capitalism has dug in and decided that the upward redistribution of wealth is more important than the longevity of western civilisation.\n\nIn short neoliberal capitalism needs to be consigned to the dustbin of history because it is the true path to serfdom for the vast majority of people and could cause the extinction of the human race. \n\nCapitalism must adapt again or it will give way to fascism or some kind of neo-medievalism.\n\nSo it's not really capitalism that people are protesting against, it's neoliberalism, and since neoliberalism is the philosophy that dare not speak its' name, most people don't know what it's called; so they protest against capitalism.", "If the airlines didn't have to pay union wages and benefits then perhaps they wouldn't have to resort to these cost-cutting tactics.", "If everyone has enough why do we care if someone has more?", "Maybe the schools could start by teaching ethics in journalism. Lying scumbags.", "Lenka see I told you they would make faster planes", "Cause it's the climate change ? Bah...", "Not they are takung over the philippines", "Jihad is inspired by a sense of injustice traditionally, that's understandable, everyone has their own personal Jihad, it drives their actions good or bad.", "Newest member of the Trump Kakistocracy"]