["They are the best forever. I vote them number #1 ever", "I'm sad there are not more movies", "this film is very gud nd my fvrt", "Jemma Lee couple of these I remember being you xD posters and that!", "Happy birthday Bella I hope you have a good one be safe o by the way went is the next twilight is coming out", "Best movie...i cant get enough of it", "It was   a love it ........  .!", "The wedding and we're they lay in the field and she shoes him all the reasons there in love and the thousand years song was so perfect for them", "I just love edward and bella...one of my bestest movie..i just cnt fed up of this movie...i cn watch as many times ... as i can ... wow , wat a love story ....", "She's so boring.     Edward,  what are you thinking?", "me segue eu sigo de volta <3 <3", "I love when he hugs Bella and says he is happy to have her become part of the family!!! Happy Birthday hunk!!!!", "(Pushes Jacob off porch) You imprinted on my daughter?!\n\n(Dad in living room of Cullen house) I've just seen a kid I've known his entire life, turn into a really big dog...", "the best movie in the world ..", "even the joke \"why is six afraid of seven, because seven ate (eight) nine\" is still a better love story", "Just like the first part of this movie.... Rest of the series is boring", "no jacob does i your face robert", "Okay, So I have a question. Are Robert Pattinson and Kristen Stewart dating or what? I lokked it up and some webs said yes and some said no. Im confused about it.", "oh yeah , i love all the The Twilight Saga movies", "He was always my fav twilight character", "Can Brazilian fans watch the short films?", "i wish i could b bella lov dis movi", "I love them all I've seen the movies more than I remember the books at least 12times", "It really figures out pure love.", "Please make more Twilight movies already! :)", "he is cute father.i love u world all fathers", "twilight is still my favourite <3 <3!!", "Omg m a die heart fan of twilight series Love u Edward     mwahhh", "i like this movie ,i watch this movie many times ,u both are lovely", "Well bbc three has managed to turn taylor lautner into a complete idiot ruind him cut his hair really short n all sorts and called him dale.", "I may not be able to tell you this every day but I just want you to know that you mean the world to me. The day you stepped into my life you changed it into something so beautiful and meaningful. I may not be the first woman in your life but I want to be the last woman you ever loved. I may not be the first woman who made you feel loved but I want to be the only one to make you feel loved to the core .", "Yes just the movie... I leked..always..", "Pleaseeee! Another sequel! Been waiting for the battle of Volturis and Cullens!", "The best of luck in a while ago but I have a good conversation about me and you conversation about me to do it for years yoga class", "No measure of time would be long enough with you but lets start with forever <3 <3 my best part ever", "It;Lovley  & Intrsting Story\nI Like It", "Happy Birthday kristen! Love you so much you're the bes vampire ever", "Ciao ditemi tutti i film sono rimasta alla visione di elis di jecob e remesme pliss", "i love twilight i love it so much when its on the movies just keep repeating and i still watch the same over and over again I LOVE EDWARD", "Miss you edward and bella \nTwilight forever\nThe best ever...", "Will she ever publish midnight sun or write again? -Jessica Garcia from Fort Worth Tx, huge twihard fan!", "Happy birthday but i didnt think vampires aged? Have a cup of blood from me x", "ya i really like all part of twilight series", "I'd never given much thought to how i would die but dying in a place of someone i love seem like good way to go", "Yes to all except #9 (I never planned a trip to Forks), #15 um cause the vamps in Twilight didn't have fangs and none of my MANY copies of Twilight are \"well worn\" because I took care of them as I read, their spines aren't even cracked! Oh and change all the \"had\"s to \"have\"s cause my room is a freaking Twilight museum.", "I only read good books. Not that trash.", "oh my this is it taylor lautner", "Imprinted on someone is like when u see her everything changes...it's not the gravity holding u to the planet..it's her...", "the twilight saga movie why not proceed ?? unfortunately it is no longer as popular as movies made goes", "Happy birthday hope You have a wonderful one", "I have seen All the parts nd this movie is 1 of my fav. Really this is such an Increadible movie nd a Great love story too...", "this is soo wrong, it should have been this:\nhttps://scontent-ams2-1.xx.fbcdn.net/hphotos-xfa1/v/t1.0-9/577766_465036206867040_2100773175_n.jpg?oh=69d24b0667d57f95b079999f31955822&oe=575FB6C7", "Have a happy father's day handsome", "Nice pic que hermosa foto me encanto felicidades.", "Taylor  with long hair looks gross. So glad he cut it off. Men just shouldn't have long hair.", "i love this movie sooooooooooo much..", "true love between edward nd bella.,,everyone loves both of them....i also love the story.", "Yvonne Marie... i didn't even recognise him!!", "OMG.. I see \"Evan Peters\" :)", "Piano cover of \"A Thousand Years\" by Christina Perri. smile emoticon\nhttps://www.youtube.com/watch?v=B0ssAI07zNU", "Twilight Is my favourate especially Robert Pattinson( Edward Cullens) and Kristen Stewart( Bella Swan)", "Excuse me.. just wanna #share with you all.. Lets Download Android Hacked Games Here-> http://bossapk.com thankyou", "i love this part  :)", "Everything happens for  a reason. So live it, love it, learn from it. Make your smile change the world, but don't let the world change your smile.", "Happy Birthday!!! I loved Twilight so much its always in my favourites lists!!!", "So with all of this twilight new saga  movie news .  it true there will be a one last closing Twilight saga movie ??????  I hope so.", "Are they going to make a movie about Jacob and Bella daughter", "Twilight breaking dawn part 2 gives you the best way to get the most of the best", "I would LOVE to see Midnight Sun finished, but this is a step in the right direction - it shows that Stephenie Meyer hasn't forgotten her inspiration!!", "o,,,,m,,,,,g,,,, i really lve this movie iam witing 4r nxt mve and i lve u so,,,,,,,,,,much twilight team i cnt tell in wrds tht much i lve u guys,,,,", "i love you so much stephine . you are really looking out for the women", "Dios mioooo., adoro esa historia . Me encanta la saga \"the twilight\" tengo toda la saga y siempre la veo ..", "Happy birthday  adward  twilight  saga i love bella", "Together they both look so cute couple...!", "I love\"Twilight Saga\"soooo much. it's a my perfect movie and still in all the seasons", "#ManyHappyReturns.. You rock the twilight.. I just loved the who twilight series.. First on fvrt.. And watching again'n'again.. Every night the music playlist i put on is 'HR Twilight Fever'.. Mad..", "Jacob can phase on the fly....love Jacob.", "I love all series, yesterday I see first part.", "I lv Twighlight so much n ds msg iz so cul", "Wishing you a awesome birthday! your a wonderful person and actor.", "so introduction my self berihun best", "Im in love with twilight\nI love the story\nHands up for Bela Swanand Edward Cullen\nAnd also to Jacob\nI could watch twilight all the time i could never get tired of it\nNo.1 fan", "They are so cute together. Who agrees?????", "my favorite!!  I'm ready for another marathon day with friends.  have to have one now and then", "Can't wait to see KStew in Personal Shopper movie!", "I Love You Twilight.Its A Touching Lvu Storie.6 Part???", "Love it, she just should have picked the wolf boy! He was a cutie. :-)", "HELLOOOOOOO       LOVE SPELL CASTER  BRING UR LOVE BACK    BRING UR EX LOVE BACK                        A great Indian love spell caster for love back . specialist in love problem solution , husband wife relationship problem solution ,lottery no specialist ,beauty spell ,money spell ,spell for business . get result within 24 hour . contact now +91-9780225275 call and chat on whatsaap", "one of the suplendous movie ... twilight n twilighters Rock ...", "I'm waiting for next part of #Twilight...!!", "I love twilight saga happy birthday.", "Happy Birthday, Bella!  We share the same birthday!  #VirgosRule #VirgoNation", "Happy mothers day to all twilight fans", "Love twilight  best love story", "I will try again....what happened to Edward's story...Midnight Sun? It was beautifully written, and gave so much more depth to the Cullens and Hales. Edward was by far your best character. Sad his story was never finished.", "I remember that he has changed too quickly, how was it possible?", "I'm just not a Taylor fan because I couldn't see him as Jacob. He's a cutie all right. He's not Jacob. Happy to have graphic novels picturing a 6' jacob", "Twilight is cool.go bad boy style", "I wish they would make a movie on Jacob and renessme as a couple in love!!", "Reason why i watch twilight Renee Damaj", "I love this movie..... \nAnd Edward and Bella both of you r just Georges...... Lovely", "Oh my god,,,nice body of Jacob", "Hermosa historia lastima q no exista!! Yo kiero otra peli una nueva x favor feliz diaaaa", "I love this movie very much", "Twilight will be my life forever!! I will never stop loving the saga!", "I'd really like to c her in a new twilight installement with taylor and rob and the others", "I love watching twilight and I'm in love with Jacob black he so handsome.<3", "My good actor Jacob lovable boy", "I LOVE YOU  ROBERT PATTINSON", "But your expression says something else :P", "I do love Robert Pattison .", "I wanna get next part \"twilight saga breking down part 3\"or new name \"twilight breking down angel\"", "If she wants to continue with the TWilight stories, she should complete Midnight Sun. Twilight from Edward's point of view.", "Man I always wanted a love like these two", "buona serata a te e buon sabato a te .", "I've never actually seen the movies, only read the books... Is that Alice with Bella?", "I love the Twilight Saga, forever", "I love twilight saga film so loving", "Just watched all the movies again. We need a spin off of Jacob and Renesma", "daughter and father hmm very lovely.", "Love spell caster love spell caster      Love spell caster love spell caster   Indian words no 1 love spell caster lottery spell, LOVE PROBLEM SOLUTION, money spell, HUSBAND WIFE PROBLEM SOLUTION, relationship problem solution contact now for spell +91-9780225275 call and chat on what's app", "No1 Spell Caster, trusted Love Spells  +91-9780225275 \n 24 hrs results\nget your ex-back, get-your ex-boyfriend back, get-your ex-lover back, get your-lover back, get-your-ex girlfriend back, psychic reading , spell caster, black magic, lost love spells, lost love spells caster, lost love spell, love spell, love spells, love spells caster, black magic spells, cast a love spell, love spells testimonial, black magic love spells, love spells that work, powerful love spells, bind-us-together, black-magic-expert, black-magic-love-spells, break-up-spells, breakup-spell, divorce-relationship, psychic reading , spell caster, black magic, lost love spells, lost love spells caster, lost love spell, love spell, love spells, love spells caster, black magic spells, cast a love spell, love spells testimonial, black magic love spells, love spells that work, powerful love spells .\n\nONE CALL CAN CHANGE YOUR LIFE .       \n\nCONTACT  +91-9780225275  CALL AND CHAT ON WHATSAPP", "oooo finally When cannot wait marriette schoon", "Black tiger gentian inside a second trip to school preview 22222 it was these two quantities for the society no me comes just as changing nervous system", "Wat een heerlijke film is dat...zou graag de laatste willen zien..die waar hun kindje al groter is.....iemand een tip voor mij", ":)so wonderful story...more on lessons...what is the real world meaning of love...", "WIsh yOu a hAPpy BiRtHdaY KeLlEn LuTz", "Star Wars for my grandson :)", "Robert is so gifted and talented, and I wish him the best.", "I hate when authors do this they just take the same story but from a different perspective. Give us something new", "I love to watch twilight again and again....", "pls...edward & bella send me more of your photos together....pls....i am one of your supper fan...", "same an seneg vidio twowelig a", "I want more part of twilight", "I love twilight.I never forget the story of it.it's really beautiful.", "Have a very Happy Birthday Esme. XX", "sibaranun suatu pulau yang indah ,di nias tello,laoutnya tenang,panoramanya menakjubkan,diapit oleh gugusan pualu 2.", "its a nice movie full of Roman's even if it confuse me a little bit but i like it .the guy i like there is the wolf that guy who is in love with that girl", "twilight saga always quinch ma thirst n i love it ma sweet wolvestwilight saga alwayz quinch ma thirst 4movies i love it!", "they were so beautiful together! Miss them  :(", "Farid apakah kamu mau menjadi kawanku, aku icut,cut chintia", "I'm a big fann of twilight...", "May hmmm what movies are we watching on our mommy night out.. Julia Roberts or twilight hahah", "i have watched the complete twilight saga series so many times and can watch this movie whole day and night never got tired of it because it shows the real and pure love.", "Oh dear! Volturi is coming. Let me show what will happen and scare the hell out of them.", "I can watch this movie over and over never get enouth of it", "Naby Mohamed Dieng c est celui ci que je connais moi", "Happy 10th birthday The Twilight Saga. I wish you will continue making movies I love Bella Swan cullen and Edward Cullen...", "I loved the twilight saga!!    please finish midnight sun... plz?", "Bappy birthday i love twilight so much", "what a perfect picture !! i\r\n've never bored 2 watch this movie over n over again !! i'm waiting 4 d next episode.....", "When they climbed the top of the tree", "Back off you idiots...I will not respond to any of you. My opinion of these movies and actors are just that my opinion.", "omg so nice its beautiful i love it", "I miss these movies so much!!! There just has to be something else coming...they just can't end it LOL", "I loved the series, but it seems like SM keeps trying to capitalize on the same story like she \"got lucky\" with the concept. I'm not interested in reading the same story with a gender reversal. I want to read new stories. The twilight series were such a fun and exciting read! I want to see her come out with something new so I can get excited all over again!!!", "I'm the biggest fan in the world \nI'will see you live", "this I our mother daughters and grand daughter time watching twilight !! and we are right now!!!", "Happy birthday... Wishing you a many more happy returns of the day...", "i'm not a fan of valentines day but if it involves twilight then ok!!", "Could never get bored of watching twilight", "Why does she never give up? She's not a good writer, and Twilight's not a good story.", "Just re watched a couple days ago.", "salut tout le monde dite vous avez un lien pour regarder le chapitre 4 partie 2 je n'arrives pas a le retrouer pareil pour le 5 partie 1", "Oh my god this love story is so sweet! The reason Edward Cullen is my favourite character is because he would do anything for Bella and he would literally kill for her, he is a true hero! No spoilers please btw", "This is a GOOD photo for a Fathers Day salute on here", "Great story, great movies! Just sorry you gave up on the story.", "How did you come up with such beautiful love storyies...??!! Are there more to come..?? I certainly hope soo.. because after reading and watching twilight saga , I really want to be a vampire..!!\nThanks Stephenie Meyer for such wonderful love stories. You are certainly awesome..", "this scene was so cool...the stunt people couldn't do it, but the actors could....very cool.", "The only love story which neverens", "OMG!!! ICH LIEBE TWILIGHT!!! HAPPY BIRTHDAY!!!", "Tau Ga Sih Orang Yang Sering Kepo Sama fb km, Caranya Buka www .Wapkepo .tk", "Love how he knows now it's LOVE and not just her blood he wants <3 That look on his face says it all > <3", "I loveeee movieeeeee and sooooooo niceeeeee", "i really enjoy the film many times", "I Love the twilight\nILove Robert tumas pateson", "Happy birthday Kristen!more years to come,", "If allowed I want to Ask a Question", "https://www.facebook.com/Vrenzolaio-%C3%A8-Gossip-530243943808565/ mettete mi piace alla pagina grrazie <3", "Love you....Edward and Bella.the twilight saga,,best movie ever..and you best film of my live", "I thought that they were going to make another like edward and bellas daughter gets into a relationship with Jacob and get married and have a baby and the baby is half ware wolf/ vampire/ human lol they didn't think of what Alice saw at the end of breaking dawn part 2..", "I love Twilight is the best  movie:-)", "I am hotter than you! (In the tent in Eclipse)", "The company I've worked for now for 2 years is hiring again. We need 50 new people to work from home, simply copy $ paste ads in online. You MUST be at least 18 years old and have access to the internet, either through a computer or smartphone. - No experience is required, so everyone who may be out of a job / work, and in need of income, can get started today. Average pay is around $400-$600 weekly. with both FT / PT positions available. Choose your own hours and days you work.... If interested: You MUST MESSAGE me through FB saying \"INTERESTED\" and I'll get the info to get started to you within 24 hours. Be sure to check your \"other\" folder for the info, as most messages between non-friends on FB go to that folder. Thanks and have a blessed day!", "(Quote) I'd never given it much thought to how I would die, but dying in a place of someone I love seemed like a good way to go.", "The best couple for me and I love this movie I can see every day its perfect well kiss from Greece Christine.", "I liv twili8 saga every part its my favrt movie", "Twilight my best favourite movie,i lyk it so much", "noooo are u seriouse twilight is the best and the one but the hunger game is just filme not like twilight", "Hey! The town of Port Angeles is featured in a contest to win Best Town of 2015! Twilight was amazing to this town and we could really use Twilight's fans to help us win. This will not only help Port Angeles but Forks too! So vote for Port Angeles! This round ends Saturday at 8:59 pm http://www.outsideonline.com/1972941/best-towns-2015", "Happy birthday...hope your wishes come true,hope you will be a better person.", "Twilight forever. The sweetest love story so far (I'm on the second book, no spoilers!)", "Alexandra I cal good to me and I wonto to gent am interviw for my vlog \"adore Twilght\"", "Great movies  watched em all", "Det har jeg sikkert. Men har fortalt dig det alligevel Josephine Jensen", "What about a book about Jacob and Reneesmay?", "happy age day edward cullen :p", "I love everything to do with Twilight! I have like everything u could imagine but the biggest thrill was going to The Twilight Convention. The pictures I have with the actors. Autographs and all the memorabilia! Team Edward all the way!!!", "Love the twilight ,happy birthday !", "I love her caracter as minie on 'the help' movie", "MAKE ANOTHER TWILIGHT MOVIE. COME ON!!! :)", "Who is going to read Stephenie's new book? I hope it is edited better than The Host.", "Do you want to be Bella Swan? Join FaceStar App!  https://www.youtube.com/watch?v=qlUvhvSvqAg", "Super love this pls continue the twiglight breaking dawn", "He is ADORABLE with long hair and GORGEOUS with short hair!", "I miss u guys so so so muchhhhh", "when will twilight saga; breaking dawn part 3 is coming..i am waiting for that day", "Been watching the Marathon since yesterday", "Piease send me all part names.", "no question,,just saying that was awesome story,,,", "ah i miss this!! hahahah even tho it's so bad Savannah Mouat", "Bella swan udah jdi cowo dan suka sesama jenis...! gak seru,, dan gak romantis lg...", "Yo amo esa escena... La he visto mil veces y me encanta", "Theresa Halbig just in case that you forgot....", "I'm reading Anna Dressed in Blood now!!", "So beautiful i like it ilove robsten", "hi John I like  u so much.", "Happy 10th birthday twilight...i love all of the twilight movies. the best movies.twilight is my favorite..i like it", "I start again this series now and i love it... Uummmaaaahhhh (kissed)", "I love tha twilight saga is nice and awesome movie i love all tha series of twilight", "maldita sea creo que siempre he querido que me digan eso", "i love the twilight so so mush and i hope to every one to enjoy and i love pella swan and edward", "This was truly a beautiful love story. I loved it!", "Hey beautiful! , very happy birthday", "Kehna to bohot Kuch he lekin aj itna kehna chchahti hu jo mere sath kiya Vo kisi or ke sath mat karna my love kisi Roj barish jo ay samjlena bundo me Me hu subha dhup tumko stay samjh lena kirdhoo me Me huhwao me lipaty hui me gujar jaungi tumko chchu ke kuchch kahu ya nahi tum mujhako sdha sunate rehna bas itna he tumse kehna I love you Jan", "I love this movie  so much", "r u going to start how each character became a vampire instead of the short version (r u going to make a long version like how jasper had met alice and how emmett met rosalie)", "My favorite all time romantic movie!! I makes me feel good! Thank you and Happy Birthday Kristen!", "I see this movie and I like it.", "Beautiful.. \nCant wait for the next one to come", "Wished they make one of Jacob and there daughter", "I hope the finish happy ...", "That was the most beautiful wedding dress I have ever seen.", "Happy Birthday . .......<3 <3 <3  I love Twilight <3 <3", "Happy birthday Elizabeth thank you for making my Twilight experience a great one", "Hope this helps you heal, it worked for me. http://www.ebay.com/itm/KESHE-HEALTH-PEN-TREATS-PAIN-INFLAMMATION-SICKNESS-AND-MORE-KESHE-PAIN-PEN-/301900026125?", "Am always in fairyland whenever i see edward's face...soooo romantic", "I love the twilight films, my favorite characters are Bella, Carlisle, and Alice and Jasper. I love the other ones too of course.  I have a bunch of great idea's for some twilight films, I mean great ideas.  Whether others would like it or not I don't know, yet it would make good stories I think. Such as, perhaps Bella loses Edward and she has to deal with being not only a newborn single mother vampire, yet also with the loss of edward.     And another idea is to do a movie of how Edward became a vampire, and in that same movie, how Carlisle did too.  anyhow just some idea's.  I wonder if they will bring out the new short films onto dvd?  :)   anyhow anything they do with Twilight, I look forward to.  God Bless ya all.", "paki kiki yo kadun  apiyagotas ka babasang kaon", "Eza mi peli favorita,x ezta genial,donde el amor lo pues todo", "IM INLOVE WITH TWILIGHT I EVEN WANTED TO NAME MY DAUGHTER TWILIGHT...I THINK THE MOVIE PARTS SHOULD GO ON STOPIN IT WAS A MISTAKKKKKE", "I like them so so much,,,,", "Maciej Karkowski po 15 tu operacjach plastycznych u doktora Szczyta", "Ahh, the ability to see what she has seen before it has happened.", "HI :D GET DAILY 3000  FRIEND REQUESTS ON FACEBOOK USING THIS AWESOME WEBSITE WWW, ADD3000 ,COM  :)", "my favorite part I love it.", "i love twilight ,,i love that hero ,,may god bless him", "I think their \"relationship \" was hype for the movie. The stuff about her \"cheating\" was the way to end the tale. She says she has always known she was attracted to women. Hollywood has been using this storyline for years to add to the hype of the movie.", "happy mothers day i wish u were my ant", "I love you twilight moive team Edward are the best..", "I wish twilight saga Breaking dawn pt.1&2 would still have an extended Chapter :'( I really want this story so bad...Most favorite movie ever", "Wow me encanta es super guay todos los dias los veo son muy guay me ENCANTAN es la mejor pelucula que e visto en mi vida, bno hasta ahora", "Another movie of robert ang kristine pls...", "OMG PEOPLE STILL LIKE THIS?! YAY!!!!!!! HELLO MY FRIENDS!!", "If only Edward would be there", "Just put this 1 on :)", "i   always    watch this  movie  and the     others  my  favorite  is   when u  turn into a   vamp  like  edward   lol  i  love the  movie", "I love this movie so much", "Oh my...... Edward and bella u a my favorite couple u make me feel... I cnt eve explain the feeling***^o^", "I can't believe that this series in its entirety is not being shown on HBO, STARZ, CINEMAX, or SHOWTIME...", "I love do chracters of jac0b. . . .", "http://www.folksrelation.com/2016/03/a-short-story-of-good-people-polite.html kindly meet with the reality of human being and see how god will always help right or good people . i am sure about it you will love my views must read once", "Is there going to be any more", "Pleaaaaaaassse.. there is a new part of twillit or not ?????", "I LOVE ALICE, SHE IS A WORK OF ART.", "I love you twilight is my life i wish i was part of it. Its the best", "Would like to know how it feels.... Just saying", "I wud be just thrilled if ther was a 5th film of the Twilight....so much!!! with the same actors!", "You also remember that you ve first hate the film ;) because the book was such better!", "It is doing another film series Twilight? :)", "owesome movie & my favourite movie", "My most favourite movie. \nI hope this new movie FALLEN is as good seeing it has the same creaters of twilight.", "Two amazing guys always there for a beautiful girl... Love Twilight", "Happy mothers day to all twilight lovely nd cute fans", "LOVELY AFRIDI <3 <3 _________^^^^^^^^________  BOT !!! AMIR AFRIDI :", "Still sexy....I would be a cougar to that young wolf pup....", "Oh Edward my Edward . . .", "I love love the twilight movie", "wanna die to see the next part ... my love edward", "LOVE, will watch again, and again, and.........", "Me encanta toda la saga como me gustaria conocer a los actores me facina esta saga :)", "I love and miss Twilight! Wouldn't it be awesome if those movies could just keep continuing as we go through life. One thing about these movies you feel like they're real people and it's real situations it's never going to Anne. Twilight forever!", "<3 twilight saga is my Valentine....", "When can we watch these short films??? Nothing else!!! And the comments on this page are so rediculous!! People pretending there Edward Really!! And these are not twilight movies!!!", "step 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choose", "Happy birthday to the 1st and the best female vampire actress EVER !", "I love twilight but Robert has moved on with his life and has a fiancee let's respect dat and not be stuck in the past"]