["First try, what a beast, love the globetrotters!", "She happy living in a shitty house. Plus she act like she ain't just walking in the house from sucking lamars dick on the elevator. Bitch look like young MA grandma . This a grown woman who just messed up that lil girls life smh shii crazy", "Left wing media is bunch bitches, cry like little kids. Funny how even when they are adding up the election again they found trump gained 27 more votes so far lol", "Of course theyre gonna supply the bananas and then wonder \"oh fuck how did they make weapons out of the bananas, the bananas we supplied them\"", "U have a great fuckin time that's what happens", "Motherfuckers eating pork, smoking cigarettes, drinking liquor, snorting cocaine, fucking these hood rats and trailer trash hoes but won't fuck a bitch because of a tattoo...smh foh...", "Lara Schaffer I feel like this is somewhat close to who you are hahaha", "Wait y'all before we go crazy Manslaughter is different in each state. Manslaughter could have him locked up for life without parole. Don't jump to any conclusions yet", "And all the hoodlums just gonna let that happen in their own hood store... smh that wouldnt around here.. disrespected at its finest bc a nigga was so ballsy not to leave when told to...", "The white guy was not only wrong, but double his size and was only saved because the black kid was scared he'd get caught beating a white guy down .. very sad .. granny was funny AF though!! Lol", "Bruh.. Just her saying not to be recorded at work , in the airport.. and he still did.. She can sue for way more than 15k leave that gay nigga broke selling ass back on the streets...", "The media cares none. It's all just a story and how many likes they can get. Though this man might not have had his building up to code, you could hear the pain in his heart. Leave the guy alone for a day or something, damn!", "The last thing you pigs want to do is start challenging people to fight. We've all seen the beatings you take when you aren't protected by a pistol, and I know a few guys who would pay a lot of money to be in a ring with you pussies, let alone have you challenge them in the street.", "Mannnn we don't know what happened. Who are we to judge? I don't particularly love either of them but she's married to man who quite literally thinks that he's god. How does that sound like the makings of any type of healthy relationship? Sometimes it's not your responsibility to be someone's savior, especially when there are children involved.", "There was \"overwhelming evidence\" that they were doing it prior to Election Day... Nobody gave a fuck until trump won.... There's also \"over-whelming evidence\" that Hillary Clinton has committed multiple crimes and killed Americans as well... You STILL... Seem to not give a fuck..", "This is Trumps fault!!!! (Can we blame everything on trump like they did Obama?)", "That dude should be worried about the hoe of a girlfriend his friend has.....actually why is this dude fighting someone for fucking someone else's girl?", "Damn. Chill with all the white boy nonsense. It was just one dick, not a synopsis of a race.\nAnd frankly, brother man could be nicer to his damn customer.", "Fuck that I'd move, after two break ins? He's in the NFL time to use some of that money towards security systems and what not. Scary world. If they are willing to break in and write these nasty things what else are they willing to do...", "People on here obliviously have no idea how much money the WWE actually makes", "I be doing just that making my shit straight tunnel vision hoping I don't crash my shit in the process", "i bet theyre gpnna say hurricane katrina was racist too.....damn you katrina", "Omg how silly!! He appointed the co-founder of a multi-billion dollar company to be the head of small business administration and not a politician who has never run a company in their lives. Where's the logic???", "Was hoping to see a good fight, I mean the caption made it sound like that dude was some beast ass fighter when in all reality none of them know how to throw a straight punch.", "It's legal where I'm at so I'm good", "Another slut ....nothing new...if shaking ur ass is what brings u money ,u a hoe,,IDC if u stripping or so called cheerleading,,, we all know what a cheerleader is?", "In his defense, he has probably waited his whole life to get an autographed shoe from a sports star. So why should the kid get them just because he's younger?", "Dear Jay Z give me a few thousand bucks and Ill give my soul to Satan like erbody else", "Of course he did, he's gonna turn America into one big reality show, not that it isn't one already. Watching the news is almost more excited then daytime television anymore.", "The real reason why people died is the damn high cost of a regular apartment in that area if housing was affordable people wouldnt have to live in warehouses", "Everyone has a plan 'till they get punched in the mouth.~ Mike Tython", "I'd show up on time every day just to slap the dog shit outta someone", "Manslaughter if people don't wake up lol that's they are giving people that intentionally kill African Americans and latinos .. it's right in our faces so sad", "I wouldve done the same thing, Rich ass kid ... fuck you id sell them too lmao", "Charlotte Rose Ellis if we lived next too eachother", "Cross faded . Only the strongest survive . Feels like you're ON!!!!!", "First words to mind came out of my mouth out loud when I saw this pic \"Jesus fucking christ what on earth...how the fuck...whatr in gods name...I...I can't do this right now.\"", "I would have too much money to count God has been good to me this year", "Its hard going into public stoned af i feel like everyone knows im high af but i still get my shit and go", "Damn that's shitty, how the slut gonna wipe her ass now!", "Total pay-for-play move. She ran for the Senate twice and lost because she sucks and wants to crush the working class, so now she just cuts Trump a check and boom: head of small business", "these thugs and savages make it not safe to attend family sporting a vents. Bunch of THUGS!", "Why are women always slut shaming each other, we all know she suck and don't bush her teeth too.... Why she blaming this poor little girl instead of her son an ultimately her poor parenting skills. She just jealous that no one wanna give her the D anymore!", "A message from me to the world: quit asking for mercy you little bitch, and suck it the fuck up.", "Johnny Manziel's constant struggle with alcoholism & the poor officiating in the NFL will not distract me & my fellow woke Americans from the fact J. Cole went double platinum with no features on his last album", "Mofos is writing paragraphs....LMFAO...one word people's..one word...and Ya wonder why ur year sucked so much.....", "Only if you're a dumb ass who doesn't get a separate cover for yourself.", "Ass shaking videos are old now....you don't know what's real or fake these days", "Tasers or rubber bullets are less likely to work especially if someone is high on adrenaline. Someone can cause a lot of damage with a knife.", "Kelly Carter this was you that one night I met you and said you were going out but you werent even dressed yet Lol", "She isnt wilding, she is a sick piece of shit. What in the fuck is wrong with you? She should get ragged for this shit until she doesnt even dare to think about little kids in this way no more. Cut her fucking clit out, god this makes me so angry.", "I'm tired of black people calling each nigga then crying a river when another race uses it the exact same way (non racist way)", "Brittle ass hoe. If she was my kid I wouldn't help her do shit! You better go stay at a the old folks home with your grand mama and beg the nurses to help clean your stupid ass.", "You know it's great in all that they have everything out in the open, but the stupid thing is tables are so close to the doors. The first video shows one person taking five steps and he can grab the phone and out the door. SMDH", "Oh nah someone did that to me i beat the M&m's out of em, stomp they ass to reeses pieces and make em taste the rainbow through my fist", "the hands on that bitch. look like a fuckin sasquatch. big ass 360 degree basketball dunkin hands.", "Birthday\nNo car problems\nNot on that air sandwich diet\n\nGoing for the EXTREME LOW BALL.", "I mean its sad but on da bright side, hes chillin with his homie on the other side right?", "Damn homies gonna lose his apartments now lol Sue the shit outta him", "He had commands and shot once and is now in hospital if he was black he wouldnt of gotten such luxury.. he would of just kill him, a Black person with knife is like a Christmas present to an American police officer", "Everyone is talking about he's drunk and they riding the bus so they both broke. None of that matters. The real story here is how he basically said Mexicans are hard working and get money and blacks r lazy and on welfare. This us the sad logic of a lot of our border brothers, especially in cali", "Just cause he black, people wanna catch feelings! this shit happens every day in jail no matter what color your skin is... Hopefully we have a world war and it ends all of mankind I'm tired of living around human beings that think skin color makes them so different from each other.", "Try this: J COLE ALBUM DROPS IN A FEW DAYS", "This woman_must_ have Ehlers-Danlos type VIIA which has the gene for Osteogenesis Imperfecta", "Fuck that, ill put on a hoodie and sweat pants and leave that window wide open if she think thats how its goin", "Looks like hotdogs left on the grill too long.", "Wtf does he care? Dude is making millions and acting like it's been a tough 2016. Gtfoh", "It helped me with my seizures 7 years ago. I haven't had a seizure since", "In the picture there is 3 kings and 1 baby Jesus 3-1 warriors blew a 3-1 lead", "Grandma saw she sent that to her grandchild and immediately went to delete the dick pics she's been getting from Elbert before they come over to check her phone lmfao", "This is what the White house is going to look like ,a joke", "We dnt need kanye from the crash m.f. Kanye made a lot if things happen and POPPING!!", "I love coming here to read the comments. Some people (like myself at times) are obsessed with reading comments. For example, we find you reading this comment right now, which does not contain any useful information, only curiosity, that drives you to waste your time. Have a good day.", "The beat was pretty bad but buddy went crazy . This nigga got bars . If anybody calling him garbage yall must not understand what he's saying . He probably to compliance for you . And p.s freestyle s don't have to be off the top .", "Wash your mouth out buds lol", "Me and my mother went to Victoria's Secret on Black Friday same s*** happen to us except it wasn't because nobody stealing she tried to act like she didn't see all these white people walk in when she see some black people walk in she going  say hold up the stores too full when.... I say I drag her ass  through the mud i embarrassed the dog shit out that bitch in front of everybody ...", "You whole style is bitten, pieces ain't hittin!!! Yeah, she bodied Nikki.. Lmaooooooooooooooooooo Get her Rem", "All I see is Police is a organized mafia trying to take control of citizens, and this guy's eyes clearly show in the picture he didn't do anything wrong. It ain't about race wars come on people.. can't you tell the government is trying to blind our sights with media and feed us some bullshit infos, while they grow more political power, fuck the feds and government, one day truth will reveal and I'll watch citizens in shock.", "The bitch that cheated gave him that ass whooping lmaoo there ant no \"stop stop \" bitch stfu lmaoo this is your boy now all retarded and knocked out making funny noises lmaoo was it worth it ?", "The charge for spitting on someone is (Assault With Bodily Fluids) \nThere really is no charge for not leaving when asked to. A (Trespassing charge) is not applicable unless the person has been previously removed from the property by police, \nIf the police were to show up at the point of the video ending the outcome of the situation would be\nOfficers would of asked the customer to leave citing him with a warning if he returns he will be charged with trespassing, they would also give the customer the option to press charges or not against the store owner for the assault with bodily fluids/spitting", "Sp your telling me harambe dying the clown infestation and trump are all good things?", "I feel like if dude wouldn't of been slipping like dat it would of went a little different but not too much ...spitting on someone is nasty af dude had that coming but what did dude say for dude to want to spit on him ...because people don't just spit on someone everyday u dnt really see that that much in these videos", "What I think is silly is that when you replay this over, the guy in the black shirt said something that started with a \"P\" and basically spit at the guy in the reds shirt. The guy in the red Purposely spit in his face, Yeah. But the guy in black actually started the spitting. He just did it unnoticed..", "It's alright I guess. The amazing spiderman is so much better!", "Never heard of these chitlin circuit rappers that Soulja is beefing with", "On a side note, I thought this was The Weeknd @ 50 years old", "Spitting on someone is tantamount to wiping your arse on someone's hand...it's fucking nasty. Only ppl who really hate someone would spit at them. Not a stupid fight in a store. Dirty fat pig!", "No smoke detectors , no sprinklers , in an old warehouse , could have been prevented.", "That's junior right ThuRR on my mama!", "You can buy the same shit in the store dip it in BBQ sauce and BAM! a McRib.", "You can clearly see the dog shows emotions. Blind idiots if you don't see it", "This goon had me wearing shirts 3 times my actual size ...Fuck him", "He dragged the officer. Lights out for the crook. I hope the officer is ok.", "That may be cruel and wrong but at one point in life these people were the most disciplined and its cause of this shit right here", "So if the kangaroo wouldve won would Conner ask for the rematch immediately?", "Lol I swear it has something to do with their next game", "Katelyn Renee Owen this was me today when you text me you were outside my house lol", "Ariel Elaine Reed.... when I tell you I'll be \"on time\" hahahahaah", "i mean KD & CUrry are busy trying to answer the questions lol", "Dude said the worst part is they did it in his bed, while they weren't home. So he's mad they weren't home to watch?", "This will be good for him, cause no good is going to come from a family that's turned a Basketball player into a Crackhead, a Entrepreneur into a raging alcoholic, and Olympian into a tranny.", "Why J trying to kill Kanye", "I hope people look back and laugh as hard as I laugh at these shoes now", "Thats a fight you should really try to avoid. Ive seen enough jail movies to know how thats gonna end", "What kind of fucking punches were those? Looks like they were attacking bees rather than fighting", "That wasn't a grown man...looked more like a teenager to me", "Why would you let a stranger finger you and worth millions don't mean your pussy is worth millions so you might walk a way with nothing more than a fungal infection", "If he would've caught them and shot them he would probly be locked up rn", "This whole post just got off on the wrong foot but on the other hand this is no laughing matter", "Genius to the guy who was able to get the idiots to buy it....", "Go home Lexus, you're drunk... and about to give someone a fukn' seizure.", "That is so sad I hope their both resting in heavenly peace, fly high with the angels. to both family's  never let go of God's unchanging hand there  both walking side by side with our heavenly father", "plot twist:\nlogan: honey I think you need to stop fucking the landlord, immediately.", "White lives matter! I'm gonna gonna riot, Oh wait he deserved it never mind.", "I don't get it, please explain...", "I'm not understanding how that is enough probable cause to get a warrant...  how did the Alabama police department know those were acquired illegally? I would think a good defense attorney should be able to get these charges dropped.", "You're nothing without that badge\n\nAlright imma take it off wassup\n\nI'm reporting you", "A man who is millionaire wearing that shirt, thats the real joke to me xD...", "Michael Saunders dont act like you would even be showering", "Man I thought it was a lil kid lol that boy old enough to work, a week of work instead of going in there enough for employees to notice he can get himself one, lazy ass lmaoooo\n\nBut for real that it was nice thing...... I guess\n\nBut nah for real..... lmao fuck it", "Jeez....the woman in the background screaming her ass off was just about as annoying as she could POSSIBLY be!! Couldn't even finish the video she annoyed me so friggin bad lol!!", "The only reason this is getting as much attention as it is, is because she has her ass out. If she was dressed it wouldn't even have made it on the internet. And all the dogs on this post proves my statement is accurate.", "Making money off other designer and harambe smh", "Ugly looking mf!! The orange is the new black crew called, saying some shit about how one of the actors ran away well look no further cause we found the mf lol", "us finally dating, us getting back together after breaking up 20 times, us eating in my bed. $3 Neil Da Ton Knee", "Fucked him upppppp. Play stupid games, win stupid prizes.", "Got the nerve to call somebody ugly! Lookin like the roach I stepped on this summer! Burnt ass bird lookin nigga! How about u pay to go get some surgery on that face of urs! Dirty lookin ass! With the most wack music ever! How u talk about the girl wit nappy hair, nd u have dreads in ur head?? That look like dried worms! On a hot summer day! Thyr ants??? Nooooooooo nigga I think ur the ant! U look jus like em! Don't talk about ur fam like that! Ugly ass!", "Well I though about it and so what everybody is different people should not judge others by their appearance because I wouldn't want anybody talking about me that way so don't judge her heartless ass people and I really hope this is Photoshop", "your eye have double vision/head think very fast/blood beat fast/ all object slow/muscle tense/all blood pasage tube slack/and a possibility for mal functioning/day dreams/foolish wrims/ bright future and also accurecy in all thoughts---ok!", "It's called cross faded.. only the strong can survive it. Lol.", "I Don't have any sympathy for neither of these two clowns. McKnight should have went about his business and not approach that guy and the white guy should have rolled up his window and call the police. Both were idiots.", "I love the snoop ones more tho.", "this a better combo than burger and fries", "im pretty sure i don't understand why he didn't wait for back up, use a taser or mace...why would he release a round in a crowded school yard?! \n\nthe stupidity and lack of judgement/professionalism here is stupendous!", "Yeahhh. Do it live then I'll believe it", "Straight bullshit the cop did nothing wrong... Sad to see the man lost his profession/career over this... I have no problem with anything he said... A damn shame they took a good man's job away from him... Sometimes you just got to think about what these cops go through, either way you look at it not pretty...", "Granny's need loving too- I'll knock the dust off that pussy ...", "if you are trying to escape in a vehicle you are a 4000 lb chunck of metal capable of mass destruction.  Of course this was justified. He didn't get shot for having a light out, he got shot for trying to run from the cops.", "The gay dude was disrespecting the woman cook so dude checked him about. He kept going so dude beat his ass.", "Because the Public Defender literally works for the people he's \"defending\" you against. And he's on a payroll, so it doesn't matter if he wins or loses. It's easier to convince you that a plea deal is your best option regardless. I don't have to read the fucking clickbait article to know that.", "Dan Kernan when you get time check it", "This video was actually from last year but they still fucking us this year also smh", "The wanna be Young Thug but never can be, the lil ugly ass frog, and... tf is that big haired chick? yeeezz. - a thug fan.", "I assume lots of people here have never even seen a refugee in germany before so do us a favor and shut the fuck up. These guys are assholes not refugees", "All you Lil' This and Lil' That listening ass idiots...listen to THAT! That's hip hop. That's a real MC right there. And people wanna talk about Drake's bitch made album. FOH. For real.", "I would have called someone to say he is making terrorist threats... His music is trash and he wont be poppin soon enough...  Coming from a man who has to wear a dress to be relevant... I would of popped off on him... He only saying that at the safety of the airport..", "Everything has to be recorded now, this generation is only getting worse. Literally if someone is getting raped people would rather record it then help. That's insanity.", "Anna Baur egal was ich mache. Mir ist kalt und du grinst beim pennen", "People that like Lil uzi vert and future belong on the short bus....the music is idiot rap hahah.hi idiots", "Russia interfered with the electoral college vote? WTF.. What European put this African up too this shit?  They just want war with Russia, Because Russia beating that ass in Syria. Did ya'll see on the news that pieces of missile or bomb that didn't blow up had USA lettering on it? It's all gonna come out.", "Us when we talk about the MSW program Kari Nadine Brianna", "Guess no one watched sagwa or however it was spelled", "When someone comes out and expose what bad things  \"some white people \" do or did to blacks, a white privileged guy that never experienced or heard about such things will come and say that its not about a race thing! Even if its a white man who exposed everything!!", "When you find a rider for the set", "I guess it's a British thing, because that was super dry and hardly hilarious", "I just hate the small spider logo on the suit. only complaint other than this spider is SPECTACULAR!", "Well. The next time they're asking you to feel bad about one of them being shot down, remember this.", "Don't be afraid to learn. Knowledge is weightless, a treasure you can always carry easily.", "Boy: You wanna go hang out this weekend?\nGirl: Yeah sure. We'll be good friends going to the movies.\nBoy:  *whimpers* Friend Zoned", "How many spider man movies are they gonna fucking make? And how many of you idiots are keep watching it?", "Why even put lights up at all? It's xmas, not Halloween. Ain't nobody coming to the door asking for you to give them some treats.", "Everyone went home and told stories about an epic brawl where they bodied everyone when in real life limp wristed punches were thrown as far as the eye can see.", "Too bad they didnt square up, cop would've beat his skinny ass. Nowadays every kid is tough and most can't back it up at all.", "Got damn I would be knocking those ankles loose in the bedroom every night while she be speaking that espanol. My chocolate would be all over her spices. S/O to the real niggas who know what I'm saying", "I bet half of you would do the same in person. Not justifying it...just saying y'all probably would lol", "Cops like to stop right in harms way. I see it all the time they never pull completely out the way", "Lol serious ... i really can't understand how some of you guys thinks this is ok and to even share it's disgusting....", "Lmao curry don't give a warm shit about them fans..just something he's asked to do \nLol he probably says to himself \"here choke on these you little bastards\"\" then goes to snort some coke off a strippers tits", "That was fuckin epic (the escape)", "Sum shit that should have never happened or been seen I know sum people need therapy after that hide yo kids it's jabary momma on the lose call the strick team navy seals like wtf", "Duh they give no fucks about our lives.\nThey just see you for ten minutes to say they're your lawyer. Then let you get hung by the prosecutor that they golf with. Then next!", "Should have done the best out of 3 playin rock, paper, scissors", "Stefanie Klamerus that day where we talked for hours and then it was suddenly 3 in the morning", "By \"influence the election\", do you mean, to inform the general public  about situations and instances of incompetency exhibited by a presidential candidate, that without those \"attacks\" wouldn't be available to us, for the people to make a sound educated decision on who we want or don't want in office? Well in that case... thank god...", "I love how everyone is preaching \"if he were a black kid\", when the cop showed more respect for the kid of color than the white guy. Smh The people preaching this racism shit are in fact the true racists.", "Trust me it happens even if they're not late. The worse is when it snows and they clean a 3\"x3\" . Or they clean the whole car and leave the top with snow damn cars look like Elvis ' hair", "Hey guys quick tip, don't go against the law you will never need that !", "Shots fired!! Man down! Man down! All units respond to friend zone C (curved) Sector F (feelings).", "This is one of those moments where those involved gets a second chance at life and takes off like a bat out of hell.", "I make money posting ads on social media using my smartphone/computer. If you're tired of working, need a second job, or looking to make easy money.. inbox me asap!!! I will get you started right now and you can start making money right away. Only in the USA and Canada.\n\nSERIOUS INQUIRIES ONLY!!!", "So reading the lyrics from your Iphone is now a freestyle? I guess the game truly has changed.", "If he didn't say anything, people would say \"He didn't even apologize\". If he apologizes people will say \"apologies don't bring the people back\". It takes a man to own up to their mistakes.", "I'm trying to understand why you would want to crucify this guy? This is a tragedy. There's no intentional malice... An electrical fire in a warehouse. He's not even the owner. All these people would have been on the streets. San Francisco is one of the most expensive places in the US to live. I'm just starting to read all the info but can't something bad happen that's just a bad thing that happened. I understand people want someone held accountable. I would be the first to say so to if they said arson. But this was an electrical problem. All those living there saw where they were coming to live and like most of us would have never imagined something like that would happen. I don't know maybe I'm wrong but I'm seeing this as a huge tragedy. RIP to all that lost their lives", "That boy is tryna get out of his house, with his momma naggin him all the time talking bout, \"ohh why you aint clean the bathroom witcho dirty ass stained draws all over.\" n his moms new boyfriend Larry talking bout, \" you see boy, me and yo momma got a good thing, and you better get used to having me here to straighten that ass out n boy pick them dirty drawz out the got Damn bathroom.\" man im high as shit.", "Women always say \"men think they entitled to the girl because they nice\" Who doesn't know that? Every dude here knows that...it's the \"All man are assholes, cheaters and fuqboys\" speech these guys have to hear about thats annoying...because the girl go walking into lava repeatedly and complain that it burns lol.", "The Fed's watch every move ,let's make better decisions my people , I know  at some point one of them had to say the police coming for this shit smh", "John Hall hahahaha he fucking said call your mom to suck my dick", "I did better at a bus stop. Three chollos tried to jump me but luckily I had more room to move around than this guy. They ended up running cuz they couldnt knock me down.", "I would love to meet that twerp i would beat his ass and then make him eat his own shit after i was done smashing him into shiting him self. What a chump", "He shouldn't have been fired for that. It sounds like he's concerned with the way people group them all together as dirty. They seem like good dudes trying to prove a point to the younger generation.", "She was being arrested and she fall down in the process. Happens all the time. She just looking for a payday.", "Been saying that for years mang!", "Click on this link to learn how to make $200-$1000+ part time from home with a service that everyone needs!!! http://mca-biz.com/1qYzi", "If that officer got caught under that truck he would of been fucked and the officer doesn't know the dude he could have been going for a gun and with that jacket on a tazer wont do shit pepper spray blinds everyone", "Wow, it's so sad how we have to punish our service men for doing their damn job! Kids like this deserve to get shot!!! Sign says weapon free for a reason fuck yard!", "What, you want us to criticize him so a racist white folk in return calls us ignorant, lost whatever. An eye for an eye nowadays thats how I see it. who gives a.f.", "Ami the only one who thinks he swagger jacked old school Chris Tucker!!", "The Owner was wrong, if he couldn't get the boy out the store. He should've called the police on him that would've made him live, not spit in his face to me that was the first sign that the owner assaulted the boy all fair and game. Don t know how it escalated to that point but just sayin.", "Blessed with a sweet and gorgeous wife, and by tomorrow a brand new fresh out the box twin boys.", "What the fuck is with these \"don't let this distract you\" comments? You lonely ass fools that desperate for attention?", "Mom: \"why are your cot'damn eyes red?\n\nMe: (smacks teeth) \"because I was sleeping mom!\"\n\nLol back in high school. Miss my mom's cooking when I have the munchies though", "He goes first. Depending on how well and long he eat this pussy ima do the same. I hate men no point in blowing him for 25 mins when he can't eat you out for 10.", "Out of tacos\nNo more weed\nHarambe is dead", "The ones that would are being played.....just because it said a man worth millions doesn't necessarily mean he's going to spend it with you...and you let him run those e.t. fingers up in you....", "60 in 29 minutes\n60-29=31\n\nWarriors blew a 3-1 lead.", "Trump fans don't care, it happened in China!", "They are both fucking wack! Dude trying to sound like fucking smokey from Friday!!!", "First time I've listened to his music and... nah I'm good, not feeling it,guns,snipers,getting head, etc. etc.- ppl want unique,fresh.", "I wrote something dirty and edited it", "Whoever grandma that is recording ratchet as hell... smh.. he was wrong for spitting on him tho...", "Seriously... How is she even able to talk. If I ever run up on a child abuser male or female fists will be thrown. I'm so disgusted!!! Everytime I log on I see some mess about kids being beat and molested. Why are these people even able to breath?? SMH!!!", "Don't let this distract you from the fact that Ray Finkle blew a 26 yard field goal in SuperBowl 17 costing the Dolphins the game", "What's with all the \"white boy\" comments? Can't you just call the guy what he is: a bitch, punk, POS, etc? Some racist pieces of shit on here I swear..", "He says stop resisting and it was so quiet after certain amount of times like damn I don't think anyone is moving after awhile this was a racist cop with the open door to kick ass because he had alcohol in his system but then went to far this is so fucked up in many ways sorry bro you had to deal with this ignorant police system against people of color", "So many mean comments jfc. Let's assume you actually LIKE/LOVE the person you're having sex with. I love my partner, I ask him if he'd like me to go first. He loves me and wants me to be happy so he asks me if I want him to go first. And it's a different order every time. If you care about someone, you usually want to make them feel good and happy! \nY'all are so mean to each other sheesh, where's the love?", "Ahahahah Thad what he gets ..he lucky he didn't get his face kicked in 'ol b!tch runs mouth..seems like everyone does now a day jus run they mouth n neva been thru no time at all ..pussys", "Caption is lazy bitch. She should have hit the gym and took pride in the journey to bettering herself physically so she can show her ass on ig. Instead of surgically doing it. Lol", "You expect people to feel bad after seeing a cop murder someone and get a mistrial?? I think he was defending his self.. Innocent, some cops deserve this shit.", "I like being high in public sometimes, but if I'm kief high I stay low. Lol like right now. Blazed af", "I think every man should get one. Too many shady women out here. As a mother to a boy they need to be protected.", "im suing for the house. voila! new house and put it out for rent. fall back and use the risiduals for school and everyday epenses. Graduate and move everyone out ad take over the house. This guys silly mistake would have made me a nice little life.", "Cant stand khaled most annoying dude in music period", "Pretty funny. One of those movies you check out when you have nothing to do. Lol", "He asked for it people saying he was drunk are Dumm af what if he would've hit him with that 40oz in his head why he wasn't looking different story right", "I'll make it a conversation \nHer> who is she\nMe> I don't know \nHer> I'm leaving you \nMe> that's fine bitch \nHer> how could you \nMe> her ass though \nHer>Wow I see\nMe> three way maybe \nHer> oh my god\nMe> so yes then\nHer> I guess so\nMe> I love you", "America we have more serious issues , kangaroos are flexing on us and our pets lmao", "Amos Christian\nNeck ass lol\nTone GD Lott", "Remy killed this shit papoose is meh he was. Never that nice to me", "That animal should of been shot instead of Harambe. That store owner needs to make his store great again and build a wall around it.", "when frank looks at me I feel like he wants to expose some knowledge to me  Ashley Lyons", "I hear a lot ppl saying this and that drunk sober are what better watch that mouth. A drunk man or woman always speaks the words of a sober person. He got what he deserved.", "Sad how people can bitch about there holiday spirit on here grow the fuck up his family and his dog are going through a lot more then there holiday spirit getting ruined lol pussys", "That shit isn't even fun to be like that lol can't even function n u look ld", "You can tell he was kind of feeling like they didn't want him there, but I'm sure he understood their gift soon after.  Probably taken aback by the generosity.", "No no no no no. This is not okay. What a piece of shit human being that manager is, and everyone just standing around watching. I hope corporate made this right with these women. This is horrible.", "Im gonna be a cop gives you a license to Kill. If you have a badge you could just yank out your gun anywhere any execute people on video and you won't be charged", "Dick dipped in food is powerful as fuck....feed her with a double combo", "Who refers to going down on a girl as \"giving head\". Wtf kinda gay shit is that... \"yeah I gave her head last night\" wtf", "This dude is funny what's his name on IG OR FB \n5 cent Moore lol", "Fuck the guy in front of the microphone. It shouldn't have taken this long for these half ass charges. They protect their own first. So fucc him and fuc whoever feels otherwise. Its not up for debate these folks are purging blacks left and right and the entire system protects them from justice.", "WSHH Headline tomorrow:  \n\n\"SOULJA BOY DISSES DcYOUNGFly\"", "If there was one black person among all those guys, that one black would have been cuffed, pepper sprayed, and tased, then arrested", "Of course he's going to do he's a Rag Head probably works for ISIS they probably put him to it so he could spread he's HIP-C everywhere", "And you all wonder why Asian people are very smart and can learn and be great at almost anything. They don't put up with shit over there. Friend taught bjj over there for a year. Said it was a very modest country", "Vai achando q n tem briga em estadio de futebol americano Guilherme Jardim kkkkk se liga", "He definitely flipped the script on her ass.", "Aneesh Gupta I dont think white boy knows India ain't in the middle east haha #onlyinamerica", "How does white lives matter when shit like this is happening?? Smh so sad...this white on white crime has to stop", "Being amputee doesn't give you the right to do whatever you want", "If that's the case then half the demographic of Charlotte Russe shouldn't be allowed in the Damn store. Them white people steal everything but the Damn mannequins", "White boy needs an atlas to see India isn't in the middle East.", "This is what Ricing your car looks like in 2016...\n\nThe Fuck outta here!", "Why she gotta be a hoe? She can be wife getting ready for Christmas and decided to spice things up ;)", "Black, white, hispanic, asian, doesnt matter. You approach an officer of the law with a knife you will get shot. The officer gave multiple commands to drop the weapon.", "Wow that is sad feel bad for both families RIP and god bless them all", "Shit that's rude af they bought him a console cause they didn't want too see him there everyday basically he's saying here's a free console get the fuck out of here we don't  wanna see you here anymore", "I love the McRib! I had one the other day. Fucking delicious", "Shit her monthly child support check be more then what I make in a year. Lol", "This is wrong on so many levels. People never cease to amaze me", "Looks like he was getting jumped in but what's sad is it was by a bunch of weak asses!!! Hahaha he should have no problem getting to the top he the strongest one smh.", "That sh sad. I hate to hear stuff like this. I stay prayed up and i repent throughout the day. Some sh just cant be avoided. Never know if you finna have a chance to see if God is real or not. Betta be careful out there.", "This is sad. Instead of studying or doing something to be successful they fight to prove themselves? That's not what a man does. Smh. Black community takes an L.", "Sof u prolly seen this already", "That's why no man should be friends with a bitch. Only be with a bitch to fuck thats how real niggas do it", "ashy im worst lol il be getn ready by 9 45 to meet u at 8 45 lol..i havent changed..bt il kick your bum if on Saturday u start ur nonsense", "2017 already has me putting money aside for all these movies coming out. it's gone be lit AF.", "Why is it that every little thing Donald Trump does somebody have to have a problem with it but yet nobody had a problem with all the things Obama did like literally had to take a s*** in the White House and you guys will be going to sterical like does he use Downy does the sermon is he non wiper like really you guys cut man no slack", "I absolutely dont like trump,but shes not unqualified simply because of the kind of business she founded. Which is much much more than a small business now,so lets just hope hes done his research and she will be an asset to the country we live in", "The people talking all this race shit are doing so because they have the self worth of a piece of trash. Not all fucking white people hate black and vice versa. You're not doing anything to anybody. All that tough talk man, I can't imagine what you'd be capable of in person... Nothing. This isn't jail. Not everyone judges you by the color of your skin or forcing you to stick with your own. Fuck outta here. A police officer with a family, or a person of color being killed for no reason.. there is nothing funny about that. Go to that cops wake and run your mouth... Go to the funeral of one of the young men killed by cops and run your mouth. You all fucking suck", "That's why you tell your women one on one not over social media so everyone knows how you feel lol let her know straight up to avoid this simp shit", "So again, where was this 60 points when the Warriors blew a 3 - 1 lead for the title?", "It's soooooooo serious that Russia hacked HILLARY. Why isn't it soooooo serious what was found in the emails aaaaaand the fact that IT TOOK Russia hacking those emails for anyone to even know they existed considering how HILLARY was ordered to turn over those emails and instead of doing so. She deleted them. \nThat's like me snitching on someone for a murder and instead of locking up the murderer. Ya totally ignore that and lock me up because I snitched.", "Hush little indian dont you cry\nnightshop gonna make sure you sleep alright\nand if you cant sleep whiteboy gonna smash your brain\nand make sure youll never wake up to redeem this pain", "Why would they even try to make anything while j cole dropped an album?", "If the facility was cited by the city for fire codes then they have a right to be up set . That guy has no clue about codes we pay people to go in places like that and tell us it is safe . Their the ones to blame and if it wasn't safe it should have been shutdown immediately. Or cited to be fixed", "Why don't the cops reporting to school emergencies have bean bag guns? Why are they shooting these kids in areas that are deadly? Why are they shooting them at all? There are more non deadly ways of taking control of a situation. The problem with policemen today isn't racism, it's fear of the job. They take these jobs thinking it's a position of power and then shit themselves and get trigger happy when the job their job description describes becomes to real for their very little training.", "Rina JonIglesias Park you going to the health center today", "\"I feel like I should be able to physically resist detention without any physical consequences based on the pigment of my epidermis. I now feel entitled to a large monetary settlement based off of said unfavorable repercussions.\" The intelligence displayed in the comments explains why racebaiting \"news\" gets any clout.", "Okay this why I listen to Bryson tiller type music he is the newest artist with talent", "I heard him say \"\nNow when you are molesting Lions \"", "Wassup with that girl orange shoes?", "Actually this woman has a sad story. She suffers from a rare condition known as Pneumonia Perfecta. When she was younger, her mother told she was worthless and abandoned her at a hospital. She grew up in an orphanage and was bullied for her looks but she always tried to stay positive. She told herself that she would always believe in herself and achieve her dreams, no matter what others said. When she got older, I completely made this story up and you've wasted your time reading this..", "Marvin Demiri du immer yaaaaa IMMER!!!!! Selbst wenn ich dir 5 Stunden vorher Bescheid sage", "He tried to drive off with a cop hanging OUTSIDE his truck after resisting... I hope the cop killed him", "Seriously someone get that man jaw wired shut again", "This girl makes me worry about our future. It's alarming that her top priority leading up to that day was to go in front of console for a \"Muckrib\"", "Light bill is looking good for the house on the left.", "Everyone is being poisoned, but because I like playing devils advocate, I'm gonna give a decent argument. Most black communities I am aware of aren't what I would call suburban. Not saying suburban is white, just saying when people say \"Black communities,\" you arent talking about the Subs, you talking about the Ghetto.....NOW, Ghettos arent the cleanest places, healthcare isnt as good, schools dont get a lot of funding for nurses, and making sure the school is extra clean (Shit even suburban schools nasty). On top of that each ghetto has that nasty house where they dont clean anything. Well those kids catch something and get poisoned, and they spread it. Then you have the water and other things that transfer disease and poison. Water system probably arent as clean. Etc.....so really an argument can be made that the reason is because of economic issues impacting the sanitation of these area....but thats just me playing devils advocate....we all being poisoned.", "This lady is pure stupidity at its finest!!!! LMAO oh snap my Arm", "No, this is just a normal pic...", "But I'm happy man getting his shine he stupid as fuck lmmfao", "It's not his fault!  nobody was forced to go into that warehouse It's a warehouse why would anyone expect it to be up to code like a building?!?! Always gotta put blame on somebody!", "that was actually nice, he jus needa work on that delivery", "U might aswell wrap a garbage bag roun both ur feet and eat lavish then buy a pair of ugly as yeezys, shoes look like MKG jumpshot, straight awful", "She cheated!  Look at her un-used hand. She feeds it under her wrestling arm and pushes for extra force!", "#3 deserved to die. Stupid asshole", "Every rapper that came out in the last couple yrs music is ass n they all sound the same smh how the fucc can ppl listen to dis sum shit ..", "John Hughes you dont fuck with the mcrib like she do", "Racism will exist until old white man are the Elite in all Western countries \nThat is no Conspiracy theory \nIts a fact \nThey hold down everybody but their own Kind", "Crabs in a barrel. He'll drink and smoke it all up before it's over. That's why they give niggas like that a chance, to keep put other blacks down. Those women didn't need that interaction with him. He could have harassed some white people, but knows his ass would be on a federal jail cell looking like how regular self, dumb ass fuck", "She was resisting arrest but still,they didn't need to take her out of her chair she was cuffed .the officer dropped her on the floor cause they didn't know what to do with her after that ,they gonna throw her in the back ...this is just wrong and they need a police wheelchair accessible cop van ..shit it should patent it", "The guy that tried to steal the shoes looks like the type of person you want to punch on a daily bases.", "Am I the only one that noticed the tattoo artist could've at least centered it better. Its not even over her belly button and half a horn is only on one tit. Ocd kicking in I guess.", "Illuminati will be revealed along with the scum who live by it.", "Wow is it me but I've never seen this many white people concerned about a topic on WSHH..... but what is more baffling is that these people who support Trump have bombarded this page.... Fuck Trump and Fuck Russia", "Didn't notice the dog at all", ". Today at work. I was laughing at customers and hiding in the bathroom.", "Funny enough, cultures that drink more dairy (not just milk) correlate with higher rates of bone fractures, especially in women.", "Tf is that?..a professor dumbledore dog hybrid or some ish??", "These dumm mutha fuckas eat out every chick they see but won't fuck them without a condom..wtf...Trust me its safe bro you already ate the AIDS", "This is fake!!!... you telling me from Elbert, she have no one in her phone until you get to L in your phone book??.... atleast make the person up with the same initial...", "For those saying this isn't a race thing??? Please educate yourselves. When and how often does this happen to white people? Count how many times you have seen on the news or tv a white man being brutalized in police custody and treated like an animals. Yes he was drunk but in school we were always taught two wrongs don't make a right. What happened to this man I wouldn't wish upon anyone and if justice doesn't get served properly then I will pray for you all.", "She looks sexy af tho...I would smash", "Why does this site have to be such ratchet trash? Should be asking these DL mofos if they would let him finger their buttholes. Dumb asses.", "Coochie eating is disgusting... is it true that if you tell an American you've never eaten coochie they'll think you're homosexual??", "Law enforcement all over the country should have been audited and sweeped across the board. But still, we have these people who  dont understand basic humanity, let alone how to do their job.", "Damn it takes real strong men to forcefully hold down someone a repeatedly beat them saying \"stop resisting\" just so you can make sure it's to training standards. Way to use your training to its fullest potential.", "Stupid news people asking stupid insensitive questions. Find out who owns the building and ask them those questions. The owner leased a property that was not up to city code. What was the terms on the lease agreement?", "Disrespectful to the Reese's skittles are not worthy to share the same bowl lol", "SMOKEY WHERE THE WEED AT SHOULDER BOI GOT TOLD BY SMOKEY LOL", "Lil Uzi Vert and Future are living proof that even special needs people can rap what an inspiration", "Wth. Always trying to justify shit. If you spit on anyone idc if your black blue pink yellow purple. You should get your ass whooped. It's the highest form of disrespect. P words may produce a little drop but the other man all out spit on him. My one year old daughter spits a little on certain words but I don't spit on her and then blame her. You sound not smart. (Stupid is a harsh word)", "His name is Jeremiah Phillips. He's a local comedian around here. The guy is absolutely hilarious!", "Lol, it really grinds my gears when I hear White's say stupid shit like this, first off ya niggas are immigrants too! Everyone is expect for the native Americans aka Indians.", "I just wanna see people fight.", "There's no money in the cure when will people get that.. they don't want to cure you..", "They say this guy has been in a road rage incident where he assaulted the other driver in the same f*cking intersection. It's almost like this piece of shit just tries to start some shit in the same spot everyday on his way to work or something.", "They'll be divorced in a year", "Cassie look at these fools flying down bleachers lol", "Is it just me or does anyone else get kinda grossed out with UKs chicken", "Fuck da neighbors ill jack their shit and sell it for my xmas presents", "Fuck those kids. They sitting court side their parents can easily afford a pair of signed shoes. Mofo need to throw into the bleacher seats. Lol", "Copied from the one about Messi. 0 points for originality.", "Fuck her ratchet ass, fuck her dirty ass son, and fuck that nasty ass dick sucking girl... they all gross af. The real concern is the infant in the playpen inside that dirty ass apartment. Smh", "Thank God we got Kanye West that's losing his mind and can't control it and Kim Kardashian that has a history of divorces. I think it's time for Kim to take a break of relationships.", "For a conviction they not on yo side they want u to plead out to get rank off u to become a lawyer", "Nigga said 4, pulled out four fingers then pulled out the high five. You sure you don't got 5 instead homie?", "Honestly knowing those guys' reputations, it's entirely possible...", "I thought he'd be eating that cereal with a fork to save milk", "Is it only sad because theyre niggers? Or would it be sad if theyre white too?", "And this was the last time he ever showed affection.", "Chris Yambo I only have cream filled.", "Fake as fuck man, the nigga used the pole to unlock the fence for the lion to show the opposite of what he was preaching trying to be funny.. the crowd even laughed", "Andie Schnee Ava Dunnehoff if someone did this to my breakfast I would never speak to them again", "Is this legit ? Cuz if it is, im buyin' that shit...", "Isis was created by the vacuum power by the invasion of Iraq. Obama pulled out the troops from Iraq because there was a deadline set by the previous administration and Iraq president at the time wouldn't allow immunity for American troops. Yhea no conspiracy theories. It was caused by the invasion of Iraq which caused civil war because of the cultural and ethnic tensions that was already in that land. In short Bush's fault.", "Napganastan! we ain't no pussies bish! Momma already know the deal.", "To bad no one cares about them two lol. They werent even hot in their primes.", "This is funny but the sad part is people really think like this. Dude said baby supposed to be mixed this baby look fully European. Like it's a crime the baby can't just look like the mother lmaoo", "Yea and the success of all those vacations him and his beautiful family went on, paid by us truely. Someone google how much that was.", "Lol. Surprise! Older people are people just like you!!! As a matter of fact, one day....ALL OF US WILL BE OLD. If we live that long, anyway.", "To all those idiots saying why did they shot him. let me ask you this. do you prefer an inocent student get stabed by this psycho?  He was warned and still proceed to attack shooting him was the only thing to do. what did he expect? he asked for it.", "Sooooo them tazers that shoot from a distance those non lethal rubber bullets aint popping no more?? Fuck it just shoot a muthfuka instead right .. Damn cops are so pussy now a days yes the tazer is more dangerous but if u wanted a danger free job why be a cop smh pussies", "This is the dumb ass shit I dont like in my timeline. Who made this? A five year old? People these days have 0 decency man", "Disgusting behaviour and totally unacceptable. And to all those who clicked the laugh emoji, she is somebody's Mother, Daughter or Sister...now imagine this happened to yours...not so funny now is it!", "WWE is entertainment, for amusement! Running a business is very different in running a country. You can't put people in serious positions just because they know how to make money! You can best believe that the other countries are not impressed with his eenie meenie mynie moe selection.", "Katy Becker I know this so irrelevant and so random but it had me dying of laughter        lol", "Through sickness and health? What happened to people taking vows serious? Smh", "My take on it if you choose not the lucrative career and just trying to help people at least be successful in helping people be the best out there because to be honest public defenders suck", "They have GREAT relationships with the prosecutors .. And besides that the system has a vicious cycle that makes it hard for them to go against the grain and genuinely help somebody!", "Everyone's ignoring the fact she was smoking crack with a 9 year old also haha.. Having sex with that whale at 9 years old is very very bad agreed but being addicted to crack at 9 is like wicked bad smh", "I wouldn't even be able to focus on the game........ hell I don't watch baseball anyways I'd love it lol", "Its actually possible for a black couple to have a white child and for a white couple to have a black child, it all depends on what your grandparents were, also even if your in an interracial relationship, the grandparent's DNA on one side could overtake the zygote and make that kid look only like them.", "Whoever was on their shift knew exactly how to fuck up this guy's day", "women jus take care of your goddamn bodies, okay? many of you just want a perfect body out of thin air, no ladies you need hard work and dedication if you want something like that, not even though all you gotta do is stop being lazy at least do something each day of the week and before you know it you have if not the best body then its one you are satisfied with and keep going thru with it, Im not telling you how to run your lives this is just some advise if you want to reach a goal that you set for yourself take it, if you are already happy with your body good for you and if you dont want to take advise  then oh well,", "Wallace Bahilot-akana ariel said I always beat it up hahaha", "I wonder how long it took him to do that", "Good job. Now the dude can sit in his own shit and think of what he did wrong", "Y'all owe me another Phone. Shit just busted into flames", "U crack your knuckles. Then go in for the kill. If it that serious. Other than that fall back catch the brains.", "This was nothing more than a \"Plea-Justice\" deal. Some justice, but no justice at all. My prayers are with the family.", "My mans went from having broads in Atlanta to having a talk with his daughter", "What in the fucking fuck is this? I wanna hit someone with a bat after hearing this . If Jay or Eminem were still the gate keepers wouldn't none of these idiots gotten in", "They really didn't throw her... She was leaning forward doin the most...", "His delivery could been better but he's better then the majority of this crap on the radio", "How'd he explain that camera angle to his wife? \n\n\"I don't want anyone stealing pillows\"", "Did they just fucking take an environmental safety break? Getting out of the water was an excuse for those getting their shit tapped. Not the dancer doing the tapping. He was fine with the liquid.", "SE-NU \nND-DES\n\nThe fuck does that mean?", "Grown ass men fighting over a game they paid to get kick out of smh lol", "I need to go to Best Buy everyday and stand in front of one of those 90inch smart tvs.", "Fuck no..... That bitch got all types of demons in her... Sex is spiritual and you transfer pieces of your spirit when u have sex... Fuck around and become possessed after fucking her... Next thing u know your a cuckold taking dildos up the ass.... Ijs better be careful.", "Now this person here is a stone drag and not a cheerful person anytime those lights didn't even  give him some kid of lift,!", "If he is smart, he would start banging one of her little sisters. They are both hoes and pretty sexy. One negative is there dad is a damn near 70 year old tranny.", "At the end of the day you people are fighting over if he is right or wrong. It doesn't matter if its a cop or a regular person. Nobody has the right to take a life. That's the problem of the world today, full of hate for each other for no damn reason", "I bet u one of his kids was like I been telling. U to hit that shit dad u could've been straight years ago lol", "What song besides superman did this wack ass mf make ???? He cant make a song so all he can do is beer with everybody to get his name on social media wack mf", "wow that was sooo graphic!!! there was blood every fucking where", "This is why I always carry. Fuck with me or my loved ones, and it might just be the last thing you do. I will not hesitate to defend myself with deadly force if I feel danger.", "Why waste money on poisons. These idiots kill themselves for free.", "LMFAO y'all never gonna let this go", "Northgate College Station, Tx. Just incase anybody was wondering where this asshole works!", "A lot of black ppl do be acting rude in their work positions.\nI experience a rude black worker aleast once a week.\n\nHe also missed a show in Seattle that night because of that incident.\nSo now they messing with somebody money.\n\nI'm not going to be quick to judge homie", "I'm sick of young Kings fighting each other. No other race does this, broadcasts it and promotes it. I pray my daughter grows up in a different world.", "OK I'm confused if I'm trying to arrest someone and they're resisting and they jump in their car and try to take off yeah my life is in danger now and yeah I'm going to shoot you. Now if he would of took off and hit someone and kept driving well know everyone is singing a different tune. I don't think the cop did anything wrong.", "Curry looked like he had no acknowledgment to the kid and just let anyone grab them? am i correct? maybe it was the angle, but at least the kid got them", "The free attorneys want to make a quick buck and try to pick up as many cases possible. Doesn't really help, but something is better than nothing you know", "They let worse things up there you think they gonna stop at a clean slightly over cut nail finger?! Gtfoh. And plus it says HE'S worth millions.  Not that he's gonna give YOU millions.  You think a millionaire gonna give you millions just to finger that cat?! Hell no.", "I bet you he was wearing those new delly's", "A girl what leaves you in your darkest times is the definition of a cunt", "Pathetic Oil Babies have to pay for sex.. they know no other way.. saudis, kuwaiti... all of those people are child rapists too.. yet your \"POTUS\" is all buddy buddy with them.. i bet they ALL do the same thing.", "Michael Nguyen it would affect me in 0 ways. i like all of them and idgaf what i eat :)", "Did this niggah get put on the set or what if not I don't get that in and out shit ?? Points for homeboy he can say at least he squared up with like 5-6 heads!!", "Mad typical Americans talking about shooting kids. Jesus fucking hell man, over here we go away, regroup and if there's a few of them, get tooled up and have a rumble. But as far as guns are concerned, I wouldn't shoot a bunch of kids.", "People say this is fucked up to post, but then share all the stupid ass fight videos. Gtfo", "What these employees did was really nice. Not trying to take anything away from what they did, but they should have left the kids face out of the video. Kids can be pretty fucked up and hopefully he isn't teased about going to best-buy everyday to play video games.", "I like this kid but I would have stayed against the wall.. every time I was outnumbered I found a wall or a tree, car anything to keep people from hitting u from behind.. it also helps when they miss and punch those things behind U .. lots of bobin and upper cuts", "Sucks a person got injured but couldn't the cop find a better place to do a field sobriety test? They were in the middle of the road.", "I love all you internet gangsters. Real gangsters avoid the police and when they come across them you give them an illusion that you respect them by respecting them. Unless you that stupid that you confront them and set yourself up to get fucked up by them. As many times as I have been dirty I always walked away from it. Knock on wood. I don't want to fuck up my money. Keep acting stupid and getting shot or arrested. More money more money. Dumb asses. When Keeping it real goes wrong.", "Ive spit sunflower seed shells with more truth then this nigga.......", "Everyone is complaining about the villain when you guys already know that there will be more movies with better villains. Still hoping for carnage perhaps. One day...", "Bro this disney shit I can't even Travis Vanek", "I liked it, but this is a written piece. Which is fine I guess. It's not straight on the spot spitting though is it?!", "One time I saw two blind dudes trying to fist fight. So for giggles I yelled  'watch out he has a knife!!!.. they both took off running. . Best day of my life", "God...can his voters whine anymore? I thought they were against sissyfying America? They are the biggest sissies of them all. All I hear is them bitching and complaining. There will just be more when their daddy won't bring jobs.", "Soulja boy taking more L's than meek this year", "Both great runs, but the Iguana has my respect hands down!", "You people gotta be some of the dumbest people on earth. There were 2 cars and cop was trying to watch main car not knowing where cop car will go", "What if they copped em for retail price? If somebody paying 3 stacks for yeezy's then they clearly have the money to do so.", "Found out how to get my dick to 9.5 inches. Fold it in half. The vains stick out a bit but it works !", "Don't go out panhandling in public and you won't get arrested. And it's obvious those cops don't know how to deal with a person in a wheel chair.", "Hazel Malinga i actually cant deal from how much this resembles jevon", "Soulja boy just cause you suck dick at rapping and anit made no money besides what daddy gave you don't mean you gotta become a boxer now. Yo bitch as probably got a chin of glass.", "I'm just upset how she has a designated shit room for her dog.  Lmfaooooo.  I know this is against nyc housing rules.  I wouldn't even show my apartment in video if I got an empty baby crib, and fold out chairs in my living room, talking bout where is the blunt. Lmfaooo where ur kid at lmao", "This is how you look when the weedman sells you some muthafuckin \"HUCKABEE\" weed, and you catch the fool who thinks he sold you that fire.", "How about you try to save the persons life you just hit, they have a mom too how would she feel?? If you think that Mom is lookin out for their Child? Think about what the Mom of the Person you just HIT is going to do to you When she finds out y'all just tried to leave her child to die or dumped body", "WS posts article saying it's racist to call Michelle Obama a monkey, yet they post this shit as if it's ok? Hypocritical.", "Are they sure they weren't filming fast 8?", "Should've went for the slam dunk", "You cant fix stupid, but you can put a cast on it...or two.", "I have had a bad experience with boyfriends who drank. They often cannot perform.", "\"You lil bitches...who gone and fucked up my cable tv wire we running from the neighbors house...you all fighting each other, bout to go out there and whip all of your asses!!!\" yelled the mom inside!", "I have to say this is the best Waffle House fight I have ever seen lol", "It's when deer in the headlights hits you after eating clam pie. That you start to think how many DNAs you just tasted after the eating is done and you like WTFFFFFFF", "All the so called lads their and a girl eventualy stands in the way to stop people kicking a man wile down..... all a bunch of pussies who need a steel gurder a chain and some deep water. Problem solved", "Anybody does this and I'm finding the door. I don't care if I've been there all night or if I'm just walking in, something like this.. it changes people. #trustissues", "It's when I see officers acting like this that I can see why so many people resent LEOs, it's these officers that make targets out of everyone with a badge. I hope these officers lose their jobs, deemed as high risk hires and get left out to dry by their department. These asshats are the reason that their is so much hate between community and cop. It's down right disgusting and any cop worth their salt hopes that these guys are punished.", "That's just ratchet as fuck. I hope she said no lol", "I have a weakness for chicks wearing leggings.", "This is why fuck the police. The officer even said it. He has no legal right search them or touch them.\n\nIf he took off his belt and vest and squared up I'd I've a little more respect for him but when you're armed and armored with the support court system behind you then people usually don't swing on you.", "Whatever racists are usually cowards and hide behind their hate, never confront face to face about their beliefs and when they do it's usually to a elderly or a push over type.", "All I see is a tattoo. All religions are made up bullshit for weak minded fucks anyways. Glad to see so many illogical people though.", "Nigga trying to sound like smoky from friday", "Hahaha dude can only be worth some thousand, have a bunch of followers on a social media platform, and chicks would let those Beetlejuice fingers be put to the test.", "Someone needs to make a new Shawt bus Shawty featuring all these lame ass rappers", "Worst case scenario, The landlord is going to hire a lawyer and plea his case down to a misdemeanor. Sad but true.", "I have a few things to say. First- lol af. Second- lol af still. Third- he definitely needed to get shot for being that laughably dumb but what's a couple of knives on a 14 year old tiny white boy lol. Just jump him really quick. Now you've got shots fired and cops involved school is all postponed and shit. Never been in a fight with a knife? Just knock that playa out.", "All we need is an article about Blacks eatin chicken, SMH... Fuckin devils", "He look like youngin KRS One haha\nFor reals tho, bars for days!! Solid", "He was a bully and got what he deserved! His problem wasn't based on disrespecting the cook, it was all based on that man's sexually...which wasn't his business!", "You will constantly get pulled over", "Getting butt implants to show it off to strangers you don't even know because of insecurities.", "At the she was so high she went into a different world in the last few seconds.", "They robbed that man of passing Kobe image if he played the fourth", "How the \"FUQ\" do you pay all that money to get there, just to start a fight; and turn around and have to spend more money to get out of jail??? Sports fans have got to be some of the most \"DUMBEST\" ppl in the world. I wish somebody would come to my house and start a fight during a football game, yo' ass would come up missing fam.", "Guess they finally got together and killed barney.", "No no no this was not enough to start an investigation at all. There were no illegal firearms in the video... If they were some rednecks with a bunch of illegal ass weapons they would have never did this bs. Hopefully they can get the charges dropped because this is bs", "Dan Koray must have missed the episode were daffy and porky pig experimented", "You've been eatin' Skittles as long as I have, you can pick dem bitches out da bowl blindfolded real talk!", "Y'all smoking if you think the gay dude had that lmaoooo. That dude was working both of them in the beginning fuck y'all talking about!", "i woukd expect a NFL player to have at least a cheap security system", "That's my brother. I call him and he's like \"I'm about to be there in 2 minutes sis. Here I come\" and I hear the shower just turned on lol", "lol oh lord... let me guess this is some more trevor noah shit lololol gtfo.", "He probably would have had a different life if he'd been with a non white woman Hahaha, I just wonder who do all the black women in Hollywood date? And her leaving him, I'm not losing sleep over that hahaha", "Crystal Dawn, you know this bout to be us for the next 2 months.", "I hate the word \"hate crime\" when a white person says to a white person that he is a worthless peace of shit and that his family should die then it's just a severe insult but telling a Muslim woman that she should go back to her country is a hate crime ? Hate crime is a word that was made up to confuse people and that is all", "Yall are ignorant as fuck for laughing at this shit.", "That's a 1000pts for hittin a cop", "Awe poor millionare big old fucking baby cant afford security systems and shit like that...stfu and take an L", "Good. Fuck that kid, defending yourself is one thing, but duel welding 10\" knifes and refusing to comply with police equates to a one way punched ticket to the morg", "See what that devil fail to realize it's a real world out her folks ain't bout to quit they job for 15k bitch please its a life after 15k let people live nigga you got kids to feed as well gtfo ion hate no nigga but when I see folks trying to make people look foolish by doing the devils work that shit crosses the line bru you not god son you a ant for the devil burning faggot ass bitch this prove that all women ain't wit that dumb ass shit these niggas talking bout in them songs its only whores going dumb for shit like this instead of trying to be better", "I once snatched a hockey puck from a kid at a game. He threw it over the glass and I was just taller than him so I caught it. I sat down and just laughed in his face with his dad there looking like a sad puppy. Then this hot girl came over and sat on my lap. If your still reading this then I just lied to you lol", "Shouldn't have stop him in the middle of the street at dusk dark duh", "It's not the first time they treated this lady like this.. It's just the first time they got caught", "\"Dc young fly , boy you a bitch nigga , im finna pull up on you bitch ass nigga\" is how soulja boy next video finna start lmao", "He did nothing wrong. The guy was doing a good deed and unfortunately it blew up in his face. If the fire was accidental, than we need to leave him alone and show support to the people who lost family and/or friends.", "WONDERFUL: now every single hate crime will be in someway linked to Donald Trump's presidency.\n\nI wonder who's presidency were all the hate crimes of the last eight years linked to?", "Somebody will make this about race or hating cops sadly", "This looks like a cut scene from Tokyo drift", "Fuck getting an alarm get one shot gun some duck tape and a box of hefty large trash bags and two shovels and act like you're not home catch them in the act and you know the rest", "Underglow isn't even Legal in some states how could this be? I don't understand. Imma still cop tho.", "I wish he can see this he probably cry laughing", "Yea looks easy but when you get hit with felony grand larceny, burglary, conspiracy and whatever else they can think up. You end up doing state time for a handful of iPhones. Back to the drawing board.", "I kno m&ms I hate Reese's and fuck skittles I only smoke that strain lol", "A new social Rule needs to be established. If girls are going to be hoes and start shit like this. They need a couple smacks as well. It's the fucking cunt bitch that started this mess. HER", "As soon as Steph gives me a signed shoe, I'm selling that! Now if we're talking about Lebron or someone that's actually great then it'll be hanging up in my house.", "Im wondering how he has millions but cant afford pedicure on his fingers cx", "This will get you banned from all social events ever. It could be a birthday party for you and you won't be allowed inside.", "People take the game too close to the heart, \"your\" team dont give a F@#K about u, so why fight in their name???? smh so stupid, when ppl yell and laugh when my team loses i think: well hopefully we win next week, and thats it", "dude was mad cool..he kept his composure and was gon brush shit off..drunk dude kept provoking it, in the words of Smokey..\" youuuuu got knockkked the fuckkkk outtt!!\"", "If we lived where it snowed, this would be you everyday! Chad Kiesz", "I'm almost sure that your favorite instagram model is also doing this. There's so much prostitution going on in Instagram", "Well if he getting sales off rocks he get for free he a fkn genius im bout to start selling sum bs online fr ppl buy the dumbest shts", "Why are they just covering the tip of her nipple, it's bigger its just dark cover the whole thing dicks", "His group should be called crap music!!! Can't stand rappers acting like they got money. Give a rapper 300k and all gone on gold teeth. lol \nSorry stupid music!!!", "Wtf two robbery at the same place. This shit funny first of all why the hell they didn't have a cop standing by somewhere and second why the hell they ain't hire a security guard also wtf that's what I say first was luck second time should have never happened", "The cop was actually nice. A D*** at first, but I understood why. He didn't have to be fired because at the end of the day, he showed respect. I was shocked. Give this officer his job back, and ASAP.\n\nPS: It was tough love & educational at the same time. What if it was a stranger that challenged him, pistol loaded without restraint? He'd probably be dead. This cop may have just knocked some reason into him.", "\"Ohh the cop should have tazed him or pepper sprayed him\" you're whats wrong, how about \"wow that stupid fucking kid shouldn't be waving knives at other students\"", "I heard these days he's busy trying to invent a time machine", "Wtf I know it's a reboot but it's like he's baby Spider-Man,he's too young.Oh well I'll watch it anyway", "The order only messed up if daddy was hungry and went in for a bite and saw this...", "I wonder if her pops is looking at this... but doesn't know it's her... thinking ab how he would smash", "That hoe a pervert bro...like real talk if that was a man an a 9 yr old Lil girl the boy would B layed up slumped sum damn where. This shit ain't no diff somebody need to whoop this hoe ass", "Bruh they invented the term \"ladies first\" for a reason!", "The car changed direction on its own", "I would like to hear what the lady filming was saying before it cut off. She would've what if he spit in her face? She would've gotten knocked out is what would've happened. This pull your camera out and not help people shit has gone to far. But atleast nobody else jumped in. If that man owns the store it might as well be his house if he tells you to get out.", "Don't worry in 2 years there will be another Spider-Man reboot anyway", "Nah,... I don't care how horny I am, I pushing my dick back in my pants and leaving. That pussy may be the gate way to Hell.", "If people know anything, ya'll would know they we're jumping him into they little click or whatever they got going on. But my boy handled his business!", "How are people even mad about this? The kid had a fucking knife and was swinging it at others! So just because he's white we don't get to shoot him?! Fuck outta here.", "I remember once when my dad gave me money to pay the electricity bill but instead i bought a raffle ticket for a brand new car. When i got home,i explained to my dad what i did and he beat the crap out of me. But the next day,when my dad woke up and opened the door,outside my house was a brand new car. We all cried especially me,because the car was from the electricity company,they were there to cut off the electricity, my dad beat the crap out of me again", "She looked young,It was a better way to handle that,.the mother should've humbled herself,That was mean ,this girl may kill herself,,..\nRather record than teach ,Our sisters.", "Yes with White people its manslaughter never murder....They will later say they cannot indict Ronald ,because the shots were fired necessarily.....", "This shit happened to me, windows got fogged up and there was a small layer of ice on my windshield. I was late so I prayed to god I'd make it without getting into an accident. Don't be a pussy, just do it", "Nothing wrong with the surgery just be honest and admit to it. All you people talking shit about women getting surgery saying they are fake or what not are hypocrites. Were all fake. Haircuts, plucking eyebrows or drawing them, make up, hair extensions, push up bras. No one can say they dont do atleast one of these. They are all forms of changing your natural look to look better and feel better about yourself. Thats all surgery is.", "Every time I was drunk and than smoked pot I would throw up.. but if I smoked first than drank I wouldn't throw up", "This looks amazing. Real fans want the vulture and love tom holland as spider man. This will be great. Fuck the haters", "Hey I know that thing! Its from that movie \"where the wild things are\"", "That looks like organized.. they prob have good plan what to do with those phones after. Re-install their versio of iOs and sell it multiple different countries so if police tries to track them they need to do it one by one", "I really thought the last guy was going to help her out, then this dude goes and picks up a bottle lmao wtf", "Fucken wack,if any of y'all like this I hope your xmas tree catch fire and burn down your house with you still in it.Very disappointed in you people", "This neeeguh got gangrene on his hands... he got millions... nigga you need to finger a telephone and buy you some new hands, not stickin them ugly sumbitches in some pussy...", "Leeanna Urrabazo this is us lmao never finishing stories", "They made it look easy because it was easy. Nobody at Apple is crying over the loss of these items, but these guys will be if they end up in prison over a few measly iPhones and iPads. They might think they got away with something big, but in the end they will be the only ones to lose.", "All minorities . even poor white people , Let's Face it. Let's come together instead of fighting and spreading all this hate ! BC soon we won't have a middle class just filthy poor and filthy rich.", "No matter what, lives were lost. It's really disappointing that people need to blame someone. It doesn't bring people back. It's a tragedy, it sucks. But blaming one guy for each contributing member of that Warehouse dying I feel is wrong.", "Whats the difference between cops killing innocent people and people killing innocent cops .. Its all human lives at the end of the day so just keep them under one and view them as the same but who started the beef....cops who doesnt want to end the beef...again cops so whos at fault here...?", "Funny story: I showed this video to a my hubby who happens to be white and said I prob would ask them both to leave, me being Hispanic said so if a Hispanic lady shoplifted and they asked me to leave you would say it was valid.... his reply was absolutely NOT!! I said well that's the exact same situation, he said \"I guess I never thought of it like that!!\" Sometimes putting it into perspective with somebody he loves makes him think how they must have felt... I will never shop VS again!!", "Dam that's sad man smh they didn't wanna be apart god mad them two homies to be together inseparable", "Pretty strong instant media defense without proof of harassment or a crime for a female minority officer. God forbid it was a white male. Pigs in a blanket, cook em like bacon am I right? This post is junk.", "Idk why i laughed so hard but i thought this was gold", "If this happened at every game maybe I'd watch football.", "Wish my older brother would've been this cool to me when I was 13", "007 meets 21 that's just savage", "Jolene watch the end! Best alternate ending everrrr", "Louie Roque hahaha remind me of ur led cramps jijiji love u", "So heartbreaking. Keep your loved ones close...any petty arguments and grudges being held..end them and tell that person how much u love them because you never know when your last day will be. RIHeaven", "Well this is a Spiderman movie i WON'T be watching", "Not only conversations are deep but the pussy is. The pussy is so deep that it can cost a guy his assets, paycheck and his way of living; reduced to being a slave to the pussy", "You make shit music like uzi and yachty", "Fuck them cops really. Cops be killing black people everyday an take they ass home every night an with no punishment. But 1 cop get killed an now its a state wide hunt. Hell bruh can crash at my crib if he want to really", "Get the kid life insurance he is putting his life on the line how could you have bone in a burger", "I believe he was in his rules of engagement, he gave verbal commands repeatedly and the kid didn't listen. What if your kid was the kid he was going after wouldn't you be thankful?", "It's a shame, back in the day girl's wanted to be flat with no curves and skinny run away models, now this era all want Kim k and Nicki Minaj type of asses.", "U enter a bliss kind of state where 0 fucks are given", "So you're basically saying 3 good things happed this year", "She still finna recieve 9 inches the fuck you talkin about you see that bitch face", "What a loser. Maybe if you applied your self you wouldnt be stuck at burger king. These are same type of fucking retards that want 15 bucks an hr to flipp a fucking hamburger and still get the god dam order wrong. No homie you wanna get paid use your brain and get out the hood mentality. Sad part therez people who actually think that way even tho this was a joke", "I LOVE IT!!! This speaks to the slacker in me. I just don't want to do stuff...", "Alaina Hickey You know you don't have to wait for us to get to your place before you shower", "I'm only narrating so I won't be fined", "This is America and I for one will not discriminate on race or religion...so I'm gone beast fuck this devil worshipping white girl in the name of unity and equality", "I wonder if he heard that they're planning a huge attack on the day of Trump inauguration ... of course he does!! Those are his boys", "What's up with all these NFL players being targeted now all of a sudden.. Something foul is definitely in the air.", "Ha pathetic human beings to all of who would do shit like this male or female I hope you die a painful death you are scumbags", "Its better than alcohol or other drugs still illegal smh", "I seem to rember a similar article sometime earlier this year, though it was a black kid. You all were freaking out. He could have tazered him peppersprayed.. Ect. Now some are saying. \"oh he had a knife. Thats what you get.\" You fuxking kidding me? You all are just as rascist as the people that you call degenerate rascists. Fuck yall. ( some of u are cool) but fuxk most yall.", "An RN...so 40-50k a year...biiiiiggg money right there...uh", "If they had this in the major league baseball.... I would be a die hard fan too...", "The female because the man open the door for her, he bought her flowers, & he payed for everything. The least she could do is show some appreciation", "how come mostly uneducated people love obama? Only good thing I hear about him comes from people that get food stamps, free health care, and cell phones?", "nothing like the bond between a man and his best friend"]