["If so I would like to send you a puffle I created and I can't seam to find a way to show it to you and I think you would really like it.", "ja assisti pois ja ta dublado", "Yes I am omg omg omg omg :D", "Still waits for that 3D stuff they're talking about earlier", "Pls i want club.penguin on my phone........  you have it in Greece and no in Cyprus seriously pls update the range on Cyprus", "i paid for my membership 3 hours ago and it still hasn't came", "I signed up for a membership for my son and he still cannot do anything as a member. It is still saying he is not a member, but yall took my money. This is rediculous!!!", "the next sentence is true.\nthe first sentence is false.\nmind blown.", "I like so much this party\nMerry christmas for everyone :D", "I love my blu birds and yellow brown and my dog to lessie", "club penguin can i have a membership ? it is ria zoo :)", "You make good parties every month and are very good but it is unfair because everything is only for partners and one does not have money to pay him being partners", "Tell my friends how much I care.", "I love Club Penguin, I played a lot as a child. But i still play sometimes . My penguim has 9 years (3299 days today). How old is your penguim?", "I like my cat, the name is Mylti he sleeping in the bed an i love very <3 ;)", "Club penguin is very expensive on real money ._.", "que hace una manguera en la calle? respuesta vendiendo mangos", "como siempre e querido ese perro", "I love the Club Penguin, in a Brazilian, i'm love this game for much!! <3", "help i put a book code and i received a blue book with a chain opened wath does that means", "Hola CLUB PENGUIN acabo de comenzar mi cuenta y no me ha llegado mi correo.. Q hago..", "i love my dog jay he speail", "All the spam! No wonder it's impossible to log in- too much space taken up by spamming bots. At least the site looks popular.", "Ola eu tenho uma duvida, ele dizen que vai enviar um email dos pais e quando eu vou ver se envio nao vejo nada, por que isso acontece?. Por favor me ajudem.", "I use to play this so much when i was younger but than everyone costed real life money and in game effort to get.", "Hi. I love club penguin game. It's so fantastic and fabulous.", "Happy Ninja Day To All Ninjas", "hello club penguin has dubbing portuges", "Is this going to be 3 dimensional because that always seems to ruin my interaction with games.", "!!hello club penguin,I liked much the party from intense mind very good", "i'm not a member but 'm trying to", "Club penguin por que hay sosio todos los nosodios queremos compra la misma ropa que los sosios", "Kristina Saha Did you submit any fan art?", "Club Penguin Team can you pls make the club penguin apps avaible in android tablet? pls", "hats birthday and erybody pins for back please", "I would definitely play this game again if I had a actual running pc but it's modified to much now", "Espero que esta app funcione rapido en Android y no se trave y que valla lento", "Michael Aaron Harris Nick Dey-Vo Jared Godard Nathan Iantosca Jeremy Kobylka you all in for this crazy reunion?", "Yes! More pie at club penguin yaal", "hoy gan nesesito ayuda no se como activar mi cuenta en club", "I love Dot. She is a true penguin inspiration", "me encanta club penguin y ahora mas con la fiesta de intesnsamente", "Heads up, no party (especially a frozen party) should be more than a week long.\n\nOver a month long of a \"party\" is a little ridiculous.", "Don't speak spanish se here in a page in inglish", "i will return but not in club penguin but in club penguin island, my new name is Makugan ~Ricardus99", "What time zone are those times in? I hope EST", "blash ni hablar hebert tiene miedo al frio mas nada ademan solo fue abandonado en el polo sur y los oso polares no odian el frio hebert esta cambiendo de tenperatura cama nosotros era de loco hebert esta asiendo planes sinientros", "Will do a small party for the friends", "this project this amazing. I hope the next video is a tutorial on the island in 3d", "i got suspended 24 hours and they still past and i can enter now,why?", "tu y kluzzy son muy unidos", "Dear user,\nI want club penguin membership with no money please give me the codes", "verdad yo en club penguin habia ganada eso dizfraz esta re peloa", "I really hope Club Penguin turns to a 3D virtual world. It may seem weird, but it would be interesting to be in a different dimension.", "Let me guess...a mobile game that companions the browser game", "I haven't played in a while cuz I'm really mad when I was a member I bought some clothes and now I'm not allowed to wear them because I'm not a member anymore that makes no sense just like I can't carry around so my animals have paid for and everything what's with that", "You guys have to make a phineas and ferb party!", "Me quitaron mi cuenta por no activarla xddd", "SOY EL FAN NUMERO 1 DE LA ISTORIA SIEMPRE QUISE TRABAJOR EN LA COMPANIA CLUB PENGUIN", "Oh no, that time in my country is midnight and the dawn, i can never meet him", "Club Penguin Did a fantastic job on this party. Well done for 10 years!", "eu tbb capa lindha continue assim cp", "Operation Teddy bear confirmed on November 2015!!!", "Lindy Chen I LOVE CLUB PENGUIN <3", "me encanta CLUB PENGUIN lo AMO", "*_* I love descendants I'm not as equal partner gave me things and I'm so happy to follow CP", "Club Penguin Quisiera aclarar una cosa ? no seria mejor que cuando compras la menbresia y se te acaba los objetos osea ropa o articulos del iglu se quedaran ? es que uno se le va muchas monedas y todo para que se lo quiten? me gustaria que cambiaran eso claro es una sugerenciavla verdad tengo a mi primo que era socio y de le acabo la menbresia y perdio la ropa y los muebles", "esse jogo n com sigo joga eu tenho no celular eu n com sigo", "I'm still the fan of Club Penguin but i'm a retired player in 2009-2011. I will love the see Club Penguin the Movie!", "Hello I want to inform you that umaas pages called 'Agent Dot, Rocky and Cece are annoying players in club penguin are cursing or making profanity swearing if you can answer me\nGrateful! Bruno :)", "Club penguin yo cree mi pinguino y no me ah llegadfo el correo de aprovacion", "ARRRRR,encontrei o Rockhopper no evento de FALAARRRR COMO UM PIRATA :)", "I quit club penguin because you made the mobile version", "I like club penguin super cool you can social with  the other penguin/ people  and you  can buy cool clothes for penguin. I had club penguin for a long time and club penguin cool.", "Giovani Alejandro Pues Ve Ha VIPenguin:)", "Ya lo se para el Enero 2016 aran al fiesta de Un Gran Dinosaurio, Las reconpensas seran, El traje de el dinosaurio verde, El otro dinosaurio rex, y el traje de Spop,", "that end is the best (y)", "I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).", "Do you all still give out stamps? Because I feel like I should of received some recently or that some are not possible to get anymore.", "si que vivan los gatitos locas", "Emmie Hwang i paid to play this", "I am 14 years old and had been a long time (about 4 or 5 years) I did not want to hear about that game. I was a subscriber the Club for years, totally addicted and too loved this game, but when I stopped playing I ended up with this. But a few years ago I went back to listen to some music of our DJ Cadence and started to enjoy it again. And then hearing \"Cool in the Cold\" (I saw the release of the song in 2012) and remembered that every year I donated to the Coins for Change. I still do not own an interest in the game, but I can not break my promise of donating the MAXIMUM than I can donate every year. Always, on the weeks of December, I play all the possible games to earn coins and donate the last coin by the campaign. I love it!!", "club penguin nesesito que me digan como activo mi cuenta para que no se me elimine porfa ayudemen?", "Whenever I try to go to the page, it always says, \"The page can't be reached.\"  So uncool and unfair.", "es sierto uno no puede comprar casi nada", "i'm really looking forwad to this party!!wanted to know if it will have the closes of the caracters as the disgust?", "Where exactly will he be located? I mean, lighthouse or something?", "Club Penguin a risco de banir um penguin que usa progama de terceiros?Haha club penguin e top", "Eu acabei de sair do computador ai eu fui jogar no server ingles ai eu vi ela :-D", "que viva club penguin y vipenguin", "I bet only paid members can get the clothes. However, I'm still more concerned about this (if you remember):\n\n\"I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).\"", "Hola!,Club Penguin!!! Tengo una pregunta en 2011 active una cuenta de cp no podia abrir el chat hasta ahora [2015] no esta abriendo.Que hago??.Mis padres activaron mi cuenta pero no se q pasa.Me pueden ayudar??", "Club penguin is unfair that most things are for partners", "my daughter is having trouble logging onto Club Penguin at the moment. Is there a problem ?", "xq mi cuenta ya no me dejan entrar tenia mucho dinero invertido en ella exijo que me la devuelvan", "Eman Ali ;) I know what we're staying up for", "animaljam v.s club penguin who will win?", "bora bota contas do club penquin ?", "Donde se compran las tarjetas de socio en Argentina sin tarjeta de credito???", "Its so kind of you to give green alien puffles to nonmembers", "se los agradeseria si tuviera una membrecia", "hey did you know that aunt arctic is the club penguin director see it in the tenth aniversery book character memories move you mouse pointer on aunt arctics name and pic of director and his comments will be written", "This is the lamest party cp has had. What are you suppose to do in two re-decorated places???", "I liked it when the Penguins had the old design.", "que mal que no se pueda tener agual guier pufles nadamas les im porta el dinero", "My name is Kaneva Man start of both words are cap", "Crystal Doan Get your account back.", "haha i got mal's spell book >_<", "HELP!!! i cant adopt a rainbow puffle. i can get to the place (and am a member, and only have 5 puffles atm) but when i click the log, a puffle joins me on it, but no adoption/naming thing pops up, and it doesnt leave with me", "Club Penguin,eu entrei na festa,mas nao tem nada legal apenas 3 salas decoradas e roupas gratis,eu esperava uma coisa melhor,voces ainda vao fazer alguma melhoria?", "me pregunto quien seguira jugando club penguin", "hello owner of the page cp n I can take the blue puffle dino pf help me", "i donated too much, more then 10,000", "Of course, because only Club Penguin Users still use a 4:3 Aspect Ratio.", "butttttttttt i am not a member", "lo socialismo es perfecto son malos", "todos los que puedan vallan al iceberg", "OMG the brown crying penguin from the PSA Mission MMNEEEOOORRRIIIEEESSS :)", "Why ios the puffle eatting tis over again every time?", "Where can I find his secret lab?", "amo ese juego lo unico malo es que casi todo es para socio", "I love the video! I love the song! I love CP!", "will there be more pufles soon?", "Patrick o no not the wobs", "Why do you never trust stairs? A: They're always UP to something. Terrible jokes make my day. Just kidding.", "Feliz ano novo,pra equipe e pra todos no mundo :D", "Summer is the only time mondays are good.", "no nos dan ni uno? D;", "It has been so many years since I have touched this game, so nostalgic for this to pop up on my wall after such a long time lol", "really i miss old club penguin website i really want to play 2008 club penguin i liked the old club penguin but not the oldest i really want you to make club penguin's 2008 or 2009 page please", "hello my dad bought a ticket but no one partner  gave me wanted to give me my name is BERPY1285 porfa was for 6 months and my dad pay much", "me encanta club penguin hasta tengo uno", "I opened an account a few days ago. I had accounts before back when I was younger, but I don't know the usernames/passes to them. I am glad to be back even though I'm probably WAY too old to play! xD haha", "hey cp my brother mahamed can not activate his account", "DISCUL EN DONDE TE CONETAS 1 EN Club Penguin O FREEPENGUI.XYZ PORFAVOR", "Really I love cp too much cause it was my first online game at all, but I felt mad about that when we buy membership everything we buy for our house I cant use it. Really it's so mean ._.", "esse jogo eu jogo so nao sei como ativar a conta", "I hope they do not go out with the same nonsense of buying a partner account", "I donated all of my coins", "hola ami en club penguin me dice avtiva tu cuenta y meto la des mis padre y ne les yega nadas", "now i have 13 year i remember this game i play this in 7 years :,)", "i love club penguin is the best and everytime i play!", "dear club peguin hi im tyler but my club penguin name is monstr25wigi i really want that brady hair because it's really special to me so can you give me some brady yair plz and if you do it would give me a smile", "Vendo membresia de 1, 3, 6 meses a buen precio.", "Make a party from old cp repeating it's self for groundhogs like the day cp was made be creative.", "I can't cancel my subscription. .tried now for 2 months no contact still taking my money. Try to get in touch with apple good luck an absolute rort don't sign up. If club penguin see this messege I'd be happy to talk to someone to stop as we are not and have not been using!!!!", "*with a picture of Aunt Arctic using her right flipper*", "Alonso Cortes they are using some putin brain cells", "How much did the hat cost  Conor?", "Mi hijo tiene a eso puffu de mascota y tambien tiene al dorado al arcoiris y al gato y tambien tiene uno de dinosaurio y uno nuevo que es un robot y un puffu fantasma", "Finally renewed my membership after not having played in over a year.  I've been a part of Club Penguin since November of 2007", "Cant wait, David and I will be there on Slushy!", "oooooo jeje a los 3 mi madre me conporo una cartera echa de piel de leon nose porque", "I'm writing a paper on how there is a social media for every age, interest and purpose. It would be amazing if someone from your company could give me a rough number of how many users you have or had in the recent past. I consulted your about page on your site, but I could not locate such information. If this is not possible, possibly a ranking your site has compared to other social media platforms that share similar age groups. Thank you, Kyle L", "Hey club Penguin please reply to me. One question I want to ask, will you release the shadow ninja?", "I am sosio but I can not buy things I am gabcarp Fix it please", "Happy anniversary club penguin  We Love u :)", "alguien sabe como recuperar uina cuenta...no puedo entrarfy sigo pagando...", "Still just another lame modern party", "acontece q eu nao consigo criar uma conta para mim e eu estou fazendo minha senha e meu usuario certos e em tamanho ideal", "hey I got an alien puffle but it wont let me feed it n whatnot unless I become a member n I don't want it 2 die. y u do dis?", "Is the #projectsupersecret a new 3d cp?", "porfa podrian dar los puffles especiales como el ddorado los puffles dinasaurios o otros mas sin ser socios", "I may be old but gotta revisit my childhood", "Club Penguin total drama party coming soon ?", "Vi un capitulo de la serie de Club Penguin. Esta muy bueno!!", "gente como fazer a assinatura da conta? me ajudem pf", "esto dijo ellos  lo se porque hablo ingles  La bondad es uno de los mejores regalos que puedes dar ! Contento", "When jugabas klup pingui y t recuerda a tu infancia v': alv", "Club Penguin, help me, I forgot my password the first penguin I had, 2013 or 2014, I liked him, and was never subscriber, but the important thing is not to have signed, it is to have my penguin back, :'(.", "meu filho gosta muito de jogar esse jogo :)", "will there be a day when we can see the updates as they are happening?", "love club pengui  aganme socio porfa", "I love club penguin it is the best online game ever I play it everyday", "Club penguin I have missed you", "Josie McDermott Bing bong and club penguin! It just cant get any better", "hope there wil be some good event ;)", "Just i want to know the results of the earlier coins for change", "Where can I adopt a pet rock today? I can't find one?", "Omg I'm a lefty Yaya Yaya Yaya yay btw it's my birthday", "Hi! I have a little Club Penguin animated gif I made for one of my university courses of my penguin, and I would love to send it to you. Unfortunately your fanart page does not accept .GIF files. Is there any way I can send it in to you guys? :^)", "I'm a Club Penguin member for two penguins", "QUIERO TENER UN PERO NO SOY SOCIO PORQUE MI PAPA NO QUIERE PAGAR LA MENBRECIA", "Very nice this cat is so cute. :)) :** :3", "it's so funny when Anger falls down and the butt sticks out", "why club penguin is so many objects rather than animal jam.", "eu nao sabia as regras fui banida me ajuda nao comsigo ficar 1 minuto sem o club penguin", "i want to talk to the company in important thing fast please", "Pfv Club Penguin desbloquea algumas coisas pq eu nao tenho assinatura pfv", "I've always had interest in botanical research, most of that research consists of trees. This research runs in the family, so I tend to STICK to my ROOTS, although I have been thinking about BRANCHING out, and if I could find something else to love, would I move to that subject? I WOOD; however, I don't want to BARK up the wrong tree. A comment section of jokes, I better make like a tree and LEAF, I'm starting to feel like I'm HOLLOWING out my collection of tree puns.", "oigan no me llega lo de la activacion q hago por fa contesten", "I'm really getting annoyed about the Club Penguin Armies autotyping on the Flurry server- it is overwhelming and they are sending everyone to their own websites to join their army and become Club Penguin members. If this is the way Club Penguin is going then please let us know.", "Sorry for the inconvenience but when I opened a new account penguin store and I gave mine a bone between the original is erased my friends and nose to do hope you can help me or say how to solve Thank you await your response.", "Hi, i have troubles trying to buy a membership, can you help me?", "I don't like club penguin. In the game, all the things are for members", "Club Penguin im very sad for club penguin if close i cry all the day club penguin is a great game but the boys of this days wants games of wars i have 11 years and i love club penguin", "2mlg4u gr8 banter 4 club pengueen", "me gustaria que me manden una solicitud de amistad", "I am playing club penguin right now", "I love doing coins for change!", "aqui e o filho dela o gabrielboff voce pode me dar uma assinatura gratis", "Club Penguin need more animal characters like Herbert. Make it Paper Mario-ish.", "YAY I love inside out I watched and the puffles have the same emotions as Joy , Anger, Fear ,Disgust and my most favorite is Saddness", "hi we have had problems with login for weeks due to up grades from club penguin  and sadly having sent several emails to discuss the frustration and upset, they gave us a months extension on membership . i think a little tight maybe its too cold for them to open their wallets any more , how sad.", "why no mission on it no more", "Hagan una fiesta super loca para celebrarlo B| :D <3 (y)", "Hi Club Penguin. I read that Nasa scientists find evidence of flowing water on Mars .. so, Mars Takeover?", "For my best friends, i will get her a membership for club penguin. I meant best friend, Actually i would do it all to my friends! all my friends play club penguin soo yea.. I love my best friends.", "me mostr oke e ese club penguin", "New emotes for Inside Out parteh Yay", "o rookie me no es el pinguino que mas me encanta de los famosos  pinguinos", "I love desendets and I'm a member go evei I can't what for the holloween party that is my favret party every year", "Hello! Penguin club membership can bring to Argentina? I want to buy but not hope your answer thanks for watching my comment...", "Earth Day!!! That's My Bestfriend's Birthday!!", "How do I do the safety Quiz? It does not work", "Please,and erase all the other things I bought only my raccoon I want to keep", "ola club penguin eu queria saber nos vamos poder se tranformar igual eles na festa", "Ya tengo 1 membresia de 6 meses gracias a este", "hi club penguin, about this months party for the aniversery you have the corrections wrong its suppose to be 11th anaversery cause i look on the year it started which was 2005 so you kinda got the years mixed up", "Wow, you guys are really pulling out all the stops with overhauling Club Penguin! I do hope you keep it browser-based instead of requiring a download, though I know that with a game of this caliber it could be tricky...", "You could of had a tiny party where the penguins could go underneath the surface of the snow and go on some epic wild adventure but instead you give us this.", "I'm so excited 2016 the surprice's year", "hey club Penguin qual vai ser a primeira festa do ano q vem? #pinguinando", "I already have it the clots of safety online", "pero igual me sigue gustando club penguin", "Failed to understand the \"good\" part of \"monday\" -.-", "Maybe he'll bring an army of polar bears and cp can have a battle between penguins and bears on the island.. OH WAIT no you won't do that because that would be considered a good IDEA.", "very cool, but i prefer how it looks like on computers now XD #old", "Can you put again the Cat and Dog puffles jackets? My penguin is new so i want to have that jackets than i really love", "Can you help me with something ? My name is fred73639 , and i have 4 puffle (red.blue,yellow , that i had code to put it, and gold) and i can't have the alien puffle , SO PLEASE DO SOMETHING,I REALLY NEED AN ALIEN PUFFLE :(", "Club Penguin Me dar uma assinatura? Ja coloquei 3 vezes e a minha acabou :( jogo club penguin deste 2011 :D tenho o pin", "bing bong es el mejor,comediante y loco", "Is club Penguin jenial dian leis an Hera nua", "Why doesn't club penguin app have all the games like thin ice", "Hello CP there is a glitch that occurred to me when the music is different instead of Halloween music its the frozen party music and another one is that if i teleport to become a monster my penguin disappears kind regards Tom Young", "in that month this update reaches the island?", "Here's a small question:\nDid Club Penguin Started on 24th October?", "Seriously let the non-member people get stuff, all the membership cards and stuff is to exspensive. You should price it: $3.45-1Month;  $12.67-6Months; $34.55-1Year, not $10.00-1Month $30.00-6Months and $60.00-1Year!", "espeically when ALL the prizes are for member", "Please arguien I can give a nuemero of credit card charging", "Oh, I DO hope that all of these awesome updates don't require a downloadable client...", "club penguin makes me wanna wiggle Max Gowl", "vou mandar ^^ e uma pinguin de cabelo marron e blusa laranja", "club penguin as I do to put photo? I'm argentine", "I have everything from the book... non member items for my 2nd account.", "por eso le gusta a rockhopper hello rockhopper", "Club Penguin eu acabei de fazer um encontro para falARR como um pirata !", "Club penguin eu gravo videos de Club penguin, como codigos e etc... posso ser autorizado por isso? (y)", "PLEASE TELL ME HOW TO ACTIVATE ACCOUNT!", "Are we gonna have puffle parties? I HAVE THE MOST MEMORIES OF CLUB PENGUIN PUFFLE PARTIES! PLZ BRING IT BACK. Before you do, plz...\n-have puffle costumes or hoodie or shirts for non members\n-non members can transform into any puffles that they have\n-when transformed, penguin which is transformed into a puffle can have a move for them to dig up coins or treasures\n...probably the rest is up to you guys SO PLEASE MAKE IT THE BEST 2016 EVAR", "ya recibi el correo de mariela124 :P", "AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHH!!! Ok, I got loud. Now what?", "Send them a Hi, Friend, miss you note!   To all my Chicago Friends,  Love you all & miss you!   FLORIDA is great, but there is no place like home.  Love,  Jeri", "i just thought of an awesome idea for the creators to make...ELEMENTAL PUFFLES! like a fire,water,ice,and snow puffles if you use my idea could you make it for non-members as well? it's hard to be a non-member and not have cool stuff, and if our membership runs out we just have cool stuff that's in our house that we can't use,like non-member puffles.", "What the hell happened to the Puffles?!", "S T O P T A K E O V E R S.", "Ojala la app salga ponto en android", "Its been soooo looong that I have played it...\nHow is it going on guys?", "I just noticed Kluttzy behind the mirror o.O", "Club penguin has been ignored :v", "Callum Read Conner Humphrey Freddie Tipping", "Porque no hacen una Pelicula Animada de Club Penguin", "Hello I loved this great party is re seriously :)", "Jemima Knott I know what I'm gonna be doing", "I collect like 60000-70000 coins every year and I donate them ALL", "I turned sanity1 hey please help are suffering", "Bring back the typing game in the library at the coffee shop!!!", "Is this gonna be some thing for club penguin", "those eyes and hair, it reminds me someone...", "This is the longest catalog of cp history!!!! my story: I had 32,000 coins started buying things and when only half catalog was over I had on 9000 and something coins then, I wrote some codes in treausre books now I had 15,000 and something now I started buying and still when 3/4 catalog was over I had just 7000 this is current just a few moments before  #Daffodaily18", "the old items are back :)", "atencion jugadores de club penguin alerta roja11!!1!!1!", "Oh Cp, no me des lag, :'v", "hello cp team I'm with a problem I n got the igloo it does not appear in igloos tab on my igloo please help me", "I remember watching this the day it came out last year", "Hello club penguin who never tire of making money ? because people have to pay to be happy Everyone we should have equal non- partner does practically nothing I lose because I am a non- equal partner to many penguins tired of boredom in Club penguin everyone should have equal # Wepaynottobehappy", "Q:Why was the elephant afraid to use the computer? \nA:Because there was a mouse!", "I hate the membership thing some people can't afford this cool stuff like a new igloo and such sort", "Can someone please help me. I have paid many times for membership for my son and he wants to join a prehistoric party but he doesn't know how. Can someone please help me", "My favorite book Series is The Selection by Keira Cass.  I read three of the books in a week", "club penguin vas a sacar card-jijsu sombra o uno secreto es que me emociona el que mas me gusta es card-jijsu nieve :) ;)", "hola club penguin los ammmmmmmo me llamo nifogu27 en club penguin", "si esta nueva dimension  solo estara para portatiles o para compus de escritorio tambien", "Simon can we pls watch this", "Guys stop! They made the party small because the 10th Anniversary!", "Happy ninja day for all ninjas", "Club Penguin I listed my name on club penguin took many days waiting for it then appears and nothing please help me answer as possible Thanks", "Por que no puedo entrar a club penguin", "hello cp team okay I'm with a problem in my notebook I can not update please adobe", "Herbert es el causante (se descubrieron adelantos)", "Eu vi o herbit no encontro dos pintores!!concluir os mandados!", "jai besoin daide mon compte ne marche pas quand que je cree un compte parent", "club penguin es lo mejor del mundo", "Hello, club penguin, I can not connect to this site, is saying that I can not connect? It is written that\nthanks for listening", "Perry the Platypus. Phineas & Ferb Takeover Confirmed.", "Featured in the Club Penguin Times April 8th, 2010:\n\nWhat's a monkey's favourite month?\n\nAPE-ril", "hey club penguin, buy me a membership card for one year and he said he already redeemed", "Why did the chicken cross the road?\nBecause it can", "Hi Club Penguin! I have a problem... Today i'm tried to play in Club Penguin but I can't remember my password! I'm tried to change my password but I can't because the web say 'Sorry! Invalid Penguin Name or Email Adress' but I enter the correct information! I don't know what can I do. Thank You.", "Club penguin I have a question does the alien puffle on operation crustacean also avalable for non members also?", "I have question in the game is it possible for the shirt nhl?", "como le hago para que me llegue el codigo de activacion??", "hola amo club penguin soy de colombia y tambien tengo un juego muy parecido a club penguin los amo bay otro dia les dejo el lain", "Get rid of the autotyping bots who have taken over... there is no room on screen because of their advertising outside websites. It would be nice too if the IGNORE function actually WORKED so these bots could at least be ignored.", "club penguin i am really sad because my brother bought me a membership but when i went to my account there was no member :(", "Based on FNAF. Isn't it too scary for young children?", "-_- \"Happy\" and \"Monday\" Don't belong in the same sentence.", "ay un error yo y mi hermana nos queremos comprar los puffles cristal y olaf y no nos deja y somos socios  apretamos adoptar y no pasa nada espero que contesten chau", "Oque o Club Penguin Remix tem haver com esse app?", "..You what?\nMy best joke?\nAre you sure?", "Happy anniversary Club Penguin!\nWe love you!", "Looks like I'll be returning to Club Penguin soon.", "hey no sabia q club penguin tenia pag de facebook", "Need more players, the way you make almost everything needs membership scares the non-members away", "me pueden hacer famoso porfabor soy Zass79575", "habra ofertas en club penguin hoy?", "can i write any open comments to you guys?", "agregemen publico cosas de club penguin y mucho mas.", "Hebert better not mess with the EPF!", "Just giving you ideas. You should do a Gravity Falls festival. Yeah. You should. Every one loves Gravity Falls, and that will cause a sensation all around the world. Like if you agree :3", "11 years and the game has had such a big fan low, and that step because every day give immense importance to members. Club Penguin's return to greatness, when they had adventures, when original parties and had missions. Please stop recycle maps, make interesting again find a famous penguin on the island, make the holidays are unforgettable. Return what made it great to Club Penguin, please. (Zippy Zenpin)", "Right handed. I can play left handed on my 3ds though", "but in my country today is a holiday", "Quiero un puffle multic pero no tengo celular inteligente :'( :( ;( .( ( ,(", "This is unfair, probably only members will be able to do the fun stuff", "Thanks but I do not celebrate Easter today", "club pengui es un asco mire mi ropa buna lo que no son socios ni puffles ni cosas para la casa y esta nueva tenporada que vino nada TODO PARA SOCIOS que mal amigos que no son socios ven lo que club penguin nos da es que ni un traje buene ni un puffle cuando las persono quieren pero no nosdan una oportunidad de tener lo que queramos por undia o por una ora de das lastima club penguin... :'(", "played it and saw herberts lair", "Ths video was so cool! I love all the secrets at the end and the hint for other parties Looks like an epf party is coming soon!!!! And is that a new look for Aunt Arctic?", "i am going with this game for about 20 yrs.......", "genial siiiiiiii es el juego mas divertido del mundo a soy el hijo de benedicto", "hey i really love playing this game its fun! but also some really inapprortie things happen personally like penguins do some bad things ive seen i reported them to the modren but no body did anything! so i would like to know if u can do something!", "its not worth it anymore. been playing for a long time now and its just not worth it if your not a member. when they first started they had fun activities and a even amount of stuff for both non members and members. though members stuff was always cooler. i have seen a huge shift over the past years to where there is now nothing for non member. this past Halloween i just did the enter event and got only 2 non Halloween themed items. shout out to when club penguin was actually fun and cared about its players. (Clud12)", "am club penguin did my email sent?", "la mia nose le puede activar que raro", "And how many old rare items have been ruined due to this one?\n\nEdit: Around over 20+ items are now ruined in rarity due to this one. Including the mullet tie\n\nEdit 2: Make that over 30+ items", "cancelaron teen beach movie 2 en cp", "elle herbert las pagara la epf te encontrara y te castigaran", "Wow Now On Facebook That Is So Cool", "Club penguin deixa eu ser uma moderadora do club penguin?eu adoro o jogo club penguin por favor?", "si y ami mepasa lo mismo pero tatmbien con los mapa", "ODIO CLUB Club Penguin CADA VEZ QUE JUEGO COMPRA LOS SENSEI ELLOS DE CARTAS TIENEN DE 11  DE 12 Y LOS QUE NO SON SOCIOS!! ESO NO ES JUSTO ES ORRIBLE!!!!!!!!!!!!", "Don't forget (this is more about the paid members problem than the idea btw)!\n\n\"I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!\n\n(I won't stop till I'm recognized).\"", "Hi Club Penguin! These days stopped playing club penguin because it was busy when I returned my club penguin did not go! it seemed that tava carrying more did not carry, I tried many times and did not give! Would you help me ? I've tried everything! I love this game too.\nName: Kaue K6", "Omg. Being an adult now im half tempted to join again, and become a member so i can see all of the things i couldnt way back when... lol!", "Well I play Club penguin: Kaylagirl503 (wishes to be penguin of the week) and well I love to read Fear street series by R.L.Stine.", "quiero que club penguin mande los puoductos y juguetes a las tiendas de republica dominiccana", "That could be their puffles too.", "Club penguin? Can I play offline on the app?", "Es muy bueno club penguin  en verdad numero uno pero no tiene razon el juego de que si no estas conectado durante 7 dias eliminan tu usuario deberia ser como animal jam creo que animal jam es mejor.", "Quero saber como que adiciona amigos", "Where's his news gary inventions? >:v", "I like club penguin because I can get the dishes in the dish washer while my kids have fun. <3", "I have one but ur kinda rit but it's because I said puts with an a I was tring to say puts away", "I love best friend day. My BFF is club penguin", "vivaa club penguin por que si esta animado jejeje", "como se le hace para activar tu cuenta", "Ayuda creo que mis papas se dieron cuenta que me registre sin pedirles permiso :0", "Haven't played Club Penguin in awhile", "gente dise que o gary ia ta no avalanche 1 hora no horario do cp porque ele n teve la", "when is the game app coming out", "no es justo que todas las cosas bonitas sean solo para socios yo quiero y mis papas no me dejan porque no tienen dinero porfavor hagan ropa y accesorios bonitos para no socios por lo menos por un mes", "I hate this Club Penguin. I want the original back, these parties are trash", "el queso verde dua dua que ascoooo en club penguin le deven gustar pero a mi no guacala peor que el queso azul", "My tarantula is my favorite pet. He sleeps with me at night and wears 8 tiny socks that I knitted for him.", "club penguin est nul et pas cool  parce que on paye pour etre membre venez dans vipenguin c'est sans paye pour etre membre", "Club Penguin Podrian Sacar otro Disco Por favor", "Club penguin tengo un problema no me sale jugar?? me aparece mas info por favor me puedes responder el problema?", "quiero que pongan mas cosas geniales como lo de los socios para no socios porque l socios tienen mas cosas que los no socios :(", "It means a lot to have been part of this, Club Penguin Thank you so much for all the great memories, support and love! <3", "Please put me penguin of the week Louis 2015", "I have some experiences (good or bad) to share about Club Penguin customer service soon.", "Club Penguin,Por favor lance club penguin para windows phone", "The spam today on Blizzard! Does Club Penguin even care about the autotyping and all directing players to external websites? You can't see the backgrounds because of all of this...", "We need a club penguin tv show on Disney Channel, and maybe Disney XD too, but mostly Disney Channel,", "Tenho 15 anos, mas acho que daqui a 20 ainda amarei club pengin", "I used to love this game, and now I'm trying to play it again but I don't remember my penguin's password (not even the name I remember it clearly)", "why not pull more space for the puffles, I have a lot of them and I have to get the Alien Puffles! so, you pull more space for more puffles for the puffle garden, please?", "Here You Go :D\n\n1362832942803669 \n1399540689327177 \n1371468894079990 \n1398738773744319 \n1324709933685516 \n1312524356957369 \n1372961321661007 \n1389733565156544 \n1316549775247232 \n1346142252642222 \n1357528240738652 \n1352939389577819 \n1340027712054359 \n1393801868111800 \n1376170722100576 \n1326331179390255 \n1309831604741910 \n1326902846475531 \n1365728299491482 \n1319704856514710 \n1398254750140932 \n1390586850169126 \n1388615574349442 \n1378348998487290 \n1300735415033889 \n1369759457360091 \n1357910712880863 \n1373431248926659 \n1395575724180854 \n1302285518236836 \n1382157574761361 \n1364798955748393 \n1365332496432507 \n1352045242416636 \n1337748754837004 \n1321061796119673 \n1315089430289016 \n1372108810046855 \n1341849619292505 \n1376247730397304 \n1375402273241453 \n1399816067414509 \n1363199329807740 \n1331465373428635 \n1330280040927937 \n1319289572830767 \n1300463281944667 \n1338619169678604 \n1327694862968180 \n1327685219910415", "quisieran que me ayudaran a ser socio aorro pero tarjeta de donde", "HAPPY HOLIDAYS and HAPPY NEW YEAR everyone.............", "que fino juego pero todo para sosios", "como activo la cuenta ya puse el mail y no me mando nada :/", "Like if u cri evri tim", "may have a pokemon party at cp", "cool i got eat this day cookies and chocolate", "Club Penguin, please please please, next year for the Puffle Party please have the Orange Tabby costume! The 1st you had it, I wasn't member, and the second time, I also wasn't member! But if you have it again I will buy it and I'll be a member. PLEASE HAVE IT AGAIN!", "ok ok ok Club pingui  es genial", "Ya no soy socio por eso ya no juego :v", "Seems like the website is down after the latest update", "Elle Evans omg bye i have my life back", "tengo una duda mi puffle verde el marciano de la fiesta que hubo ya no lo puedo usar porque? no soy socio", "Such racists people.....everything for members. :/", "oo than good club penguin love love him very much is a good healthy nuego also has nice things and pizzeria and intensely than joy to be part of the club :)", "ta passando o evento ebaaaa,mas club penguin o evento so vai ter esses intes mesmo ou vai ter mais intes por ai?", "we can now where is gary?", "como busco el club penguin en el android ????", "This catalog has many old items", "deverian de crear una serie de club penguin asi como los videos de musica de la penguin band y cadence", "Club penguin vcs falam varias linguas?porque eu vi uma resposta em portugues em comentarios e outra resposta em ingles", "No Billybob is no longer the same :(", "no resibi mi correo al guien me puede alludar.", "me considero fan de club penguin 8-)", "pasen Cp.......  ups  aqui no es", "Why when you get the gingerbread house you can't use it. I'm a nonmember by the way.", "hey! clubpenguin remember 2012 can you give me a boa pls i want all of theme but i cant get all of so can you? plz", "Cool CP! Can we have a sneak peek of this months catalog? I'm really excited and I can't wait!!! :D", "feliz dia da amizade no club penguin a amizade vai longe", "me encanta club penguin solo que quiero mas misiones ya me estoy aburriendo", "I pass the safety quiz..! :)", "I want to be a member Tailor5130 help call please help me", "como puedo ser socio sin pagar", "You charged my paypal account unauthorized.  who can i contact? asap", "Club Penguin Every time i go to play.clubpenguin.com im greeted with a page that say:\n\"6 months ago\nYOU DECIDE: Musical Items\n27 comment(s)\"\nand then i cant log on to play :c ive tried on multiple computers and browers and clearing the cache :c, i just purchased a membership and now i cant even play! Please help.", "Quiero comprarme socio, pero con boleta se puede?", "ai e e o es un misterio me encantan", "Club penguin me gusta mucho la fiesta de intensa mente muy buena :D", "club penguin no me gusta su juego porque me suspendieron mi pinguinoooooo", "En el lado oscuro hay galletitas :3", "al juego Five Nights at freddys", "Feliz halloween a todo club penguin", "Operation in October? :D Waddle On", "I donated about 100000coins!! 1 million coins!!", "Good morning Club Penguin and everyone!!!!! :D", "when you will make the app be available in cyprus??", "Put Club Penghin stuff there. Make a Lion Guard Takeover party!", "Club Penguin existe um bug ao fazer o login no Aplicativo G-Ladeira esse bug esta no nome a dizer que esta mal.", "PLZ PLZ PLZ make club penguin on kindle my son really wants to play it on his kindle so PLZ PLZ PLZ make it for kindle", "This isn't a dog its a puffle!!!", "why isnt club penguin working today", "The DJ girls not wearing a pinkshirt", "Eu tenho club penguim no celu", "When is Rockhopper coming to Club Penguin again? I can't wait to get more pirate gear(besides the gear I already have).", "CANT RETRIEVE MY ACCOUNT SINCE YOUVE DECIDE TO SWITCH SOMETHING I GUESS LAST NAME WAS SHINDONGHO FORGOT HOW TO RETRIEVE IT TRIED MY EMAIL NOTHING", "how would I go about reclaiming my old account? it has been a very long time and I need some help :c", "una pregunta como se ase socio", "hmm the Theory of FNaF is not wrong, but: It's not in a Restaurant", "Lo mejor es ta pade y yo estoy con....con...con quien sea XD", "What a day for your dog to enjoy.", "vdd que dia vai ficar zinza :v", "Hey Club Penguin, I Can't Activate My Membership code Because When I Click on Redeem than it Says That You Are Not Eligible For The Promotion :(", "quiero el gato de el penguin", "I think I didn't visit my account for a long time my puffle ran away", "I love club penguin a speak spanish no inglish", "what is Elsa's pet? the white puffel since the cold never bothered him anyways", "soon i draw my fan art...", "hi cp I am here to ask can i be a mascot like you all my name is jayceekohar1 in the game thanks.", "shout out to when club penguin was actually fun to play, old rooms, original games, and not owned by disney #RIPOLDCP", "we will try to turn the iceberg in the Zero Degree server !!!", "Happpy 10th Anniversary Club penguin <3", "quiero que quiten lo de los socios", "I am so disappointed. After waiting so long all we get are 2 rooms decorated and no activities. wow ...", "Blizzard is over-run with spamming auto-typing bots. You can't see the rooms- will Club Penguin ever do anything about this? All directing players to external websites to become members.", "jaja isieron enfurecer a furia jaja como le pegaron con el balon i se enojo", "Club Penguin podrias hacer solo 3 misiones faciles", "Oh Herbert, I guess he did not lose any weight as he got older.", "club penguin esta bien que cada mes den ropa nueva para socios pero hay algunos puinguinos que no son socios.Me gustaria que pongan cada mes ropa nueva para los socios y los no socios", "Does anyone know how to buy accessories for puffles on the app?", "A new penguin model. Is this part of....projectsupersecret?", "happy new year Club Penguin :)", "purchased products disappearing after subscribing for membership.please help", "una pregunta club penguin yo tengo un pinguino entre y era socio le compre ropa un iglu y pufles me sali y cuando volvi a entrar ya no era socio solo me quedaron los pufles y la ropa ya no la podia usar pero nose como paso no he comprado membresia ni nada que hago", "i love anh hate club penguin you know?\n i hate being not a member i always wanted to be a member but it costs real money!  i hate it so much and why dont non members get more stuff?!", "Please don't ruin my childhood by making the game playable only on mobile. I don't find the mobile application a good alternative even in its current form. I have been a paying member of the Club Penguin community for 3113 days, but in recent years, I'm just more and more saddened... :(", "es malo por que las cosas sola mente son para socios", "hey they know how to get clothes descendants", "I really like this one. <3 :) What's the next party? :D", "Feliz sexta! essa festa club penguin do filme divertida mente foi um  susseso", "I'm a non member and I have the maximum amount of puffles and I want to adopt an alien puffle :'(", "No puedo creerlo solo por que distraen de un proyecto >:-(", "if they keep giving the members im not gona play any more", "ALL YOU ME IS CLUB Club Penguin", "Club my New penguin hcman6 i Need a email i Put my email And my Sister went To gamil And yahoo There Is no Message About You my Sister Put The email Again stil no Message From You To Put The email That you say", "I hope Club Penguin even comes to Bangladesh......", "HOLA!! EP llego a club penguin!!!", "e legal eu sou assinante tipo rico", "hey club penguin, i just tried to login to my account, it says i have put in the wrong username or password, when i know for a fact that its the right username and password, and it wont let me reset my password either because it said something like invalid email or username, help please, do you delete old accounts or something, what happened to my penguin", "que mal que no estube en ese siglo beueno pero no inporta pero se be muy dibertido.....", "Happy anniversary < 3, thanks for a great game!", "Do you still play this game?", "no me a paresido pero para estar pre parado", "I miss old cp u u", "olle me active la cuena para escribir y ablar etc. y no puedo ablar necesito ayuda", "Hello clubpenguin I want too tell you something thank you for everything you have done in this game.thank you so... Much that is the best game.", "New penguin model in pc #projectsupersecret", "How much is a membership for a year? Like, do I get a discount if I've had an account for a couple of years now? Also, are there wider selections in terms of colours for the puffles? Thank you all", "wow la fiesta 3D de clubpenguin sera en Agosto???                                   disen que sera esta la ultima fiesta", "so eu acho que o herbert tinha q parar de agir igual um troxa?", "lo unico que tiene de malo club penguin es que cuando no tenes membresia las cosas que te habias comprado de membresia no las podes usar por eso es mejor mundo gaturro", "I can't adopt the green alien puffle !!!!  Why???!!!!", "i can not answer you because it also happens to me if you speak soubese", "club penguin tendran otro viaje al futuro es que me gusto esa fiesta", "i love the game be my friend on yessenia2007 please", "agan una fiesta de zootopia y que canta gazelle", "Deberian darse unas vacaciones y hacer una mezcla de fiestas pero con nuevos articulos, gracias por la atencion, mi consejo es que si hacen una fiesta mucical que sea de noche , que contenga edificios y que se pueda percibir musica por doquier y pistas de baile fuera de los lugares y un concierto de R5, the Vamps, y otras bandas en el iceberg como funcion especial y para socios seria un Meet & Great en un backstage para conocer a los cantantes pinguinos.", "Don't close \nClub penguin \nIn comeputer please !!", "Voces sabem cono acha o puffle dourado", "Hola por FA vor decirme donde puedo comprar cartas de card jhitsu", "I think non-members should have a day just for them and win awesome prizes ,I am a member but I still think that non-members should be treated with a little more respect .I see every time i go somewhere in club penguin non-members getting turned down by members because they think they are better than them.Also members saying they are throwing a party,fashion show ,or contest only for members or they will be kicked out,ignored,or reported .So who is with me on making a non-member day on club penguin", "Eu Sou O Puffle Dourado Com Mistura Do Branco , Com Uma Pitada Do Puffle Gato . :3", "The party is awsome and Dot is awsome too!", "It looks really cool but please don't make it mobile only!!!!! The game is based around kids and not many of them have phones! ;(", "Hey guys I think we should do a game on who will win animal jam or club penguin", "Alguem sabe aonde compra o puffle de gelo (um puffle q parece um boneco de neve)?", "Club Penguin kinda died out when the first sponsored party came. (besides operation blackout and some others) but there's a rumor that there will be no more? Hopefully that's true and we can have fun original parties that aren't insanely complicated and crazy where we can hang out! :D", "como me puedo hacer socia porfavor ayuda", "Rachel Chin dude legit gave me nightmares", "Yeah welcome to club penguin jan\nJa se english es igual a jeje", "Cheers 2 all the true ninja penguins out there, we rock!!! ;)", "I missed getting the orange tabby puffle costume :( :( for the next puffle party will you still have it? Hope you do :(", "mi infancia de club penguin y aun lo es es el jeugo que juge club penguin", "*****PLEASE SHARE*****\nCLUB PENGUIN (DISNEY)\nI had purchased a membership which I showed proof of and did not receive that membership. I called Club Penguin support and was told that there was a glitch on their end and that I would be receiving the membership which I paid for. 3 days later I received an email stating that I would not be receiving the membership due to problems on their end. I did not get a response to my email back to them so I called. I was on the phone for 40 mins before I was transferred to the Supervisor \"Amber\". I asked to speak with the person above her and she hung up on me. I called back and was hung up on by \"Serie\". I called again and was hung up on by \"Katrina\". I called again and was hung up on by \"Amber\" who said I wasn't allowed to speak with her manager. I never received my membership and was completely scammed. *****PLEASE PASS THIS ALONG SO THAT IT DOESN'T HAPPEN TO ANYONE ELSE*****", "A love me result is excelent and fain no sou", "yo club penguin is this a sign? im epfs head detective and i know you guys so if theres something up here ill be the first to know. also you have many glitches today on 6/24/15 please fix them.", "Hello, everyone just wanted when it is, will get a surprise of Club Penguin ? Oh, I forgot one thing, I Know speaks english", "Yay!!! Can't wait for August! :D", "Para mis 3 perros Pretty, Krispy e Hito", "Club penguin my best game ever", "i have a membership code BUT IT DOES NOT WORK NO MATTER HOW HARD I TRY", "Theres a bug with mission 3 it wont let me enter the vault even when i enter the right code in :( its really bugging me", "Why is there nothing in the Halloween party for non-members to collect when they find the sweets?", "ogan no me an emviado mi codigo para ctivarlo  que ago", "club penguin meus pais compraram a assinatura e faz uma semana que nao chega vcs tem como dar uma pra mim", "y que paso con el otro culb piingue lo del sunami", "Did you get the coincidence from the incredible's", "this is why you don't decorate your tree with pet food when you have a pet", "Hello , I have a doubt, if I buy an activation card 6 months I get time on email?", "Just going to call that this is a remodel of the docks", "Umad Brohoho Lach Jolliffe lets do raids on this again! Just like old times!", "Is Jay the red one,Carlos the white one, Evie the blue and Mal the one with purple hair?", "Everyone with #pinkshirtday \"kindness is one size fits all\" stop bullying, you have the word, now.", "today is my birthday three years of club penguin", "I'm a huge fan of puffles I have 15 and more is wild puffles.", "Who do u get the link It isent comeing on my Facebook to even do with club penguin", "Like si quisieras ser socio :( :'(", "It's actually nice that you remember stuff like this. I would think u wouldn't jerks.", "Does it look like I can play to u", "Club Penguin It would be a good idea to make an event / party Pokemon Go!", "I don't play this game anymore but what happened to Gary dear lord someone explain", "si cool y quien diga algo malo de club penguin es un tonto", "Club penguin Hello, I am disappointed that at this moment the \"biggest fashion cp\" is only for members ..", "quiero hacer una pregunta mi hija a entrado en el juego y dice que tiene que ser socia para hacer todo me pueden ayudar ami y ami hija para que eya juegue y que se divierta", "But I hate member ship why must to have member ship also any wan tell me ples", "hello club penguin the trip could last for atleast prehistory wing uns 10 days thank you for your attention :)", "tengo una duda, por que cuando el pinguinito de mi hijo me quiere enviar el correo de activacion no me llega??? que puedo hacer? es un gran problema por que si se juntan los 7 dias mi hijo perdera a su pinguinito!", "ola me desactivaron mi cuenta por favor  me la pueden activar otra vez", "why does the groundhog puffle look like a cat?", "I love club penguin and i have my own nintendo 2ds", "Is the old CP going away?", "The prehistoric party in the application is VERY BAD , we can not turn us into dinosaurs, the hunt for fragments equals the 2014 home , just stay finding the fragments of the island , has few furnished places, it is very unfair that, I'll end up stopping to play CP ! It is better CP team to improve !", "All of the spam autotyping bots on Blizzard right now... totally obscuring the room!", "Whos your friend who likes to play?", "I haven't opened my accout for 2 years now. Is it still available?", "I have a membership for 7 days only and I bought a raccoon puffle. It says only for members.\nIn six days I will not be a member please make my raccoon stay and i can play with it", "I can't log on to Club Penguin", "hey club penguin why cant active my clubpenguin", "me en canta todo de club penguin", "Hi, I mean I need help .. I created a penguin came to me and no email. Help me anywhere? Well thank you :(", "I've been waiting for a number four", "Why did the chicken cross the road? To get to the idiot's house.\nKnock knock.\nWho's there?\nThe chicken.", "I rember her! I have all the DS games", "Hello happy day to all ninjas club penguin", "i  love  club  penguin!!", "Happy Ninja day for all <3", "Hi there, I was just curious about something. Were any of the original Club Penguin creators involved with the Wii game, Club Penguin: Game Day??? Like who's the staff behind this game? Who designed it? We're Merrifield, Priebe, or Krysko involved in any way?", "Me gusta los pufles tengo 26", "Why on my country is not available on the phone the club penguin????", "It can not be that no longer selling club penguin cards that are already valid in tas stores no longer sell the", "meu sonho de festa aconteceu e eu aqui, sem assinatura :(", "voces club penguin disseram que iam enviar messager e ainda nao enviarao", "why i cant open club penguin?", "I adopted all the puffle and transform into puffles by being a member", "I wish that the prices didn't raise to 40.00 every 6 months.  That is crazy.  When you pay that price you cannot use the items once you cancel.  You loose everything unless you renew at the higher rate!!!", "sad story short: i don't have one", "Club Penguin VCS PODIAM POR FAVOR REPETIR A FESTA DO FROSEM", "Whoa dot has new Style and an herbert?!?", "So ignore button isn't working... overwhelmed with these armies and can't ignore.", "Chris :)  I don't see Gord though.....", "Where is the EPF missions? From the tube transfer", "mal-igna because is the most bad of them all and i like so much the color purple", "I do not really like club penguin because only members can buy everything", "Por fabor podrian  hacer como el de elsa, pero mejor  uno de five a nigs at fredis", "Can you guys add the bat puffle, almost everyone knows bout them because there are statues everywhere, seeing them at the end of this Halloween party would be nice enough, so why dont you guys just add them to the game already, because I'm dieing for 1 of them", "O puffle brando fico muito fofo !", "Looks like a new place or a remodelation", "me gusta el juego club pingue yo lo tengo", "YAAAAAAAAY!!! finally another new club penguins movie!", "Edgar si no tuviste como amigo a Gary no eras jugador del 2010 :v", "Hi Club Penguin, me and my friend were playing Club Penguin today, but when I was playing, I tried to open the friend button. It didn't work. Yesterday was the same. But on 7:39, it worked. Can you please fix this glitch?", "Club Penguin is the BEST GAME :D", "wow I bought all thanks: D though not alas alfin partner that I could buy a hair baby", "I have just cancelled my daughter's membership. She is repeatedly unable to login. I too have tried and failed. The only time I have been successful in the last few days is around midnight (when I presume traffic to the site is quieter) Unfortunately so is my daughter.. she is asleep. I refuse to continue to pay for a game she is unable to use.", "dj decen tia jeje buen efecto", "como mi hijo puede ser socio en club penguin", "I preferred her old design ):", "eu amo esse jogo pena que eu nao posso meu tablet nao pode jogar que nao e igual o joga mesmo assim eu amo ele ele ta no primeiro lugar de jogos <3 <3 <3", "Carla look at this terrifying monkey penguin hybrid", "Elsa and Anna are great sisters.", "soy bugui porque era socio y no lo soy ahora dignme soy bugui j30052006", "Hola Disculpa igual Tengo el mismo problema ya me contacte al sitio y tuve que mandar un correo y nada me responde, mi sobrino esta desesperado!! ya que compre una de 3 meses por favor, Pin no es valido el dia 01/02/2016 la compre y todo el dia lo e intentado para activarla y nada Club Penguin", "LLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLLlLLLLLLLLLLLLLLLLLLLLL\n LLLLL\n *Acum uita-te dupa Q si dorinta ti se va implini:\n ... ... ... ...\n\n OOOOOOOOOOOOOOOOOOOQOOOOOOOOOOOOOOOOOOOOOOOOO\n O.. .OOOOOOOO\n *Acum e foarte greu,gaseste N:\n MMMMMMMMMMMMMMMMMMMMMMMMMNMM\n *Acum gaseste greseala:\n ... ... ABCDEFGHIJKLNMOPQRSTUVWQYZ\n *Spune ceea ce-ti doresti dupa numaratoarea inversa:\n 10 9 8 7 6 5 4 3 2 1 Acum inchide-ti ochii si pune-ti o dorinta! ;*;*;*;*;*;*\n Acum pune acest mesaj in 9 comentarii si dorinta ti se va implini!\n GRABESTE-te! Ai 20de minute!!!!!\n Sau rezultatul va fi chiar opusu.", "Club Penguin is going downhill ever since 2014...", "happy birthday tra-la-lala; happy birthday tra-la-la-la-la-la", "Oops I did it again song", "Festa medieval do futuro :v imagina que louco", "i know that singer Mileo used to play this game :D", "I'm happy and fun all of day with my puffle pink, we are listening to music of cadence ft penguin band and later reading news at arctic's office I am like ninja or superheroe with my shirt pink in this day. I love club penguin", "la fiesta es ya assta el 5 de agosto", "pero yo estoy en facebook y dice que no esta tampoco ativada la cuenta de club penguin", "Support no bulling and breast cancer awareness!", "My favorite puffle is the pink puffle :DDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD", "club penguin e orrivel tudo e pago", "Eu consegui encontrar ele hoje !", "What if they have a ninjago themed party on Club Penguin? That would be a very interesting visitor for sensei.", "I played club penguin for 1 year and it's a wonderful virtual world with penguins and they all live in the same neiborhood and lots of stuff. Seriously  who dose not  like a party every month!!!", "justicia debe aver un catalogo para todos y otro para socios", "I have a problem- when I go to adopt an alien puffle, it says I reached my limit even if I release some puffles, I'm not a member, that might have to do with it, but I didn't reach the limit. Please help!!", "hi how do you post fan art on club penguin tell me please", "I can't get on the game. Why?", "Club Penguin sounds like an epic place to work.", "club penguin yo envie una membresia y no me la mandan era de 7 dias y todavia no me la mandan :(", "es genial donar juguetes para lo que lo necesitan es muy generoso feliz navidad club penguin", "Hello Club Penguin, wanted to make a call, will you could release at least one item from each as item for the head to the body, fins, subscribers to non-subscribers. We need this. Thank you", "Since when she is pink ?", "Check my help ticket i need heeeeeeelp with my account", "club penguin'm from Brazil and I heard some penguins talking obr the dojo of the shadows it exists or existed? There could tell me where it is? or if there could please put the dojo of new shadows? and I was curious to see videos about this place?", "It would be cool if it was Cp themed :D", "I really hope there is a medieval party this year! I miss thoes!", "Ugh todabia sigo teniendo las publicaciones de este juego :'v Todabia lo recuerdo ;_;", "Happy anniversary to the best online game ever ;3", "club penguin fazem uma festa do TOTAL DRAMA PRESENTS THE  RIDONCULOUS RACE  onde os pinguins podiam visitar o mundo inteiro igual o desenho : )", "Love it and miss you all!!!", "como hago para activar mi cuenta no me han colocado el codigo", "hello Ep you have a incredible parties", "I LOVE CLUB Club Penguin :* :) :D :)", "Es muy genial porque me ise ninja de hielo", "someone buy my clun penguin account has 50 k coins", "Como se activa la cuenta por fiss :(", "yo quiero uno de ellos puffles no soy socio pero quiero uno", "i guit club penguin because they don,t knoy my gmail", "I can do qiero a membership and no longer sells can do", "Its ok! As long as Club Penguin stays running ill be happy :)", "Hello CP there is a glitch that occurred to me when the music is different instead of Halloween music its the frozen party music and another one is that if i teleport to become a monster my penguin disappears kind regards Tom", "please get rid of the auto-typing spammers. Ignoring the penguins doesn't work, it doesn't get rid of the auto-typing, just the penguin.", "club penguin asqueroso prefiero geometry dash", "Patrick did you pass the safety quiz?", "Tony Calderon Paola Alvarado Brandon Zubia Monte Garcia Victor Monterroza Alfredo Arredondo Brian Juarez Terrance Johnson Karely Annette Macias Helen Vega Anaisa Garcia", "club penguin is the best game!", "please I want to  delete my cat in the game but how? please help me", "compre una tajeta club penguin y  al momento de canjearla me dice que el pin es invalido no se que hacer mis hijos estan desesperados por seguir en club penguin", "I love this game <3 :3", "Club Penguin why can not I add more friends? I think my list is still not crowded I have only 507 friends", "I get one name is UFO, the best party ever!  :D", "I WANT TO PUT A HAT ON MY PUFFLE!!!!!", "Vanessa S. Payne il y a plein d'animaux maintenant :D", "club penguin please can you have a party of disney chanel series call talent", "Happy Halloween MUAJAJA club penguin is very very awesome!", "Don't spoil the party, give us more functionable items, not fancy items. More quality items for the non-members, this game needs more penguins online.", "Elisha Carmen omg guys the time has come", "love a cheeky hot choc at the pizza parlour! keen bubblez? Katie Blackburne", "woah more info at 3D penguin coming in March?", "My favorite pets is parrots and birds and puppies and dogs", "Oi Galera do CP, Sou Brasileiro mas n to gostando da festa, pelo amor d deus e mt chato.", "I feel sorry for the Penguins who used to be rare", "Happy #Lefthandersday \nWish I was left handed", "SO much spam on Blizzard right now you can't even see the background.", "jajaja intensa mente en club penguin yo no estuve en ella fiesta", "hola club penguin, nose que pasa pero no me sale la barrita de conversacion y ya active mi cuenta", "socios: 42 puffles\nNo socios: 2 pufles", "Hello! We are new subscribers to Club Penguin. My son really enjoys the site, however it seems extremely glitchy. We have to often refresh, the login page doesn't load, games do not open. Is this normal for your site? I definitely have higher expectations for a subscription site. I would appreciate feedback! Thanks!", "i know a lot of people do not like club penguin because these people make a mistake in thier lives", "Yo tengo club penguin y lo voy a terer 100pre", "Wuau no sabia q ese oso era vegetariano  jajsjsj", "All the new party events now are not good anymore that's why I stopped playing I once was a 1 year member then the parties were getting boring so I canceled my membership and didn't play anymore I like the old club penguin it was fun now it's boring", "me paso algo muy malo  le agrege una menbresia a mi pinguino hoy y compre muchas cosas  y cerre secion y cuando la volvi a abrir  ya no tenia nada solo los puffles por fabor ayudenme", "goodnight I apologize sincerely want to have a membership in Bolivia live so I do not know where to find a card payment or Asher hope your answer thanks .....", "As can Aser the game move me because the application is not so", "Why cant you people bring old club penguin back it was way better.", "no se como crearme una cuenta de club penguien como hago", "I love Disney and their games. I want to play with the beta, please :(", "Club penguin when you will put back the store? thank you", "Jajaa ok very monky is very happy", "Me sorprende que hay personas que crean (o quieran creer) en conjuros de amor o como les llamen actualmente , y a mi me digan infantil , jeje bueno , total , cada quien con su manera de ver las cosas", "Pena qu nao sou assinante :l", "I like it, it looks really cool!", "Skunk is me favorite pet! It's desacked and named Flower. Let's see who can get the reference", "club penguin e o jogo fantastico de sempre", "Y can't u give Elsa a balloon? because she'll let it go!", "me ajudem eu comprei uma assinatura e nao esta aparecendo no meu perfil    me ajudem pfv", "PFV Club Penguin unblock some things because I have not signed PFV", "Everyone is confused about why people on club penguin are getting abducted by aliens and some are asking how to get a tin foil hat,so I am asking why is it not for everyone", "I need the android app but cant find it on the appstore", "I'm trying to cancel membership and it's effectively impossible. When I try to cancel through the parent page it sends me to Apple iTunes, however the subscription is not showing in iTunes.", "club penguin quiero activar mi cuenta y nunuca me llego el correo", "Every server is filled with club penguin army recruiting autotyping.. it is impossible to even see other penguins through their speech bubbles. horrible", "tambem eu mas so que ele perdeu a memoria", "Why is all for membership?? :)", "Move along Flop Penguin, AJ is here to ruin you!", "eu amei  a musica e a festa do club penguin de dez anos", "I sometimes miss those old missions you can't play anymore", "Esta es mi carta de jugador", "ola club penguin te admiro me puedes dar una membresia", "Club Penguin it's cool, my game favorite", "Sorry for the inconvenience but when I opened a new account penguin store and I gave mine a bone between the original is erased my friends and nose to do hope you can help me or say how to solve Thank you hope your answer Club Penguin", "por favor podes poner cosas que no se agan con membresia en club penguin", "I remember meeting her, it was nice, I've always liked Dot, always been so witty. I'll miss the old look.", "why does cludb penguin keep charges me and in not activated??? please stop charging me", "What club did the penguin go to? Club penguin!!!!", "I have a statement! Me and some of my friends and family play Club Penguin, and most of us have been paid members, but can't afford it anymore. Now we can't use the stuff we could have as a paid member. I know paid members are very helpful when it comes to money, but if we have been paying that, and can't anymore, why can't we have our stuff back?\n\nAlso! I have an idea for he game! We can send post cards to our friends, but it would also be cool if we could send gifts to each other! Even members to non-members. Like, stuff they aren't using of course. Just an idea! Anyway, please let us former paid members get our stuff back! Thanks!", "Thanks...My draws are new video of fan art Club penguin... choose 3 pictures of me. The best video of everyone, really.", "me gustaria descargarlo pero pesa arto", "escuchen todos herbet acaba de aparecer en pinguinera auxilio", "I love club penguin but I wish they have DJ cadence clothes and also I want teen beach 2 in cp  and the cp app", "Hey club penguin! I just want to tell you my laptop is broken and i can't play club penguin now :'( cries i will get new laptop i can't wait :'(", "club peguin por tu culpa perdi a mi mejor amigo mi puffle jr si yo siempre activaba mi cuenta", "Club Penguin porfvor onde posso assistir o  filme do hellowee", "MY BABY CLUB PENGUIN IS ALL GROWN UP", "Omg club Penguin that penguin tho :D", "Please have the orange tabby puffle costume return!!!!!!!!", "Had to cancel membership to update credit card details.  Lost the 12 month pre-pay membership rate as a consequence.  All with no warning/info on web.  Nice customer service Disney.", "Hpla Club penguin, quiero ser socio como hago??", "alguien sabe como se activa la cuenta", "El puffle verde alien es para no socios?", "OH! I loved hotel of the living sled when it came out! Another great addition to \"Night of the Living Sled!\"", "I need the chat,I just joined club penguin and it doesnt have chat?", "i have this puffle cat his name is chedda #ilovechedda", "copia barata de meet the- en team fortress 2", "realising the ignore function STILL DOESN'T WORK. Please respond!", "clu penguin quisiera ser socio ya que llevo 1074 dias en el juego porfa se los agradeceria", "que todo el mundo pueda ser socio gratis porfi!! :( en serio o que por lo menos la ropa y las cosas sean para todos!", "The Eel and Eagle fell in love. But they cannot marry each other. Why? because it's EelEagle!", "i miss the old EPF missions\ni never did complete the last one.how did it end??", "my bro seems to get lagged on club penguin he cant walk or use actions towards his puffle", "My sister is my best friend.", "It's National Ice Cream Day not emoji", "When I go to log on it says to come back that you're updating things behind the scenes? When will the site be up and running again?", "It's a trap to Hypnotize everyone isn't it?", "que capa maneira com ninja e com outras coisas, realmente gostei muito desta capa", "Awesome! Also Club penguin. When is the Frozen party?", "Feliz dia da amizade club penguin !", "Everyone is right, This party is boring. But i can live with it. :l", "Look like Worms 3D Game map! :)", "Greg Tonks now we can go mobile", "could you tell me how to delete the alien puffle please", "great job guys i wish i can go to that park CP ROCKS!", "oye club penguin soy socio por 2 da ves!!!!!!!!!!!!!! gallogabi  volvio!!!!!!!!!!!!!", "If you go onto Iceberg right now you can't even see the screen because of all of the Club Penguin Army recruiting spam...", "club pinguim o passageiro clandestino muito legal o livro..", "thanks for bringing it back (:", "I quit club penguin because of the mobile version", "saben crei que club penguin iva dar un iglu grande de navidad pero no tambien es para socios son los peores", "That was the best party ever.", "The music in the games such as hydro hopper, pizza tron, surfing, fishing, etc has stopped playing. This is very frustrating! I've tried everything to fix it! Help!", "com vc me falando isso, a segunda deixa de ser feliz.", "no recibo el correo de la activacion que peudo hacer quien sepa comente", "Belem Takeda ahora sabes por que bebi cafe ayer", "como consigo el club penguin alien", "me pregunto cuando habra noticias de herbert", "club penguin deixe eu ser  um famoso do club peguin por favor?", "Can we find Dot in the party???", "Wish I could have a cat on CP :)", "Pongan a five night at Freddy\"s", "pls fix, the game don't play Club Penguin in my phone (Oppo f1) :(", "We want old times in Club Penguin now is it boring...", "AHHH MY MEMBERSHIP IS GONE WHEN I HAD LIKE 2 MONTHS LEFT JUST YESTERDAY WAAAAAAHHHHHHH", "I love this game but most of items needs membership", "I don't have a cat! I could bring my cat puffle!!! :D", "Why do not made more mebership cards in all the world again?", "Guys i have a windows computer its windows 7 and it freezes when i come on CP. so i cant come on btw and its my moms windows computer...So i guess this a goodbye to club penguin", "lo   mejor  del  mundo  es  club penguin", "This is me when I find cookies XD", "How do I adopt a pet rock today? I can't find one!", "e huuuuuum amo club penguin e tinho pin achem eu Spokinha responda eu club penguin", "How do I get membership without pay? :(", "Club Penguin, help me, I forgot my password the first penguin I had, 2013 or 2014, I liked him, and was never subscriber, but the important thing is not to have signed, it is to have my penguin back, :'(", "hi how can i activated my penguin account for 7 days?", "Club penguin be only phone game?", "How many people play Club Penguin?", "hello as I activate my account? because often ami send email to activate it and I could not do because I do not get anything. could explain to me how is please?", "Feliz Ano Novo Club Penguin !", "Please I need to know how I can get the membresy because we are intented from Ecuador since one week and until now it is imposible to get it ? Thanks", "I want to lavender in club penguin!", "i cant adopt my green puffle...it says i have maximum numer of puffles...b'cuze of that i had t sell some of my beloved puffles...but i still cant adopt those green puffles...pls help me!", "me quiero ser sosio gratis pero no puedo mefacina club penguin", "Can You Add More Rare Items To Clothing Catalog ?", "Q : what animal should never play cards ? A: A cheetah XD", "i love the video  Happy Aniversario Club Penguin", "Club Penguin Hi Cp you should create a mini game where penguins race against each other in gym P.E. climbing rope till they reach the bell. You could put the mini game in the school. I have lot's of idea's for mini games I started playing club penguin in 2007. I recently brought a membership for my old old old penguin :) I'm eighteen and looking for a job that involves creativity and imagination. Since you gave me that as a kid I would love to work with you and give back to the new generation.", "como puedo ser socia gratis ayuda porfavor", "hola porfis no se como tener amigos ayudamen", "Hi, I used to love club penguin when I was about 8 years old, now I grew up but I'm bored and I want to play a little bit again, also because why not? I still remembering my password and my username but I just wanna know if the penguins gets erased or something like that when they have so much time unactive. Thanks.", "The kicker is that the game'll actually go back to being good. LOL. #clubpenguinalumni", "megusto mucho el pinguino se mira tierno adios", "Thanks for all but you can come back the old penguin skin"]