[".besa tu mano (izquierda)\n2:di el nombre de tu amor\n3:siera tu mano\n4:di el nombre de un dia de la semana\n5:di tu nombre\n6:abre tu mano\n7:pega esto en 15 comentarios yes el dia dijiste te va a decir que le gustas y te ba a pedir que sean novios.si rechasas esto te a ir muy ma|", "q te ases orrible sos mas eo q comer caca pendejo pelotudo pareses gay puto asete hombre gil de mierda", "i really l0ve ur s0ng titled sorry.i really2 love u justine bieber.take go0d care urself.", "you are just joking with your heart", "i enjoyed the movie so much i am going to buy it when it comes out to the stores i love you justin.", "dpzzur Well, I posted earlier in this comments thread and came back because I wanted you all to know how I did! I lost 10 lbs (4.5 kg/0.7 stone) of belly fat in only 6 days and am keeping it off. The results speak for themselves. This diet product is life-changing - thank you. clbbly www.theeightiethi.info", "happy bday justin i wish more birthay to comes", "O.M.G er ist einfach so HOT...!!!", "I LOVE YOU SO MUCH!!!!!!!!!!! i have been there for you sense day one and what you did in your past, I have ALWAYS had faith for you", "I love you <3  :*", "you is saxy saxy  saxeeeeeee. baby justin", "OMGGG IN WELCHE KINOS KOMMT ER ALLES ? :D", "o creo que en un video bi a esas chicas y claro a justin bieber", "Me gustas como cantas y eres mega guapeton sigue cantando sin que nada te detenga como todos los cantantes.:-)", "Ich geh am sonntag mit meinen 2 Freundinen rein.\nIch bin total aufgeregt. Der Film wird bestimmt der HAMMER!!!!", "y Love Justin Bieber Merry Christmas I love you te quiero mucho=) =) =) =).....", "Infact I really wish I can get to meet you and personally congratulate u, u give me joy when ever I hear ur voice,  u are my inspiration, I really wish u can help me to put up my own music. Be blessed.", "https://www.facebook.com/Banamex?sk=app_566703996722072&app_data=eyJmYW5QYWdlVXJsIjoiXC9cL2ZhY2Vib29rLmNvbVwvcGFnZXNcLy1cLzE4OTM1MzU5Nzc1MTc0MT9zaz1hcHBfNTY2NzAzOTk2NzIyMDcyIiwic2VjdGlvbiI6IkVudHJ5IiwiZmJfcGFnZV9pZCI6IjE4OTM1MzU5Nzc1MTc0MSIsInByaWQiOiIzNGYyZjEzOWVkNmVjMTRjNTgxYTgwNTA4NWNlZmY0YyIsImVpZCI6ImM5NjYxZWRhZTUzNTdkMTc1M2ZlMWUxMDY3YmU4MDdjIiwib3BlbmVyIjoiaG9tZSIsImRhdGUiOiIyMDEzMDkxMjIwIn0%3D     vota por mi hermana porfis!", "i really love your song! i love you justin<3<3<3", "I love justin,and selena more perfect:-P:-P:-P", "I love justin <3<3<3<3<3<3<3<3 hes sooooooo nice!!!", "ik haat justin bieber One Direction is veel leuker", "name justin join mix ok pleas 1", "Hey guys. I found this awesome shop on etsy. Guy is selling purpose tour sweatshirts. He also makes custom made. HE is a very nice guy just wanted to spread the word of him as a thanks to him. That is the link to his shop. https://www.etsy.com/listing/280388614/purpose-tour-v-files", "u know jb i will be just like u one day.", "your the fittest boy on earth <3 <3 <3 <3 <3 <3 <3 <3 <3 <3", "justin bieber ilove selena gomez but you breaks selena gomez she was crying in the youtube video", "Don't worry justin you don't hav to say somtin I already did,it ticles to da universe justin u must know dats y I lust fr myself.n I enjoyed it so much,....", "HE IS FUCKING RIDICOLOUS.\nI heard he is starting to do metal,bitch please he is just a stupid kid.\ntill yesterday he was singing song with no fucking meaning.", "junstin vc e tudo vem me ver akie no brasil", "Justin you are the best <3 ly <3", "Hello dear justin! Your song is i like that they are song....never say never and mistletoe and i never let u go and as long as u lve me. So All is all, wholy i like of your song.", "How are you justin i'm brother you", "Love this song and acoustic is the bestt", "stas bn papacito miamor si ke me vueves loca", "justin i love you so much...........nd love your all song", "I love you Justin Bieber hope you live up the hundred twenty at least be careful and be alright if you needed to add some more guards to protect you love you from the wolf", "WIR SIND DABEI Jasmin <3 <3 <3 <3", "qqqq     <3  =9", "i lv u n i lyk u", "Welcome to the Justin Bieber Official Store! Shop Justin Bieber merchandise (t-shirts, clothing)\nGet it Here : https://www.sunfrog.com/ebayhivi/JustinBieber", "https://www.facebook.com/pages/Bieber-My-life/1418336508400492?ref=hl quem amo o justin vai curti por ele", "Justin bieber I love you so much if you reply that will make my day love", "South africans cant understand this fucken lageuge", "You're beautiful I love you, you have a huge talent your loyal fan <3", "can you soing in my sterthe  birthday is on marhe 20 pat thay or going caslit  and it is going salirt it  may  10 is going be at my house the adresse is 123butter frame", "ich will au ich kan aber nicht ;(", "YES YOU THE BEST AND DE SWEETS!!!!!!!!<3 <3 <3", "hi. idol jb i did you know. i always listening of all your songs coz its so very amazing   i. sm always inspured idol thank you so much....... I thumbs up for you .. lavyah", "This is so sweet and precious! I love you Justin!", "aguuanta erii sos mala eeh jjajaja", "hey justin i wnt u to knw tht ol ur songs are driving me crazy i lyk diz song down to earth wow its amazing oh nd diz one where are you now i jst wnt you to knw tht i rily rily lav u chao.", "I love you so much better Justin bieber", "Our idol may again fall into a depression. Do not let it! In our country , Poland . It is the action of the cinematics and photos with hasztagiem : \" It is most popular with us . I am writing to you sister .. help us . To all the world and saw it ON ! Let's Beliebers ! I believe in you !", "May foyborit song never say never", "this video is in my tv", "Justin Bieber I do not know what people think of you but I think you're king of the music that God sent the head to please all people of the world be blessed kings of American music", "U look cool..and cute u too weekend", "you're da best love you my idol :))) <3", "Babe's your very good looking Justin bieber xxxxxxx", "hello justin,ur so nice kid,i love you so much,ur songs are amazing,ur voice is cool,am addicted to you:-purpose*makes m wow--as:-mistletle is cool--forever BELIEBER!!!!!!!!!", "omg he is so cuteeeee i love him", "justin i like you song came to yourself and the shout be me. i am here to remember a person who is always you wit", "Ahhhh I <3 LOVE YOU JUSTIN BIEBER <3", "i love  love you Justin Bieber <3 <3", "<< like if you like selena gomez! <3", "que lindo con esos lentes vale", "When can u come to California can u come for December did you know my birthday was December 10 now I'm  11 !!!! I love you so much Justin", "Und kuke justin bieber never say never cool geher....?", "My Best singer i want To see your brother jaxon is my destiny and you justin", "Justin u r my best singer nd take a gud care of ur self.....(im missin nothin but ur performance......:-*)hav a hapi hapi new year....", ",ilove U Justen ,you Are So Very G0wap0,its Mnz Hnnds0me,,mahal Kita,,i.Am Your Fun Fr0m Tha Pilpins,", "When you nod ur head yes...but u wanna say no..what do u mean....justin i kne all ur songs...call me let me join u nd sing@09030074224", "Hi justine you know what since you started to sing and your first album is Baby that time im started to admire you and your s0ngs , and i can say that your my idol now and forever,,i love u justin my idol and please make new s0ngs ,,take care mwah,,:)", "Hi How are u, u will be my best friend", "l love you jestine bebir ........in future came to india .when I grown up I will came USA to meet you ......I wish to meet you", "nice meryy christmas cool <3 i Love you too justin biber", "i love you justin bieber forever!!!", "i wanz also!! <3 <3 <3", "Why is he treating seen a gomez the way he has. They had a relationship that didn't work out. why continue acting like a prat. He cheated she according to him cheated no prove there. Just leave eachother alone.", "LIKE THIS PAGE IF U ARE A TRUE BELIEBER  https://www.facebook.com/justinbieberdanskebeliebers", "it is serena and gabriell we only heard your music once or twice", "Your hair is great...but it looks like you may need a little more sleep? take care of yourself Justin.  I can't imagine the pressure you are under at times...so take care of you:)", "I love you justin Bieber es o meu edelo", "Hai.idol Justin bieber:) Gud evning .what are u doeng now??", "Por favor no te retires!!!\nY si lo haces que no sea por mucho tiempo.\nTe amamos Justin y nunca dejaremos de hacerlo :)", "soo cute ! aw i <3 it !      <3 <3 <3 <3 <3 <3", "Hey I hope you answer me I am your biggest fan ever", "i wish i cold meet you", "so haaaammmmmaaa ich liebe ihn einfach.. <3 <3 <3", "https://www.facebook.com/pages/B-E-L-I-E-B-E-R-S/572015046142920  Pridruzite nam se ! Nova smo stranica <3", "I LOVE YOU justin bieber i like your music n what do you mean", "JB BIG UP  Men aim LIL-G from malawi iwish next time u will come in malawi i all ways listen to your music end inever stop that think u,,,,,,,, captain be with u", "Not being horrible but I liked the old Justin Bieber not the now Justin Bieber bur good music man if you need an great beat boxer I'm in England Plymouth Brixton yampton 25 yeo park man keep it up just", "Wauuuu..  M encanta i love you", "i print -shirt name justin bieber ok", "Ich aber ich kann das film auf den internet nicht finden weist du wo man das ganze film kriegt??", "Hi to the way too and the last year I don't get a good news about my resume for this communication including attachments from T-Mobile from my mom  pattie. Mallette. I love you can  I have  get  together again soon", "Alogaaa and pick aloja te amo", "I want too move your house Jeremy Bieber and clean my little brother Justin Bieber room", "hello justin bieber i mean if you wanna be my best friend because I am your fans that do want to be like you and congratulate you on your profession", "HI ALSO I LIKE YOU ARE A FAN OF JUSTIN BIEBER\nYOU CAN MAKE A LIKE THIS PAGE PLEASE https://www.facebook.com/pages/Justin-Bieber-FANS/1420563711511291", "I love u so much justin bieber", "You tube Justin bieber what do you mean", "JUSTIN BIEBER I LVE YOU 4  - EVER", "https://www.tripleclicks.com/17294910/detail?item=526719 Smartwatch Bluetooth Smart Watch U80 for iPhone IOS Android Windows Phone Wear Clock Wearable Device", "Im sorry guys but i know this is fake but i always stick to the safe side i know im weird.. If you stop reading this you're gonna die, My name is teresa fidalgo if you don't post this on 20 photos I will sleep with you forever.. This girl ignored and 29 days later her mom died. I am real you can search up on google", "Breaking News:\n\nDriving under the influence over the speed limit and have been smoking weed all day, along with drugs in the blood and suspended driver license. Justin Bieber was released hours after being arrested by police in Miami FL.\n\nThis is a symbol of Corruption and Discrimination to the most vulnerable(poor) immigrants. Has been anyone else, right now he or she was awaiting sentencing by a judge and then a process of deportation.", "http://www.facebook.com/pages/Svi-mi-koji-smo-Belieberi-i-Directioneri/193566130783874\nPlizz like! Molim vas nemojte me banovati nego samo izbrisite kom, jer ste i vi ovako prikupljali fanove. Hvala onima koji lajkuju:)", "Osea aloja es tu family nunc te abandona y and pick te amo crreoo", "vai pra mierda...fai ferrar o canada vaiiiii", "i love u so much in my life i will never say never i love u so much in my life and in my heart", "you no quer me chama pro seu aniversario no lindo", "I love you  Justin Bieber", "i love you !!!!! <3 <3 <3 :*", "i really dont know when that day will come.", "i loove youu j.b <3 <3 <3 <3 <3 <3never say never", "que hermosoh video ss um bombon justin tiiih amu..", "justin bieber  u always rock star and also my favourite singer.can u sing ur baby song.", "happy brithday justinbieber we love you", "hola amigo soy tu  fan", "drogaditoooo justin biever sos un drogaditoooooooooooooooooooooooo   garcaaaa", "i love u justin... i will always be your fanz 4ever and eva... all your fanz in nigerian are hailing u 4your lovly songs", "waww! I love you justin bieber", "habt ihr schon den ultimativen justin?", "u look so young and cute and handsome and wonderful and strikingly amazing   i love you so much. justin bieber you are awesome...   #foreverbelieber", "hello friends, a \"vintage version\" of \"what do you mean\" performed by me. You tell me what you think? thank you\nhttps://open.spotify.com/album/5kewU7L5xub7siLLxOmDIY\n\nhttps://itunes.apple.com/it/album/what-do-you-mean-vintage-version/id1067901054?i=1067901067", "https://www.facebook.com/pages/Jhoana-Marie-E-Vineyard/278079215682821?ref=br_tf \n.\n.\nLike Herr <3 Please :)", "JUSTIN bieber I love you vor ever  du has my <3 <3 <3 <3 <3 <3 <3 <3 <3 <3 <3 <3 <3", "i love you justin bieber!!!!!!!!!!!!!!!!! ill wait for you whenever its time!!!!!!!!!!!!!!! i would die for you!!!!!!!!!!!! love rachel antz..", "hey ....man you must be really f**king those chicks n btchs around,,,,=-[]-===[=---=,,.,.,-=-,=.do';;;;your/'thing ''''man they''/'..,/reallly /.,/'[]-=need that f**k", "I'm  Portia 4 years old and I am a big fan of you....love u soooooo!much!!!!", "Nossa mim encanta i you love", "Justin I am look for you", "and im going out with him and im15", "Please make this possible. Karlee is a 9 year old from NH who has lost her fight to cancer, she has maybe a few weeks to a month left to live. Her one wish through make a wish is to meet Justin Bieber. Please send this to the appropriate people.", "JUSTIN my friends tell me just now he wanted your number phone", "Hy Belibers 1 Like For Bieber Styles  Plzz           https://www.facebook.com/pages/Bieber-Styles/156067891270682", "I love your music your smile sweetheart", "All your song is my favorite!!!!!!!\nI love justin!!!", "kein anderer junqe sieht soqar beim schwitzen qeiL aus ^^ :D:D <3 <3", "when i first saw ur name, i thought u ar a old man bt when i heard ur song \"baby\"oh!my,its very interesting including d one u sang with usher.", "I love you  Justin beiber", "i love you bieber <3 :)", "What a fat ass nigga cunt", "love it sooooooooooooooooooo much i also love Justin soooooooooooo much", "SMART PEOPLES DON'T HESITATE TO LIKE (y) OUR PAGES   https://www.facebook.com/AntiHackersGang  Anti-Hackers", "justin bieber i love u my friends tell me justin  <3 <3 <3 <3 <3 <3", "Justin i admire u alot.m from bhutan:*", "We love u justin.whtever u r & whatever u will be we,we would like u.only ur hair style is too mch 4 ur dslkrs & enmiez", "The Justin Bieber Vs Triple J Hottest 100 Mixtape\n\nhttps://jaymeefranchina.bandcamp.com/track/justin-bieber-vs-triple-j-hottest-100-mixtape-bieber4hottest100", "I love u justin. Iam your biggest fan, ac, cooler etc.., of your's and i love ur singing", "https://www.facebook.com/JBJBJB4ever ====> All believe believe believe.... <3 <3 <3", "lo amo y siempre estare kn el", "Justin  I saw your movie an I love it as much as I love u an I love u aaaallllooootttt lol", "watch online Justin Bieber: Never Say Never >>>http://www.onlinecinemahall.com/movies/view/justin-bieber-never-say-never", "lindooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo que  pene que eu naofalo em espanhou", "hi justin bieber ! you are my true idol ,,all your songs is my favorite ..im always  to be a belieber...i love you justin,, i love you idol....", "Me gusta love you yustin es mi idolo amor y paz", "please enter and out is for a draw http://codes4free.net/?ref=pm0cvwHxc", "das bild von Justin Bieber ist so Sexy echt einfach nur WOW", "I love you  Justin Bieber  so much love your songs", "so awsome and so so so so so so so so so so so so so so so so so so cute i love u in my heart love ur songs just like i love u", "hi is am how like me where justin love glendalyn yuo", "Justin your golden hair  its looks stylish and good not better than before hair style.....#bigfanpraveen", "awww.... so cute \nu are amazing\nso hot\ncool adorable\nperfect\ni miss u 2010JB\nanyway i LOVE u always till the end\ni LOVE u so much jb\ni always be your #belieber forever\nim a true belieber\ni LOVE u justin bieber\n so sweet my love!!!!!", "I hope then I'm a sun to say good morning , and I hope that l'm a moon to stay a wake watching you but l'm only a human excited to see your eyes . I love you", "This movie is so emotional <3", "U a the 1nd only singer i lyk in the world u rock my world i alwys wish we could met bt i knw 1day we will met(F)", "Aii que afortunadas las que se tomaron la foto con el!", "wow I love ure songs Justin bieber", "cool aber es kommt doch erst am 10 raus oder ??", "I love justin but people. are saying he is their idol insect of worshiping GOD ur worshiping a singer darm thumbs down i love justin so much", "i love you justin bieber allways believer", "i fucking love u justin bieber", "wow i like to watch basketball and 24 is my favorate no.", "ILOVEYOU SOOO MUCH! I LOVE EVERYTHING ABOUT YOU.", "justin bieber je super i volim ga pumooooo i ima lepe pesme", "Pues va a perder Soy De San Antonio (y)", "eu gosto muito de Justin Bieber - Never Say Never", "The kid is a fucking loser, for what he said about Prince! He is a coke head and is no role model for any kid! Parents need to coach their kids about this drug attic!!!!!!!!", "me gusta  I LOVE YOU  JUSTIN", "i love u Justin Bieber.....an i lke all ur songs", "diz song is good ....coz u r not dare......just hate u ......", "i love you so much ;)", "Some times it plays over and over in my head love the song too.", "la pelicula max buena never say never", "U are olwas our star love u soooooooo much", "You change up with hair doos. With your busy performing schedule just keep it nice and easy but you know just go with the way you are feeling. I can't imagine you looking ugly. \"Smile", "happy birthday justin..i hope you will succes in you career..:)", "i love you i love you i love you", "i love u justin bieber u rock", "hi justin my cousin love you", "sos  el    mas  lindo  qe  todos  los  chicos   de  el  mundo  .....", "Justin you will always be in my heart !! <3", "I LOVE JUSTIN BIEBER <3 <3 <3 <3", "que pena que ele mudou ele alcansou a careira de do malcom gessao", "I like your real color and gorgeous hair better Justin... but this is ok for now... You always are handsome..", "uhf que guapo te ves hay verdad", "Justrin ur looking so fantstic in this vdo sng :(", "love u so much justin Bieber bt nt morethan ma LIL WAYNE love ur songz", "my love baby soy tu beleibers", "Justin bieber never say never always", "Ammm yeah.. And i anderstood and everything. Ya know? So... See ya", "Beliver's need your help please I could win a gift for my girlfriend I hope I can help just delen like this link please if justin bieber has problems we are all human beings & make mistakes here is the link helps delen like a page & a my photo\n\nhttps://www.facebook.com/photo.php?fbid=10203165569530825&set=o.313609785414498&type=1&theater&notif_t=like", "am 11.  2. brach in london das biber feber aus. tausende fans kamen zurk", "U're the best i love u", "like my page please <3        https://www.facebook.com/pages/Justin-bieber-fans/581464735241550?hc_location=timeline", "justin drew bieber mallet 4ever  <3<3<3", "you're so cute Justin bieber ! I'm a solid n always  belieber forever ! God bless idol more blessings to come !!!..i love you justin !", "i love justin bieber song and his", "At wash ay can't see Justin am has beg fan en the world", "justin ur my idol and im ur super  i hope i meet u someday   ilove u idol..    takecare ur self!!!! ur so handsome   fantastic singer ur my veryvery idol..", "Justine,wish 2 see you in person, before i've gone in this world, even if this so impossible,, im just hoping everyday", "Armaan Joy https://www.facebook.com/pages/Stunt-club/363805786969044...\n\npyar kya??\npyar kyu hota hai???\naur saccha pyar aksar logo ko kyu nhi milta ye janne ke liye ye awesome page like kare......", "que guapo  es  justin bieber  cuado  sea  grande  sere  cantante   te  amo  vivo  en  lazaro  cardenas   michoacan  hablo Ingles", "Im Beliebers , I love you Justin..", "beautiful love you so much justin'm Brazilian I ask you just stay in n uam thing drogasten much jente who loves you like I remember the things you said never use drugs remind people that you visited in your pray clip i love you justin n decepicione their onrre fans just his voice that god gave li i love you so much justin I pray every night for you cuz u know god n ten talent and so will you deichar", "hi justin! do you know,,,\nall your song is my favorite! because it's very beautiful!\nyou are the best justin.!", "guys? I want to a Never say never song layric please", "whats with all the ugly hats,especially the trucker hat,you have nice hair ,a beautiful face,don't hide it under those ugly hats.", "I like u and I want selena gomez and u to stay together  again", "i love justin biber <3 <3 <3 <3 <3 <3 i love you :D", "i love justin bieber and im gonna be the next justin bieber here in africa,botswana", "JB eres lo masimo te amo", "hi justin..i want to say i love ur song so much and i love also the singer..", "I know you have experience in everything in your life daily to read books that her readings also visit different and beautiful places in order to be happier and you reassure your heart, but did not find Bad.o but did not read the book and did not visit the Holy Mecca. You will find happiness in them and reassure the heart even if you are very poor", "Fashion :3 https://www.facebook.com/pages/Fashion-3/216420805184769 unance esta guapetona la pagina chav@s\n\nFashion :3", "Let's hope Justin supports rescue groups saving horses in Australia, after he plans to ride in a race supporting an industry that breeds thousands of horses each year to be killed", "wua eres una estreya inalkansable sige asi", "Eres un chico hermoso kiero un beso tuyo mi vida te amo <3", "Justin love u and friend me in this facebook please:)", "I love you Justin happy birthday I am one of your biggest fans I am dying to go to your concerts and I am having a tough life right now I am being bullied love you JB", "eres lo mejor q nos pudo haber pasado a las believers y ami bbe <3 te amoooooooo", "vc e limdo vc e o meu amo justin biebe", "Hi Justin this is vanessa how are you doing", "you'r just perfect justin,you have an amazing vioce and ur songs ar just perfect.i wish to be like u someday,u ar so cool men.", "Follow TASIA ALEXIS from vine on instagram.... Next DISNEY star..", "aaaaaaaaaaaaaaa justin biber te amooooo mucho", "justin you a very good job by breaking up with selena she don't deserve you", "good job Justin bieber your song", "hay si yo te miro en persona no grito ni ni lloro me desmayo deunaves", "Hi guys, this is my piano cover of LOVE YOURSELF, I hope you like it :) At guitar my friend Jack https://www.facebook.com/davidelocatelliofficial/videos/vb.182653505094232/1393806223978948/?type=3&theater", "Love u...Justin bieber ur my favourite singer and good dancer.....I think u really multi talent so sweet young man.....Ur songs are like u fabolous....Love u", "H,justin i love you so much im true belieber", "Hello ! Justin Bieber.\nI like you !\nI love your all song !\nI'm come from Cambodia.", "I love you so much justin bieber", "Justin bieber y love you\nTe amo", "Hi this is a little girl name liliana my fav song is never say never.", "Waaaw your my favorite sinner i like your voice. But i don't i some of your stupid song clips.", "es lindo nao ha ninguem assim", "wuuuaaasoo soo swett....<3 <3 <3 :))", "justin!You have very fan in Iran....We love you!", "I beg follow me please I will be very happy justin", "Se ve demasiado guapoooooo lo.amo siy bilieber", "yustin mandame una solisitu por fa", "soooooooooooooooooo much also love\nlove it sooooooooooooooooooooooooooo", "i wish i could sing lyk justine biber", "klick einfach auf den LInk :D lade dein foto hoch mit deiner Kinokarte und fertiiiisch :D", "justin bieber  te amo  muy  mucho  amor  bien  cacsa", "This is my piano cover of ''WHAT DO YOU MEAN??' :-) Say me if you like it :-) https://www.facebook.com/182653505094232/videos/vb.182653505094232/1263023833723855/?type=2&theater", "im d 1St 1 to comment lol", "If you stop reading this you're gonna die, My name is teresa fidalgo if you don't post this on 20 photos I will sleep with you forever.. This girl ignored and 29 days later her mom died. I am real you can search up on google", "i saw that in 3d it was so cool and sweet", "All my heart for you justin", "te amo justin bieber never say never", "in NEVER SAY NEVER i loved he rap portion much!!!!!! jaden smith did cool in that", "Iam a big then we're going to your concert tomorrow night I want to meet you I hope I can someday", "kk i'm a fan that would like u as a friend . . . seriously!! anyway love u", "Of course they are they have always been and will always be,.. just look deep ,..", "i like your songs but not like you", "justin bieber ur always be my number 1 idol,i wish someday i will see u in person...i love you justin..(love your self and sorry)best song i will never forgotten.", "i love your style but if u die today were will u go to heaven or hell jesus died for u n me so that we can live...", "I think, at brown you look the best, and a blonde you look better than now. :( But if you like this.. Okaay. \nYou look good. :)", "Warum jetzt aufeinmal 10.?! ;o -.-", "a zoila le gusta justin bieber y dive que no", "Hi Kyra, due to the fact that this is the German Justin Bieber fanpage, ruffles and competitions are only held in German and only for fans in Germany. But we've also got an English fanpage. Take a look at: http://www.facebook.com/BieberPremiereUK.", "ala  sale en todas las fotos como nena", "justin why you break selena gomez, selena is a simple girl,humble,cute", "Hahahahshahahahah Omg I luv u Justin Bieber ", "i love ur voice. :) yeah.. im ur #1 fan. :D goodluck to ur journey. godbless. xD", "We want to know who is the most popular #Believer around! Soon you will find out at www.SociAllRank.com\n#justinbieber #Justin #Biever #believer", "I like  your movie concert  I love   you", "i love you justin bieber soy mexicana", "Justin es lo mas lo re kiero...!!!!"]