["So many whining pc players. Get over it. Consoles have been lagging behind for ages.\n\nGood job Mojang for getting everyone up to speed, taking your time and doing it right.", "Minecraft? A movie? What why? Was it's story so good that a movie is being made of it? I will be shocked if it's even remotely good.", "Disappointedly, the Mario skin looks nothing like SethBling's", "That depends. Will it be in creative mode? :)", "Why is everyone upset? It's still the same minecraft, they just adding more. All you're old stuff will still be there, and if you don't like all the new features they're going to add, don't use them.", "how to down loan minecraft on computer desks", "The dlc is awesome but there's a serious problem. The birthday skin packs 2 and 3 had both changed into 2 . now it appears to be 2 birthday skin 2 packs as if birthday skin pack 3 is being changed into another birthday skin pack 2 on the list of skin packs. I tryed deleting,re_downloading. Separating the packs using a scan disk. No fixing it. I used another hard drive. And still the same effect. Once I removed birthday skin pack 2 the birthday skin pack 3 showed up as normal. The game will not allow you to have both skins without making them both birthday skin pack 2. I even tryed to delete the update and reinstall everything including my skin packs. All of them . just to make sure it was not me. No change. The skin packs are simply showing two birthday skin packs 2 because the 3rd is being changed into a copy despite the fact birthday skin pack 3 is in my console. .  this message refers to the Xbox 360. I have no idea of any other reports such as the Xbox one but I wanted to get the awareness of this problem out there so it may be fixed soon. Because I live Minecraft. And birthday skin pack 3 is my fav. Because of the redstone man and others. Thankyou.", "LEL lets pay 160$ to see awsome things like:\n-build battles\n-10yr old kids in mob costumes\netc.\nI was to Minecon in 2015 don't go to this crap and pay 160$\nWant to see Minecraft Youtubers?watch yt\nWant to see a build battle o on Mineplex or Hypixel\nI like minecraft but to pay 160$ again and see 10yr kids,build battles and retards in costumes?\nWith all respect Mojang but i am not a retard like guys that go to HaryPotter convention in costumes.", "Whats new for the consoles ... ?? Don't care about mini-games or mini-game maps ...", "Can anyone help me with the download? We paid for minecraft a few years back and downloaded it to another computer but we want to use it on another computer now. How do we do this without having to pay for it again?", "Story mode. Whoop-de-do. Give us console players the Combat Update", "Could you please fix the frame issues with the PS4 version? Why, whenever I hit an animal (sorry) they are lagging midair and moving when I'm in offline mode? Same goes for the sun and moon. They go back a few frames after rotating..", "I need help i have minecraft download on my pc and I have windows 10 but he doesen't work what I neet to do", "Mojang, ever since 15.0 update in Minecraft it started crashing and I could never play it again. I'm playing with my Asus Zenfone 6. I really want to play the latest updates but sadly only 15.0 below works. I'm so doomed lol.", "Its nice that Microsoft still allow the Mojang crew to do the Minecons.", "I've got a question, I'm curious but, is Herobrine real, did u really remove him, or what? people are constantly cyberbullying each other about it. not to mention when u guys say he doesn't exist or he isn't on Minecraft, but, the new update says you \"Remove Herobrine\", It confuses me and its making me question if Minecraft is actually worth the $20 to play it.", "I Know this is not about story mode but i changed my name on Minecraft and now it comes up \"Not Authenticated To Minecraft.net Can some1 plz help me", "Not sure how interactive this page is but I have some requests for the next update on the Pocket Edition application:\nitem frames, stained glass options, horses, further dye options (beds, collars, leather armor), dispensers, also the ability to open and fill chests in creative mode... \nJust general improved items of that nature - again, I'm not truly sure if even saying anything of this on here will be very helpful, but worth a shot. Thank you.", "Awesome! My 10 year old does a lot of coding. He'll love this", "When is this going to be available on Mac? I paid for the program to get ALL the updates. I've been with this game since it WASN'T popular. I'm glad it took off, but if Mojang is all of the sudden going to say \"Only for Pocket or Windows 10 Editions,\" they're seriously starting a technology war they don't want to add fuel to. They might as well be saying, \"Don't play this game unless you have this platform.\"", "Will there be any coverage of Minecraft, or only the feature-locked Win10/Xbox version?", "My son's Minecraft will not open on Samsung Tablet.. The only thing that got it to work was to download AndroidZip and delete all the Minecraft worlds. Then it worked for a few days, and now it's back to just going to a black screen when you hit the app and nothing further. If we delete his one world after only having it for a day, it will open back up, but now just a few hours later it happens again and again. Any advice?", "I got the mini game battle yesterday on ps4 and it keeps saying connection lost host has exited the game any help would be great I would love to do some battles", "i miss to play minecraft ;'(", "I cant treat the wii as a serious console... xbox (xbox one in particular) and sony have raised the game to such an extent that the wii looks and feels hopelessly outdated", "My oldet son loves minecraft. He looks at stuff and makes it like our house and even furnature.", "OMFG I can't believe this! Mini games in minecraft console!", "Can someone help me please... minecraft is not working on my son's computer", "A time lapse camera would be a great feature to add to the console version. Recording in 1st person doesn't show the entire build process...", "Hi minecraft can you help me i downoloaded minecraft but i cant join its read downoloading i wait 5 10 minutes and next was play i press play and again downoload please help! :)", "I love solo n adventuring with friends, and ive essentially had to stop playing ps4 minecraft because they just wont update to 1.9 :( hope they do soon so i can get back on it", "Guys, do you have plans to merge Minecraft PE with Win10 edition? UWP maybe?", "This post said that pocket and windows 10 would be updated \"today\" on 22 October. Does anyone actually have the update yet? Or have I read the first line of the post incorrectly?", "Hi minecraft, i have a acc on MC... and all games fo mojang", "Okay Mojang ADD IN THE HEROBRINE AND GIVE HIM HIS OWN DIMENSION.", "Minecraft, PE has not been working properly on iPad Mini. Me and my little sister has has worked hard to build our land. When we try to add or delete stuff it crashes. Please fix it.", "This is what i wanted to see. Ive waiting this on like 2,5 years ago or more. Finally the Beta version of The End world Pocket Edition appear now, good job Mojang. :D", "If these books existed for FTB Infinity... My wallet would be empty.", "my little boy loves minecraft but your toys are cheaply made,vinyl creeper and spider already broke one very upset little boy now i have to go buy more as ive lost the blinking recite", "Minecraft team. Sony Playstation Virtual Reality is around the corner and I hope you started developement on Minecraft VR.", "Ps4 i need the trophy for 500 meters on a rail .. if anyone has this rail already up can u please invite me Dvsgurl4u  thanks", "Which is the best city for next Minecon 2017?\na.Vienna\nb.Budapest\nc.Venezzia\nd.Istanbul\ne.Prague\nf.New York\ng.Munich\n Leave your answers in comments below!", "Antonie. MinecraftBijbel maar dan specifiek over bouwen alla middeleeuwen :D", "Some people Minecraft can not get me, and it rahman Low to'm 19.95 eur, while bi bakd my 23.95 is become my parents in here does not allow are the sesleniyorumilla to Turkey I songs, but ing good anyway decrease hear me you get everybody following game", "I know this is a long shot but I would love to see them incorporate Pixelmon into the console edition of MC... It's not a mini game but at least it would give console users a chance at something different and new to experience.", "I'm have this texture pack. Good skins.", "The new update on console version is so epic i wish that stampy's house is still there", "WTF DOES THIS EVEN HAVE TO DO WITH MC?", "The day that minecraft gets mods will be the day I get the Xbox one s", "I got the PC, Xbox one, pocket (iPhone), windows 10 edition of minecraft I just love it ! Love what you can do with red stone VIVA MEXICO!", "I always used to love those things in game they were so adorable!  ... And then i caught fire", "Or you could just play the existing Minecraft on PC as it was meant to be played, runs fine on Windows 10 as is, already has these items, dont have to buy skins and texture packs like they're DLC, and you can mod the game like crazy. Microsoft...leave Minecraft alone....you will be the death of the game.", "Where do i find the schedule for minecon? Does it only go to one city?  Once a year, or is it a tour. My daughters dream is to go to this :)", "We promise it's the final countdown!", "Omg I can finally get more inspirations for my medieval themed survival work it's nearly 2 years old now and there's not much houses there's only like 13 and a really long wall", "I dont midn 1.9, I just find the colision prevention system they added to be a major challenge for the serevrs to handle", "Hey there!!!\n\nBuy The Minecraft And I want to play, how", "My son uses the train tracks to write film credits including the logos at the end of the credits like Dolby stereo sound etc !", "Me and my step son found a typo on the advanced world options on trust players the word authorize is spelt wrong it is spelt with a s not a z", "all the tix were sold in the first 5 seconds.  I watched the clock count down and got nothing... What is the secret to buying tickets?  Is there a ticket sniping service like bidnapper for ebay? anybody know?", "I LOVE minecraft and play it all the time. I would love it if they fix the glitches. Like when you place a half slab and it glitches to the bottom when you placed it to the top. Or the one that when you place a brick down and it changes it to the block type that is around it. That one is extremely annoying. That being said, I I don't mind the new update. I didn't need it and I have not found the wings yet, but but I will not stop playing because of it. I am sure they will fix the issues and that have already fixed the combat update so it is a better compromise. So just give it time.", "I don't play XBOX so I can't play realms. I like the idea of what you are trying to do but I think playstation users (like me) are going to be very unhappy. I think there should be a sign in that is for the realms instead of XBOX live.", "anyone play minecraft skyblock blue here message me if play this server", "I love it, I've been playing MC since 2010, (6 years ago) and I find this really easy to use", "Someone is having problems with disappearance accounts in minecraft?", "Hi minecraft, i have made a server but only problem is that i dont know how to port forward it so anyone could join there =(  could you help me please", "why can you guys invent something better for childrens coz my kids are fitting too much when their are playing your dam games", "So no cross platform between playstation consoles as well then..that is a downer..but at least i can now connect with friends on pc and PE editions..", "When is cross play for xbox one and w10 a thing? my friend and i want to play together :D", "Will PS edition get those skins for its birthday as well?", "hey minecraft can you put helping villager that mine stuff or listens to you that would be great and a new ore like amber please do it it would be more fun.", "The last time a fun game got a major update called the \"combat update\" it was the beginning of the end. Good luck.", "I just use my Steam Link to play PC version on the TV. I have the console version for the Wii also but its really pretty terrible in comparison... v.v", "Minecraft: Story Mode is basically already a Minecraft movie, there's little to no gameplay. Why does this need to be made? MONEY OF COURSE, DOLLA DOLLA Bill Gates !!", "I wish the TU31 didnt render my game non playable! You need to fix xb1 TU31 with a patch NOT FUN \"NOT\" BEING ABLE TO PLAY MINECRAFT NO MORE!", "Mojang if you're reading this in your next update 4 minecraft if you do a jungle village can u plz do a tree house exclusive 2 a jungle tree house. Sense in 1.10 (The Frostburn Update) we get taiga villages and savannah villages. PLZZZ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Hi all anyone know the release date for minecraft story mode episode 5?", "Glad I play this on pc.. have access to uncountable skins and texture packs... and most importantly.. mods.", "I'm so excited for minecon 2016 i'll for there and it's very cool that the Developers makes a big works for give us a game good with new features and more we are everyone crazy for see what you have for show us , this for minecraft 1.11 and also pocket 0.16.0. Thanks by support", "They are improving combat mechanics, they are fixing the boats, and minecraft is coming to Wii U. Now you don't have to watch the video.", "Wish it was in Europe :( \nHope my country will host it one day :) Come to Poland! But have a great time in California this year :)", "Characters cast\n\nMario/Luigi : <Player name>\nPrincesses : <Supporting player names>\nTurtle : Zombie\nGoomba : Spider\nHammer bros : Skeleton Trap bros\nBoo : Ghast\nShy guy : Witch\nBob-omb : Creeper / Charged Creeper\nYoshi : Horse (or) Pig\nToad : Villager (Liberian)\nMooshroom : Mooshroom\nBowser : Ender Dragon (Yes, Bowser flies and is black)\n\nFeatures:\nPlayers can jump up to 4 block height and stomp on enemies.\nPlayers can break Dirt, Grass block, Bricks and Nether Brick Blocks with their head.\nPlayers must eat red mushrooms to maintain their 2 blocks height.\nEating a Sunflower will grant the player ability to shoot Firecharges.\nPlayer must find the Elytra to fly for a short amount of time.\n\nP.S: :P :P :v :v", "We do coding at our school", "in my opinion, minecraft story is not a very good game at all, it has the game play of a 2001 online flash games. and honestly the demo bored me to death.", "Any christian who stops playing this game just because of this disappionts me only judge the belivers and the world focus on wordly issues", "Minecraft admin pls look here, you killed my minecraft account D: I already buy it but I cant log in. Pls fix  and give back my account", "That awkward moment when you're reading this comment to find an awkward moment but there isn't any, and still you're reading this comment and you're starting to realise it says nothing important and you just wasted a couple of seconds of your life but you're still reading and you don't even know why. That's awkward... You should give me a like for wasting your time.", "Yeah that's great so when's the Snapshot for 1.11 coming? I couldn't give a crap about social issues or LGBT rights when i joined this page, infact all i cared about was updates about the game, not LGBT Rights, Gay Rights or anything of that nature, if i wanted to see that i would have joined a different page.", "Yes finally they made minecraft wii u edition", "I can't  wait to see episode 5 6 and 7", "Yeahr  but Microsoft can make it better / but they wil win with Xbox not with Wii U", "Add super hostile maps as a mini game, specifically Vechs super hostile maps, that would be amazing I would literally buy all the dlc for that minigame.", "This looks awesome!  I love the isometric illustrations in it!", "Hey Mojang! I have some ideas on Minecraft 1.9 and I would like to share them with you if you ever have the time", "When does story mode come out dor the PE verson of minecraft?", "Can you add beacons and stained glass to minecraft pe?!?", "why GOLD CREEPER ? Creeper is very good for name ! (i'm french, sorry for my english !)", "What is the difference between the win 10 minecraft and normal minecraft? I have windows 10 now, but I haven't downloaded the win 10 version yet. I can't find any info on that matter : /", "Speak of the devil, I'm building Battle maps of my own on Xbox 360.", "I love this thing I got one and I am a computer nut and I did something fun . I put it in to a windows 98se and the game ran fine will 45fps at a high and 20 fps low it is not a computer  i would play on all the time but in a pinch. so I am going to buy one for my wife and two kids. and the price is good you are paying for a mini computer the taps into your  video and mouse and keyboard and the game runs off the band is self that is way it is 80  for the diamond and i think 50 for the redstone. I am sorry but people need to read the specs of some thing before saying it is over priced . gameband  is cheap for what you get . and i tip my hat to them for making the band less then 100 not more .  the band is a tool just like buy a ps4 a nintendo wiiU,ora xbox 360 or xbox one to play minecraft on.  .", "Why was the ticket sale site so glitchy!?!?! It kept showing tickets were available but the checkout button wouldn't show up. I was not able to get tickets. If I have been approved to be a volunteer agent, can I purchase an additional ticket for my 5 yr old?", "I don't find any ocean temple on PSvita even with seed can you make it spawn rate higher please ? (sorry for my English)", "It is the best time to make a few plans for the longer term and it's time to be happy. I've learn this put up and if I may just I desire to recommend you some interesting things or advice. Perhaps you could write next articles regarding this article. I wish to learn even more things about it!", "Can anyone build this? I mean you don't need to buy those fancy add on packs etc. I don't have Xbox live?", "OK, so like the two people who bought the Wii U version are left out? My son would love to be able to use these skins.", "If i could go i would apply now", "Would you put Minecraft Car Mods,and Helcopter Mods? Becuase i would love to fly my HELICOPTER! On Xbox 360!(Thanks)!", "This game hasn't been fun for quite a while and the combat update just made it worse. Instead of stealing ideas, how about that mod API you guys seem to have brushed under the rug and forgotten about?", "I like the artwork guys keep it up!! But when will 1.11 be released. Pleasse tell us Mojang!", "Hello i was just asking if you meant that 0.16.0 MCPE with today or next week?", "Hi all I have minecraft good game server if? Two Spanish and English can if", "So sad.. i just had to realise that the Minecraft Wii U Edition is only a carelessly made xbox360/ps3 port. it even stutters in local coop. thanx for grabbing my 30 bucks.", "Hi, not sure if this is to the right people but anyway, my sons 8 and 6 are huge Minecraft fans. We have just booked tickets to go to LA and booked them for the time Minecon will be on in the hope that we could get tickets. But I have just read it sold out months ago and we people can't on sell their own tickets if the cant make it. We live in New Zealand and our trip to USA is a special treat for my boys after my husband and their Daddy lost his battle with cancer in May this year. Is there any way we can buy tickets to make this a special trip for our wee family? If there is somebody else I can ask, plese let me know. Thank you. Anna", "I only read these for kicks and giggles because odds are they're outdated.", "Question I've been dying to ask, when will you guys make  Minecraft compatible with Google Cardboard? And with respect don't reply with \"It's a bit of crap.\" Sorry, heard that you guys said something like that, which comes out as exceptionally rude. It was my hope perhaps since then popular demand has swayed your minds over. Any answer aside from the \"It's a bit of crap\" would be wondrous. :D", "Oh my GOD THIA WILL BE THE BEST FILM EVER I LOVE MINECRAFT LIKE EVER... before i hated minecraft since 3 years but then when i watched a youtuber's minecraft video i was inlove like crazy.", "for the love of Minecraft please make breading unlimited on the xbox one, ffs my land is toooo big to kill every animal to bread my own and it takes too long to collect them all", "Now, if they use Herobrine as the villain my life will be complete! I mean what other plots could they have? Though, I doubt they will...", "I really wish I can come to minecon", "Woah i like challenging with minecraft battle with multiplayer so much fun.", "Minecraft Wii U edition comes out 3 days after my Birthday wow.", "Any one know how to Re-install the minecraft client because my game hasn't been working and I asked around and most people just said to re-install the client", "Or instead of the barebones Windows 10 version (AKA: the Mobile Skrub edition), the real deal PC version is offered in it's place, you know, the one that supports mods and dedicated servers without the whole Realms thing.", "Problem switching Minecraft Pocket Edition to new tablet. Old tablet broken and new tablet comes up with \"My World Can't be Opened\" Any suggestions?", "Aw look at that little monster about to smash them to bits!", "Hey when r you adding all of the Minecraft PC i really would like to see all of the 1.09 update in Minecraft PS3", "Can Minecraft add trains which would be attached Minecarts even if this comment gets lost in an ocean of other 1000s of comments", "Game keeps disconnecting me from sever on friends", "I CANT RESET MY PASSWORD!!!!!! what is wrong?\ni`ve been trying all day, it say that will send me an email, but it never comes\nand no, its not in the spam/trash folder or is marked as spam on my e-mail\nneed help!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "story mode and put minecraft episode 5 I am desperate to please and sy Mojang creates episode 5 and I give you my star wars toy minecraft 7", "Who need Gear VR for 100usd\nIf you can by from me the same VR Box for only 30usd", "Hallo ich hatte mir 8 Premium Accounts gekauft. Anfangs liefen 5 auch alle ohne Probleme ab 25.11.2015 bis ca 3 Wochen also 18.13.2016 seit her kann ich auf einige nicht mehr anmelden oder gar zugreifen ;( Hier die namen:\nShampoolol, Cothem, Rustruby, gackchin, luffy0486 und CaptainSpooks. Die zwei konnte ich nicht migriren; milomax91 und Jodashin. Bitte hilft mir das kann nicht so sein. Herzlichen dank Konnte leider keinen anhang machen,\nHi I bought with 8 premium accounts. Initially ran 5 all without problems from 11.25.2015 until about 3 weeks so 18.13.2016 since her I can no longer log on some or access; (here the names:\nShampoolol, Cothem, Rustruby, gackchin, luffy0486 and CaptainSpooks. The two I could not migriren; milomax91 and Jodashin. Please help me that can not be so. Many thanks Was unfortunately not make notes,\nHi I bought with 8 premium accounts. Initially ran 5 all without problems from 11.25.2015 until about 3 weeks so 18.13.2016 since her I can no longer log on some or access; (here the names:\nShampoolol, Cothem, Rustruby, gackchin, luffy0486 and CaptainSpooks. The two I could not migriren; milomax91 and Jodashin. Please help me that can not be so. Many thanks Was unfortunately not make notes,\nHi I bought with 8 premium accounts. Initially ran 5 all without problems from 25.11.2015 until about 3 weeks so 18.13.2016 since her I can no longer log on some or access; (Here the names:\nShampoolol, Cothem, Rustruby, gackchin, luffy0486 and CaptainSpooks. The two I could not migriren; milomax91 and Jodashin. Please help me did can not be like that. Many thanks What unfortunately not make notes,", "How can you have lego minecraft when minecraft is blocks anyway? Yo dawg, I heard you like blocks. So we took a game of blocks and turned it into blocks so you can block while you block", "i wish you could craft Netherwart in mincraft xbox i need it there is none in my nether i looked in every corner :(", "hola soy gabriel uso el facebook de mi mama soy todo un crack", "Minecraft needs and Egyptian theme pack", "When playing lego virtually is too mainstream, here comes Lego \"Virtual Lego\" collection so that You can play with virtual legos in real life!\nbut seriously, what?", "Oh, pretty cool look guys! Keep on updating the website! :D It's so much cool right now! So excited to check it by myself! :)", "PC gets something too though, right?", "''very final instalment of the three-part DLC adventure.''\nNothing about the series ending as a whole.", "Pls get Alex out of Minecraft she really annoys me btw the pig is cool", "hey Minecraft my brother forgot his minecraft username and password, and he forgot his Gmail that he used to host the account so we really have no way of recovering his account, all we know if that his username was Dule### and he had a mudkip skin, if you could pleas help us with this problem that would be great because we don't want our money to go to waste when we already paid for the account and used it but then forget its info and have to buy a new account because yet again that would be a waste of money. if you could get back to me on this it would be great, i really want to play minecraft with my brother again.", "Omg did they made minecraft there amazing if they did!!!!!#", "I didn't see the 0.16.0 update on the app store yet. I don't know if was a delay or a glitch with the app store.", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't  do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "Mojang just wants more money. This is at a ridiculous price!!!", "Don't ever stop using removed herobrine.", "Hi I'm really after some help please, im new to minecraft and I'm rubbish, but my 5 year old loves it! She has seen people have dinosaurs in minecraft and begging me to get her the dinosaur minecraft, also a fly mod or mob? Any help would be greatly appreciated oh she has it in ps4 thankyou", "can you build your own minecraft world with lego sets", "After the update for PS3 my existing  survival world did not generate the new blocks or trees, at least not that i can find. The only new thing i have are the fish and items you can get from fishing. Do i need to create a new survival world? If anyone knows anything about this please let me know.", "dino acc minecraft gia ena acc lol gold division olous tous paixtes", "I have an idea to make it so minecraft Wii u edition can attract players to IT and not just old PS3 and Xbox 360 editions.\n2 Words, NINTENDO, SKINS!!!\nThen people can play as Mario,Luigi,link,toad,Kirby,and more!! Please add this!", "What exactly is Minecraft story mode.", "NOTE:\nInstalling it from the Windows Store failed, no VR.. just normal.\nInstalling it through Oculus Home, worked.", "I love minecraft and I want to go to mine on", "Anyone want too join my server its 16+ up Must be Able to follow the rules but im looking for new minecraft buddie i have no one to talk too in my game if your interested pm me", "Idk haven't played it yet. Don't got anyone who plays minecraft. Hit me up @ ANGELSHADOW777 mature crowd appreciated. As for the update that does sound fun.", "Minecraft Wii U version is having issues with saving files. The file appears saved, thumbnail is correct picture of progress, but when you open the file it is gone. Everything is gone. It has happened to my daughter now three times. I have looked online and it appears to be an issue with no answers. Very disappointed. :( She makes sure to save each time before she exits.", "Make Minecraft available in Philippines please we don't have any card to buy it online", "this is piss to write words in lava theirs two ways, write the words on a slant so it works like that , or just put a line of lava at the top and just write the letters in thront", "As much as I love Minecraft, there's no way I'm paying $160 for two days of walking around a convention center full of kids. MineCon has never been worth it.", "I got a whole modern city under construction with red stone functioning elevators in every skyscraper ! that's just scratching the surface i'll upload my city later probably in 2017 stay tuned everybody !", "How to Download Minecraft pe its have ender eyes", "I'll join the \"dislike\" group.  The balance between damage taken and given is way out of proportion now.  The durability of the gear is way too low.  While there are some great ideas here, I'll wait for further updates before using this anymore.  I'm not into entering \"God-Mode\" and creating everything.  I prefer actually finding what I need to build what I imagine.  Minecraft is losing what made it unique.  Leave that to the mods.", "my account for minecraft on the laptop doesn't work. I tried 12 times with the password but it just keeps saying it's invalid!!! can anyone help me out here?", "Hello , I am Brazilian , I can not speak much English , but wanted to partner with you if possible , I am a new youtuber and pretend to be youtuber Minecraft . Please could you give me a forcinha ?", "I have finshed minecraft story mode  episode 5 Iloved it a lot", "Xbox one s is garbage it's so weighed down with all that extra tech you need God to piss heavenly Internet onto your house for it to function normally just get a regular one you'll save money and hair trust me I know", "My daughter had had minecraft pe on her Samsung galaxy tablet 4 for ages. For the past two days a pop up has occurred saying unfortunately Minecraft has stopped working! I've tried rebooting the device. And I've uninstalled and reinstalled the game, I've also done the same with Google play. I rang Google play and they said that it is an issue with your game. Could you please let me know how to solve this issue?", "Can you please create the next minecon in germany? Alot of germans also play minecraft, they would be so happy, why everytime america? What about Europe?", "A mini-game. A freaking min-game? Are you serious?! The console version is so far behind the PC and Pocket editions of this game it's not even funny. Forget the stupid minigames and give us the combat and frostburn updates! I want to be able to glide around my world! I want to explore end cities and grow chorus plants! I WANT TO BUILD WITH RED NETHER BRICK AND MAGMA BLOCKS!", "Have my Lego pieces ever come to life? Nope. I haven't had Lego since I was 16 years old. (I really liked building and creating xD)", "Whos playing minecraft could you guys help the minecraft name Orc with something with the skin of wood", "Quem me da uma conta de minecraft original", "Wait, what? I thought it was only 5 episodes....", "You guys should make dlc mods for PlayStation and xbox, basically dlc tinkers construct, lucky blocks, and all the other ones, I'll be more than glad to pay for them", "the new story mode skins are available in minecraft pe too now in 0.14.1", "When will Mojang release the Nintendo 3DS Edition of Minecraft?", "How do I delete behaviors packs on minecart pocket edition? Please let me know?", "It is shocking that PC is totally undermined. I think the real issue is that the problem of Microsoft deciding to push it to xbox and elaborate it so much on the xbox console for the sole purpose of making money. The story mode is a stupid thing at start. Now they start declaring more restriction on commercial patron giving funds to creating using minecraft as a tool. If you see the history of the entire development of this game, it was also been treated as a tool of creation. PC gave the game different taste, yet pushed it towards better version each time. The community support it with craftbukkit, spigot, and many other mods and plugins. Now by crushing the community's creative platform with so much restriction on doing this and that, I just felt it is hardly sustainable for PC in the future rather than people using it for pure hobby. PC has so much potential, and yet it is going to die out.", "Yeah, crouch and put TNT under your house, watch them go in and enjoy the show, always make an underground base in multiplayer guys", "i never been to Minecon but i can build (just been awhile since i built big things)", "Does Minecraft really need Lego sets? I mean the game it self is basically a virtual Lego set", "If people are so bothered about 1.9 just change your game to 1.8 or below in the game launcher! Personally 1.9 is great!", "\"I can build anything the way I like\". Call me old fashioned, but I don't need my LEGO to look like Minecraft to build anything I like.", "besa tu mano (isquierda)\n2:di el nombre de tu amor\n3:siera tu mano\n4:di el nombre de un dia de la semana\n5:di tu nombre\n6:abre tu mano\n7:pega esto en 15 comentarios yes el dia dijiste te va a decir que le gustas y te ba a pedir que sean novios.si rechasas esto te a ir muy mal", "When will Minecraft 1.9 be coming out for pc?", "I had a glitch in my game while making a video about traps there was some kind of forcefield and two minutes after i was done recording there where burning logs on my trap that werent there before\n\nThis was on console edition\nMaybe it was a glitch in the new upgrade", "I think the traditional one is just okay, you better only want to enhance the interface but not the content which is missing after the update", "MCPE is ruined. The buttons are too small, the GUI is only good on tablets, and the poor Pocket Edition also got raped by Microsoft with their \"friends\" and skin packs", "i had a great idea for a new update for consol and pc editions. mabe there can be a way that u can build over minecarts to make them look like trains or cars. also put most of the mod that are on pc, and build them into pc and consol editions. its just a litle thing i made up. plz reply back on what u think.", "I cant afford that skin pack but someday i will ask my dad i love it but i expected a mob or blocks update", "i wish minecon 2017 will be placed in austria,or hungary,or in Sarajevo,because its the olympic city,and we got enoughly big centre for minecon 2017 called Zetra:)", "You can run away to it is day light then let the zombies burn in the sun you will not die or the pig this is what I think", "Hi All. My daughter was modding a skin - I think - while her PC was downloading  1.8.9. It now won't startup. The PC is fully updated with all software related to Windows 10. Every start up has a different error and I don't think the \"report to Mojang\" button works. I have been told that she should be able to play the game from Minecraft.net if she logs in but that doesn't work. I have downloaded the game onto my PC but it starts with nothing in it. Can anyone help because she will lose 2 years worth of work? Thank you", "Any sort of soundtrack for the two versions? Just doesn't feel the same going through the end without the ambience the music creates for the end.", "my account and demo , how do I leave it original , I bought minecraft", "I had to roll back to 1.8.9... It updated on my computer yesterday and suddenly NONE of my texture packs work on the game!! I can't stand the standard pixelated appearance of the game. It messes my eyes up bad and gives me a headache.\nPLEASE hurry with new texture packs for the new update... can't play it until there are smoother, realistic packs (that get rid of the choppy appearance).", "i want to say a qusiton when mcpe 0.15.0 released? i want to play mcpe 0.15.0!!!!", "Why do we bother with Minecon? There isn't enough going on with it to justify an oversized convention. I wonder if there will be any \"awkward moments\" this year?", "1 dirt house playset: $10,000 please", "Hi all, what's this about then? And do we just open the link at this time?\nCheers!", "Minecraft my son downloaded the new update today, and within an hour of having the update, his phone is hot, and now will not connect to wifi. Please HELP!! Had NO issues before this morning's update", "Why minecraft pe isnt free. I have bought pc edition so why should i pay for pe -_-", "Or you mean absolutely nothing but money grabs now? Like dlc packs now lol. Now update Survival mode and then I'll be back until then nope. Add mods to Skyrim remastered and fallout 4 already have them. Catch up.", "Please MCPE v0.16.0 update language Bahasa Indonesia ;)", "I play minecraft for the creativity and the fun new updates. I injoy minecraft more than anyone else because most people I see that gives minecraft a compliment gives bad reviews about the game but I honestly injoy minecraft I even built dragons and awesome structures and torture mobs lol but please don't ever listen to those bad reviews because if I don't have minecraft in my life I will never see myself injoy my creativity in other games as much as I do with minecraft.", "We want for survival tempature and you get damage when you stay too much in desert,and cold biomes.(in cold biomes you get damage only without fire,without armor and without any wood place)", "I remember back in 2010 when the Halloween update was actually something interesting", "goblog! gua pengen download malah suruh kasih email adress ama haritanggal ultah sama padah password.....Udah bener passwordnya sama email adress dan ultah.Malah gk bisa.bisanya registrasi.....Veriify email belum,buybelum,downloadbelum........Caranya gimana sih guys? tolong donk kasih tau yang orang indonesia...Dan yang ketemu ama gamer minecraft bilang klo gimana cara download minecraft di mozilla firefox...Klo gamernya gk punya mozilla firefox...suruh cari aja solusinya......bilang yaaaa!!!!!!........thanks yng udah bilang ke gamernya", "No way Minecraft making Minecon in Vienna is a good idea,there are hundreds of Minecrafters I lnow in Vienna please Vienna Minecon 2017", "Servidor de minecraft 1.7.2 sem lag e unico, DemonPvp IP: 167.114.100.45:25606 ------> evento BOSS valendo a tag mito", "Realms on alpha android tablet pls on Hp tablet realms pls!", "Ia ser muito bom vcs adicionar a vila do minecraft do xbox para o celular", "Minecraft advertise that no one plays on leadcraft coz the owner gave me stuff to help me with my island (skyblock) then tried to accuse me of trying to kill him which is not the case i have pics of the chat log", "there is something i have thought about. why is there not snow biome mobs i know there is wolf but why not any thing else like penguin or polar bear there is a mod for minecraft where there is polar bear and penguin but i dont like to download mods i better like if they already was in the game i hope you DE's reading this", "I wonder if these people who are reacting negatively (and quitting) to this posting really think that the community will miss their vitriol?\n\nCheers for the solidarity, Mojang!", "Removed Herobrine is a Prank for beginners right?", "SUPER :) Minecraft is for all ages. I'm 56, and i have had Minecraft since alpha.... and i do still play the game :)", "Please make the next update for the builders we can't do things with this kind of stuff it makes me don't want to play minecraft any more...", "Make school fun/ make minecraft boring. I hope the first one!", "Mind you, Pc is inferior at this point. They wanted simplicity but but now you can fly and wear a dragons head for hell's sake!\n\nBut seriously though, i'd lose interest also and sell less when the majority of Pc players use Minecraft and other games just to mod instead of experiencing the full game. Thats why console is superior, it's more engaging.", "technically the nether is not a biome", "That awkward moment when you're reading this comment to find an awkward moment but there isn't any, and still you're reading this comment and you're starting to realise it says nothing important and you just wasted a couple of seconds of your life but you're still reading and you don't even know why. That's awkward... You should give me a like for wasting you're time and you're gonna copy and paste this.", "You should add walled villages in minecraft, and plain villagers are enemies with desert villagers, their are like two races of villagers!", "Hey, I changed my name on Minecraft, after this I can not log into the servers, someone who has a solution?", "wow ! it will be amazing with virtual reality minecraft, and want to see the zombies and creepers explode. Mojang good job ! minecraft to the future", "To hell with this trash I want more texture packs for xb1!", "hey i have been trying to get on minecraft for a few days now but it says i have demo version only. i dont i bought the game in 2011. plz help", "I don't have minecraft on the pc, but on xbox 360!!!", "Time to start building a \"controller SUIT\" ... headset, bracelets (or gloves), anklets (or boots/socks) ... electric shock outfit (so you can feel when you're being hit) ...", "Can't wait for Minecon Cringe Compilation 2016 ;)", "After installing Enchanced biomes mod and deleted it\nThe ocean biomes became extreme hills\ni guess it messed up the biomes configure or something\ni need help", "when does 1.9 come out I keep seeing youtube videos but no update link when I use the game? anyone can answer this. :)", "Haha game made for children what r u a prized mug most kids under the age of 6 struggle to read specially at the speed the game wants u to read this game sucks full stop", "We'll be up and running with the show soon. Thanks for sticking around!", "Life is Strange will always be the Best Episodic Game ever!", "minecraft can you update the mcpe", "Oh typical Microsoft hahahaha squeezing every cent out of the franchise ...", "As if i'd get that low version with paying skins and textures packs. Stop being so greedy.", "Great example of the self entitled attitude gamers and to a lesser extent indie gamers have.\nSomething is added to a game they play but its something they dont use or intend to play and their reaction, even in this case when its for education of children, is to complain and whine about it. To complain about the direction of a game or a company they are not a part of or an employee of. Remember when the Oculus Rift guys got death threats because they chose to sell THEIR product. Pathetic.", "Hello staff of minecraft ! I am a player and I love minecraft play .But today I have windows 8.1 pro . When I try to download minecraft me a problem with Open Gl.My can help please?!Thank you so much", "Invalid or corrupt skin show when i play multiplayer??? Please fix this...i tried to use steve skin but ot still the same please fix it", "when you get an account you get the demo version, you you buy the full version luncher.", "It's May 17th and Mario update still not available!", "YAY! MAYBE THIS YEAR I CAN FINALLY BE AT MINECON!", "If you make skin packs in the Wii U then I don't care, it's enough and I already have minecraft on my pc so I don't have to.", "So you keep releasing new gamemodes like storymode, windows 10 version, you update other things but leave the pc version  not updated for at least a year, no wonder why people don't play it anymore, I used to play it all the time but have gotten so bored of the game due to no updates, looks like Rising World is the new game for me!", "Cassie Koerner maybe me and braylon can try this out when it comes out? :-) :-) or obviously u and him can too. I just miss him too ya know", "I wish there were cars on minecraft.I also think there should be guns.", "I dont care about mini games. If I wanted to play mini games of some kind, I'd download some cheaply made app in the google store.\n\nJust add more content to the game instead of gimmicks.", "Hey if you guys are REALLY going through with this idea, can we please have C418 do the film score instead of whatever trash band you guys got for Minecraft story mode?  I at least want one component of this film to work out.", "the minecraft windows 10 beta is a load of crap it as why to many problems it not worth $9.99 it is almost not worth giving away right now to many thing needs fixed", "I was all excited until I realized you can't create your own battle arena. \nAm I the only one who sees something wrong with this?", "hello Always thought that if the servers could be opended or online", "I already have the version this very vacana the most great are those shulker coffins and more that are of different colors", "Hi, I am having trouble with loading my world in the Minecraft game on Xbox One. The game itself loads, but when I try to access my world it stalls in the syncing process, crashes, and returns to the overall home screen of my Xbox One. This started yesterday, and I today was on the phone with Xbox for an hour and a half and they could not resolve it. It is not impacting any other game on my console so I KNOW it's a Minecraft error and issue. ANY HELP or ideas on how to fix it would be amazing.", "I'm seriously confused of the direction of Minecraft. It's updates at this point are mindless. What about survival mode players who want more than a RPG? Where is improved hunger, improved crafting, improved cooking, and improved agriculture? I'm not just asking for more items and blocks, I want more features. This game is too easy. Also for game that completely changed its direction to creative gameplay, there isn't any furniture.\n\nYou guys don't even give us a way to chisel down our blocks pixel by pixel to make them into whatever we want, expanding on creativity to great lengths. Jeb ruined every aspect of Minecraft which made it great. We still have lame unpolished features like floating trees for crying out loud.", "PLS FIX THE TNT CANNONS IN XBOX 360 IF I MAKE ONE I LOUD IT WITH TNT IT HAVE A SHORT RANGE AND FIX TNT GLITCHES AND SOMETIMES IT EXPLODES  MY CANNON. PLS MOJANG OR MINCRAFT READ THIS.", "Next minecon should be in germany...", "como soluciono un error de minecraft lanchure cuando le doi play", "i personally am not a fan of this update, it just made the game 10 times hard because of the cool down and also the shield is a kind of dumb idea. the sword blocking was easier. this is minecraft not skyrim", "How come the creepers still explode while you are engaging them they didn't used to As long as you were fighting them.", "The site looks sleek but its a little difficult to find where the servers are. Same goes with changing skins. I dont think it should be in profile, it needs to be more apparent and visible to the average player.", "I have literally been trying to sign in to Minecraft for hours now. From what I can tell all the servers are up. Yet I cannot sign in. My brother cannot sign in. His friend cannot sign in. FIX IT!! I'm getting slitely agitated by the fact I pay for this game and not a week later I cannot sign in and you help forums are absolutely now help. I guess  I will however many days it take for customer service to respond. Thanks for ruining our weekend.", "When are you going to put horses in the game of Minecraft PE???", "Can you on the next update of Minecraft Playstation3 Edition can you put Armor Stands and the morph mod and new mobs and new dimension's.", "Words of caution... 1. Local multi-player doesn't work unless you have Wii U Pro Controllers (wii remotes are not supported) 2. If you buy a 3rd party pro controller (like the Afterglow) it has a problem with the analogue sticks not working correctly.  MOJANG, you need to sort this out ASAP.  Not happy!", "ok i have a question...i paid for minecraft on my pc years ago...i have just had to reinstall due to getting my pc fixed...do i really have to pay again...and why is it double the price???", "looking for player for my privet server i have with mojang a hermitcraft like server is what Im going for message me for details", "got it today. my 5 yr old grandson loves it, i also got the halloween realm, he likes it even more and so do i,, we love the secret tunnels", "Who ever has a Xbox one , go over to YouTube and check and subscribe to box turtle gaming. His server is awesome, organized and fun with survival and PVP zones", "Go Ruthie! Voting on the costume and she actually made it herself.  Magma Cube love it.", "IM GOING TO GET A DIS LIKE ANT I", "I bought Minecraft for PC but no longer have the computer I now have a tablet and was wondering if someone could get in touch with me I have a question and need some help", "\"1.9 ruined pvp\"\n\nRemember when sprinting \"ruined\" pvp? Remember when potions \"ruined\" pvp? It takes more skill now. I, personally, am pretty skilled at pre-1.9 pvp; I'm a fast clicker, I can press a few different keys quickly, and I get about 25-35 ping on Badlion. Now in 1.9, it'll take more than clicking, hotkeying, and ping to be good at pvp.", "Can't wait! I'll be watching from 3 in the morning (I hope, assuming my alarm will work) to 1 the next morning. I'll be in the livestream!", "Time to play again?\nI want nice villages but mods used to seem the only way there", "Hello staff, I would like to know if there is a minecraft game for an IMac computer? My son keeps bugging me about getting it. TIA", "You know what would be awesome for Minecraft? Content. \n\nNah, 360 noscope dlc are way better.", "Minecraft <3 MINECON @ PH :) 2017", "Yo me gane la mena de diamante q prende y se apaga", "Win10? What about other desktop OS? I thought that's the point of using Java", "\"free update for windows 10 too.\"\nI still won't update to windows 'full of updates to fill your hard drives with useless stuff' 10.", "Hey, hum a friend of mine is trying to buy minecraft since 2 or 3 months but the Minecraft.net website does not let him pay for the game, like every time we try to pay the website sends an error message.. If someone could help us please", "I just got the ps4 version of my Minecraft. It's terrible.\nToo far behind.\nNo custom skins.\nNo custom resource packs.\nSkins and resource packs cost too much.\nOverall I'm annoyed I spent any money on this.", "game modes : survival, skyblock, kingdom, factions en minetopia!! \nmini games : hide and seek, TNT run, hunger games, skywars, bedwars, cube runner en paintball", "sweet. Let's watch people go head to head, building things with 8 bit blocks.", "Why don't you focus on Xbox and make servers for Xbox. No one cares about the Wii.", "hey minecraft when i switch my version the whole world turned into a jungle then my house was destroyed i was really sad so i had to reset the world", "Can you do so in Minecraft Pocket Edition you can play with your friends together in a world but at distance?", "better use a wiki for free , i dont think they use minecaft if they dont have internet", "Hey trying to figure out anybody can help me out on minecraft trying to figure out how to play the game if you have a Playstation 3 and a microphone so you can talk to me to explain some things in the game hit me back my gamertag is kevikbb shooted message first to my username and I'll hit you back", "could you release a minecraft five nights at freddy's skin pack? I would totally buy that. I think it would be cool to be chica or foxy or even MANGLE?!!!!!!!!!!!! Please  i would buy it FOR SURE!", "Well, I enjoy playing it on iPad! Also enjoy the Java version on my laptop too. It's been my favourite game for about three years now. Can't understand why there are so many complaints considering the amount of free content updates. I know the texture packs cost a couple a quid but, hey, you could buy a takeaway coffee instead...", "I don't play electronic games, so I have almost no understanding of what will play on what machine and my wee boy wants to play more than pocket edition; if I buy minecraft pc will it work on an android tablet? Thank you", "Oh wow, they did what mods did 3 years ago, congrats. How about you do something big? 1 mob, shields, and dual wielding, is less than what most mods have anymore. Mo'creatures adds a lot of creatures, there's so many weapon mods I've lost count, and they've done what it took years for them to finally do.", "Where is it on Xbox 360 guys I know that it was going to come out in the last update so where is it???", "if minecraft is coming out for wii U then it might come out fo 3ds/2ds", "Jfc, so expensive! The only way I'd be able to go is if I made it as an agent!", "I hope I get to go to Minecon!!! I live in CA!Its just a 30 minute drive for me to go :)", "Minecraft I just bought the minecraft one version by mistake can I please have a refund", "I'd like to see a minecraft movie, but it comes out after i graduate highschool? that's going to be way past the time minecraft players stop playing...", "Um the official 0.16.0 will be realesed on Minecon Right???", "Idk about y'all  but this update is much more than I expected, I've been playing Minecraft since the beginning and it has improved greatly in this update. The weapon cool down does give it a bit more realism seriously who can swing a sword 4 times in a split second XD although I do wish it had a weapon cool down toggle for people who just like swinging their swords", "Maybe they should focus on fixing current problems instead of ignoring them.", "what about IOS???? Minecraft only focuses on the android and PC versions....yet Mojang fails to notice minecraft versions for IOS, ps4 & wiiU", "A large number of servers are refusing to update, shields are op, Minecraft combat is now turn based. It's cancer.", "Did this in class it's actually pretty cool", "HELL yeah minecraft wii u edition so getting it so coool omg omg looking forward to playing ot on the nintendo wii u Yesss thanks mojang", "I am getting really tired of my son being banned on servers for hacking.  He is 12 years old and doesn't even know how to do that.  I am starting to think it is a scam just to get money!", "dd they announce anything really groundbreaking for MC or was it just fluff?", "Random 2c worth here. Why are there not more animals in the game? Lions, bears, tigers, even a horse would be nice. How about a cat, monkey, mouse, shark or scorpion.? I just long for more variety. Or am i stuck in a world with only farm animals?", "\"better fighting\" by adding in a cooldown. Combat is what started to ruin the fun of MC in the first place, this is the CU of Minecraft.", "lol. dont forget to bring a bed!! LOL!!!! your naps will be a BANG!!", "please add servers to minecraft xbox 360 edition porfavor adicione servidores para minecraft xbox 360 edition", "wait there's someone in minecraft that doesn't carry a sword non stop to kill the monsters that can walk up on you.. and he never looked around to see if any were coming... he deserves to die.", "Aimee Harrison what do you think you could make in 20 minutes", "it's nice that Logdotzip was telling the tale of each character. I honestly didn't know he was gonna be in there.", "Wow amazing i love lego and minecraft  both of them is the best:)", "\"PC\" ... so it's finally coming for Linux? #pcisnotwindows", "How about fixing host skin bug in PC version?", "Saw this earlier today not really had a fiddle with it yet been building a hub for starters on my world. PSN Funkertron add me", "I'm all for online play, but with PC why can't we just host it ourselves? Am I not understanding something?", "hello all i have a nice MCMMO survival Australian dedicated sever on 1.10 on hard for anyone whats to wanna play! pm me for info if you are keen i enjoy MC so much better with other people playing seeing there builds helping out exploring ect i will also be resting the end maybe once a week to give everyone a chance to beat/explore end! PM me for sever info", "i love minecraft i even have it on my tablet", "i love minecraft i been play windows 10 edition allot but why can't we use gamerule keepInventory true it use work but now it does please yet us use it regular minecraft doesn't work my new computer ????????????????", "PC players, why are you complaining? We have access to mods!", "This is going to be for kids who have trouble learning in school right? Cuz I don't think many other people would use it that much....", "These books are for all those grandma's out there who don't know what to get their grandchildren for Christmas, and heard they like that \"mind crack\" game so they buy them these books!! Lol. I know that because I used to work at Kohls and they were the only ones who bought those :P", "I want someone to photoshop Nigel Thornberry into that going \"BLARGH\"", "Is there anyway for my kids to use voice chat with each other with microphone/headphone combo when playing together on LAN on pocket edition using separate tablets?", "I don't like the new site, I prefer the old because I knew the site as my pocket ! (i'm french, it's french expressions !)", "Within the last week, My account is no longer available, I can't login to my account. When I do lost password or screen name I get no response. 6 years ago I paid $26 for my minecraft. Until my account is put back I will repost this over and over. my minecraft screen name is camelcash32. please put my account I paid for back.", "I wonder if we will see anything for MC storymode season 2", "If you actually look it up, for all the nay-sayers, this thing is WAY more durable than any standard usb drive.  No you don't play it ON the watch.  The whole watch feature is just a sidenote to what the product is.  The point is to have your MC on the band, so that you can plug it in to any computer, anywhere, and play on your world with your account, without having to be online and host a server.  the computer doesn't even need to have MC installed.  80 bucks is 80 bucks, but if you got it to spend, this thing is awesome.", "Hi  how to get friend or peple swan in minecraft android", "Ok... So i am loosing my mind, this is the only place I thought to go for help (sorry!). >~< I am new to playing the Minecraft PC version, and my friend just got it as well. So we decided that we wanted to play on a LAN together. But we just can't seem to get it to work. Help?  ; - ;", "i'm just the mom so please don't  yell at me if this is a stupid question but are realms on xbox live???  my son has been playing windows 10 on the pc and has been dying for an xbox so I am getting him a xbox 360 for his birthday (can't afford xbox one, so sad  :(     any info anyone can give me about what minecraft on xbox 360 would be awesome!", "Julie hopefully they will have grown out of minecraft by the time this comes out... angry birds was bad enough! I can't do a minecraft film!!!!", "I have Minecraft PS3 Edition, and i hope in the future this Edition be like pc 1.9 \nPs. Mojang what about 303?", "to the developers at minecraft that doing alot of things for this world. why dont you fix the bugs and glitches on your game. why are you using java when other games use a game engine like unreal etc. most of the errors are java.", "I would enjoy playing the Console edition if it wasn't so outdated. 4J needs to step it up.\n\nEDIT: They posted on twitter about the panel they will be having at Minecon, and that they will talk about new features for consoles!", "Would love to know why I can't play multiplayer offline. won't even let me press start to join or anything since we got the update...", "I am selling my minecraft account + cover 5zig , it is two years I stopped playing and I do not come back ...\n\nMore than 40 kits in Brawl ..\nand a starter serves other ..\n\nIf someone is interresar , call Box", "When is minecraft putting future and more cool things to Xbox one and ps4 and if you do that you are the best minecraft creator on the world thanks for everything", "Is there someone here who can help a clueless parent with a pocket edition issue?", "Unanse al nuevo server                                                       PichorraCraft 1.8.7\nServer ip: servidor1.myserver.gs                                                                                  Campos de Batalla pvp, eventos diariamente, kit de inicio, y sobre todo un coordial trato para las personas, que esperan?", "Why buy these. It is just a waste of money. Why have this< when you can make battle arenas on vanilla minecraft. I think they're point less.", "Because we really need to see that Minecraft in 4K!", "Angelo and Ruth - I was thinking of you guys and Kaleb & Bengi too.  The cost factor may be pricey, but I thought I'd bring this up to you anyway since this time it will be in Anaheim and not in Europe last year.", "Hi Minecraft. Heroebrain is joining my game please help me", "they should add the ability to craft diamond,gold,and iron rods so that you can use diamond sticks e.t.c to have even more durability on items that need wood sticks to craft", "love to see some support for the orignal not w10 Minecraft", "just saying why does't minecraft  ps3 have mods because u can just go into play station store and buy them because it's really annoying to have to have a PC or MAC to get mods  and it would be really fun to have mods in minecraft ps3 and it's unfare for the people that have a ps3", "yes finally i beat the 4 others in in dec", "want to download minecraft for PC on your homepage. But it wants me with no refuse option to entitle you for further payments via PayPal??? no way!", "I need help on knowing how to buy Minecraft for PC", "When are you guys gonna fix controller support? Been waiting for a a year or so. Still can't move and look around at the same time", ":D\n\n\"Come on, kids, buy this printed book that will be obsolete in a few updates!\"", "Just a question from my son; he wants to know if the Wii U edition has the Ender Dragon. He has the iPad version that doesn't. Thanks.", "Dear Sirs, Have grieeferi in Minecraft that wreak havoc by servers (destroy) please turn off Hack THANK YOU!", "No, I didn't know, but don't tempt me - I'm trying to grow up a little here!", "Someone wanna tell them that the Minecraft hype train left the station years ago?", "No it have never happen for me, because Im not a minecraft character made out of Lego! Use your brain next time you ask a question...", "my minecraft i didnt play for a month and now its trying to say its a demo im really sad because  i spent all that money on it", "Is there any movement animations like steve points a creeper with his fingers visible?", "Wow, so they make the fighting more skill based, and it's ruining Minecraft somehow? Yeah last I checked, the previous combat was more luck based, and not skill based. All you literally had to do was repeatedly left click, until the other person was dead.", "Woo hoo!! That means new fresh cringe compilations coming soon! :D", "I've had my HP whittled down by Zombies and been exploded on by Creepers but that's nothing compared to the online bullies in Minecraft...", "i thought this game died out long ago", "Join our Server Please! IP 90.230.3.204:25565", "Does anyone know of good plans to build Titanic? I cant figure out how to build it but I want to do it myself.", "Where is the love for linux? I'll stay on the java version to keep a private realm server for the family. It would be nice to see them all come together, but please keep linux on the radar.", "A year later...\n\n- Still there is no way of claiming land to have land protection or being able to lock anything from griefers.\n- Still cutting down trees is annoying and floating trees continue to this day, exist.\n- Still there is no furniture to furnish your empty homes, aside by trying to make blocks look like something they're not.\n- Still there is no official Mod API which was promised and later abandoned.\n- Still survival has very few survival elements.\n- Still all mechanics are overly simplified to the point that the game doesn't even feel like an actual game.\n\nSure, improving combat was needed and welcomed, but it's priority was very minimal when compared to all the other things I've outlined. The game remains to be for children, not everyone. Am I the only one noticed that the game went to trash the moment Jeb took over? Reading ideas that Notch presented way back, were amazing compared to what we have now.", "My son had an idea when he saw searge's message on reddit. I wouldn't let him use reddit so he used my facebook instead. Searge said that they were asking players to give ideas to make combat more fun. He wanted to say that he had ideas for some swords and a new mob. He was thinking that it might be cool if minecraft had elemental and dimensional swords such as: The aqua sword, blaze sword and an end sword (that has enough power to destroy enemies in one hit). Then his mob idea was to maybe have a nether knight, an armoured knight boss found in the nether that would wield the blaze sword. He thought that maybe these ideas might be good to make combat cooler and more fun.", "Same as terraria, Becuz terraria has cobalt in it", "Lmao Wii U? Barely even a games console! Nintendo need to stick to hand held devices, they're consoles have plumeted since the gamecube, its a surprise they're even still in business let alone releasing new games lol #MicrosoftSonyOnlyRunners", "People who are angry at this need to rethink their priorities.", "It's gonna be awesome on the Wii U", "Look at that, another page gone to waste about social stances on what is what. I lost my respect for minecraft, not for their stance, but for using political correctness on a game page.", "I was in the Nether hunting wither skeletons in order to spawn the Wither for the new achievements today. The Nether fortress was thoroughly infested with blazes, but only a handful of them actually attacked me. The majority of them just glanced at me, watched me a bit, then floated off on their own business. Aren't they supposed to be a hostile mob?\n\nNot that I'm complaining, though... It was nice being able to concentrate in finding rare wither skeletons without being fireballed every other step", "Sana sa philipinas merong minecon at merong mararaming tao na nag lalaro ng minecraft", "looking for people to join on my realms! for some captive minecraft", "Can you put the special effects on the original Minecraft and everybody's getting bored about your original weapons can you put more weapons in like a spear ore guns.can you put in cristal .Minecraft would be the best if you would have more tameble animals like a griffin .Minecraft must make that you can break the bottom of the tree and then the tree callaps it would be awesome!make different tipes of zombies and put in wearwolfes and vampires.", "I have both PC and PE. Worth it!\nThis game was what I was looking for, something that allows you to do whatever you please. Either it's mining, building or seeking adventures. It is complete. Thanks!", "For God sake let us host our own servers using the Windows 10 version like we can using Java.  I had a server hosted at home that my friends could use.  That's what we need.  Until then I'll be playing something else.", "OMG I did this in science the other day and all the kids in my class were asking me who was better steve or alex cause I'm the only one that plays and i said steve cause the alex arms scare me lol", "Oh I would but the Windows Store keeps closing out before updating,,,much less anything else", "Why would you play minecraft on anything else than PC o.o\nControls and the sheer amount of modding-options just scream for this game to be played on the best gaming device.", "So these are the people behind the destruction of Minecraft ?", "What about Update for Minecraft Xbox one Edition? Im still waiting for new things...", "Why u take minecraft off of facebook :,(", "What is gonna be new on Minecraft u guys should make lucky blocks and other mods for xbox360 and ps3", "Look why in every atualizaction says Herobrine Removed ??? Herobrine appears on the same", "My 7 year old daughter LOVES her update! Thank you Nintendo and Minecraft for making her a super happy kid!!", "There are so many hackers spread across Minecraft right now. I thought it was a problem with one server but no. Every single server that I go to, either mini games or classic (Eg: Prison, Factions, ect) there is at least 20+ hackers online, and a week has been gone and nothing happened about those hackers because they are still there. Very upsetting, seriously considering of not playing Minecraft anymore. I know it's hard to catch all hackers but still, it is very annoying. Loosing OP gear, accounts and etc just because people can't play properly. Minecraft is one of my favorite games ever but this hacking issue is really upsetting me. So, for now, good bye Minecraft.", "win 10 sucks more and more, i ll install one of my older unused win7 keys soon", "Problem: Can you destroy things you have built ?\n(Considering LEGO blocks)", "I noticed that two creatures from the first biome settlers pack were added as a feature in the 1.10 snapshot excluding the woodlands beast. Does this mean that the creatures in this modpack are going to be added aswell? That would be interesting.", "i cant dowload the game anymore due to the new dowload i cant use the luncher and when i press run it comes up with download luncher why cant i just have it the old way its much easyer for my computer to acsess", "I am having a huge issue getting minecraft to play on our xbox360 for two players. Understand I am a total noob. My kids both want to play same time split screen. I have an HDMI cable, display set for widescreen in the display setting and HD,  we have two controllers.  My kids are young soo we are not \"online\" so how can they  both play at same time? I cant log on my son when my daughter is logged on, the game does not recognize him from player list.  My thought was does this only wotrk if two Xboxes in the house? that seems crazy if game allows two player and split screen.  What am I missing? Please be kind if I got this all wrong, I am not new to PC gaming just Xbox", "Your latest Xbox update obliterated our world last night. My daughter will be devastated after all her hard work. BOOOO! :(", "Im Playing on Xbox one right now just started a new world if anyone wants to join~ (16+ only please!!) Send me a Message My tag is Blood Promise", "We have been using Minecraft in the classroom for years. As an administrator, I will be checking this out to see if it is easier to use for younger students and how the lesson plan was developed.", "How about you get problems fixed on other versions and help out customers that contact you for help. I'm still awaiting response on problem I have with pocket 3dition for andriod", "I miss the days of Notch. Buy it once, and everything present and future is yours.", "This is nothing to be proud of. Stop promoting PC crap and be a normal business.", "Pathetic you have to pay for Minecraft Maps. Skins, textures I understand, but builds? \n\nNotch I hope you're proud of what's happened to your game, that is if you even follow it anymore you sellout.", "i need help, i forgot my account and it's so complicated, ive even try to buy new one, but nope.", "I was wandering if you can add a brand new Racing Mini-game. It can work similar to that Hypixel Turbo Kart Racers game. Should it be driven by Horse, Pig, or possibly a fully custom go-kart in Minecraft? Please answer Mojang.", "everything in here have mods doing the similar already. I really hope they stop making superficial changes to the game and really open it up to the modders by providing better support.", "Something is wrong with the new update, no matter what file/folder i put it into it always comes up with 'protocol wrong type for socket' there were no problems with this before the most recent update.\nI am using a mac and many others i know have the same problem.", "A few weeks ago, I filled in a contact form about a stolen account, but I haven't got a reaction yet. How can I get my minecraft accounts back?", "Not sure if Jeb is responsible for this, but the 1.10 update looks promising. With auto-jump, Mojang is finally working on unpolished features. I'd be extremely impressed if they did something with floating trees which has been a nuisance since the beginning of Minecraft.", "If you can read this can you make the villiger look like a player and let them talk to you like Minecraft become more real life put that on next update plz", "Dear Mojang team, I am trying to instal a new skin. I play minecraft 1.10.2, but... It is still uploading. Why does it take so long?", "hey Minecraft , I have 1.8.9 but 1.9 does not work for me", "that's some bull crap when you host minecraft in some city no one even knows about when everyone else in the US would've wanted it in CHICAGO ILLINOIS!!!!", "Lol everyone's mad about it becoming a movie. Y'all are pathetic. You will enjoy a Lego movie but not a minecraft one? Stfu always have something to complain about instead of actually enjoying whatever experience you might have.", "Screw that I want to see more texture packs!", "Haha you brought things? I can try this at home and you don't need to be the craziest of crafters to build in creative mode :D", "Melissa Andrus and Josh Morse will you show Jack for me? Thanks!", "I have truly no idea who the target demographic is here. Anyone who gives a crap about Minecraft already owns it on PC. Give me one good reason why I should move to the Windows 10 version, which has less features and is many updates behind, when I already have the PC version.", "Hey mojang could i get some help with minecraft pe its bugged out it says its installed when i have uninstalled it and i uninstalled it because whenever i try to play on it like today i tried to install it didnt cost any money but when i clicked on it it would not work at all just took me to a black screen then it puts me back to my home place please help", "I read the book and it's really cool..Especially the base making trap..", "Make sure to check us out for the most reliable Minecon information!", "It is stupid that servers don't work in Minecraft PE because when I type in the name and complete it and load into the server it always says Invalid name. The servers worked the other day and now the servers are not working anymore. Please fix this. I love the servers but it won't let me play them.", "WHY DID YOU REMOVE THE PISTON TRANSLOCATION GLITCH!!! That \"glitch\" was used in so many redstone advention tha are know broken. It was WAY more of a feature than a glitch. Unless you have a block ment for translocating players, you should add it back.", "Hmm... I wonder if this is hinting at Minecraft 2.0?", "You guys SUCK major right now!!!! Xbox 1!!!! Just saying dont try to add a new profile and than play any preexisting land your boyfriend has been working on!!!! Its happen 2 times that it's either whipped everything out or you can't even get it to load!!!", "i've tested it out and the enderdragon kinda have too much hp/defense", "Gurwinder , Nico , Rj Silberman. I bet something new will drop for PC.", "It would be nice to change the amount of time in a day/night cycle.. 20 minutes is just too short for day & night. I would prefer 1 hour of day, then 1 hour of night.", "hey Mojang are you going to announce the next big update at Minecon for consoles this  year like you have done many years before?", "Can I ask you something?! If I have the WII U version, can I play with someone who has the PC's version?!", "I've done it before well, not writing messages but creating something where when you seen it from the air it looked like the picture out of lava.\nCourse I've done all kinds of things. Right now I'm trying to create the most overly enchanted diamond sword that you can possibly make. Like basically the sword to beat all other sorts  i'm going to do this for every inch Hannibal item there is in Minecraft. t", "Christopher, Minecraft eould be nothing without adults.", "Once in minecraft i was so happy i found the end portal WITHOUT Ender eyes I jumped in and holded break button and broke the portal, but it was online so the ender eyes was already in, I raged lul c;", "wasnt minecraft already sort of educational and a learning progress?", "Do you need to buy a new copy of minecraft for your oneS if you own minecraft on the one?", "Add servers to xboxone and mods \nPlease!!!!", "I wish they would work on the real minecraft game. I don't care for the side games. Every time There's an update all I see is junk. I would like it to have all the thing like the pc version", "My favorite new feature is having to reorganize all the resource packs I created.\n\nSeriously though, other than that, it's awesome.", "I DISCOVERED Very mysterious thing which is used to closed all multiplayers game please allow me to send pictures to you", "Lego Minecraft? That's like making double monocles.", "minecraft eu tenho uma duvida sobre o minecraft existe mesmo esse negorcio de herobrine e lik??? estou aguardando uma resposta", "I love minecraft but I wnat new things added in the game", "The game is awesome! It just needs one more thing . . . Now that the console versions are the same version as PC, can you please bring cross-platform multiplayer between them all???", "They really should have included Herobrine in that skin pack", "Minecraft i have a question cann you make please a demo for browser i have problems tho download it and the cracked version is not starting please help!", "man, you guys have fallen far... making people pay for DLC that would basically just be a free and easy to install mod on PC... M$ really have completely took over the reigns and Mojang is basically just following orders like a slave...", "It's a lagfest. Like seriously. I started a round and when the clock hit zero I was already killed by a sword. I didn't even have time to move.", "Angela M. Leonard looks like we need to invest in getting addison a wii u, she enjoys that more than xbox lmao", "I've had all this stuff on PC (Win 10) for ages now-- my friend and I went on a tour of water temples like a year ago. Granted I haven't seen one in a while, but I assumed that was because I don't spend much time in ocean biomes. Was there an error made in this announcement?", "Hi Mojang please make more texture pack in Minecraft PE 15.0 and add a more items please", "I'm calling for a ban on all minecraft products. Minecraft teaches our kids that it is okay to exercise violent behaviors, in both the virtual world and the real world. Someone needs to make a petition and make this happen. Sexism in video games needs to stop!", "Can someone that isn't microjang (their combined named as dubbed by me) explain the issue with the Windows 10 edition? I have Windows ten but I just use the normal Minecraft not the Windows 10 beta or whatever it's just downloaded and collecting dust in a folder on my cpu lol", "I remember when minecraft was only a 27$ game that you could buy online. Now it's legos, realms, story mode, and now a movie...", "Hi guys. I have been able to play Minecraft on PC just fine for several years, then formatted my computer sometime last year; I was still able to log in to my account just fine at the time, however after a break I recently decided to get back into it with some friends, at which point I discovered I could no longer log in. The saved credentials were no longer working, and none of my passwords worked either. I thought, okay maybe I've forgotten my password or something, so I went to try and access the password reset function. I have tried this over twenty times and the email does not come through after about a week of trying. The fact that my email is not registering a reset option is I think pretty clear proof that my account has been compromised in some fashion. I have therefore contacted support to get my email reset back to its original, and yet I am still waiting several days later with absolutely no contact. I understand it is a busy period, but it would be really nice if the website at the very least registered an automatic response to the support claim, so it can be tracked. Ideally I would like a response sooner rather than later though, as it is getting close to a week now with no response whatsoever.", "Hey Mojang, I'm not complaining, I'm just curious. Why do you not release alphas of your newest content for iOS? Is it something with the operating system that makes alphas for iOS more complicated?", "it doesn't matter. I try sneak attack a creeper from behind but it always lag when I attack so I'm dead when it unfreezes.", "I'm going to get one of these play sets for my nephew.", "Hey minecraft update minecraft minigames china freee and more things and more mini games like five night of freedy game on mini games", "Hey.Minecraft PE has a bug/glitch.I built a Cyristmas tree in my village and placed 6 snow golems with 4 iron golems.I tested a security feature by spawning a creeper but he went too near and my game crashed when the creeper exploded.Please tell Mojang to fix this plrases because I worked hard to make a big modern village.Thanks I hope to see a new update about the bug fixes.", "You use some \"magic\"to make this video", "As a pre-mobile, pre-console, and pre-Microsoft purchase player I feel like the traditional PC version is becoming less and less relevant to Mojang. We used to be the home of MC but now it feels like we're a second thought...", "Nope because when in a cave zombies are least of problems.  Cave spiders are what give you the nightmares or silverfish x.x play safely my gamers", "Wish mojang would email me back. Someone hacked my sons account and changed all his freaking info. Just bought mine craft a week ago and he hasn't been able to play for 5 days now. Ughhhhh", "i've got a question minecraft story mode episode 6 relase date", "Next time on Minecraft Story Mode: Jesse and the gang stumble into a Mindcrack UHC match! The Iron Kurtain takes over the Farlands! Pauseunpause feeds a golden apple... TO A HORSE! Insanity!", "hello and ask yourself how you can dowload minecraft link is not? many links out there just did not use it. If anyone knows the link then send links to your inbox", "Everybody ready to countdown starting at 10?!!", "Honestly, I'd prefer if some of Minecraft's older features were actually, you know, *finished*. It's been how many years? How many features have been added but not completed? Let's see: you can farm, but there are only a few varieties of plants and they only give you a small selection of new things you can craft/do. There is wildlife, but only the basics. Particularly with aquatic life, this is painful (I know Minecraft isn't Subnautica, but if you're going to have ocean biomes, actually put some stuff in it). The number of things that can be crafted has barely improved since the game came out of beta. Unless they fixed it since my last time playing, boats still break abruptly and for no good reason (incidentally, there is still only one kind of boat). And on and on and on. Not to take credit away from what the developers have already done. Just that they seem to have gotten *way* ahead of themselves.", "I can see the News now, \"Man beats friend to death with VR controller, was trying to get a Diamond Block\"", "My minecraft is not letting me load my world. I play the xbox one edition, and all my worlds are saved with a dirt block", "And stop the \"- Removed Herobrine\"", "How old do you have to be???", "I have a question...does anyone know if there's a way to download and install mods on a PS3 for my son?", "Minecraft Story Mode's third episode is the best so far,but that brevity is the biggest complaint, which, if you look at it from the most charitable view, means the game never outstayed its welcome.", "It's not the combat update but the update that made me to hate minecraft ! Axe , the strongest weapon ! Are you guys kidding ? So WHY u created SWORD ? :/", "My Stream Name xRuSHeR_19 live Playing minecraft", "Notch this for all ps4 and Xbox fans and notch yes notch when will we get to make custom skins minecraft consoles like ps4 and Xbox and PS3 or if no custom skins just put youtuber skin pack I think it should be you tubers skin pack and custom skins sound good :-)", "Lol i always thought of Minecraft to be Legos, I don't think theirs a purpose of the game, but that's my opinion. But if it makes Minecraft gamers and the company happy, I guess that's all that matters.", "this server just oppened it is full factions and it is rly good I'm not even keading and the kit's OMG you can get until protection 9 and sharp 9 too. The IP is :mc-supercraft.tk", "Am Excuse me Sir, Ia m a FILIPINO minecrafter how can i fix \"Error: Could not find or load main class info.mineshafter.GameStarter\" and at mineshafter.info i can't do your step by step and so i found vids on utubes and when i did it, It worked! but there's a problem it has crash report! What! how can i fix this? i did all of the vids on youtube and it did'nt work, i miss playing servers and specially minecraft.... i am also a server master how can if ix this? plsss iam a filipino! you can also speak english when saying how to fix this! pls tell me how! Thank you!", "It's June 21 but when is it officially out like what time day or night", "Apple Store always takes longer. So if your on iOS like me we're gonna have to wait a bit longer for apple", "when will you guys add a cape for anyone who has stuck around minecraft for more than 1 year id love to see a cool cape for that with a basic minecraft M logo on the back of it", "Well Eurovision is just countries supporting and hating on each other by not giving or giving points. No real talent and a good example is... that Conchita won.", "It may come in the next year, due to Telltale confirming the rough date of Season 3 of The Walking Dead.", "Ce tare sv de minecraft ! La 20 playeri on event cu grade !!!\nmc.eliteroyal.ro", "Why no team crafted and the pack?", "The offensive bullshit coming out of people here.\nIt's a thing, you were wrong, the argument is over.\nPlease get over it and continue to cling to what remains of your acceptable prejudices because this one isn't one of them.", "I hope they have all the minecraft monster mobs, like the strange ones, like the guardians, the elder guardian, shulkers, husks, and strays.", "When is The Minecraft Battle Mini games coming out for Consoles?", "Too bad the PC platform was so under represented, considering how the PC version is the best, and the PC itself is the ultimate platform. You can take your consoles and everything else, I'll go for the real deal. PC for ever!", "Still not going to remove Jen as a lead developer? No hope for Minecraft. Jens at this point is another Obama. Provided nothing in his position besides disappointments. The only thing I liked which he added was horses, which he only added because someone asked for it and he promised them he would. Sad...", "I personally don't care for Ender Dragon. I'm waiting for functional Book And Quill.", "Stopped playing when all the M$ updates came out and gregtech couldn't keep up", "You bring it to wii u and you don't use the selling point of this version, the gamepad inventory control?!?!?!?\nDon't wonder why it won't sell after SO MANY YEARS and without the most obvious feature you could add!!!?\nJust like watchdogs....", "As others says, it depends A LOT, on what version of the game you play, when it comes to \"secrets\".\nOne hint for all newcomers or thoose who didn't know:\nSlaughtering an enderman is actually easy, without taking damage.\nWhen you eyeball the ender, run and jump emediately to a 2 block high hole, and just hit the Ender's legs until he is dead ;)", "mmm oye como puedo descargarme minecraft no engo dinero en mi cuenta y kiero jugar el minecraft soy adicto al juego", "Hello All\nI have error with worlds creating\nI can't turn off \"Limit World Size\"", "I was at Minecon 2015, I really want to be on Minecon 2016, but it's so far... but if next Minecon will be in Europ I will probally go there :D", "After Minecraft Story Mode Ep.8 end,Jease and Petra in Love and married,But and Herobrine the dark lord rise the power and change Jease become his right hand,Jease join the Herobrine Order, kill all Order of the Stone Petra and fight with Lukas on Lava land,But Jease fail and fatally burned from lava but still alive and Herobrine lead him to wound healing and make him as half-cyborg and become Darth Jease and rule the Minecraft with his master like Darth Vader.... LOL (it is my theory,It maybe make sense for Minecraft movie in 2019,important character maybe be son of Jease with Petra for destroy Herobrine.)", "I play Minecraft on ps3! I've been waiting for a new update for a long time now!", "Look, I know you guys work hard on what you do. Minecraft is great, and you keep adding onto it just for us, which I respect. But I just don't understand..\nWhy just make updates, while you could create mods too? You don't need to always make updates for minecraft.. Have a little fun, take breaks from the real thing sometimes. Because remember, this game is about imagination, it's not a battle. :)", "I'm trying to get more animals in my world, but when I try to breed them it says the maximum of animals in the world has been met. I barely have any animals. And I tried going around to see if I could kill wild ones and I can't find a single wild animal. Is this a common problem? Is there a way to fix it? I'm on ps3 version.", "Minecraft needs SO much more animals than just polar bears and llamas that were added. Odd choices tho", "I have a question , Today I was playing minecraft afternoon but a friend asked me to look at something on your premium account and I spend but apparently I avia gone wrong password and coming and coming and not mejava but when I step While password and coming and I did not even entered my premium account I do ? I blocked or happened ?", "Chris Basedow this looks like so much fun!", "Oh thank god you're not adding kung fu to Minecraft. The new combat mechanics from 1.9 are bad enough.", "i havent played minecraft in ages. how is it on PC or dont they patch that anymore?! or is the windows 10 for PC too? and when yes, why only windows 10?", "Nothing but crashing on the ps3 since this update came out & I'm not even doing the battles just reg game. Auto save set for every 15 mins & dont even make it to the 1st save before crashing. Ridiculous! !", "Anyone having issues updating minecraft on their xbox 360? Xbox live disconnects when it goes to do the update. Anyone know a fix?...it's been a month & 1/2 since my daughter has been able to play online with it. I've called xbox with this issue & have troubleshooted everything with no fix, not happy.", "Instead of this, ALL CONSOLE PLAYERS would definetly love command block support.\n\nThen we could play, not just player created mini-games, but mini games created by you guys as well! Eric and Jens, I'm looking at you. :v", "Maybe its time for a Minecraft 2? Look at the current building and crafting games coming out on steam by indie developers following on from you. You are now Microsoft for pitys sake you can afford to really make something special and the game and its 100million players deserve it.\n\nI mean does nobody in your development/management team think sales like that warrant a sequel?", "This update is so stupid. I DIE every time I try and kill anything! If it's not lag, it's the fact that it's 3 times HARDER to kill anything! I HATE IT! >:(!!!!", "And still doesn't support mods!  You're ignoring a massive pile of revenue and whoever is running this branch should be fired.", "Why in my asus phone a new version minecraft it's always stop working will open ....... please give me a solution", "hi mojang ich hab mier jets auch hax heruntergeladen und es stimmt das spiel spilet man mit haxs nur richtig ich kann im nachihnin die leute nicht ferstehn die sich denken ahhh der haxt dan sind sie auch selber schuld wenn sie sich keine haxs herunterladen wie wollen sie denn sonst gewwinen etwer ohne hax :(", "I want a xbox one pack with a minecraft xbox one cover thing lol kinda like they did with some 360s and other games before", "about time !\nall Xbox games should have this !\nThere are so many other games I wished had this:\nBF3, COD, FIFA, NFS and etc !", "Hello. I a plugin creator and server developer. I'm currently looking for a few players of PC minecraft as beta testers for the server that we currently have to see if everything is running smoothly and correctly.\nMessage me or reply to this comment and I'll send you the details ASAP!", "Still don't see it in the update notes. I want my llama ranch, man.", "Minecraft, please make Romanian Language on Minecraft.net, because a lot of people from Romania play and like this game.", "Can you put CaptainSparklez into a game aimed at children?", "i soooo want this. i love legos and minecraft,so this would be epic for me", "Can you use your keyboard for normal movement and VR just as a display?\nThe guy in the video uses the xbox controller. But how is Minecraft with keyboard+mouse and Oculus?", "hello can anyone help me ? im looking for the link to the minecraft pocket Addison for pc but cant find the one for steam can anyone help me :l", "I should show you all here the pics of my castle at some point.  There are a lot of you who would really enjoy it", "And in that day MCPE 0.17.0 is confirmed", "Can anyone PLEASE HELP? My daughter is 7 and loves this game. I don't know much about it, and she doesn't know the technicalities of it much. She built an amazing world and it took her a really long time. She got an upgrade not long ago and when she got in her world it is completely flooded, and now she is heartbroken and devastated. Does anyone know how to fix This? She also says she can't move her head in the game anymore either. Can somebody please tell me how she can fix her game? PLEASE HELP MY LITTLE GIRL.", "I am all about minecraft but after awhile it gets boring so I think if this account connects to mojang then y'all should consider adding command blocks into Xbox 360 to Give minecrafters something else to build", "hi was wondering if someone could help me my sons minecraft should update on its own on the xbox 360 but it dont seem to have the 1.9 and i dont know how to get it  dose anyone know what could be wrong", "Is this only a whole new world? Or can you use your existing World, that a ton of work has already been put into, and would suck to waste to start over?", "Good skin pack i liked the skin of steve:D", "What was that song called? It sounded so good.", "Minecraft The combat update for 1.9 is so bad, the pvp servers only have 1.7 for pvp, your version has lost x-millon of users.", "The new 1.9 update with the Power to fly, is so fun, but who remembers the minecraft days where you don't even have hunger? Beta", "Hey guys. I want to start a server with some people, maybe 10, and us create a server together. The cost would have to be split evenly as well as any money we make. If you are at all interested, message me for details.", "How you tag my Little loves this game but she's only 9 .", "Yay, is episode 5 out yet?", "Where can I please Minecraft Realms for 30 days I see no testing Button.Was is that !!", "Jeremy i wonder how this would work with the leap motion haha. I can judt imagine you standing there in the study flailing your arms around trying to beat trees to death", "Guys can you do a map for PC version? I'm bored to play everything on singleplayer again and again while I'm in my summer house", "Lego minecraft you will be mine soon!", "Tickets were sold out in 1 minute. :-( \n\nI was trying to make a dream happen, but I guess she will pass away without going to her Minecon", "iOS release date plz tell me and good job with Minecraft good job", "I am WAY too lazy to check the comments. This is a PC edition update correct? Also if so have they announced when consoles will be getting the update?", "Tell em they are bad at \"\"designing toys...They dont look the the Minecraft game at all.", "When we are trying to download it -- we are selecting the Purchase button (it has a -1 in the top right corner), it kicks us back out...any thoughts??  we have tried EVERYTHING!!!", "Plastic moulds. Done. Do you really need an entire Youtube channel for that?", "HEY! I have a great idea for custom Minecarft skin.. you see.. in my idea.. on consoles.. you need a minecraft account.. when you log in with it on MC console.. your skin in PC will be the same on Consoles!! Great one??", "If minecraft is at Nintendo  wii u it will be so good if have it cause I can play in it also # happy", "Everyone knows a minecraft creeper has tnt in its head", "Add sponge in minecraft pocket edition can soak up water", "what Minecraft Story Mode Episode 5 coming is 2018", "WHAT? Changing Texture packs and skins for MONEY? What is happening to this game???", "When you can't think of new ideas for Minecraft so instead you make guides to build stuff. Well-played, well-played mate.", "You don't need a console when all you need is a desktop gaming computer, a TV, a wireless mouse and keyboard, an HDMI cord and a copy of minecraft for pc. There's your perfect gaming setup there", "Big awesome smart gameband i like diamonds ore but now you can made good idea mods Glow or Black redstone", "I love Minecraft but Mojang is Horrible they don't respond to any email and they just suck I have lost 2 accounts now to Mojang for no reason and they don't care about any of us players...", "If this game was rated M I might consider playing it. Although I own it on PS4 and my seven year-old nephew loves to play it. I've literally fallen asleep watching him play it. Horrible game", "At first the order didn't go through, but I kept going back and hitting the green button until two tickets were available.  It was about 8 minutes in, but I have a feeling someone else's ticket order didn't go through.", "\"Only the craziest of 'crafters write messages in LAVA.\"\n\n*Looks at the screen, see's they are in creative mode*\n\nYeah, they're not crazy. A newbie can do what you just did.", "Downloaded most recent update (auto on PS3) and now am unable to view map. New/Loaded maps both. Can create, move, place in usable inventory/hand, but unable to view onscreen. thanks", "Wont buy it till you put out more texture packs for Xbox One!!!!!", "Evrybody says that the wii u suck but ots not true is awsome i like it  coment what you tink or if you like the wii u too", "i bet supernatural is longer than that. well, the show. sam and deadn and cas... but if i were to choose, minecraafftt!", "Mojang's website minecraft.net updated and now has become more difficult to be able to Mecher I can not change my Skin minecraft please help me; -;", "I thought i would quit minecraft cause i couldnt find server download but its just alittle bit hidden on there. XP", "\"Thiz iznt myncraft!!11!11! its juzt a bnch oof cutceenz!!!!!!!!1111\"\n\nYes, this is Minecraft. Yes, this is a game. Just because you don't like story and believe games have to have guns and explosions and some form of open-world, does not mean that Story Mode is not a game to others. If you don't like it, too bad. It's still going to be around whether you like it or not.\n\nSo why not keep those mouths of yours shut, and allow people to enjoy something for once, without acting as if you know what is a game, and what isn't?", "Why i cant get minecon 2016 skin?", "Find the 2 and tomorrow you will get kissed 55555555555555555555555555555555552555555555555555555555555555555555555 count down 10,9,8,7,6,5,4,3,2,1... Now close your eyes snd make a wish! Paste this into 15 coments and your wish will come true! Hurry you have 29 mins or opposite of your wish will happen", "Guys come join RevoltedNetwork IP: revolted.factions.ws  We currently need some donators to make our server officially a network as we already have our dedicated machine for the server. Come join us to have a wonderfull experience, Currently recruiting Helpers.  [Owner: 145], [Dev: CalPlayz].", "yo tengo minecraft premium pero no me yega el correo de que la tengo y ya espere 7 dias y solo puedo jugar el demo", "Hey aaah this skin pack is form minecraft poket edition right but what versions", "That would almost convince me to go Xbox instead of PS4, if it weren't for the limitations on things you can do without a subscription and the numerous ways I've been absolutely screwed by Xbox live in the past.", "Wait they charged money for skins on xbox? What the hell", "I need the trophy for 500 meters on a rail .. if anyone has this rail already up can u please invite me Dvsgurl4u  thanks ps4 only", "The reason for this is that sometimes it gets boring playing as the same old character model so I decided on this wonderful idea to port stuff like the shapeshifter mod to the console and mobile parts of the game!", "I thought the next mini game would be released next year guess not cool then", "Seriously? Sill no Lego villager sets?", "We cannot seem to get our Minecraft PC to update to 1.9, anyone else having trouble or have any advice on what we can do? We have updated Java an uninstalled/re-installed to no avail. Any help would be greatly appreciated.", "I need help .. I used the mastercard to take the game and he is telling me all the time An error occurred while placing order, please verify credit card info and try again\nwhat to do?", "hi guys if you are one of the fans of minecraft buy a t shirt here for only $20 to $30 quick this offer will end at april 4 2016 if interested click here https://teespring.com/mcplayer", "Also hey do you think you could make skeleton horses ride-able on the PC version? (update) I have been told in the replies to this comment that it is possible so i won't delete this comment but know that i retract the question.", "Movement needs to be tweaked. Felt that flying around with the vr set made me sick almost instantly.  Even walking felt a tad fast. \n\nUpdate to bring movement speeds from slow to fast. Helps to make the game a tad more comfortable for vr.", "I changed my minecraft pc username and now it wont let me on my fave server please help me!", "Why can't I get the extra's when I enchant now?? I'm trying to get infinity on my Bow, but the only thing to come up is 'Unbreaking 3'. I add the Lapuz but the ? doesn't add anything. Tried too many times without getting anything and it's pissing me off. Can anybody give advice or is it a bug??", "I still can't believe the developers still work so hard to release updates and really upgrades to every version of Minecraft at no extra charge to gamers.", "Gentlemen, a few days ago asked for help to regain access to my minecraft I believe to have been stolen. I sent my ID on request March 19 and still got no answer . Seeking another way to contact you, but I can not . Please help me!!!", "how to download the minecraft for now money", "Love this game keep up the great work guys", "Its great for wii U users no need to buy a computer or pc or whatever :D", "Hay mojang I was wondering if you could add a sonic mashup pack", "Any news on VR like with Oculus, Vive or OSVR HDK? :)", "Unfortunately the skin selection crashes the game for pocket edition.", "Nothing because I don't play Minecraft anymore", "HELP my friends deleted my mine craft world so I started to build it again I was nearly finished so I went on it this morning made a few things saved it and exited the game go back on 10 minutes later and it's gone please HELP!!", "slowly minecraft has become less challenging i can find diamonds in 1.5-2hrs of gameplay and then kill enderdragon within 6-7hrs....", "When will it be avaliable in Australia??? I'd love to have a copy.", "We need Players And Donators Is Our Server !!! :)\nAnd We will Be Happy If you Donate Some Credits to make the server Premium And Also You can have rank and you can be OP If You Donate In our Server ^_^\nOur Server is For Minecraft 1.5.2 >DarkCrafter.serv.nu<\nWe will be Happy If you Donate In our Server Here is The link\nhttps://server.pro/server/2683693/donate/\nOwner:Skylersawesome\nCo-Owner:Dead1\nPlay now! :)", "Never take a trial from Microsoft.  Even if you remove your payment method they'll wait for you to add another one for something else and then charge you for three years without your knowledge. >.>", "I was playing Minecraft on my iPad. And on Minecraft, it was raining, and I heard a boom on top of my ride that I was working on. On top of my ride place, my ride wasn't destroyed, it was only a skeleton horse, and I thought my other skeleton horse was moving, but my other skeleton horse was in the fence still. Then I looked at a lightning bolt on the ground and it wasn't destroyed, but when those lighting bolts crashed to the ground, the skeleton horses were spawned. And my history I think about the skeleton horses that they came from the lighting in the sky, is when those old horses died, they went to heaven with God. And suddenly, Lucifer the devil came out of the hot place, and then, he went to heaven, and he said. \" God. I'm going to turn this heaven into a heaven nightmare!\" So, lucifer began to turn half of the clouds into hard, hard black rocks, and those rocks were so, so hot. Then, lucifer grabbed God's horses. And then, he peeled the horses fur and skin off. And those horses are now skeleton horses and they were still alive. And those horses never die in heaven, even if they were skeleton horses, they won't die in heaven, either. Then, Lucifer made rain storms and thunder storms, too, with a lot of rain drops and lighting, and thunder. Then, lucifer puts the skeleton horses in the lighting. And every time the lighting begins to crash on the ground, the skeleton horses will come out of the lighting. And those skeleton horses are now lucifer's slaves. But those skeleton horses are still Angels, not Devils.", "Coming to pocket edition but not console?", "Ye I like minecraft I play it all day", "Guys how to download minecraft windows 10", "Come to New minecraft 1.8 \nwe got here:\n\nKit-PvP\nFaction\n\nSoon: Op Prison and sky Block!\n\nwe got all day DP we got good staff and we search for staff so come now!\n\n85.65.111.184:25565", "Justin Neagle Connor Kaye I can't wait for the next cringefilm", "Hello Minecraft players. My name is Dawson Avey AKA bubbadawgz, or zzDRAGONBORNzz over Xbox Live. I am here to announce that my cousin and I are creating a Coliseum Weekly terrain changing server. If you would like to help on this project, hop on your Xbox and message the following Gamertags: XRG Prophet and zzDRAGONBORNzz. Thanks so much!", "No idea why they even started ith microsoft win 10 instead of just continuing developing the normal minecraft for pc. I don't know but i have feeling they hope we all swap to the newer version :(", "It actually works!! \n1.Put your hand on your forehead.\n2. Make a wish\n3. Put this on 10 peoples pictures.\n4. Then look at your hand", "The Two Best Games Together, Dose Anyone Gotta Wii U With Minecraft I Wanna Play With Someone When It Comes Out Today", "Does anyone have any old laptop they can donate to me, plz.i know how play minecraft but i don't have a pc can anyone good people out their can help", "Is Minecraft available for Nintendo DS?", "How old do you have to be?", "Any word about where MINECON is going to be? Most people have to plan in advance, its past the point of building hype, I really just want to get rid all my sons minecraft software, toys shirts posters ect... way  and have him get into something else.", "i  just   got   pocket   edition    couple  days   ago     love  it  one  thing  don't  understand  why  can't   we   use  /gamerule  keepInventory   really think we  should  be  able   use   it   seems  unfair  for   people  hates  lose  stuff  and  get  it  all  back !!", "Make a minecraft story mode skin pack 2 with Dantdm,stampylongnose,more", "Hope they spend some of the money earned on more support staff as currently a 3 day backlog to even look at submissions.", "Anyone want too join my server its 16+ up Must be Able to follow the rules but im looking for new minecraft buddie i have no one to talk too in my game if your interested pm me :D", "I play on the xbox one and yea this is cool and all. but is anyone else having problems with villages not spawning in anymore? started a new map for the new update and poof, no more villagers or buildings to be found.", "I've been out of the minecraft game for about a year now (360). Is it possible to play on a world even though the host is offline yet? This update looks cool and I want to get back in, I just can't play minecraft by myself though. To me, this game's entertainment value relies heavily on building communities and sharing with others.", "Minecraft Hello there. Im a work from home mom with 3 kiddos. My son is 9, and daughters who are 4 and 5. They all have really been into watching YouTube videos on toy reviews. and have even expressed interest in wanting to make their own videos. So... Here I am. I am writing to see if your company will be looking for any reviews on new product? Thanks so much!", "Hi there at Minecraft, have you produced a calendar for 2016, I can't seem to track one down anywhere???", "Hola, disculpen.. Tengo un problema.. Instalo minecraft en mi pc y al abrirlo me dice que hay un error, pero pues me han dicho que mi pc si aguanta el juego", "Downloaded minecraft 1.9.4 but this much catching .My friend downloaded before and I took a week to stop to catch I was wondering if it's to catch it?", "Could you make Minecraft on console modded by making it offline as an option", "Okay I have been thinking about this for a while but in your next update or even if your getting this I think the next update for Minecraft should be parachutes like for example when your walking threw a forest and you walk off a cliff a parachute would deploy and you would fall slowly to the ground without getting hurt", "I love minecraft. Me and my friends can't stop talking about it.  I like having my friends over in my world's. Me and my friends love my Disney world I made! I will make it a server soon. Release date: the 29 of June, or Today! Look up servers, Disney world, and enjoy!", "I'm playing the psvita version , the enemies don't seem very difficult to beat, I'm on level 32, does it get harder ?", "LOGIC GATE QUESTION: Ive developed this logic gate, but I dont really know what it would be its classification.  Two inputs. lets call them A and B.  in order to turn it on, A and B must be on. So its like an AND gate.  But then to turn it off, ONLY A will end it.  B has NO SAY.  What is this thing?", "Honestly if you ask me Minecraft is boring, i just don't see the appeal, now Terraria on the otherhand is way better, it combines the sandbox world of minecraft with action packed bosses and biomes! And it's only 10$ on steam compared to 30$+ minecraft is worth", "o and evil little club are the enamy they are cluns see it in the breaking news in the little club and they do adevenchurs sorry i dont now haw to spell", "300.000 rupiahs to get minecraft premium. It's expensive, or not expensive?\nSorry for bad word. Because im an indonesian.", "That moment when you realize Microsoft owns Minecraft But you Can Play it On the PlayStation 4 in higher definition 1080p 60FPS!", "Pleeese Fix my minecraft v.0.14.2 poket edition beacuse it always blink and then it sends me to my gallery pls fix it pls.", "Dear Minecraft! Minecraft does not work. Something could you possibly help? Thank you in advance for your response! By Luca Majdanics", "I Always Like MInecraft With Playing With My Freinds.I Watch Minecraft Youtubers.So when Minecraft Have Update i Will Update It With My Freinds Then when Its Done Updating We Will Play It Already My Worlds are Good.Build your Own World,Thats Why Minecraft Is Best.", "Would it also work with regular Minecraft? Yeknow, non win10 users?", "They literally just house it in the app store in order to monetise every little thing about it... Good luck to them, but whatever popularity they thought they were buying is not only largely finite but also diminishing over time and likely to not want to migrate... When are these businessmen going to realise that gaming isn't static!?\nIts totally in my head, but i imagine them to be getting more and more frustrated with gamers for not taking their bate.", "Mojang! On the new update for Minecraft PE 0.16.0 i cant go 2 the nether!", "I can't even figure out how to get my Xbox 360 games on my Xbox one. It made me buy the fill version and now I can't pull them off a thumb drive >~<", "Just build straight up and watch the golem take care of everything, seriously, at the most you need like two blocks", "Gonna watch a cringe compilation of stupid kids/fans asking idiotic questions later.", "I really wish I could go bit I live in South Africa. :( If only the minecraft gods can give me a ticket.(the minecraft gods are Notch and Jeb.)", "This actually sucks, this basically hurts me being on top of USA as an Canadian and this MineChest is for USA only :'( as well its just items and a shirt that you can easily go buy at stores... nothing really exciting so its a win/lose for me", "Win 10?  Why does anyone care about... oh, yeah... Microsoft own them now.  I forgot.", "coooool i play minecraft pocket edition for years and you do the trailer", "hey im having a really odd glitch in my mincraft where my chunks load in and scatter themselvs across the map then change at random and im really confused on how to fix it", "IP:evermine.serv.nu \nNuevo servidor PVP SUERVIVAL EXTREME!! (Habla hispana)\nEl survival como nunca lo haz vivido. \nEstamos empezando, ayudanos a crear una excelente comunidad!", "wish I could have gone sooooo bad!!!!!!!!!!", "hey Mojang you know how you can make the Nether Portal you actually can but i saw that the end portal frame is there for PE but the ender eye isn't i think if your going to put the frame then why not put the ender eye?what i'm trying to say is that  you should put the ender eyes and pearls. hope for the best!", "good now put out more (Console) texture packs! Plus i love the fact on how PC's sales are being slaughtered across the board!", "Why haven't they made this game harder yet? These features completely improve combat mechanics to the point where it's idiot proof. Mending? In a resource based game? Why on earth would you add mending for an unlimited durability item in MINECRAFT? How about making mobs harder? Stopping massive monster spawners?", "Hi can you give me  a link of Minecraft updated plssss", "So that's what is in a creeper", "please i need a premium account in minecraft", "i can't even play it on xbox one every time i go to load up a world the game crashes on me am my old xbox 360 world's freeze and send me back to the dashboard have the time plz i love playing minecraft i hope this can be fixed soon !!! or can any one help me on this ?", "i had minecraft for years and today i decided to go back when i log into the game it say demo version on top of that in you main page say I dont own the game when i actually do...... -_-", "CAN ANYONE TELL ME WHY MY MINECRAFT PREMIUM DOESN'T WORK I AM AFRAID THAT IS HACKED ...", "Will there be one next year? If so, where? Thanks", "I don't see the point of VR on a pixelated game. I love Minecraft but I'd kill to see VR coming to simulation games that actually need it. I'd love to fly without useing a mouse to look around. Minecraft is a simple game for simple joys.", "gALERA ACHEI UM SERVER BOM PARA JOGAR IP-RATOLANDIA.COM.BR  VS:1.8", "why shouldnt we play with lava at home? seems completely safe to me.", "This is an absurd: I've bought 2 copies of MC on PC, then a copy on Xbox. But to play it with VR I need to purchase Win 10 edition, 4th copy. Or... mod the PC original version up.", "Now they just need to bridge the gap of Windows 10 to Xbox, I know a few people that use it on Console, I would buy the 10 version if I could play with them.", "I really don't know how to change the skins can you help?", "Great, a reminder that a number of us have no chance at youtube popularity no matter how hard we try.", "Minecraft after Happy 26th Birthday SCTV Indonesia August 24 2016. Minecraft go to Minecon from California 2016.", "When I read this post, I thought it said, \"Minecraft Win10 is now 10 years old!\"\n\nI had to check the calendar to see if I didn't skip my mom's lunch.", "1.1 and now 1.10 later on in future when it gets to 1.99 or something then 2.0 now that'll be so cool and I can't imagine what there will be", "i wanna start a survial server with multiple people with mics that will play daily and make it epic if you have a group comment and let me know", "So much hate for Win10 Minecraft.  It's pretty sad, it's not even that bad. It's just making the change away from JavaScript. Sure it's just copying what Mojang had already made, but it's still Minecraft, what difference does it make?", "don't encourage them. windows 10 is bad enough as it is already.", "Minecraft story mode is the bestest of the bestest stories I have ever seen", "If it's in creative mode, i would try but all of my things i build would take way to long. But i could try to make something in that time, it just wouldn't be my best.", "I bought minecraft and have the purchase record in my email, but I forgot the password, and you do not send another password for me to recover the account, I need help!!!", "Any idea when the Chinese mash up pack is supposed to hit the PS Store?", "Minecraft creators ur the best!!! I have minecraft on iPod minecraft Pe and on Xbox 360...lost my controller tho so when I find it minecraft here I come!!!!:)", "(epic trailer voice) In a world, where YouTube and Google exist, with the ability to find just about anything Minecraft related online, comes a book everyone should have, teaching you things you already needed to know, and probably searched for on the WIki in order to start the game. For just $99.99, you too can keep ahead of those pesky Creepers! (extra fast) Coming to a store near you.", "Can you make MCSM skin pack in MCPE hope you reply it thanks", "But I have already bought the game a while ago. When I open it it tells me that something's missing and that I need to reinstall it.", "I know this has nothing to do with the Wii Mode, but I need help trying to get my sons account to work with Realm.  It keeps asking for parental permission and I put in my email and then try to confirm with my cc# but it keeps telling me there is a card error, when there's not.  Therefore I can not give him parental permission.  Any help would be greatly appreciated.", "So we buy Minecraft for our 8 year old and I set up the account and a few months ago it stopped letting him log on to the PC Version but his mobile version still works after more than 30 attempts myself with contacting their company via email and calls my son pleads with my husband last night to fix it so today Brandon Brooke calls Minecraft himself and they say we need to buy a new account for another $26 something or pay $100+ for them to trouble shoot and re activate the account. See they deactivated us. For no reason! And cussed us out and told us \"it's only like $20 quit being cheap pay us\" SO PISSED right now! they are a bunch of thieves.  And they just re-routed us to a scam number.", "Anyone have minecraft on the 360 and wanna play?!", "... the zombies wouldn't leave that cave in the daylight no matter how close she got... and that iron golem could handle them easily while they burn, just grab the pig and climb a tree. :p", "yeah... spend one day writing command on command block and then just one click and BOOM !!! magical can happen...", "Thanks for keeping me updated also a question will there ever be like a campaign for minecraft I meantime halo and textures?", "Please make a realms more cheaper than now ... i want to buy minecraft realms instead play a community server", "I love mojang team #long live mojang and minecraft", "I'm playing minecraft pe and when I click it, it just goes back to my home screen. Halp", "Where can we post pictures of our kids minecraft  creation", "I've done mining for months and I have more than a full stake and forty-nine diamonds, fifty-two emeralds,two staks of block of iron , gold,redstone and coal.And I've done a cool hause under the graund.But you will never belive me for this------I faund to the mines quartz, I dont now if is a glitch or what but is true.", "All you wonderful players are welcome to join jupitercraft.mcph.co a friendly factions survival server with MCMMo, timber and more. We look forward to seeing you! :D", "Hi Im just wondering why my minecraft pc wont work when i load it it just says Error and wont load the world sucks i spen 25$ buying it and i cant even play it :(", "What version of minecraft pe do you need to play the beta?", "Can't get it to work, keeps crashing on startup every time. Have reinstalled drivers, oculus software and all versions of Minecraft on the computer, still crash on startup. Please help...", "Why are updates so slow on Minecraft? Do they have like 2 people working on these things? Microsoft bought Minecraft for over 2 billion dollars and still takes 6 months to add a frikkin horse. Come on.", "Mine craft Windows 10 edition is mine craft pocket edition. The different is that Windows 10 edition is suppose to be the version that makes Xbox and hopefully ps4 all able to cross platform play with each other. That way they don't allow mods on the Windows 10 edition so you can't hack against console players. Which is also why it's $10 less than the Java Version.", "Sam hollway is my friend how lives a cross the roed", "My 11 year old son started a Podcast about video games including Minecraft and Lego Dimensions - if you are looking for a fun safe podcast to listen to with your kids, give it a try - we are still working out the sound but appreciate any new listeners - new episode should be showing up by tonight! Thanks!\nhttps://itunes.apple.com/us/podcast/the-insane-arcade/id1088726516?mt=2", "But that fact Notch! Mojang he left, but I know where it is? in his luxurious villa he paid for a whopping $ 85 million ???", "Hi\ni need help and i dont now how to contact you,i dont have your support mail\n\ni buy the game frome your web site\ni installed the game on the 29.09.15\n\ni had a proble, with my computer and i installed the Os from the start\nand now when im traying to play its in demo mode and i cant play the full version\n\ncan you pls help?\ni have the ORDER RECEIPT and the Transaction ID", "none of you can even tell the difference in graphics between PS4, Xbone, or PC,\nand if you say you can you're an elitist prick and most likely a PC gamer.", "I am very new to minecraft does anyone want to be my buddy and guide me through it. I really need help.", "Pls help me i want to join minecraft on pc  windows 10 but the minecraft has a problem with the graphix crard and i updated but there still the problem help", "Pls fix the bug with pistons. It is getting stuck. If u stack sticky pistons for example 3... The have red stones to activate the other two as they stretch, those two get stuck and does not retract.", "Did this few days ago :)", "hey guys. i just found something. check this out. https://fastfilez.com/9DIN", "Modded on the pc all day long.", "I wasted $ for nothing lol yay.", "When I try to load a multiplayer map, my game crashes and my launcher says, \"Unable to laod block....\" and so on. can anyone help me?", "I liked when Minecraft was the ambition Survival game. Too much stuff now.", "I do gotta say that in my opinion, 1.7.10 is the best Minecraft because of all the mods. If I had my own router I'd create a pretty cool server, alas I do not.", "So not only do they screw up the Hunger Games mini-game by giving it way-too-small maps and too many chests, but also rename Spleef to... Tumble? We're \"falling\", not tumbling... Like who the hell came up with that name??", "Still mad about the 1.9 update that implemented attack cooldowns...", "Well, i think the game is totally ruined now... At first Notch left, than Mojang is bought by Microsoft and now you joined politics... I dont have anything... i mean i have. Big number of MC players are children that dont understand politics and you are joining leftists propaganda...", "Can't wait till the 4th of October man", "I hope that answers and knife this in minecraft pocket edition porfavor minecraft pe had been much better with these things porfavor ask notch several people of Brazil asked it to me", "But they just made an Iron golem, why whould they need to do something else? It can kill a few zombies without problems if they stand back...\nAlso, it's daylight so those Zombies should burn up in a few sec.", "plese just let the cape be the one in the minecon logo and not the one spotted in the leaked pictures. ok thx", "do it in survival mode then i might be slightly impressed lol", "Don't know why c418 volume beta theme songs are not in minecraft Xbox one edition?! Anybody knows?", "When will there be a fix for xbox one cloud syncing? You make BILLIONS and there still is not a fix? Do all the xbox customers not matter?", "hey minecraft when i go into minecraft the blue loading bar goes across and then it just kicks me out of the launcher pls help me", "This \"game\" came out defected! Not happy....returned it 3 times at different stores and each New Disc was defected with freezing and bad time lapse with voices. Returned last one and got different game for my daughter.", "My son is locked out of his minecraft account, the email he was using for that account is no longer valid ( the company sold to another 3 times) its not letting me log in at all and will only send a change of password to the old email we can't acess! Help", "What are some family friendly pe servers my daughter can join? She was on lifeboat but there's waaayyyy too much nasty stuff being said on there. Thanks", "Omg I love the new update 1.11 and I would like the camping update \n\n1 camp fires \n2 shot guns \n3 tents\n4 new mobs\n5 ect.", "Im so ready but its the end im very very very sad one of my favorite games ever will end :(", "Will, fortunately,I upgrade my computer to win10 last week...", "Well, I guess I won't be playing minecraft any more. The 1.9 update ruined the game for me. Going to be playing modded minecraft from now on. THANKS MOJANG, PROPS TO YOU!!", "I hope that the PC/Mac version is exciting. It's been a long time since I found the new developments exciting. But I'm not counting on it.", "This sums up \"Minecraft\". Once good, Friday updates, and a decent community. Now it's a bunch of little kids who want to be twenty different non-existent genders.", "Give me link for download minecraft please T_T", "Annnnd Minecraft is officially dead. Gg folks.", "i love doing fun build in creative mode but will go back to s mode for later =)", "Come check out my creations I make famous things using minecraft follow me on Insta rebelgamer9 u won't be disappointed", "All join my server 1.5.2 >>>>>AngelCraftPvP.serv.nu<<<<< Open Now October 1 2016", "Hey Minecraft when will the realms be working again? They are not supported by the 1.9 update yet. Do you know when that will be fixed? No rush. Just wondering.", "I have access to Minecraft 1.8 Client Metro download. PM me if you are interested, I'm willing to share it with you. :)", "Me and my brother liked episode 5 i cant wait for 6,7 and 8", "Why theres no Minecraft in PSP?", "the one time maybe Minecon is near me the tickets sell so fast. Last year they were still selling tickets the day before.", "Join server minecraft 1.8 survival Normal ip: Mc.BlueGaming.Ro! (Non-Premium server)", "Do you know when episode 7 of Minecraft Story Mode is available please?", "Please don't ruin this game for me.. Stick to your field and stay out of politics please!!!!", "besa tu mano (izquierda) 2:di el nombre de tu amor 3:siera tu mano 4:di el nombre de un dia de la semana 5:di tu nombre 6:abre tu mano 7:pega esto en 15 comentarios yes el dia dijiste te va a decir que le gustas y te ba a pedir que sean novios.si rechasas esto te a ir muy mal", "Got the latest patch for PS3 awesome but the world is already rendered. Any plans to make the PS3 world bigger so the game will add the new biomes and underwater temples?", "Hey if you like minecraft come check out my channel! Type in KalebMorrow into the search box and enjoy minecraft and much more!", "I've already started medieval-style projects, but I'll snag the book anyway just to make it official and my Minecraft book collection more complete. ;P :)", "I have continuous problems with being unable to join a friends game or battle, even when one of us has an open NAT type. Connection to server lost. But all other multiplayer games let us  join without fail. Very, very frustrating. Don't recall this happening prior to Microsoft ownership. :-\\", "Hi there .. just wondering if you are going to put glass stairs into the game as im building a glass place and realy need glass stairs .. pleaseeeee ... thank you in advance ... hugs", "When can we see the new stuff in the console edition? Also, I'm still getting a bug where when I have glowstone in my hand, when I'm in a lit area it looks normal, but when I'm in a dark area it looks black. Can you fix that, please? It somehow escaped the last two rounds of bug fixes", "I am unsure on how to submit a website bug as it only asks for game bugs. I use the SAME browser and computer every single day and it STILL asks for me to enter in my security information because it thinks \"it's my first time\".", "What so you have to buy 8 Minecraft for the story? Why not just buy the best and only 1", "Nine charge bend eh djsydk mndasjw lpolj zxssirhddurjdiiijsjsje dyebhejejejjejejejejjejdjejdjdhhhehsiaijeoeekmekd", "Three more? Three more extra episodes? That's what eight? My word The Walking Dead only clocked in at 11 with two seasons. If this has \"A SECOND TALE\" it'll be 13.", "Mine didn't get updated and the updated wasn't in the app store why plz reply", "Well i can see why.... The current population of China is 1,381,588,762 as of Thursday, May 19, 2016, based on the latest United Nations estimates. China population is equivalent to 18.72% of the total world population. China ranks number 1 in the list of countries by population. So thus must be a grab for a few more millions of dollars eh?", "I like MC and all, but given the choice between a wine and steak festival and MineCon...yeah...", "I knew that this was coming soon. Mojang has made me proud of them for finally updating their website!", "lol, the first time lego actually depicts reality XD", "I hate this update. Now during parkour, everyone pushes you around. And shields. Forget about it. Minecraft went down the drain on this update.", "happy birthday minecraft xbox one edition", "hello my name is Simi and I have an idea for a new version of Minecraft my whole class (6.A) 27 minecraft love children, so we thought of minecraft ring (minering). together we came up with 230 crafting recipes, and I think are good, we came up with other things but that's will not write because it would not fit me here :D. Can you simikasl inscriptions on Skype or on FB. PS: sorry for my spelling in English I have 4", "Vance Freire. They just added the best thing to minecraft... LLAMAS!! Hahaha. We need to play soon boo!!", "Talking about demons, they should be added in the Nether", "Im very intrested why minecraft pe 0.16.0 is updateing when minecon start.If somone know write comment Im very intrested.", "I see Dan the Diamond minecart and Captainsparklez!", "I wonder how much farther they would be with this game if they spent skin pack resources on other things. 0.o", "How about some holiday themed items so that those of us who run servers can give out gifts Durning these holidays.. stuff that cannot be crafted or found in game.. like maybe special candies and masks for Halloween, it would be awesome to have official Minecraft items to be able to be put on custom command block villagers to barter with on the holidays.. and don't forget us PC players!! :)", "Im glad LEGO has such sense of humor. Making lego sets about something, that made their product pointless. :)", "I saw achievement hunter play it. There's four kinds of heroes in the game and you could only be the one who follows the footsteps of the one who fights monsters with swords and shtuff.\r\r What about Redstone? I would totally beat the bad guys with Redstone contraptions.", "before i get hyped, will the seeds on PC work the same way on wii u", "Not following this for cobalt updates. Stick to the Minecraft updates pleazzee. I tried and didn't like cobalt.", "Tried both days the moment the button turned green. No tickets. My 7-year-old daughter is devastated. There are probably 12k Minecraft fans within driving distance to Anaheim alone. Why not two or 3 events each year? West coast, east coast, and the Midwest? We would be happy to attend anywhere in the USA. Extra disappointing considering all we've invested in Minecraft/Mojang over the last two years. Maybe it's just time to stop the Minecraft madness in this household.......", "I have the skins, i use the Jesse with white t-shirt and i make a world with the Jesse's treehouse! I want to send you a phto but this Facebook is so... >:(", "PLEASE PLEASE PLEASE!!!, make the next update like vehicles or lucky blocks PLEASE", "Ok went to buy it and it's in ero money is there away to use US dollar????", "Took me a long time to build everything in my minecraft world. Somehow it got corrupted and destroyed most of my progress :'(. Time to start over. (This didn't happen due to this update BTW) I don't know why it happened.", "I love this story mode minecraft its awesome", "how to add the version 1.9 in minecraft ps3 please?", "Okay but you missed the chance to give the Xbone a skin\nLike cmon thats the point of bundles(most of em)!", "My boy plays minecraft (I know zero about it) he has the version the PS3 edition, he wants to be able to build moving vehicles is there an upgrade I can buy?", "The PS3 edition public online update was awesome... Are you working on public survival/creative mode? \n\nPlease tell me you are :)", "I downloaded the update here in North America and no where on my menu does mini games show. I tried to download a map pack in ps store and it said I couldn't because it was undergoing maintenance. I deleted and reinstalled the mine craft app and it still isn't showing the mini game option at all....any suggestions? Or is it just not released in North America yet?", "Too all the minecraft fans look me up on ps3 MrMsBlease2", "Could you see if someone maybe has a minecraft account not in use? I know someone who really wants to play, but is unable to buy it </3 it would go to  good use, I would be sure they didn't mess it up", "Minecraft in virtual can you fathom the possibilities you can create a model of Hogwarts and walk through it my poor nerdymind just got blown", "hello I am trying to buy the version for windows put the card information all right all right but unfortunately is not getting why ??? I typed the nick everything right !\nNote: Card and international !", "Are you guys going to fix up minecraft ps4 edition? The cursor is going so slow when I'm in creative or survival and I have sensitivity up to 180% and now it's too slow!!! Please fix this soon as it's the only version I can play since I can't keep right clicking to plant blocks for hours anymore since I have carpal tunnel syndrome.", "who cares when nintendo is making a new console?\nwhy buy wii U games when the wii U is about to be obsolete\n\noh also there wont be any mods and there will be DLC which i hate\n\ngive me a full game, not half a game and then charge me more for the rest of it like you did with smash and mario kart 8", "Please don't stream on my face.", "Why dose the App Store now show Minecraft needs an update", "i found new dupe glitch u take dispenser facing upwarts and place another dispenser place it next to other dispenser (new disp must also face upwarts(MUST place disp by clicking on to the other disp)", "ku? jadi duta shampo lain? hah? haahahaha ups... dulu pernah coba shampo lain, dan ketombe ku juga sempet ilang,dan kotembeku datang lagi. aku sama Pantene ajahhhhh, rambutku ga ketombean lagi,gak rontok lagi.\n\nAda kelezatan baru,Mi sedap white curry,dengan belasan rempah,begitu fenomenal creammyyyyy, membuat lidah menari nari, mi sedap white curry. Sedap sedaap, nikmatnya, lezatnya mi sedap white curry.\n\nSakit lagi? Kuman penyebab masalah kesehatan jadi lebih kuat dan sulit dilawan karena itu Lifeboy hadir dalam kemasan jumbo baru memberikan 10% lebih untuk perlindungan terhadap 10 kuman penyebab masalah kesehatan hanya 3.000 rupiah.\n\nPanas membuatmu mudah berketombe kalahkan panas dengan Clear Ice cool menthol dengan nutrium ten dan menthol jadikan kulit kepala tak berketombe terasa dingin dan segar... Clear kesegaran maksimal tak ada ketombe.\n\nIni malika.. kedelai hitam berkualitas yg saya besarkan seperti anak sendiri untuk membuat kecap Bango yg melazatkan masakan karena rasa tak pernah bohong teneng noneng noneng Bango benar\" kecap\n\n:v bot", "The one thing I've always wondered and thought would be cool, if they made the ground limit higher like how they did with the sky level was made 2 - 3 times bigger, I think it be cool if they did that with the underground level. \n\nWhilst adding new types of caves, underground biomes, and also making Ravines wider and possible deeper, because when I ran into a Ravine that was 3 times wider and 2 times deeper, it was epic.\n\nOh, and add new minerals and stones X3 And one thing I think would be Soooo helpful. \n\nIf you can reverse craft metal materials, like say you can smelt a bucket or a cauldrons, and you get all the materials back to craft them, but say for armor and swords, if the durability is high or low. \n\nIt will depend on how much percent of the materials made to make them you get back XD \n\nBut the materials to make these reverse crafting tools would be made with the new materials to use for crafting recipes, being resistant to heat and more durable than most stone and metals, ores and so on.", "i dont know how to pla minecraft on facebook help me mojang plssssss", "YAY !!! i won't sleep until they release minecon live streaming on youtube", "Man, you remeber dis game? John Werner", "I wish there will be Minecon 2017 Philippines please Minecraft there are so many Minecrafters in the Philippines waitng for thi", "This convention needs to be bigger and more tickets to sell as minecraft is so popular now!! Sucks, would've loved to take my son there. He's 10 now and have been playing this since he was about 5!  I guess we will try \"next year\" again. But please have it here in Las Vegas!! We have a 3.2 million sq ft Convention center! Please do it here next year!! LVCC!!", "Hello minecraft peoples where should i go for questions about system requirements of FTB  or how much ram/ video ram I need for \"x\" mods? I thought I had a powerful PC until it kept struggling with minecraft. it would stutter and take awhile to load things. I play with alot of mods and play in windowed mode while i do other things (surf the web, watch movies, listen to music, play WoW, work from home job, etc) so is a 2.9ghz dual-core cpu, 1gb video card, 16gb of ram not enough? how much do i need? probly at least double that huh? I'm pretty sure that the more things you add- the more it taxes your system. :/", "Great I was just charged full subscription price 5 days ago and to top it off we cannot log in on minecraft.net - but can log into the game and play??", "i had launcher and what will be nice name to join in servers ?", "1.9 everything is amazing EXCEPT for the new control and combat... totally ruins the minecraft gameplay most people in big servers are saying this too. Even normal players are starting to quit servers with  1.9 and returning to 1.8.9/1.8 even 1.7.10. In my opinion the combat style must change! Until then me and overy 573 people are not playing! Good luck!", "i hate this because i don't no my email it was 7 year ago and now i can't cheans my skin (i am dutch i can type as good as wel)", "And yet again console versions get left in the dust, so much for the promise of having consoles up to the tu as pc by the end of 2016, more and more reasons to quit, not that it would matter to the company as they already got the money from us buying the game", "So when are we getting Mods like search in the search bar of Xbox or PlayStation. Like When are we getting it cause I really want crazy craft in Xbox and PlayStation and maybe wii U", "I often let my wife's brother play on my Xbox one. he's nine. he asks, Jack, do you have any texture packs?\n\nand I laugh and laugh, and tell him we don't spend money on minecraft", "Hey Minecraft. \nWhen is the console getting an update? And will the End City be added to our existing worlds, or do we need to start again?", "Why this???\n\nGive splitscreen multiplayer support for those WITHOUT HDTVs & HDMI cables instead.", "Goodmorning...i lost my email and password linked to a premium account...how can i get back my account?", "Like yuo mojang i played mincraft when i was 4 on my pc and pe", "I have Higher version on this minecraft pe 16.5", "Need some skins that don't get killed when wearing armor. Makes the Steve with black shirt useless....", "this year's song, ukraine, was a very odd winner since the song was mediocre in comparison to other songs, but the fact that it broke the rules of not singing about political stuff (yes, including ppl that flee their country/immigrants etc.), besides that the song as a song itself wasn't the best.. but on the contrary this year eurovision had several songs better than every song from 3 years back, I felt some degree of eurovision-feeling to this years edition, as compared to 2013, 2014 and 2015", "Wait wait wait, so first, Tetris gets a movie. Now Minecraft?\n\nAngry Birds I can get. It does have a story. Even if it's a bit of a throw-away one that's just an excuse to do what you do. But Tetris and Minecraft don't really have stories.", "My Nintendo e-Shop says Minecraft dosent exist!", "Hi, we made a new building guide for Minecraft. Look here please :)https://play.google.com/store/apps/details?id=sayzen.buildguide", "i don't know why so many people are opposed to this. as far as i'm concerned a festaval about non-straight people is at least as justified as the various nerd thing conventions.", "i played this when it first ever came out of course i didnt pay for it and well the game was probably best in 1.2.5 but after that big bugs in the game appeared everywhere and i play 1.5.2 with alot of other people because people dont like updating", "I loved it but why does windows 7 not get it???", "MCCE - Mc clock edition, with HD display 1x3cm (advice: you need a microscope to play on it)", "Holaaa capaz alguno pueda ayudarme. Pague por el minecraft para mi hijo y cuando lo fue a abrir en la tablet le dice q el mundo no se puede abrir! !", ":(I cant't install java in my PC, everytime", "192.99.47.146:40822  is new server plis \nenter if they want to play a good survival only 12 people : c", "It would be so nice to have more options than anaglyph on the PC version.  Even just side-by-side frames would be so great.", "Coloquenle to minecraft animation is more better and graphics too.", "Looking for people to play minecraft on Xbox one with 18+ please I don't play with little boys lol dm me for gt.", "I only want to be able to play minecraft on my pcwith my xbox controller", "This was a ridiculous way to sell tickets.  My 8 year old thought she had a chance to get tickets; clicked the button and was greeted by a follow up screen that didn't let her select tickets...just said tickets would go on sale at 12pm EDT...by the time navigated back, greeted with an \"unavailable\" sign.  THEN the next 15 minutes were spent refreshing the screen only to be presented intermittently with the opportunity to select a number of \"freed up\" tickets....only to be met with a \"your time and quantity of tickets are not available.\"  Disappointed, Mojang, that you couldn't come up with a more equitable system (perhaps a lottery?) for distribution of tickets.", "please for a new update if can could there be like actual spawn car normal white or black and a police car to drive in just like the boat how u move it but with a car as well alot of us would love that", "I've been having problems with the 1.10 update. The game keeps crashing saying something about Java... help?", "Of course it's a Deathmatch mode in console exclusive content. This is the gaming generation that put a multiplayer mode in God of War; I guess it's not a bad thing, it's just kind of an obvious move.", "I miss playing this game...my computer is so fragged :(", "you do realize the modding community has existed almost as long as the game has, right?", "COME ON THERE ISN'T REALMS ON MCPE", "I love minecraft multiplayer sky wars", "Looking for a minecraft server?! Send me your username! Looking for Survivors! Pc players!", "Lol I would just grab a sword and kill the mobs", "My son has many Lego sets but the Minecraft sets are his favorite. Just because there is a video out about it doesn't mean that all kids like games or know how to play them or even have the money to get the game so yes, Legos was very wise to come up with because I'm sure they are making more money then any of use. Good job Minecraft for all the new and cool ideas you guys come up and thank you for putting a smile on my kids face. Most of us in my house play minecraft on ps4 and I even play with the Legos with my son.", "Intra Acum pe 193.84.64.113:25565 este un server de Survival la 15 on facem event grabiti-va timpul nu sta in loc!", "I have a question, if I buy my minecraft premium online then I can get my minecraft premium from another computer?", "Can place more character animations please if Steve and performance, is that everyone gives me loads very lento.Minecraf is one of my favorite games cosmically because I have few but the more I play that is Minecraft with my brother, interconnection or with my friends.", "so it seems you guys forgot some stuff in the windows 10 port , like maps, and enchanting tables.. anything else NOT in it?", "Microsoft needs to finish catching the Windows 10 edition of MC up to the Java one and add a modding API so we can start getting mods into it as well. I love MC, but the fact that it's java has always been a problem for the game's horrible performance issues, while the Win 10 version runs great! Unfortunately the Win 10 version has been limited to only having the features of a massively outdated version of MC and has been slow to catch up. I'm not sure how far along this update get's it, hopefully quite a bit. Still though... Until it's 100% caught up I don't see why I would play the Win10 version instead of the original. The performance is bad, but in vanilla it's not game breaking so why giveup cool features?", "Reading through the Article, the \"Remote goes missing\"-Line is invalid, as you can use the WiiU-GamePad for that (it's that little TV-Button next to the Power-Button on the WiiU-Gamepad, that gives you an overlay, that actually controls the TV like a Remote).", "Im still not able to comprehend, the reason for existence of lego minecraft.", "I know this is about an update, but I've googled the crap out of this lol. If ender crystals aren't in the console addition can you resummon the dragon? I beat him and can't find the portal to the end islands so I need to make another one", "Hi all........ i want to by an account (minecraft) any ideas?? I cant by from the mojang......you see the capital control dont let me use my card or paysafe.  Or if anyone has an account to by it from him?", "Sounds like an impressive update, but I wish you guys would increase the build height to 256 blocks like on the PC/consoles version. If you do, I will be able to convert my worlds to Pocket Edition without loosing anything placed above the height.\n\nIf you are worried about performance issues, I recommend adding an option to use 128 or 256 for a specific world sorta like how you did it when you made Pocket Edition worlds infinite. However, it would be nice to have an option to convert worlds from 128 to 256.\n\nIf you did this, you could allow people to officially transfer their worlds between platforms rather than using 3rd party software. But to do that, you would need to have all blocks avaliable in all versions, or do what the 3rd party software does, and replace unavailable blocks with a placeholder.", "Only the craziest of 'crafters carry a compass to the nether, mine netherrack with a non-enchanted diamond pickaxe, and use cookies as food source.", "Jeb do you have PC edition? if you do please advertise mineverse.com server please!!! its an amazing server!!! from (Quoik my Mc name)", "Are they really doing a Minecraft Xbox and not painting it to look like a Minecraft block?!", "Story mode is Meh at best.\nPlease spend the time more useful and give us more blocks, tools, minerals, animals, etc... Aka, content to the actual Minecraft.\nLet's start with stairs for everything, then fix fences/stairs underwater.\n\nThink about why people play MC.", "yay!!!!!  My son will explode when he finds out this exists - and that we may be able to go! Awesome.", "Remember when Minecraft said we would be getting huge console updates at Minecon this year? Where is that promise at?", "Can i ask you:did you can creat a more ore like a rainbow ore it really hard to fine and just have 10 in 1 world?????Plese hear me!\n:))))))))))))))))!!!!", "This would of mattered 2 years ago... But MC really killed off my interest with just 2 distasteful moves.", "will you be able to play with a friend who is on android and the other friend on xbox one? or crossplay xbox one, win10, ios and android?", "So this update will only work in Windows 10 correct? \nMy sons laptop has not been upgraded to Windows 10 and keeps getting Java errors and it shuts down when trying to open his world in minecraft.", "Sorry cannot buy it, every time I try it keeps going to the Windows 10 store.\n\nSo no will be sticking with the better versions thank you, until you fix that stupid choice.", "sorry that didnt make sense its i would like some and Ashara World and always Sorry", "Only for Pocket edition and Windows 10 edition? Updates for the regular PC version no longer available?", "Dude come on this is Minecraft. You don't have to agree with whatever someone else's belief system may be. You can make Minecraft whatever you want it to be, regardless of whether or not someone agrees with your opinions. That's the beauty of Minecraft.", "Well currently i tried logging into my account in minecraft it says not correct pass and email.I tried getting it back using my email adress notch or anyone please help meh :(", "I really hated episode 4 'cause Reuben was (SPOIL WARNING! CONTINUE WITH CAUTION!) dead... :'( :'(", "I found a bug in the iOS version of Minecraft. When you go close enough to the stone button, you can look inside the button.", "Heaven forbid they bring the other versions up to speed with PC before continuing to update it. Get a grip, PC players. I play both PC and Xbox versions and I'm ecstatic Xbox is up to date now so I can use all the new stuff with my friends instead of alone or with random people on my PC.", "Why play minecraft when you can build whatever you want on fallout 4, plus the added bosun of 10000 of other things to do as well", "Does this mean the game I paid 17.99 for 3 years ago won't work if I upgrade to 10?\nOr is the 10 edition just you guys ripping off the new guys? It's cool I just want to know", "How will this affect the combat update? You are planning on bringing that to consoles, right? Elytra is the bomb, and shields are neato too", "Come join us at ExileFactions A new OP Factions minecraft server looking for new dedicated players! Theres something every faction lover can enjoy! Including Survival, Opening for the first time! NEW: Auction House, Trading, Custom Enchants, Warp Pvp and Envoys! Join NOW! And Have Fun! Ip:167.114.0.223:25576", "There, Minecraft for the Wii U. Happy?", "you guys should bring over hypixel and stuff too that would make minecraft on systems exclusively better lol", "Logdotzip told this tale perfectly, I cannot wait!", "$30 for a bunch of exclusive happy meal toys and a t-shirt that says  \"#Minechest\". I love Minecraft but this is dumb. Killing Minecraft one box at a time.", "What a huge disappointment !  I am old and live in the stone age, so I guess that is why I love minecraft. I just found out that they make it for pc's , so I bought it and did the download. OUCH, What a rip.My computer game pad wouldn't work, the keys don't match what they should on the key board, you have no controll over peacefull or reg. As far as I'm concerned it was 30 bucks flushed.", "It was in London last year because my son asked how much it was to fly to London it's not always in America", "I just got on minecraft and no update really", "default mansions that can be found like strongholds or abandoned mineshafts? oooh!", "I can't get past Ep 1 and I have the PS4 Season Pass! It says the rest are Coming Soon! If someone can help, I'd appreciate it A LOT", "LifeCraft.hostgamebr.com:\t25686 server pvp novo entrem ae", "What do I do when my launcher isn't working?It's been launching for 1 hour straight!What do I do now?Please anwser.Sorry to bother you!The game is great but it is sometimes glitchy when I change versions...thank you for reading...and sorry to bother...", "Hahaha it's so funny to see all the people to save the world. It look like film.It's so nice.This is very indispensable in my life.I love it a long time ago.But i think the Minecraft Story Mode should in the game itself.I think if it can in the game itself the game player will happy in the every time.I from the China.", "So, what's the difference between this gameband and a flash drive?  You can wear one for 80 bucks with a watch on it, or you can buy the other for 10 bucks and put it on a keychain. You can literally buy anything better than a gameband for what it's worth.", "Screw that I want more texture packs for consoles!", "Very good minecraft but \nwhere is the minecraft 2.0", "I though a \"Minecraft Movie\" was essentially what Story Mode was...\nEither way, my six year old is happy lol", "For all of you pc nerds a console is a pc that you don't have to worry about viruses or your pc crashing every 5 minutes", "Not missing anything here. Minecraft never did have much of a combat system. Didn't see enough change in the combat update to think this would make a difference.", "Thy hope that many great new achievements in the coming mminecraf", "Legend of zelda would have been a better choice imo", "Thinking of getting Minecraft for PC - Please can you guys let me know if it is worth as I never played it and want to play and put it on my channel. But before i buy it i want to know if I have to get Server or just normal download?", "Dear Mojang,\nIm using mcpe.Please being version 0.16.0.Adding wither,end portal,ender dragon,book and pencil,ender eye.", "Minecraft page please put the game, the program to minecraft computer animations .\nYoutube squeeze out a program to make a good editadables and creative animations to enhance the game minecraft computer , if you please.", "minecraft  give me wackest world seed ever X'D.. there island full with season from plain to super high mountions  and float island all in one.. that crazy!! it great to travel around with boat.. becasue it look like water world but so many tiny island to huge islands awsome! <3", "I'm  so sorry WARNING! Carry on reading! Or you will die, even if you only looked at the word warning! Once there was a little girl called Clarissa, she was ten-years-old and she lived in a mental hospital, because she killed her mom and her dad. She got so bad she went to kill all the staff in the hospital so the More-government decided that best idea was to get rid of her so they set up a special room to kill her, as humane as possible but it went wrong the machine they were using went wrong. And she sat there in agony for hours until she died. Now every week on the day of her death she returns to the person that reads this letter, on a monday night at 12:00a.m. She creeps into your room and kills you slowly, by cutting you and watching you bleed to death. Now send this to ten other pictures on this one site, and she will haunt someone else who doesn't. This isn't fake. apparently, if u copy and paste this to ten comments in the next ten minutes u will have the best day of ur life tomorrow. u will either get kissed or asked out, if u break this chain u will see a little dead girl in your room tonight. in 53 mins someone will say i love you or im sorry", "I am more amazed the whole thing worked in one take. Though why a Win 10 edition when the current version works fine? Or is this Microsoft trying to squeeze out the huge Modding Community? Or maybe in fact helping? Don't know really. As can be good or bad.", "Minecraft... Y U NO MAKE MINECRAFT 3DS EDITION YET?", "Literally just turned my Xbox on and seen the update ! YAY!", "I might have experienced herobrine or entity 303 i was playing i spawned in playing i got on creative and i spawned a boss got off of creative (this was still the 1st day) and i heard arrows shooting me then i heard a lighting strike with no rain then my game crashed PLEASE HELP I AM FREAKING OUT (i dont have a mod for them i checked)", "Battle mode doesn't work on PS4. Fix that. Nobody can join random matches at all, it always says the host disconnected.", "Can they actualy released a good update ? Not something that add like 10 things or less to the game. i mean a REAL update. More blocks, more ores, more enemies, more stuff to do. I've been playing Minecraft since Beta 1.3 and the only thing i've been doing is Mega Build. And yea i start to get tired to always have to deal with the amount of blocks they had on Minecraft before i found a mod where they had 100X more blocks and more ... *Blightfall* Notch make one of the best building game *survival first but still* and microsoft will killed it lol", "I would still love to see a classic Resident Evil themed skin pack.  That's my dream skin pack, 4J and Capcom need to get together and make it happen! Wouldn't a classic Chris/Jill/Barry/Wesker skin look cool??", "I'll prob run it better then u admins u wouldn't have a job left", "Dear Minecraft fans,\n\nmy 10 year old son Jonathan is a huge fan of Minecraft. I have been working for over 11 years as an architect myself and I was very happy when I heard that he wants to play Minecraft (instead of some killing games...).\nFrom the very first time I heard of Minecraft, I thought: what if there was a possibility to give players the knowledge, in the same way like Minecraft, on how to build buildings or other things in real life?\nI have created a concept and I would really appreciate your feedback before I go and spend money (which I don't have) in making it happen.\nWould you be willing to have a look at our concept?\n\nThank you and best regards from Berlin,\nGeorge", "So Telltale games are still clinging on to their episodic dream.", "como puedo descargar minecraft en la PC", "MINECRAFT OR ANYONE can anyone help me fix the Java crash please!! i really want to play minecraft :((", "I think I'm done updating Minecraft. I don't like the new combat system so it's going to ruin all future updates. And actually there are more 1.7 mods around  than 1.8 so I might not even play 1.8 anymore either", "The minecraft.net help page is way put of date. Please update. I was researching mod downloading and other stuff and it is still for only 1.6", "I find it funny how they can get llamas but we can't get that patch to fix the wings and everything else we got in the last update.", "I always wanted to see the end dimension in pocket edition for next update as the end stone and the ender portal were in this version.", "slabs on their side for thin walls please", "Seeing minecraft account full access xbox live gold three months if you want to come chat facebook step account information", "i would die if some kid trips and break that lava cube costume!", "Yeeeeeeesssssssss!!!!!!!!!!!!!! I'll finally be able to kill the DRAGON!!!!!!!", "Who even plays minecraft anymore besides little squirrles", "It won't work for me because I try to test it but it won't let me and I am on the Android", "Why would you buy skins when you can just make your own or grab someone else's?", "Anyone know where I can get a Minecraft Case for a 7\" Kindle Fire????? My son really wants one!!! Please and Thank You", "If anyone is interested in joining my Minecraft realm, just direct message me your Minecraft name and I will add you ASAP.", "Notch, bro i'm sorry to say this but HOW COULD YOU?\nYou made one of the best games that is going to set an mark on gaming history and you just sold it out?\nYeah too much pressure, take yourself some pressureplates then.\nMinecraft is one of my favorite games ever and Microsoft is going to destroy it.", "1.10 isnt compatible with texture packs yet even with optifine, ive tried so many things and my minecraft continues to crash. i cannot get it to work right and my computer is a good gaming computer", "Episode five was AWESOME! My fave episode so far", "I have a problem. I've bought Minecraft for PC two years ago and every time I return from holidays I can't play because of Passwords that I write correctly. Can someone help me?", "That would also be very cool to stuff my FTB factories into. You know, like nuclear reactors and stuff xD", "Guys so yeah if there was a minecraft game that could put a game mode that puts in real life  put a disc of Xbox of minecraft that puts in \nReal life okay", "This will be the first chance for my survival server to go to the end! we started it before strongholds were even added to the game and once they were added the ground they'd be generated on was already created. This is a big day for us!", "Hello Minecraft Staffs/Bill Gates,\n\nI Really Like The Concept You Guys Created A Combat System. But Its Not Working Out For Players Who Moved Out From 1.9 to 1.8 And If You Guys Could Remove The Cooldown System It Would Be Very Helpfull For Us PVP Users. If You Guys Dont Then We Will Be Forever 1.8", "I bought tickets for Minecon under my work email (of which I have my old Minecraft account) , my current Minecraft account is under my personal email. Will I still be able to receive the new cape on my current account?", "i gott the game minecraft story mode and i was almost with the part that rueben dies butt my game random delete his self and i feel just like why meeeeeeeeeeeee", "Hello, in Minecraft: Xbox 360 can put skins without being of any package?", "Telltale couldn't even make a decent mine craft game what on earth thinks you could make a movie", "i love minecraft Pocket edition/pc can it come more updates on Pocket edition", "What is wrong with minecraft now ;-; I have problems to login for most of time. Why do they take so much care about the box if there are such problems with servers", "i more like this game and roblox", "Will there be episode 4 which that after Ellegard or Magnus dies,the Witherstorm is still alive,then what next is unknown.........", "I play on the xbox 360... I have noticed that doors/fence gates/probably trapdoors make no sound when they close. Can you fix that?", "Just one question: Why would anyone buy the pass at $14.99, when it is cheaper to purchase each episode separately at $4.99, which comes to 14.97 for all three? Granted that one saves on transaction costs where applicable, but as a deal, it is valueless.", "Minecraft OMG it helped my son in Math. I couldn't believe it, but I saw it for myself. It's great for geometry. Please more Free stuff for kids who can't afford all the \"Fun\" stuff. If they are like my son and will use to their advantage in school. He built a cereal box on minecraft to the exact size as it would be in life. Plus he could open the top and look down inside of it. Pretty cool design. :) <3", "can anyone help me with NEI bug? it says I'm missing master files when i already installed Codechickencore, both are the same version 1.10.x", "How long till the next update for minecraft:story mode for episode 5 I wanna play it, is it when Ivor and Jesse do skyblock together?", "someone help me,,,why i cant play minecraft,,if i press PLAY is says\"Error: Could not find or load main class info.mineshafter.GameStarter\"please help me!!!", "My son has the game on XBox 360 and did the necessary updates. Now the game has a richer texture but now he can no longer move his head around, left to right, and the game freezes. I've tried to power off and on and fix it myself but it's not working. Any ideas why this is happening? My son is pretty upset.", "not going to lie the theme looks really good. to bad its nintendo only.", "If they haven't fixed the extreme stupidity of forcing your GUI language to be same as your keyboard language, it's not an option.", "Forcing the player to use Blaze Powder for potion brewing now is a change I'd expect from an early access game. NOT one that has been properly out for almost FOUR AND A HALF YEARS. Sure it's small, but it seems like every Minecraft release now has been changing stuff that really shouldn't be changed for the sake of changing. There's a key difference between rebalancing (such as damage values or durability) and changing core mechanics after years of them being the same.\n\nI'm glad I'm going to stick with a Modded 1.7, because tbh the game is pretty much Modware now...", "cannot download minecraft story mode episode 3  on ps3  is there  a delay", "wait...THE SUPER SECRET THINGY CAPTAIN SPARKLEZ AND STAMPY WAS RECORDING MIGHT BE THIS!!!!!", "Does it come with a mod that lets your character gyrate around on stage playing an epic sax solo?", "hello everyone , i have some problebs amout playing online, when i try to join seerver its write me internal exception: java.lang.nullinternalexception , so if someone can help me write me in pm        and one more thing i am usin keinett as minecraft :(", "can i have minecraft for windows 8", "This is an the intended same thing as a well preserved known as to the intended recipient only and for your time to meet get the a and team to help", "Is there a problem with minecraft playing it on laptop today? its asking for login.. But when we enter mail address and pw, it doesn't work. Then we click forgot password but we don't get any email to reset.", "Don't really need a book\n\nBasically here is what you do : \n60ms\nRegedit\nJitter click\n\nDone.", "Oh thank you mojang! i completely forgot to dislike your page after you got buyed by Microdump - and windows 10 is unstable trash - no wonder its for free :)", "i wanth to play minecraft 1.9 and 0.15.0", "So, I have been hearing that Minecraft Wii U edition will be available as a retail disc on a later date.", "Hmmm. Go out tonight or play Minecraft...", "I love minecraft game ever can not go a week without playing", "Hi how to get command block minecraft ps3 ???", "Ummm...are your marketing directors on crack? No one in their right mind would pay for something like this for $30 dollars plus 7.00 tax a month!! Unless you are trying to coax little kids to steal their parents credit cards and I bet most of them would agree with me that this is an absolute waste of money for anyone. Honestly, you guys are no World of Warcraft by any means. As for paying that a month as an subscription fee? No way.", "The only good version is 1.5.4, 1.7 is ok... 1.8 isn't the best, but.. You know better then nothing. Now we can say goodbye to GOOD OLD minecraft. :(", "minecraft is the best game in the world ever", "Xbox One S \n\nUltra HD\n4K\nBlu-ray and Streaming\n\nHDR\nHigh Dynamic Range\n\n40%\nSmaller\n\nUp to\n2TB\nStorage\n\nOnly plays minecraft", "I wish I could go SO. STINKING. BAD! But I live too far away and I'm too young to go alone, and it costs WAAAAAY too much. :( #Minecraftismylife", "Why would anyone buy a book when you have Minecraft Wiki?", "Look, I own Pocket Edition and it causes major strain on my thumbs to play on my smartphone for too long. No trailer can solve that issue.", "*Haunts your pocket* - Fixed. Seriously. Paying for skins after you already paid for the game is ridiculous! Thank god for the PC version...", "I Remember When i was playing this game back in Alpha. Everyone made fun of me, But I thought it was so much fun! Now that I'm 23 and i still play. It's bigger then ever! XD", "*Groan*\n\nOne of these days i'll hopefully see an alert saying \"Minecraft announces New 3DS is getting Minecraft\"", "Looing for some builders for my server i just started PM me", "well I got one thing to ask about minecraft PE  I know they just added texture packs to minecraft PE but that's not a cool update a cooler update if it has texture packs and a store where you can buy custom texture packs so people would not need to go in to the files and every thing and go on the internet and look for 5 hours just for one texture pack and people could make there own texture packs     just saying minecraft you have lots of crappy ideas some times and stupid ways of making things mostly the sounds of the mobs but this is some thing that's good", "why  the minecraft didint let the snowman follow you or you command hem or at lest let hem talk. let hem talk that will be soo coool if they but it", "Wow, so cool, but why isn't PopularMMOs, Thinknoodles, or ThnxCya in it? They're popular ( besides I've never heard of StacyPlays or LDShadowlady xD)", "I can't buy minecraft!Its says...An error occurred while placing order, please verify credit card info and try again...Please help", "Am I the only one here who hates minecraft?", "So i downloaded minecraft right.. So then after that i tried to play minecraft and its keeps on saying unable to update minecraft native launcher... please tell me wtf to do ;-;", "Aaron, voy a dar todo por ir a esa minecon, voy a conocer a unos mamaguevos lacras,y voy a llevar una pancarta con tu nombre menor :(, tengo a anaheim cerquita y estoy en california, eso es una vez en la vida, voy a ir y llevare tu nombre en un brazo", "Unanse al nuevo server                                                       PichorraCraft 1.8.7\nServer ip:servidor1.myserver.gs                                                                            Cuenta con Campos de Batalla pvp, eventos diariamente, kit de inicio, y sobre todo un coordial trato para las personas, que esperan?", "Yet another price in the world, which is now ending with a .99. I see the marketing department got it's hands on the product.", "Hi all dear can you tell me how have pepule  or friend in minecraft", "I've  going to buy minecraft wii u edition", "Pls. I have a suggestion for a minigame.\nHide and Seek pls.", "amig@s aqui les dejo la ip de universitycraft es genial entre tiene skywars.luckywars,eggwars,survival clasico y mucho mas entre es el server mas lindo aqui abajo les dejare la ip IP:play.univercitycraft.net", "The ocelots are still bugged in the console version. The \"tame\" prompt does come up, but giving them a fish only puts them in love mode. They do not turn into cats and they continue to run away if you so much as twitch. And aren't rabbits supposed to be tamable? I can't tame them no matter how many carrots I feed the little buggers.", "Can't wait until 1.11 update where they make the shulker useful for something.", "What Funs of Game (Minecraft Story Mode???) :)", "I do wonder why pumpkins in Minecraft have pre-carved faces in them...", "apparently Microsoft bought the company that makes minecraft or the franchise itself,yet it still on playstation(then you wonder the stupid decision to have spider-man as a ps exclusive even though it\"belongs\"to sony when even the latest sm game is on xbox one.)", "Omg so it's finally going to be the official release??? Ooooooh", "quien sabes que le paso a mi minecraft dise asi Unable to update the minecraft Native Launcher", "please make the next minecraft update be the \"redstone update\" w need more redstone components", "can we find minecraft  somewhere for nintendo ds oor 3 ds", "Minecraft fan!! Its me... I love u mcpe!! Pls....accept me as I am!!!", "Dude do minecon on indonesia there aloott of minecraft fans there", "Ruthie! the others are cute but I think Ruthie did the most work", "You know what how about more mini games like snow spleef and parkour and tnt run and other ones y'all can think of that's exactly what we need and if it doesn't happen then I'm done with minecraft", "S Nossa mano tomara que encontre ggohhokkkkkkkkkkkkkkkkkkkkkkkkkkkklkkkkkkkkkkkkkkkkklllkkkkkkkkklkkkkkk", "What does one's sexual orientation/identity have to do with Minecraft? I play Minecraft to escape the toxic political atmosphere that exists today. Please don't drag it into gaming.", "I am haveing trouble when I build my boat to go across the water to expore I can not turn the boat around....Is any one else haveing trouble with that....", "Cobalt In steam? It's awesome i have waiting this good moment ^_^ maybe i will Moving from Dota 2 to Cobalt, #Indonesian_Minecraft_lovers", "I have all the skin packs and all texter,packs my dad got me them and are girls aloud to play it I'm a girl and boys say it's only for boys.", "I want to go to minecon but i cant i want it to come in Thailand there are many minecrafters waiting :)", "You should make it possible for ps4 players to have options like the pc. We should be able to play minigames. We should also be aloud to have the downloadable stuff like making ships out of planks and actually making it drive with a wheel.", "For some silly reason, I would love to be able to play Minecraft in third person view all the time but having your character in the center of the screen all the time does complicate things. I would love something like regular third person view games.", "chairs can be added to the next version of Minecraft, please ?", "Jared Spann Come out and see are new pack called Darkend. If you love magic then this is a pack for you we are on the Technic Launcher SO COME OUT AND SEE", "i must say this 1.9 update is pretty good and although 1. whatever was cool too but this is better ......... Just Saying lol", "could someone help me please , cannot logon to my minecraft/mojan account.. (Invalid Credentials/Incorrect Login) and even reseting my password don't works..PLEASE HELP !", "like this comment if u like minecraft", "Why should I pay AGAIN for a minecraft version even if I have it bought for PC and got a Mojang/Minecraft Account since MC Beta\n#notgonnapayforthat", "I have a premium account, and whenever i join to servers it says /login password, but actually im not already registered in a server, i tried to join to another server but the server keep saying me to login my password. need help please!(sorry for bad english)", "pls stop crying because this new combatsystem, it is realy funny to think it exist \"Combos or skill \" in minecraft PvP ITS TOO EASY . this new update brings Shield, Dual wield and nice cooldown for now you need SKILL! crapy kids", "OMG why in the world isn't Minecraft VR out yet? That's literally the only thing I bought my GearVR for and it's been over 4 months, a year ago it sounded like it was going to be a launch title for the Rift but NOPE the Rift's been out for a month now, seriously COME ON.", "give actual PC Minecraft a story mode and i'll be interested.", "Hunter Kirby dude we're going within the next 2 years for sure", "I was there, when greed killed minecraft. Press F to pay respects.", "I might own it on xbox and PC, but will always be a PC player for Minecraft... Been on it since the Beta and ran a server for the past 4+ years", "Would have been nice if the console was skinned to look like the Minecraft terrain", "So basically it's mods for Pocket edition, as well as plugins for singleplayer for pc and pocket", "mojang would you make the minecraft story mode maps for minecraft wolrds so we could play in it like season 6 where they were in that creepy mansion with all the deathtraps and make it a minigame for the xbox players and more", "Donald Cleveland Sarah Cleveland Megan Hines- brace yourselves for update announcments that will inevitable draw us back into this pixelated hell.", "Man, you guys really love your micro-transactions. Pretty disgusting when PC players have access to whatever skins while the console are restricted to  some default skins and DLC packs.", "Minecraft makes players smarter? \n\nSo that's why I aced my college entry test... XD", "This sounds really stupid. They're going way too far with the marketing of Minecraft and need to calm down. Minecraft is about personal expression, your own world, I really don't get how a movie would work without just being ridiculously stupid.", "DStep 1- kiss your hand\nstep 2- say your crushes name\nstep 3- close your hand\nstep 4-say a weekday, for\nexample monday\nstep 5- say your name\nstep 6- open your hand\nstep 7- repost this to 15 other pictures\nresult- your crush will say they like you on the day you choosed", "Its not even Minecraft. Its a story with a Minecraft theme to it.", "Minecraft... why do you do this to me??? You were great in Beta 1.7.3 and then after 1.8.1, you lost your shine. Goodbye Minecraft, again.", "Interesting, I personally dont see a practical use for it at the moment but interesting none the less.", "It's like Lego and minecraft were made for each other.", "I just did an idea for the Minecon 2016 cape! It is the old Mojang cape except it's colored like the very first Mojang splash screen! Can you please use it and put it on my MC character?", "Does anyone here play Minecraft for the 360?? Although I will most likely get an Xbox One in about a month when my tax return finally gets here. :p Message me if interested.", "THERE IS ACTUALLY A MINECRAFT MOVIE?!? I thought it was a fake rumor. Will it be good? I am patiently waiting for the FNaF movie, know I have a new movie too wait for. I hope the creators think \"outside the box\" when making it. See what I Did. But anyways what I mean is that I hope they make a whole new story like minecraft story mode, well because, minecraft has no story. Hope it's good.", "My son is too young to enter also,  but he thought Steve in diamond armor with the support of an at-te and many starwars figures would help", "hola tengo una pregunta me pueden dar una cuenta premium de minecraft porque el juego lo tengo en el xbox y no tengo dinero para comprarlo en la pc porfavor me pueden dar una cuenta?..........................Hi I have a question I can give a minecraft premium account because I got the game on the Xbox and I have no money to buy the pc please I can give an account?", "Just wondering if anyone else is having any problems saving a new world since this latest update has went through. All of my previous seeds before this update work fine but anytime I try to create a new world and explore the game freezes up and will not save.", "Hey mojang can i use youre website for a game im makeing plz", "Hello, I'm having issues with the game. Its about Multiplayer, all the servers I had saved have a massive error on every single one. As a result I can't play any servers except for one and that is barbercraft. Please help me :c, I don't know we're to post my problems about it.", "So when are you guys gonna star working on a minecraft GO?", "OMG! i want the new version in android", "Fix the Opengl error in Intel graphics cards!-->Pls! i love minecraft .", "If days were 20 minutes then it would take about 121 hours or 5, 24 hour days to go through a year haha", "This is getting Annoying. I've bought your game, on Windows 10, Pocket Edition, Xbox 360, & XBoxOne. An bought almost every add on . \"Why hasn't this been made Backward Compatible.\" My little sisters an cousin that works for Microsoft would like to know this answer.", "Please release this for consoles eventually", "The wiki and youtube have a lot more information then that thing ever will... and it won't be outdated by the next patch... speaking of the next patch.. how about you get to work Microsoft and stop going to parades and trying to sell us crap", "I will check it out after I'm done building my Pixelmon adventure that involves some really hefty traveling with the threat of Tornadoes. Modded Minecraft is very interesting.", "Soo why when I try to load my map that took me 20 hours there is nothing just an empty map like I never created anything went to my nephews and it's the same thing I liked this game at first but now I'm done with it", "Hi everyone i have a problem with minecraft i would love some help becouse   \nEvery time i click the multiplayer button it crashes my game", "Still waiting for when you try and make people pay for skins on the real version.", "I have a idea for minecraft 2.0 !!My idea is in minecraft 2.0 you can use magic to create spells wich you can atack or mine faster", "ive just finish episode 4 and 5 but episode 4 is a lot of sadness comes our ways,reuben died because he save our lives to the witherstorm and i love the movie i want move it to episode 6", "Hat jemand bock im Livestream mit zu machen der kann kommen server ip kriegt ihr wen ihr mich anschreibt", "Some pretty creative stories behind these skins. I wonder if the lumberjack one was inspired by Gravity Falls.", "That is the most amazing book EVER! Cant wait to get", "Please invite me to minecraft pe realms my user name is torino dan my mojang account name francescotorino", "Haylee Coffman we should try to make this into a house haha", "I'm just waiting for ur update!! Love u!!", "This is awesome. Shut up haters. This means that we kind of get to live in minecraft when we play it now. AWESOME!!!!!!!", "verry nice minecraf i like it", "I literally just saw this at a Walmart at 2am for like $7 and thought this was a thing since forever. Had no clue this is something brand new.", "something is wrong with my minecraft (pc) when i try to use my shift key in my inventory it is not working. Also it will not let me craftt or move blocks around my Inventory easiliy.", "Oh my god...i does't watch the Live steam...", "can you add a npc that can talk to us or do a job such as mining,hunting,making a home etc.....that would be cool......hehehe (sorry i can't speak english very well)", "I wish Minecon would go to different states like Comic con does.We live In Indianapolis,in and my kids would LOVE to go...", "Dear creators lot of people complain about the pvp 1.9 and reloading time since its last longer and it's :/ unsure Please remove her by 1.10 thank you in advance", "The dragon and the wither are too easy to kill when you think of it thats is why bukkit/spigot servers got created to add more challenge to the game its totally a new gameplay just look at Factions servers", "Instead make it for the original minecraft", "I love how people are still complaining about this update. Mojang wants to overhaul one of the oldest, most untouched mechanics in Minecraft, and everyone loses it? Be grateful there even WAS an update.", "I I'm so sorry. Keep reading on, or die tonight a exactly\n12:42. This\nis based on a TRUE STORY! Once there\nwas\na baby\ngirl named Marry. Her mother couldn't\ntake\nall the\ncrying, so she decided it was time for her\nto\ngo. She\nburied her baby alive in her back yard.\nAfter she\nburied her she could still hear Marry\ncrying.\nSo she dug her back up and stabbed her\none\ntime in the arm,\nand buried her again. Marry cried harder,\nbut a few\nhours later it stopped. At exactly 12:42,\nMarry died.\nShe bleed to death. Now her sprite\nhaunts\nthe\nworld. When your sleeping, she stabs\nyou in\nthe\narm and watches you bleed to death.\nAnd\nthat's how she got the name \"Bloody\nMarry\" this is the true story\nof her. She wants everyone to feel her\npain\nthat she\nfelt. Apparently, if you re-post This isn't\nfake.\nApparently, if you copy and paste this to\nten\ncomments in the next ten minuets you\nwill\nhave the\nbest day of your life tomorrow. You will\neither get kissed or asked out, if you\nbrake\nthis chain you will\nsee a little dead girl in your room tonight.\nIn the next\n53 minuets someone will say I love you\nor\nI'm sorry\nto 12 other comments you will have the\nbest day of\nyour life tomorrow. But if you break this\nchain you die\nat exactly 12:42 tonight by Bloody Marry.\nDon't believe me? You'll see not taking", "192.99.33.205:26716 a new server Please Join Us I Hope You will Enjoy IN a New Server", "I like Minecraft and all creative people ... love send to Minecon2016 <3", "please bring back the old combat system. This game used to be minecraft. Now this is just German Combat Simulator UltraReal Mega Slam V9.45.12.1 REEEEEEEEEEEEEEEEEEEE", "Come check out NewTessa MC! We off Survival, Skyblock, and now factions too! Great community, friendly staff, great gameply. Come try us out now! IP: play.newtessamc.com", "Man I wish I could afford an Oculus Rift. haha Damn this unemployment. I dunno, though, it might be for the best; I get so engrossed when i'm playing Minecraft I sometimes scream like a girl (I am a girl but still...) when a creeper runs up behind me or I see an Enderman. :D", "Please stop mobs from spawning in Flat-Creative mode! Ever since the one update, mobs have been spawning where they shouldn't be. I miss having a map where I didn't have to rush if an animal or mob (ex: cow, etc) tried to make its way into my facility. I'm tired of it. No offense, but please fix this!", "So, when are you guys going to release the new Minecraft Story Mode episodes for the Wii U? Not everyone has a PlayStation or an Xbox, ya know.", "I'm Australian and apparently the three copies of Minecraft I bought (1 PC during alpha, 1 PC during beta, and the pocket edition) just became part of that giant creeper hanging out near Alice Springs.\n\n(We're under Asia-Pacific I assume?)", "Really? Microsoft is publishing one of their games on a non microsoft console? That's a surprise... Like I can get playstaton, because I'm pretty sure minecraft was available on playstation before microsoft acquired the IP.", "When will Xbox minecraft get lucky blocks  that's all I want", "Why do companies feel the need to get into the political arena these days. I honestly don't give a damn where you stand on political issues. I get quite enough of that everywhere else I go.  Do me a favor. Shut Up and Game On.", "It doesn't work for me. I completely removed Minecraft, uninstalled Java, and used the installer file from Minecraft.net. But when I create a new map and try to load it no chunks will load, and the game crashes. What's going on??", "I just purchased minecraft and have been playing around with it!  Learning so much !   How do I get the story mode ?   Does vs. 1.9 have it or do I have to get something more?", "eu ta bem mais nao da nao da jesusuuuuuuuuuuuuuuuuuuuuuuu", "This latest update seems to have totally screwed up my Minecraft. Immediately after the update, I entered a format of the game that seemed unrecognisable to the one I've been playing for the past few months. The background was different, and the way the options were laid out on screen was different. When I followed the usual process of clicks to find the world I have been working on for over a year, I was suddenly dropped into a world I did not recognise. At first, I thought my world had been wiped of everything I have done. All my settings were wrong too, so I had to change the level of brightness, and the control settings, before I could investigate this unrecogniseable world with my name on it. Turns out the world is a brand new unmapped world, so not even mine. Since then, having left it alone for a couple of days, I tried again. The format has returned to one I recognise, which gave me comfort, until I clicked on my world, and the whole game has frozen. I am actually having to switch my xbox 360 off to get off the 'initializing Server' page and start again.  Twice so far. I will of course, keep trying, but am feeling confused and angry.", "I've already bought minecraft for my daughter for christmas, she is getting a wii u and a million other things with it this year and we made sure to download minecraft before wrapping it.  My question is (and it is a stupid question. I already know,  please no rude comments.  She will still play it either way) her father noticed that it had wtf comments being said in the game and wanted to see if expressions like this or worse are said in the wii u version.  I've tried researching it and seeing that wii u is geared toward family more,  I figured that they could have taken that out.  Just curious. It won't make or break her playing it unless it's actual a ton of real cursing.  (She's 8... if she was 14... it might be different in our household.. idk yet. .. she isn't there. ) anyway, thank you in advance", "Wow a new Minecraft Battle Mini Game is that a custom map", "PLEASE HELP US!! We've been playing fine on LAN since yesterday but now I just can't connect. NOthing changed but just don't know what to do anymore!!", "I'm here to advertise my dads server MineForge Craft", "I hope that VR minecraft works with older versions...", "Seriously? I've been playing Minecraft since 2010, and this is the worst update I've ever seen! The new combat is terrible! And the wings? Seriously? Why must Microsoft ruin everything they touch :'-(", "Still not very good at anything but becing a bat. But, I'm loving this, and looking forward to more. I do have one question, though. Will the Ender Dragon ever be respawnable in PS3 edition? I mean, I can make Withers all day long. But, only getting one Ender Dragon kinda bites. It's not like there's much else to do in the End, on consoles. We don't get the outer islands.", "NOOOOOOOOOOOOOO!!!! WHY Minecraft WHYYYY!!!! I wish they would change it to the summer!!!! I could have gone  there because my sister has college there!", "Again I ask, why are all of the alphas for PE always only tested on android? Is it something to do with the other os that makes it easier to do on android? I feel that it would be beneficial to test on all PE formats. What works great on android may not work on iOS, and vice versa, and nothing ever seems to work properly on Win10, without a few bug updates. Not complaining, mind you, just curious.", "How did you know I'm terrified of jack-o-lanterns?!?!?!??!?!?!", "I can't wait, I want to kill all llamas.....don't judge me", "Please release the rest of the updates for minecraft xbox :) i really want those banners and the other stuff thats on pc.", "STOP THIS MADNESS!\nAngry Birds, Fruit Ninja, Tetris, Minecraft, what next? Temple Run?\n\nRemember when it was the other way around, and movies would do everything they could to squeeze every bit of money out of everything? That's right, the games were by and large the most horrible things to ever come out of the gaming industry. This works both ways, ESPECIALLY when using plot-less games.\n\nThis isn't a perpetual money machine; you use a game to generate interest in a movie to generate interest in a game to generate interest in a movie to generate interest in a game to generate interest in a movie to...\n\nBut then, I am talking to Microsoft.", "I don't like Lego but I love minecraft", "Natalie Bernier I LEGITIMATELY thought that was you", "I take it that it only runs on Wii U and not the original Wii?", "there is no hope for minecraft pocket edition console edition till they make the framerates better and also have real servers like pc", "I love this mini game a lot! But the only problem is whenever anybody wins everybody votes to kick them.... I just got my first win ever and then 3 seconds later, boom, kicked! Maybe add a feature that asks them to state why their kicking the player? If it's reasonable to kick them then it will kick the player. I just want to enjoy the game but I can't if when I win or if I make someone fall into the lava they vote to kick me. Please do something to fix this... Thanks :)", "I can't wait for it to come out on  the Wii u", "I found a glitch. I have minecraft for the PC but its not accepting it and saying i have to buy it. but i did. so i can't change my skin.", "HEY does any one know why when i create a world, and try to change things in costimize that its not working? how do i fix that?", "+Minecraft  can u plz tell the creater to make a way where u just click a button on ur console in the game to download a Mod!", "The battle mode is not yet playable till later on today but it is on y'alls systems if u go to Minecraft store in game they added map packs as a purchase category Josh Loper Kellie Nicole Manasco Sah-Bear Maxwell Daryl Nunag Carlos Vasquez Erick Gomez", "Can you make Minecraft Pocket Edition to 1.4.0?!?!?!?!?!?!?!", "Hay i dont play minecraft .help me for download minecraft", "My name is Hunter and Im 6 years old, I love Minecraft but would like to play with others. if you are looking for a freind please look me up!!! my gamer name is SupeRmAN. I hope to play with you soon, Thank you ;)", "When do we get mods for console", "Minecraft/Mojang well i\nMean yes it is a huge Update but when Will\nYou let us join and make servers!!! ON CONSOLE and Playsation platforms too i mean PLEEEEEAAASE JUST MAKE THAT UPDATE", "I can't even connect to any games... It just loads for a minute and then says I disconnected when I never connected in the first place. Even when I start a game nobody can join. PLEASE FIX ASAP", "Hello everyone informed them that I just created a minecraft server no premium for all can join the ip address is: 201.211.24.57: 54237 I hope you like", "If the minecraft producers read the comments,can you make update 1.9 for ps3 id be so happy", "I Don't understand who came up with the brilliant idea for minecon to be held in a lesser known city in California when literally half the people in america wanted it in chicago IL at McCormick place...I was mad when i first found out about this...", "I have minecart on my Xbox 360 it is called minecraft Edition", "I played for hours before I realized that the 3D rendering wasn't even turned on.  You have to do it from settings.   Wow!  That made a difference.", "Story mode is boring and the Skins too!", "I won't upgrade to Windows 10, or use pocket edition, until you fix the crappy combat update you put in version 1.9.  Yes you made it more realistic, but in a game where you're creating a sandbox world out of 16 bit blocks, you don't need to be realistic.", "What minecraft story mode is a skin pack make a story", "I dont know, what eurovision is, but it seem to be totally gay.", "minecraft is so much cooler with this new update[Husk and Stray],i hope they will add more ranged weapons in the following update not just only a bow :p", "Pris add (xbox 360 edition ) v.19 (this is my birthday ) Pris  Minecraft", "I think we all knew it was coming really. And who is going to buy it apart from Wii U owners when you could easily just buy a Xbone or a PS4 and play it on there?", "You should add the feature to have banners be crafted into capes!", "I'm not sure where I should ask this question but, my 8 year keeps telling me he wants a mod creator (?) can anyone point me in the right direction and/or tell me what it is?", "Keeps crashing. Something about minidumps. Was able to fix the issue for one child by going into the Options file and changing the \"fboenabled\" to false.  But my other child's computer...  nothing I do is working.  We've tried restarting, a clean install, changing the options file, everything I can think of.  She gets into a world, plays for about a minute, than bam. Crash.", "I can watch your lifestream!!!!! Yeah! I might come to Minecon when I was 20! And it is the time which I am doing YouTube!", "Hey Minecraft, do you think you could get C418 to add more new music to the game; possibly even use it for your marketing too?", "If you love your kids, and you want to express that adoration by buying them this console, learn what love really means and build them a PC, then buy the PC version of Minecraft. It's the right thing to do, and costs the same amount of money - but a PC is far more versatile, among other benefits.", "Did they ever add key mapping to the Windows 10 version so left handed people could actually play it? I gave up and never went back after the problem was being ignored completely.  Still just playing the pc version instead.", "I downloaded Minecraft  PC for my son but every time he gets to play it, it keeps crashing. What a waste of money!", "I will be watching for this at the bookstore. I already have built loads of castles in various styles but I am always interested in new ideas.", "Don't forget to vote for your favorite costume over on Twitter @Minecraft", "Is anyone having problems in the 1.9 Update where trees won't grow anymore and bone meal has no effect in their growth?", "Notch, change the fact that you need windows 10 for minecraft 1.9, i cant get windows or minecraft 1.9 now and i really wants minecraft 1.9... CHANGE IT!!!!!!!!!!!!!", "Hey guys! I have just started a new Minecraft 1.8.9 server! It is a factions survival server with loads of exiting feature and prizes! Donators will recieve the power to go creative and disguise!!!!! JOIN NOW WHILE YOU CAN. IP:82.3.132.68", "I have a question about extreme hills/mountains on the PS4 edition, after recent updates.....where are they?!?!", "Mathieu Gaudry y serait temps qu'on commence un serveur exclusivement pour l'exploration parce que hot damm", "Hi, Could you please help us. My daughter and I love playing Minecraft together and would love some mods to go onto the xbox 360. I cannot seem to find a furniture mod. Most of them are for the pc edition. Could you please tell us where we could find a mod to go onto the xbox 360. Thanks very much", "minecraft who the creator logo launches version 1.9 for ps3 ta boring I want wings and new launches encantament and build battle for minecraft like the guys computers vain profit more think but soon launch the 1.9 to minecraft ps3", "That's you and Jr ALL DAY lol", "In the console update with hunger games you should allow sponsoring when dead", "Omg yes it's finally coming out \nI played all episodes and it's going to end here \nGreat Job Mojang and Telltale games u guys are awesome!!", "I just watched the youtube video. I wonder how long it took to build that, with all the decorations, the track, the colors...", "Need to get MC windows 10 up to speed.. runs great but need to be up to date with the pc version....", "If you find minecraft too hard, then you must be a three year old.", "isn't lego already a kind of minecraft??", "league of legends is better than minecraft :)", "At first i said \"oh hey, a chance for me to actually get involved!\" ends up that two days after that im packing for an anime con... Sorry, rather go to sacanime than minecon :p maybe next time.", "When Battle mode is Coming Tomorrow on Minecraft Xbox 360/one is gonna have a update of battle mode Right?", "Oh also, if you could somehow add in a mute players button that would be fantastic :) all the lobbies were yelling children for me. Not a problem just would hope someday it can be implemented", "And so it begins - what most of us have been dreading for, please be careful with this, please think about it before saying yes to this :)", "Mojang,why doessome other Minecraft PE players have access to 0.15.90?", "Add long-swords and longbows ! don't get me wrong i like the current swords and bows, but  lets expand and diversify the arsenal. more combat options means more players happy and in turn means more money for you Mojang, wee all win here :)", "I can't wait till you add stained glass, dispensers, prismarine, pistons, and other red stone items for pocket edition", "Minecraft story mode is terrible, I would never buy it", "Zarta de ladrones , sigo esperando mi respuesta en el hotmail... Malditos estafadores...", "Hahaha it's so funny to see all these people complain that this game is too much like a movie or isn't as good as the actual Minecraft game. Obviously you guys have never played a Telltale Game before, all their games are like interactive movies. Games like Tales from the Borderlands, The Walking Dead, TWAU, and others were amazing games and this game is just as good. You guys should do more research before you start complaining online. It's awesome that this game is coming to Wii U, glad to see TellTale expand their platforms even farther.", "Can anybody help me!How to install map in Minecraft", "Mojang! Not open Minecraft 1.10! Why?!", "Minecraft \n\nThere is probably only one big complaint I have ever had about Minecraft. SADDLES!\n\nWhy is it a rare item and not something you can make? We can make iron doors. Magic potions. Enchant items. Create portals to different worlds. Fire magic arrows. Create electrical wonders with redstone. Forge diamond tools and weapons. \n\nWe can create all that yet can't make something as simple as a saddle with a few pieces of leather. So stupid.\n\nI love this game but c'mon, when is that going to change?", "Give earlyer owners of Minecraft: Story Mode a 75% off price or include story as part of the normal game and make Minecraft $42 !", "i love Minecraft but hate fact if  accidentally forgot turn cheats on  single world  have to delete start over can't stupid  cheats on anymore why did get  rid of that feature ???????????? just why ?", "Hello, I have minecraft on my xbox one and also have the windows 10 version, I want to play with my wife in the same world, I use the xbox one and she uses the windows 10.... is it possible?", "Yah, when are the updates going to be released for Minecraft PS4 and Minecraft Story Mode Episode 5, want to see all the new stuff.", "It goes past 5??? I haven't played since episode 2 that's exciting", "Faith McLaughlin I think we could use this for our builds.", "Welp Minecrafts gone even worse Now they added 1.9 and ect.", "Minecraft is essentially legos, and the lego movies do well, so it can be done. Microsoft is looking for lost money they still need to make up for buying minecraft. So if you ask why this will exist, it's because they spent way to much money to buy it.", "Alex and Steve unfortunate situation. Two dudes, alone on an island...", "I prefer actually playing 1.10.2 on PC. It was designed to be open world, with a goal to get to the end and kill the dragon.", "A message to all those whiners who don't know that you can change the version of Minecraft through profiles.", "Elytra and end structures are my favorite parts. I still play 1.7.10 though because that's the version with all the GOOD mods.", "I hate how people are going on Minecraft just for servers and not its actual purpose. I have no problem with servers, but is this really the only reason why people play Minecraft?", "I wish they did a Lego minecraft game well like story mode but with different story lines and missions and bosses", "ola esq tengo un problema lo voy adescargar me decarga bien pero cuando dentro me sale error q pasa hay", "This is a $20 game. You are better off getting a different xbox s bundle and just buy Minecraft.", "please, make this possible in normal minecraft!", "Can we just get caught up to the PC instead of these mini games.", "yeah the best horses pigs guardian chairs eggs and animated doors-Minecraft is the best game ever and and theres some other things that the best servers too", "shame that all my experiences playing online say that the Ultimate defense doesnt mean squat because the intruder will use dynamite and if the server uses house protection then the intruder becomes a super hacker and get around it", "I don't know what's going on but it needs to be fixed now. I paid for an account, used it for a couple months, took some time off, now it only offers a demo version. I will NOT be paying again. Mojang can fix their mistake or I just won't play.", "tengo un problema compre minecraft me registre en mojang y cuando quise acceder a mojang me de cia que el correo o la clave estaba mal luego cambie la clave y siguio lo mismo ayudenme !!", "You Should Make A Minecraft Game (Not Story Mode) For The Nintendo 3DS! That Would Be Great! =D", "como me descargo minecraft para compu", "minecraft this game is very good but after a few weeks, then it must have an account and would need money to get on", "Hello Mojang\nYou can return to the PVP of 1.8 because I have friends who think it ruined the Minecraft\nOf time .\n\nBut that's not why I went in this post .\nI want to return to the defense with the sword .\nAnd would be even better if you do return to what it was at 1.7 to protect and attack the sword at the same time .\n\nI'll be happy you answer me .\n\nMinecraft", "Can someone tell me how to upgrade my son's PC version to 1.9?    I woudl have thought it would automatically happen but it hasn't.   He is bugging me!!!  Please someone help a poor old mum!", "I cant wait i love the game so far and the pic of the new episod is makeing me wanting to play it now", "That would be amazing, if only it included a trip there. :D", "My daughter and I are looking forward to this!!!\nI hate messing with the Xbox 360. My daughter has a Wii, but my husband bought me a WiiU a couple of years ago for my birthday, and I share it with her (I've always shared things with her... more fun that way).\n\nWill this version have texture packs available?", "I've played minecraft sense the beginning but my only problem so far is the new combat update maybe there could be a option to change between the new combat and the old combat just maybe.......", "Hey Mojang, in real life.. eating raw meat could be dangerous.. so why in minecraft no bad effects when somebody eat raw meat? Also why Grum remove dirt and couarse dirt in minecraft? Couarse dirt can be used as decoration. Well.. not alot of people use it as decoration. Why would minecraft be akward? ._.", "I have the Minecraft Windows 10 edition in my android (cracked) it says realms coming soon pls make it early", "Can't I customize creepers power to 40?\n/locate 0.13.0 Minecraft PE creeper file", "I have a question so when I was buying minecraft it stopped and the money went through but I didn't get the game what do I do and I don't play it my daurter does", "i have mine craft   and i need to login with that account (log on to Technic) but  it says my Morgan account has no perches copy's of mine craft.", "I'll never play this Minecraft's Halloween Edition. I prefer the normal game!", "deverian dejar gratis el minecraft mi hijo esta loco por jugar", "My 8 year old granddaughter has Minecraft for Xbox 1 but she also has it on her iPhone and her iPad. I asked her what she wanted for Christmas and she said \"Dogcraft Mod\". I don't know what that is and I have searched for that term for the systems she has but not found it. Can anyone tell me what (and where) it is?", "I need help to get my account back, i forgot the password, i cant contact you in the website because of that, please...", "Thank you for fixing what you screwed up. Now I can play without having to worry about my xbox crashing", "Well... I think maybe Minecraft needs a little bit more colour... Like more blocks, more possibilities. New biomes, new skins, new mobs! This may put your mind thinking! :D (Yes I know it takes a lot of time and effort for making a game. It's just my honest oppinion and I really think all of the MC staff is really great and they are doing anything possible to make the game even better!) PS: At least make Herobrine a boss because I really want to defeat him!", "Well not impressed so far with the pe update . All my texture packs that I paid for have gone and it tells me I am not connected to the internet when I am! My castle looks rubbish now. Help", "I can't wait to buy this game for my wii u", "Mojiang ID was hacked and I send the mail processingn't you tell me something?", "I have to say that I am disappointed... This is a sandbox survival adventure game, but you are trying to turn it into an MMO RPG. \n\nI watched my brother explore the new update, because, guess what, I COULDNT. I cant load into any worlds or LAN. What I saw, was not very appealing. You screwed things up.\n\nRemove the cool-down. we dont need shields, we already have blocking. the wings dont work. wth do you mean by 'expanded the end?' My bro tried to find a portal to take a look and there wasnt one. He ran around in the stronghold (that, by the way, was completely broken) and there wasnt a portal at all.\n\nYou guys need to fix things like horrendous lag issues, and glitched with the EXISTING stuff. Not adding more broken things and breaking more in the process.", "Minecraft story mode and Minecraft is my faforit", "Can anyone help me with mine craft ps4 or PS3 trophies? I can help with some trophies in return", "I need help. My son's cousin kept playing Minecraft when it was time for bed, so I deleted the app off the iPad and sent him to bed, the following am I re-download the app on my son's ipad and all his world's were gone :o he worked so hard on all his world's and they're all gone! How do I get his world's back? Help please!", "How come we can transfer/restore purchases that we've made on other platforms to the mobile versionz we were able to do it on those. But not on mobile?\nI mean, it also asks us to use our XBL game tag. So it must read the purchases we've made.", "Hey can you tell me how to save a minecraft world from a ps4 to a different ps4 with a flashdrive I can't figure out how please help!", "dont go to minecon its too cheesy af and crowed with micrsoft soving console verion in your face'", "It would be nice to go to different cities in all the states where more people could participate! My son would love to be there; but we can't afford the trip to California! We could go closer to where we live which would be Birmingham, Alabama!! Would you please consider this???", "Thanks Minecraft For giving Grand Game this game is the Good Game For Kids and Gamers I like DanTDM,PopularMMOS and Recabilly I like those guys and ilove so the minecraft", "Also i would love to acctualy go to finally show off my building skills but most people show no bother to it but u should see what i build.Can u help me out by thinking of people who have skills please?", "why does minecraft needs to pay if you want to download it?", "if not noticed in the photo there is a guardian and is in the pocket edition which means that they will implement and", "quien quiere jugar conmigo minecraft survival di 888888888888888888888888888888888888888888888888888", "I can't even play Minecraft on my 360 anymore. There were some stupid problems with the game continuously disconnecting whenever I joined a friend's game and then it froze when I tried joining again. I tried an uninstall and then reinstall - but I couldn't reinstall when I found that I had to pay for the game again; all because I wasn't using the (inaccessable) account I used to buy and download it in the first place. >:/\n\nNot to mention it's brilliant when the whole reason I can't access that account is because XBox turned on me years ago. MULTIPLE TIMES. My current account is my third.", "You guys should add paint into minecraft. Like have the different dye colors in paint buckets, have the brush were you paint any side of a block", "Hello there Mine Craft  makers... If you could make a plugins, i have a good idea of a plugin... just message me if you are interested...", "They are two EXTREMELY different games. You can't compare them at all. They have nothing in common. Sure fallout 4 has building but the building is not like minecraft in any way shape or form.", "is anyone else having problems with the latest ps4 update? i get to the main screen and it freezes up everytime", "I need help finding 9 dimonds on xbox one , im willing to give gears of war ultimate edition to who ever helps me comment ..", "could you guys for xbox360 minecraft have the next update to have wagons and sheilds and banners", "why cant minecraft be a steam thing ? i still have minecraft cracked version.i really want minecraft on steam.i can only buy games on steam (trust only steam)", "MINECRAFT I spend 30 dlls in Diamond rank in the server=mc.tacoland.es,the server it is erase I thing the creator is SrBigote!!,I want my money back!!!", "Thank you for streaming on You Tube!", "I need help. Always while i am playing mcpe the texture of everything changes. For examle the torches change to roses, wheat changes to doors and so on. This is really bugging me pls help me.", "I loved Minecraft from the very first day I got it for my PS4, about 2 years ago. I wanted to try the Win 10 vers since it allows you to use a controller. I love it! So, I purchased it for $10. I also wanted to use the PC vers but Mojang being the party poopers that they are, said no. I cannot. I have to shell out another 26 dollars. I bought addon's for the PC vers and I bought the Win 10 and now they want more money. GREEDY!", "Hey Jeb I have suggestion for the new Minecraft combat update. I was thinking since swords are average speed and axes are slow I thought that maybe you should add knives to the game or short swords to attack faster but do less damage.\n\nBest Wishes,\nDefenders4life", "guys i like caves in minecraft i like exploring what i dont like is strongholds.. :P i have found one with my friends and its soo big you get lost in there... i finaly found the portall to the end with a spawner in the stairs of silverfish... creapers are all around skeletons and zombies too that is more than enough to kill all the players together and there is lava on the floor too XD any ideas how to win this?", "Still waiting for slab dirt blocks, still waiting on rope for climbing. When are some new unique items going to be added, as content is getting a little dry.", "Hello, I have a problem with my account premium. A few days ago I did not buy it and got it. Even send them a complaint few days ago and did not answer me. Agradeceria help me. I am looking forward to your response.", "Congratulations Minecraft ist finally dead and has nothing to do with the original anymore RIP", "Because of this update I no longer have minecraft. THANKS MOJANG!", "Got a bug to report. The forums were really confusing. Xbox 360 console game, pause doesn't work. Gameplay continues when you're on the pause menu.", "Hi everybody x  I purchased minecraft yesterday for my new laptop. Great right? NO! I couldn't dl it to windows so I did the minecraft.exe thing and finally it dloaded YEY! However whenever I try to play a gobbledegook page comes up on the installer saying stuff I don't understand and I'm getting really upset. Can anyone help me please?  I'm not a computer wiz at all hence needing help...", "I love Minecraft! Use to play it everyday while catching up for school:-)", "you guys should let us play hunger games, or skyward on ps4 please.", "\"AMERICANS\" okay we'll us Americans don't need a cheat book because we already know how to get things done...........................", "Ale superowo memcraft dodajcie to ok", "Could you please make the questions back to one i cant get in to my profile and change my skin THAT I JUST MADE FOR TWO HOURS!!!!", "Zane Colon wow this would be slightly impressive if it wasn't in creative mode...", "please please tell the minigames are bored I care about is the 1.9 will come in December or next year if you see this please answer that day and year that mees", "Ray Duran you down to stay up all night til it comes out?", "I like minecraft hopefully make me admin on a server", "I am super excited for this update because by the looks of it, they have cool brand new stuff in it that will make your gameplay a lot more fun and will be a bit of a change. THANKS Mojang!", "So windows 10 and pocket only? leaving out the non 10 windows?", "I am a Vietnam I need you to help me to download minecraft, as I download and install it themselves, but in time to be standing, please help me. Error is \"Unable to update the native launcher minecraft\"", "Sadly, Minecraft is dying. The selling to Microsoft was the most evident sign.", "I'm a PC and console player my self what Microsoft needs to do is collaborat with mod makers and bring in the mod packs such as at launcher and the teknik launchers #consoleMinecraftneedsmods", "Dear minecraft\nI have purchased the settlers texture pack for xbox 1 and havent been able to use it in minecraft its not in the texture pack menu please help me or else you shall face my wraith \n\n-Sincerely your customer", "I wish there was a way to make the days last longer in minecraft, i hate how quick the day night cycle is", "does anyone happen to know when 1.9 comes out? a few of my friends and I have shared a server for a while now but i dont want to build anything new until 1.9 is out. however i havent been able to build since november because i heard it would be released some time in december. its really draggin on and i havent heard any release dates.", "Can you add the bat morph in the other gameplay mechanics?", "I already have two minecraft books, which I bought on impulse, but now that I know there's more... I'm going to have to add the minecraft books to my list of \"book series that I dream of hoarding on my bookshelf\" list", "Please add a new enchanting system like upgrading your tool examples are like bow to\n crossbow and dagger to sword and also new nether mobs and giant mobs bcuz almost all mobs\n are tiny and no unique mobs", "Happy B day minecraft xbox edition", "Anybody on here play Minecraft Murder? I'm trying to figure out where you go to play it. I'm a bit new but I really wanna play this game. Help please?!!", "I have old one I will stick to that. Also I have the one that has the picaxe on it and the redstone one.", "Cabros les traigo servidor de teamspeak3, esta abierto 24/7, tiene rangos y es chileno... 300 slots pa cagarse de la risa un rato .. sean bienvenidos     legendarygaming.freets.xyz", "Please allow server codes where we can join other player worlds and host/join a lobby like the PC does", "\"Ultimate defence system\"? The people i play with would call that a welcome mat.", "guysss penge nmn ng cheats Minecraft plsss...kailangan ko lng talaga plssss", "So if he already has minecraft for PlayStation can he just download the Wii U version? And he wants it for my Mac but I'm worried about him messing up my computer?", "Idk if it is my computer or something but one second ago I was on minecraft servers,I closed the game to go play survival,and the next thing I knew,I cant open the game launcher! it pops up with 'minecraft' across the screen,but then it closes and wont open the launcher! >< Somebody please tell me if there's a way to fix this", "We don't want Lego Minecraft. We will have more Minecraft story mode", "I can`t purchase minecraft, your page lucnh error and you don`t help me", "I celebrate with the rights to marry, employment etc- but I don't do \"pride\" in sex, race, etc. Other than that - MInecraft has a whole new market of homeschoolers of conservatives. We're a secular atheist family - but I guarantee you this will spread through the community like wildfire and be a blocked resource for those conservative children by their parents. That is sad, it is nearly the only activity some religious homeschoolers are allowed, so will cut them off from outside social connections they built upon with seculars who use MC> \n\nMInecraft should avoid politics.", "My son just bought the game at 24.90 euros, but impossible to play... anytime drivers requested... impossible to have updated...\nPlease give me a solution, he's crying everyday...", "I hate you. Now, i want to play Minecraft, but have to work. :P", "oh, and can we still download versions for 4 years ago? thanks...", "I like the much needed improvement of ai...However, I updated my server to 1.9 and we barely encounter any mobs now. So strange. Like we stripped an abandoned mine shaft and encountered less than 10 mobs. Anyone know if there's a way I can fix this?\n\nPumped they finally fixed the boat glitches too. It would be awesome if we could put a chest in the boat with us.", "This'll make Minecraft like EVERY OTHER GAME EVER.", "Problem is that PC is not completly honest I think. Win10 is in brown and new versions of minecraft for pc are included in that brown graph. so Would be nice to split that to PC and Phone that win10brown graph", "> better fighting\nYes, because adding a cool down totally improves the combat. How about those new animations we were promised? I hope 1.10 or 2.0 is the last update so we can have a modding golden age. Mods are what kept this game going anyway.", "when i am writing username and password launcher says to me sorry but your username or password is incorrect! pls help me i know the password is correct and username too", "how about writing a book called we fixed realms and we will now take the money you are trying to give us", "I am happy about the block height. I will finally be able to port over full PC worlds without the top getting cut off.", "I don't play, but... my daughter does.  So my daughter was really excited about this... and then she got it... and she was very disappointed.  She said, it's you sitting in a VR living room playing minecraft on a TV.  It's not 3D at all.  Does she need to change a setting or something or is this really that lame?", "It would be very nice if we can download pc maps because they are awesome", "Notch, i have a request what about you add tomatoes in minecraft :) when it gets 1:00 it will get rotten tomato and add sack for stuff :)", "Fwoof.  80 bucks is heafty for a watch.  Even counting in Vanilla Minecraft PC's cost of around 30$, that's 50$ watch.  I could buy a fairly large external hard drive or USB and a watch and do about the same with it, maybe buy a sticky of the Diamond for flare.", "Is that bat going to be in a new set coming out soon?!? It is so cool! Lego Minecraft is my favorite lego theme! Keep up the good work!", "Whoa? Now wii u? Minecraft doesn't look like a Nintendo game to me", "Nothing helped me with mathmatics and econ more than Runescape. Find a way to imitate that economy(in a \"kid friendly\" atmosphere), and make it fun and you'll be golden. Resource gathering, leveling, general RPG stuff, all good ideas to make learning legitimately fun.", "They need to have it in other places besides california and london. Its not fair for the people who don't have time to travel.", "Guys i have a theory... This movie may be about Minecraft. I don't care if i'm wrong or not but what matters is i may be right.. Thank you for this speech. (Speech totally inspired by Leonardo Dicaprio and totally is a smart original joke)", "When the embargo/exclusive oculus deal has died down are we getting official Minecraft support for the HTC VIVE?", "What is the point of the windows 10 one it has no mods and you got to buy skins instead of downloading them", "loocking for some one to play realms with me \nps: i am broke so he must make the realm\nplz do not give hate becouse my name", "I Wanna Go there But I can Watch in YT Live But I need to Sleep because im in Philippines Which is night time", "hay guys i have make a new server and i need staff \nthis is the server ip : TeamKanji.mchost.pro\nit's beta for now but i need a dev and builder and admin's come to the server and talk to me and you will be anything you want :)", "I've developed a modular system for my own builds, so that I can essentially build whatever I want in any configuration. Medieval style is my favorite, though.", "Hello i'm problems a Minecraft :( Help please :( :( :( :(", "pocket edition needs to not crash, too! :) happy for the update!!!", "three or more its cool at minecraft world", "I would love to go to minecon. I want to show off my redstone and building skills. I have a special combination lock design and with 2 dials alone I can have as many as 1,000,000 combinations in a 6x8x12 area.", "When its come out plz answer me guys. Im waiting A LOT TIME FOR MINI GAME SERVERS :D", "I've a problem: I bought the game, I was charged on my bank account, but it does not appear on my oculus purchase history. And when I click on the game to play it says \"you already have this product.\" I can't install and play my game, help me please", "Realms ... console ... please ....thank you ......", "amo demais minecraft nout mais sabio que wisten", "All I can say about minecraft is its gone downhill when Microsoft bought it...thanks Microsoft. Also, why can't the console platforms be as updated as the pc version? It makes no sense to me, other than the company wants to be cheap and make you get the pc version as well (and yes I have the pc v as well as console 360)", "also have you thought of adding more ores, weapons, and Armour?", "My user interface controls in my  Mine craft realms do not operate properly, I have imported one of my worlds twice & it claims it is downloaded but does not load but loads a completely different world from its own data bank.  Makes me think twice about the watches capabilities all in all.", "I know it's crazy, but i want that on my PlayStation. :(", "When I found this, my first idea was : wow! minecraft will roll out the 2.0!\nThen I know I was misunderstanding XD.", "Oh, this won't get used as an offensive, rather than defensive, tool at aaaall.", "I also had another idea for a new update for PC and console editions. With the Minecraft story mode game, canbu try to add the wither storm, command blocks, giants. Mods like ships but its in the game it self. And since I like this game as well, slender world that is a trial and ability to buy its as well. Plz reply back and thank u.", "No wonder i feel always stupid playing minecraft. \"Well i builded spawnbase now and started on railroad , i'm bored i switch game\"", "Can one of the mojang people help me? When i tried to log into minecraft on pc it said in correct password or username when i typed everything in fortecy the i went to minecraft.net tried to log in and it said user or password is incorrect, so i pressed forgot password typed in my username and it said it was migrated and gave me a link to mojang to reset my password there. I sent the request to reset the password to my e-mail (this was about a week ago now) and nothing came. Its as someone changed the e-mail to the account. Help?????", "hi notch can you put back the rubs and herobrine back", "Just like any update it takes time to get used to new features. So we will all figure out how to pvp with sheilds, cool downs, just in time for the next update. \nThen we can do it all over again.\nYay!", "dear MINECRAFT I don't know how to get ahold you anyways I'm coming here can you try to make it Borderlands texture pack for Minecraft Xbox 360", "Hey this is out to all of the Crafters out there. This is my first time going to minecon, and does the $160 ticket good for both days?", "Erik is theminecraft master.he gas 4 rankups.He can build online as well as by disk .By the way your Aunt Brendas Gta name is GEtAWAY.On GTA   and in real life.HA!", "Awesome trailer. Also please make a new one for the PC edition too.", "Play this server 162.244.165.91:60540 Very fun factions server mini-games comming soon!", "Dear minecraft people\nI am sad that xbox's don't have mods but computers do. If you can please can you put mods on minecraft. Thank you :)", "I hadn't been on minecraft in 5 months or so and i just tried to get on, but my password wasn't working! so i've done the \"forgot password\" thing but then minecraft notified me that my account had been \"migrated\" to mojang. so i go to mojang and try and get my password only to find that i need my old email that i havent used in years! but it wont let me change emails. im very angry/frustrated, i paid for a minecraft account way back when beta just came out, and i dont want to have to pay for a new one. could anyone help? any suggestions?", "minecraft is my life i love to kill mods and kil the bosses i hate the witer i love minecraft !", "yo no puedo jugar minecraft soy adicto insatle windows 10 y no se me abre", "@mineraft Hi, I would like to ask what to do when you press PLAY and appears to me there Crash Report and Game Output. I have Windows 10", "Will there be one in miami/south florida", "I bought my minecraft premium account and got it by saving estube valid for only dijieran me that my account is not valid hope your answer please ayudanme\n\nThank you", "Can someone help? I can't use custom skins on Minecraft PE on the iPad.", "i wonder how will youtubers play the game while hearing there voices idk (proud) hehe", "make minecraft 5 dollars plz i wont pay 19,55", "Bought the Minecraft Wii u as soon as it came out expecting the same as what my son has on his PS4 and am very very disappointed with the fact that I do not but paid more for mine?!?!?! I doubt it would have been hard to have made it the same!!! It's way too limited! The update 1.8.8 needs to hurry up and get here!!!!!!!!!! This is just flat out ridiculous!!", "Help, I keep getting a Java (TM) Platform SE Binary error... What does that mean and how do I fix it before my son goes crazy!?", "I have a request for the next update if you can could you make hoppers which transport items upwards rather than downwards ty for reading this and please consider it", "Mojang, there is a problem there are these mobs called entity.haunted.armour that give you random damage and the worst part is that they are invisible. Please fix this.", "probably wont read this but i have an idea for a future game. Minecraft Dungeons and dragons. Make a create able world where you can set up a dungeons and dragon game. Put monsters and more create dungeons fully customizable world for D&D players. to give us a virtual world to play along with our role playing game everyone loves", "First off I like minecraft but at the way they are moving for console. I'm liking ark more and it's still a beta game what mc's excuse for not making the game better for console they have been out long enough to do so ark evolvled  hasnt. Minecraft has been out long on pc than console and console still doesn't have everything pc has not including mods. And they wanna charge you $2  here and $5 there for some bs. When alot of us had to pay to have the game again when we went from 360 to xbox 1. Sorry but not another $$1 from me."]