["Obviously fake, but still funny if you use your imagination, all I can picture is Madea or some shit lol", "that dog should be looking the other way. my recommendation", "I can't and won't tell people how to spend their money, but this some dumb shit.", "Shit I didn't know YC the Cynic had changed his name to Kemba. These types of bars are normal for him.", "How is shooting an unarmed man thru a window, who wasn't attacking you but just standing there in an argument manslaughter? HE SHOULD BE CHARGED MURDER!!!", "Read the comments on the worldstar page lmao, It reminds me of youtube back in the day, except the roles have been reversed. Humans will never change haha", "Wow. I'm impressed. But he's white?", "The cop who died most likely had a family, friends, plans for the future, etc. Those people will never see them again because of some dude. They could have joined the force for morally just reasons. I'm not saying cops are good simply because it's their job to protect, but y'all who are saying they \"probably\" deserved it because they were cops annoy me. They could have been bad, maybe, but I'd rather see them put away for their crimes than killed.", "Most niggas & celebrities and non-celebrities post punk bitch shit on Facebook in reality you really ain't shit just like fb want to be seen and heard", "Lol boy was drunk I would have just slap the shit out of him but homey really throwing the hands with him lol my little sister could had beat him up", "Can't wait to see the video of Quavos taking this dumbasses chain. Wants a one on one but yet he's waiving around pistols. Ignorance.", "That bitch ain't shit. she literally had to suck dick and fuck to get to the top, no talent whatsoever. eventually time will do what it does best and take The only thing she has going for herself and that's her looks.", "Some of you people need to research a thing or two about this move...she is a very successful business woman. Educate yourselves with something other than this worldstar crap.", "For the black/Hispanic  people that voted for trump, don't complain about it now. YOU voted him in, YOU gave these racists the right to treat minorities this way. For the thousands of people that wrote in \"Harambe\" thinking it was a joke YOU are to blame. To the MILLIONS of Americans that didn't vote YOU did this.", "Mass poisoning? You motherfuckers love adding fuel to the fire of this race shit smfh...", "It's fucked up when you read the comments and Ali and his lil bro are kings in people's eyes while the Boss lady that's really getting a good deal and is the winner here, is talked about in the worst way. Respect to the Latina, That girl is going somewhere!", "Pathetic... When the fuck are we all going to get along\"??! Mexicans blacks whites everyone.... We all need to get along if not there's going to be a race war... Like shit we got enough to worry about with the scumbags of Isis and middle east scum that want us all dead! Why not target those fuckers they are the real enemy", "Alot of people on here sayin well dont break the law all ima say is if you come from a silver spoon fed home and mommy and daddy handed you everything and you never experienced poverty or any of the circumstances of living in the poverty stricken neighborhoods then please SHUT YO BITCH ASS UP", "A Country that Allow Corporation to make Billions off of Charging People Daily \"Interest and Principles\"...I'm not Surprise", "No one believes you anymore. Looking forward to what they could possibly come up with next week. I give them points for creativity, but evidence to support your claims should probably be included.", "That's really fucked up that they can just run up on there shit cause of a video they could have owned those legally how the fuck does that give them probable cause I wanna know what hater judge signed off on that. You not safe anywhere theses days it's bs", "Abdul Mudhir for the past 2 weeks lol", "Better know how to fight if you're gonna go around trying to fuck other dudes chicks", "And they wonder why people shoot each other in America no matter what if someone battered my dad I would put the car into drive and flatten every one of them girl or boy", "If this is the case then just about every person to be on the cover has had \"devil horns\" it's just the placement, it happens...", "Ain't this that dude with the memes and shit", "Sure insult me and then promise me money if I quit! \nHe needs to hold onto that money because I got a feeling he's Reeeaaaaalllly gonna need it in the next 5-10 years.", "That would be a good show a I'm in the future mms fighters vs roomasters", "He going be setting on the other side of that pole waiting for him one of these days", "White? Black? Purple polka dots? When are all you dumb fucks gonna realize? If you aren't rich, in charge, or both, you are are considered beneath them. So look at the poor motherfucker next to you. Doesn't matter his creed or color. If he's poor, and you are too, you're both fucked. The only solution is to look at him as your poor BROTHER and know that until you stand together.....until you fight together...NOTHING will change.", "It's no fun to live in fear now is it. If the government don't start cracking down on cop killing the fuck out of ppl. Ppl guess what shit like this is gonna continue to happen 1 more thing if a civilian can go to prison for killing a cop dog well a cop should go to prison for killing a civilians dog regardless of the circumstances", "You guys don't remember the pet rock? The is the new EDC version so when you're ready you can play William Wallace or David and bust someone in their head.", "The price could be for the pouch since it's some fancy leather that apparently is labor-intense.", "Everybody so fuckin serious on this post smh... Drink a beer, smoke a blunt, LIVE A LITTLE.", "Forget that. What's the name of this guy? Been looking for his petty nigga vines", "You know it's funny how the women that said they would are  trying to save face by saying they joking when men start calling them hoes or trifling and shit.....", "Bram Schepens das nog niet overdreven ook niet haha", "Marybeth Bond i would have two, one for being with you, one for you being you! haha", "If my dad found out I put my hands on a man his age, especially a father, preventing his son from being jumped. I honestly think he might just shoot me dead.....respecting elders is an absolute !", "I hope they bury him alive, let him suffocate slowly, crying like a lil bitch like most of you all here while pissing in his pants because he knows he fucked up. If I was judge and executioner, I would of also thrown fire ants in the box w him.", "Nigga look like a Sloth with piercings.. With Dreds. Yea he has money but he can lose it as fast as he got it. But what do you expect from a man child that rap name starts with \"Young\".", "I swear to God I hope China or Russia or North Korea or anyone will just drop a nuke on this whole goddamn savage infested country", "Maybe lose the Fedora if you want people to take anything you say seriously", "Adam Menkens there you go ironman in his suit right at the end", "Can we just talk about he she's calling her own son nasty and dirty, but she's saying how he brought her in the room IN HER HOUSE full of dog SHIT!!! Obviously your just as NASTY if you don't clean a room with DOG SHIT on the floor!!!! GHETTO MESS!!!", "I get it he didn't start the fire but the negligence is his fault &the state for doing nothing after four citations\nIn my eyes it's the state department that issued the citation and the owners fault.Prayers to the family of the departed though\n&may they rest in peace", "Here in the United States, we raise kids to be disrespectful bitches. These clowns will be on their phones right in front of the teacher while said teacher is giving a lecture. It's funny because they're usually the ones that fail or drop mid-semester.", "The gonna cooperate with a butch with pink hair, and family eats mcdonalds for thanksgiving what the fuck", "Damn they finally made a movie about the War in Chiraq", "Then they run off n start talking shit about. You n try to make yu look stupid. Fuck that been there done that. Fuck those convos. Just keep shit to my self.", "So repeating \"stop resisting\" while hitting someone is how you get away with it? I gotta remember that", "In the words or A PRE-psychotic Kanye West!! \nI ain't sayin she's a Gold Digger !!! \nBut she ain't goin outs with no broke ni66a!!!", "Imagine they dumped on his ass on accident thata been fucked up maa niiiiiiii aaaaaaaahahahah", "What did the cop do is the big question? Cops don't be pissed when black men fight or shout back. Y'all always give them the hard way to go and hit or kill them for no reason but yet want to cry like a bitch when a cop dies. I really don't care. Stop being racists, stop acting hard cause you have a gun cause when it comes down to it you are just like everyone else. So to the cops who are racist, want to hit people for no reason or want to kill some one for no reason y'all should die. I don't care. FUCK YALL", "Wana get in there like a jack russell", "Well next time he'll talk to her before pouring his feelings on twitter one of the most savage place after Chicago and Australia", "\"strap black man\" stop making it a race problem. It's not a race problem, it's a policing problem.\n\nThe American police see a vulnerable person that they can take advantage of because they have a badge, they don't see colour.", "The man who got shot was black... Why the fuck y'all keep saying hes white? Besides it don't really fucking matter white,black, Brown or yellow he should of complied.", "the reason why so many died was because they were on some heavy drugs and thought the warehouse burning down was a part of the rave", "We're the original spider man at.. tired of there being a new guy every time. But ohh you have to modernize it to fit our culture because the original Mary Jane and spidy aren't cool enough for the younger generations. FUCK YOU,", "Foul on the play. Reaching. 2 free throws and possession.", "That wasn't broken it was a dislocation. At the elbow.", "No bright lights, don't get him wet, and never feed it after midnight!", "583 feet up. 583 shot attempts down", "As bad as that text conversation is, thats love....you'd go to jail for that person!  I know two people max I'd do that for.", "Dam the next couple months of my life would be avenging my father. EDIT: That includes getting in shape and learning addresses and shit", "I love the report from WSHH, \"the WHITE man\". Why couldnt it just be \"the man\" but no you gotta make sure you play the race card. should change your name to WSR, World Star Racists.", "This shit is stupid as fuck", "Wtf! Were they conducting it in the middle of the street?", "Hey bro don't wreck a nerve some days just come and went good...thank God we need them much better ones", "Drink some fucking milk already Jesus !!!!!come on lady get your life together", "Times have changed, I'm living in world full of gays. When I was growing up you would never hear about this. Dudes are undercover and women are sceptical. Hold on to you your girl.", "So it's \"fuck the police, fry em like bacon, and die pig die\" until it's a cop of color then it's \"oh respect her she's a cop, I can't believe someone would say this, and it's all trumps fault\" there was racism before trump and there will be racism after trump so suck it up and stop crying like babies", "Man if you dudes are eatin just any pussy you pull from the club... you're gross. Ain't hittin my blunt lol", "I thought that was montel Williams for a second lol", "Its pages like this that hype ignorant shitty rappers to fame, then we all complain why the industry sucks nowadays", "I've actually threw up from being to high. lol sounds weird but it's when I first started smoking loud and I smoked a lot of loud and I felt like I had to throw up and I did. Idk how that happens.", "Its better than whats happening in their own country, you're families are being slaughtered and you're upset because your feelings were hurt? Get real.", "Wish he would grabbed his @$$ - it's all fun and games, haha and kee-kee caging animals for the pleasure of those who come to pay and see them...but that'll be yo @$$ one day Mr. Postman! #naturalselectionplease", "Jesse when u come over pls bring me skittles and mnms", "He's funny yeah but that line \"get that ass over here boy\" is a little off putting", "This is why you gotta be an asshole to these girls haha your chances of dating her or smashing increase dramatically. Nice guys get the girl after she has fucked the whole neighborhood and has 5 kids with 3 baby daddies. Only then is she ready to settle down with a nice guy finally", "Silvia Araceli no tendran tiempo de atenderte", "You wouldnt be there im the first place if you didnt break the damn law", "Linda McMahon (Wife of Vince McMahon & Former WWE CEO) is in his cabinet. Both of them have gotten a stunner from Stone Cold Steve Austin. I hope Vince McMahon does his Billionaire strut in the White House after she's sworn in.", "Lmfao people still talking about Conor gettin strangled. Hahaha, like that one loss should loom over him his whole career. He came back and beat the shit out of Diaz in the second contest, and NO HE DIDNT RUN. became the first person to hold two division titles simultaneously, and successfully defeated the dog strangling kangaroo. Put some respek on his name", "35 bucks for a sweater? My mixtape aint selling enough copies to get have that kinda cash!", "The employees just let it happen. I'm wondering if they put out displays instead of real working devices so no these robbers can feel like morons.", "Terrell Horton in memory of harambe we should watch it", "In case you're too busy to read about the case and you're one of those people who scream racism any time a black man is arrested for fucking anything, here's what happened...\n\nA whole bunch of idiots posed with what looked like real firearms in the front yard of a home. Police saw their viral video and were readily able to identify two men in the video, who were felons. But they were innocent, right?\n\nFelons can't own, shoot, carry, or even touch firearms.\n\nThey presented the video evidence to a judge who said \"well, they look real to me, so here's a search warrant.\" Police then executed a search warrant and found two of these good, innocent angels in possession of guns and drugs. Surely the police planted them though, right?\n\nThat's what happens when you do stupid shit like this. You get jammed up and no amount of \"he's innocent, you're just racist\" is going to help him. Wanna know what will? Help him stop doing dumb fucking shit like this.", "Jacob Rivera Steven Soto man I think I actually love baseball lol", "That's so mean your people who shame others must truly be unhappy! God bless your heart!", "Kelly watch out it will be Matt next purchase lol", "Kyle Aiken, when my sister had the headgear and giant mosquito bite.", "I watched this 10 times in 1 minute", "America is the joke of the universe. thank you for making the world happy by acting so foolishly the whole world laughs at you. and also so angry cause YOU FUCK WITH PEOPLES WELL BEING", "Big boys always trying them haymakers and fat pushes... to much forward momentum. Bob and weave lol.\nSpit in someone face you probably getting knocked out. \nReal fighters don't spit", "I remember going to a suns game and Jason kidd gave me his shoes. An old man tried to take them from me and got pushed off the balcony by my friends dad. Ha ha We both had a pair of signed shoes.", "It cannot be murder in the first because it lacks premeditation but i do think a murder in the 2nd would be more fitting than manslaughter it isnt like he killed him as a reckless driver would be more suitable for the manslaughter charge ..", "This made my eyes start sweating tight quick. Tissue, please!!!!", "What if Someones mom is now expecting a prank like this....but then something  along these lines really happens... so their mom gives a response similar the one given?...both are screwed...", "I don't think he's a bad guy, he was trying to help but if he was gone invite people to live there especially his wife and kids he really should have made sure the building was up to code.", "That's the same shit I said lol he's known for dancing for the kids never been in the hood he couldn't come up with another hit for the kids so he had to resort to acting gangsta and being hard so he could be accepted lol smh soulja u not a gangsta superman don't shoot ppl lol", "I try to go first so I'll now how enthusiastic to be when I go down! I ain't trying to give you a 10 performance when you only give me a 5. #getwhatyougive", "Guy with the green hair was getting worked tbh lol then his boyfriend gotta jump in smh", "Take a little bag, put some cat litter in it and leave it on your dash! It works! Lol Marcus Gio your mom told me that", "Thats just means he worked hard for those millions...yall better leave those broke ass butter finger dudes alone", "Dang I'm surprised it's not an anti-whiteperson post", "I find it funny all the fuck the police posts. What would you do without them? This would be a 3rd world country full of murder and anarchy no one would be safe. Or what if we were under marshal law having our military police us. Then shit would really fucked up. Of the millions of police interactions in a single day people aren't killed or shot at. There are bad cops but that goes with ANY profession can't condemn all police. If you do your dumb ass is the one's that need to stop breaking the law. I have found if I don't commit a crime my interaction with police is almost zero.", "You still haven't beaten Terrorism Obama. You should have sat down with them and told them why you are invading their countries and destabilising the planet. FUCKWIT", "Look like the Virgin Mobile CEO Richard Branson", "This video is so very sad on so many levels this is the poor black youth wtf are u doing w your life little girl what do expect to be except the lady that is filming no self worth nothing and it's really sad because if someone had cared about this girl maybe she wouldn't have been doing that and I've always said I can be poor in the projects all you want there's no excuse to be nasty and not clean omg I've seen some shit but this is pitiful", "this is why i miss the 90s hiphop i wanna listen to something where i can actually understand what they talking about i can maybe count on my hands on how many good rappers are left today", "This level of genjutsu doesn't work on me.", "After listening to that I wonder what the hell happened to the game. This cannot be the future of hip-hop because it's done if it is.", "Meaning a prison director ... Fk I'll talk myself I never ever use them ..", "Now what if this was a grown ass fuckin man saying he fucked a 9 year old girl? Nobody would say its funny! Nasty ass hell!!", "Lmao America has no intentions of breaking up Isil or Isis whatever they fucking call them , haha don't fall for the US bullshit .", "For all of the retards out there.... HE WAS AT THE SCENE OF AN ACCIDENT!! AND... GET THIS.... You don't let someone you believe is drunk get back into the car to move it out of the street... For these reasons one day you'll get fucked up by the Police... and you'll deserve it.... smh", "Baseball be doing it like this?? When's next game? I'm going! \n#instantfan", "That delinquent probably deserves an ass whooping anyways. He' wouldn't be yelling fuck anyone if his parents taught him how to respect people of authority.", "They aint gonna do that for BASEBALL. Hell its America past time there shall be no shaking of the ASS !!", "That's a Brazilian butt lift. They take fat from other places in your body and inject it in your bum. No shade here, at least the ass is \"real\"!", "Cause that's something they would post on the internet. These text message memes are getting fucking stupid", "Although the scenario is crazy.... I bet if they were in the woods with \"Duck Dynasty\" gear it would have been the ultimate mannequin challenge for these individuals. Lol", "President Trump! Get use to it for 4 great years. Bye bye Obama, Trump is draining the swamp and flushing the White house toilet!", "I have a feeling ozzy is going to do a review about this lol", "The dumb it way down generation wanna get mad when you call it like you hear it, straight garbage!", "Plot twist: dudes girl didn't know the camera was there. He was trying to catch her slippin.", "Wooooow. This was awesome. Worldstar just showed an amazing video of a kid showing how bad ass he is by fighting 3 guys at once. What a time to be alive", "I guess if you have $85 to waste go for it, it's your money. At least you're not buying crack with it!! Lmao", "Emily Wilson this was always you and probs still is", "This is bullshit! Why is this even posted? If anything this makes police look the way they should! The kid was a punk! So what! Poes were cool! Should have taken his ass to a wooded field!", "What if she is the babysitter though?", "A private attorney will always tell you what you should have. A public defender will tell you what you can have. If you have a good one... this is going to be the person that sees the same judges,court clerks, & prosecutors every day.  They will tell you exactly what you can and cannot do. Or you have a bad one, that will hang you out to dry and have you plea to the max. There's been certain situations that only the public defender would have been able to get me out of. Either way you have to choose a certain evil. Some things money can't buy.", "Why people trippin about the wedding dress...like it ain't already got jizz on it lol", "Anyone who believes this is almost as stupid as whoever runs this page.", "Terrible terrible things ... my general rule was always one or the other", "This must be where they got the looks for that Disney movie dinosaurs.", "If you really bout that candy life you'll be able to tell the difference before you even eat em", "Just cause he's paralyzed from the legs down doesn't mean his trigger finger doesn't work... being paralyzed isn't an excuse to run from the cops", "This is cute, she needs loving too, we all fuck up sometimes", "If the meat is organic yes if genetically engineer know,those food in McDonald's Wendy's Burger King and many other the slow poison food no good for human consumption", "I cringed when I heard that snap.. they call her Mrs.Glass.. if you ever seen the movie .", "Lol Shehana Buksh this car is sick", "Imagine if this was a guy fucking a thirteen year old girl how different it would be", "Don't click my edited. I said something terrible", "Wow her broke down car in the shop looking ass is clowning this young lady for doing something she look like she just finished for that damn cigarette...", "I'm not gonna lie tho she looks sexy af...she should be with a real nigga like me straight up!\n\nAnd what she mean talk? I mean unless we got kids then it ain't nothing talk about. If it's sex then shiit  my stroke game always on point so no issue there", "The cereal is fine am just wondering why y'all got to ruin it with this wack ass pair of woven things...y'all niggas call em yeezys...them shits stupid af am surprised somebody called em shoes...they uglier than trumps haircut", "I must not be high enough, I don't see anything wrong or weird here", "I wrote some really messed up stuff about this, then decided to edit it.", "That's exactly what it says on the card", "Lol big nigga couldn't swing for shit. a lot of bigger dudes try to rely on their size in a fight but footwork and actually knowing how to swing a decent punch >>>size", "These Worldstar comments funny as hell..Half these females commenting probably have fucked up PH levels. Ladies first.. Suck this dick and gag slow..", "nowadays they all look the same on instagram ! it's really depressing..", "Someone take her Black card away. She's no longer one of us. I will not be affiliated w such ugliness.", "I tried that crap once. I opened up the sandwich and was completely discusted.", "I'm cutting onions, that's why i'm tearing up I swear..", "They should do that with black kids at school. Maybe they learn discipline", "Special shout out to those McDonalds workers who don't get bitchy when you ask for extra buffalo sauce.", "That lean done warped his mind. The great thing is read all the comments. We all feel the same about this lame. He's garbage rapper. Irrelevant. He remind me of Donald Trump. Starting shit with everyone and throwing fits like a jit.", "Like my status if you would suck my dick", "Before you say something retarded listen up: what good are career politicians? Aside from lying and siding where the wind blows and manipulating, spreading diversity what good are they? I'd rather have people with REAL WORLD experience. People who have started businesses because the Americas and Europe were built on capitalism. Fuck off", "Dont let this distract you from the fact If the Cleveland Clowns QB was a cyborg it would still get hurt behind that OL. The NFL needs to make a new rule for the clowns for the rest of the year, the opposing defenses can only two hand touch their QB's. This will give them a fighting chance.", "The owner should have tried the mannequin challenge. Might have been more successful.", "How much you wanna bet his mom works at the mall and he goes there every day after school to wait until she gets off and now he's thinking damn... I'm still coming back because my mom still works here lmao.", "Looks dope! But what's this waiting 7 months till it drops shit?", "Alright....here we go, two guys egos getting in the way of their mental. Pretty soon we are going  to have a \"nigga\" moment and someone is going to be buried over some stupid shit. I swear I felt like I was listening to one of the niggas in my high school back when I was in high school", "Conor needs to have that tie breaker against Nate Diaz and stop running like a little bitch.", "You mean when you go deep in her without having a conversation?", "Punch the kid into the face and body slam him then take that Stephen curry signed piece of shit then burn it as I watch it burn", "WSHH took an L on this post", "Lmao would probably have 20$. An 20 things that good. Hell yeah", "His gf prob inside tell him she pregnancy! Peace! Lmao", "When did the chick from Orange is the new black get a grill and become a rapper?? 2016 just flew by wow", "Brittany McDaniel this might be the best one yet hahaha", "Omg I did this one night leaving work ( I only lived like a mile up the road) I blasted a deer in my Monte Carlo 86 ... tour it in two pieces guts every where. .. all it did to the car was close the gaps in the body panels \n... gotta love when they made shit to last", "True.It's very rare to find a person who wants to talk about cars all the time.", "I have friend just like her. It's great just drop stuff here and there on the floor just to watch her pick it up", "Dsmn I wouldn't even ha that. Well then again I'm alive so that's good", "I'm a little more worried they were all sitting around smoking crack.", "What a fucking joke. After the election, everybody at work that voted for him was throwing it in my face. Now.. I'm having fun.", "Stoked for it. If it all ends with a good remake of Planet of the Apes, I'll be happy as hell.", "I'm sorry, I didn't vote for Hillary or Trump... but this is even getting on my nerves. If it's not the electoral college then it's Russia.... plz just deal with it guys!!!! The president elect is Donald Trump, unfortunately nothing is changing that anytime soon.", "All those officers should be fired and arrested. Don't let them take the easy way out by retiring from the force. The drunk driver should definitely go through the judicial system for his transgressions AND Sue the City, Department AND officers individually and as officers. What a disgusting abuse of a badge", "Dudes don't care they'd do Satan if he had a pussy.", "Well why don't you post the uncut version? 10,975 shots later...", "Man if it was a black guy shooting a white guy yall would flip! Theres obviously something that made this the way it is stop seeing fucking color. What if that man was protecting himself huh? Perfect example my cousin was protecting himself and killed a guy with a piece of wood and he got 8 years for manslaughter take a step back and and realize theres two sides all anyone ever wants to do is blame race", "I wish a teacher would try and put there hands on me. That's how you actually get a kid to bring a gun to school", "Haven't we seen enough guns pointed at black men? The guns was totally unnecessary and they should have to answer for this. Foresight, what if they got so carried away and shot him or her or both?", "If I start talking about midgets....I'm flying to high LMAO", "I'd have 365, because waking up healthy everyday is a good thing.", "World star can you please stop enabling these idiots ? Stop spreading racism when I was in jail a drunk white guy was fast asleep in solitary confinement and a cop ran in their and maced him in the face and said next time it's the tazer and then he ran away and got away with it and no one cared. The correctional officers in jail treat EVERYONE. Like shit in there", "Put a cardboard outside the window, even when it's hot? It works and it's cool to take off your not burning the shit out of your fingers to try and folding something...:p", "Put that muthafucka to sleep. Drunk or not he shouldn't be talking shit to people, talking down on them. He asked for it and he got it.", "My mom says I'm her special little star. I don't need a crush", "I'll call them and tell them \" I'm outside\" yet I'm still getting ready, two can play this game.", "The worst part is, they used his wife wedding dress as a jizz towel, smh", "Tim Mc Donald We need this shirt!", "Who knew 1 mistake would haunt you for life??", "Man that dog looked like a nigga I work with name Mr.Jim kmfsl", "This one time I spot a flow about the elastic around underwear and this dude told me I was the truth", "I know people will bring up shit about being gay or straight, who knew how to fight, race, but man fuck all that I'm just glad nobody got shot.", "First thing about friendzone: stop thinking your female friends owe you anything just because you're \"nice\". Once you do that you're not nice at all. You're creepy", "At the end of the day my brother wasnt tryna impress no fucken body. Idk about yall but i cant ignore somebody trying to step up to or step into my zone. He did what he had to do. Dont be drunk in public, thats how u get fucked up", "Are they desiigner clothing...? Budun tissss", "I can't get enough of this if I'm mad as hell I can watch this and laugh crazy. Good shit niggas", "Idk ask some of these grimey ass MF that be eating different girls every time they meet one at the club.. Bitch could have herpes and MF still eating that like its the last meal they're ever gonna have... #relationshipsonly", "All that just to embarrass the girl???? Why though?? What really got me was when she said she uaually let him rock out like what f she dont have a seat lol. Her crib dirty and empty. No curtains, no furniture, fold out metal chairs, and a freaking baby crib in the corner?? Where the baby??? Why is it always an infant in the dirtiest houses???", "This pic is very old it's been around since myspace years. Not her kids she was babysitting", "Okay Worldstar you got a video here with the person admitting they had sex with a nine year old are you guys going to actually do anything about it I don't think so World star accept child rapists", "I don't see the problem. The Hispanic was a racist, saying racist shit. Racist people say the exact same shit, swearing every Black person is broke and on welfare, on these innanets. So drunk, tipsy, or not he knew the racist statements he was making. He was just saying what he hears and reads expressed by racists on a daily basis. He just never expected to get dealt with. I'm also noticing how many Hispanics are just as racist as waypeepal and they all parrot the exact same tired racist drivel.", "I brush my teeth then go start my truck and let it warm up while I get dressed.", "Fuck he was so prepared for that !", "Long as social media female attention whoring is alive and well then this cycle will keep going lmao", "I feel as if you made it this far, wild the fuck out man Fuck What anybody thinks Have fun a bit, fuck this shit, and let the world suck your saggy ass clit", "Haha this is legit me! Hair and all Tori Trigg James Drummond", "Honestly, he was probably a little embarrassed. Everybody wants their generosity recorded now, and if you want or need that validation, it's fine, not my cup of tea, but certainly nothing wrong with wanting acknowledgement, the other end of the spectrum however, is that it may be awkward, embarrassing, or uncomfortable for others. Not to mention, he's a teenager, they're already self conscious.", "Who in the world have a shitty room in the house and they call it the shitty room that shit crazy and it recorded and put it on the Internet for the whole world to hear And see that's a fucking bum bitch the mother is worse than the son", "Everyone saying fake this, fake that but all you bitches are fake including fake eyelashes, lipstick, nails, etc....", "This is why I have multiple warm blankets she got her own and I get mine", "Fuckers.. Too yall goodie 2 shoes on this post talking like you holy er than any other mthrfkr or thinking you won't get a ticket or case one day, hahaha the jokes on you & you'll learn in due time. Fuck you & the system", "Never ending story dog got old. I guess there is an ending to the never ending story after all.", "What if she knew he was mentally unstable, orchestrated the phony robbery, caused some useless stress by being a diva, brought him to the point of no return just in time for his mama's death anniversary and now that he is down, she patiently waits for the mercy kill... Even Elizabeth Bathory wasn't that evil...lol", "All i have to say ship them back to there country instead the media is crearing a race war between black and white and we are falling for it all and not pulling together and looking at the real threat open yours eyes America", "This is old it's on the Future-Esco tape", "I'm just thankful my father took time out the struggle teach me the essentials of a fight, he got tired watching me take those L's out on the street. Said son I can't stop the flaring fire of youth all I can do Is fan it in the right direction. With that came the knowledge of when it is necessary to fight and when It is necessary to walk.", "Hell yea dude 420 copscantcatchme kms rn but nah nah nigga i aint bout that suicidal shit im pacifist af so ye maybe 2k17 will be more lit than 2k16 smh niggas told me imma die cuz end of the world but nigga be trippin smh how da fuck i almost got heart attack when i saw that fucking meteorite lookin ass asteroid that was filmed in russia smh imma go and smoke some o dat purple haze oregano ink mixture hell yea dudr", "Jason Schopes\nSmother the bastard in cereal. \n(I know you've seen this but I couldn't find your comment)", "Jerome Christopher Ferrer why the fuck does this remind me of you!?", "LMFAO! Rock a bye baby!!! His dumb ass hanging around the scene of the crime like he found that mufucka like that!  You did that shit nigga! U better Run Forest! Run! LOL!", "The system fears the potential of black folks because they know who we are. The systems of the world have tried everything to kill us off and we are still here. I believe black folks all over the world are starting to slowly wake up. We are a strong people mentally and physically.", "Peter yeyaaaaa what up youtube youtuuuuubbbbbeeeeeee, what up?", "That Henny gots me being all I can be with the dirty", "I love how so many ppl dont know the whole damn story. The boy was bullied for months everyday till the breaking point. No it wasnt right, but its the world we live in. The school and faculity knew about the bullying but did nothing about it. so after a few days the boy wanted to take things into his own hands.", "I feel her on the Mcrib thing, but Santa Clarita doesn't have snow anyway for Christmas", "So why the fuck is the U.S worried about what's going on in Asia and instead of what's happening in the U.S?", "First rule of the friendzone... You dont talk about the friendzone", "Cole Tannor cereal out of chinese tupperware, uk who", "I can't even keep my dog in a chain link fence, and here this lion is.....", "I know a couple niggas just like him", "Quavo has better shit to do than pay anymore attention to an irrelevant one hit wonder. Nobody's scared of your little purple gun and the \"extendo\" clip you got.", "Stone Cold Steve Austin will head up up the FBI and that's the bottom line because Donald Trump said so", "I have a relative who is graduating law school and thinking about going into the public defenders office. My dad (also a lawyer) is highly against it but he (the relative) is making it imperative to help people so he is considering public defenders office or non profit (both make peanuts). I'm proud of him and I wish I had the guts to help people in need like that. Plus they also pay off your loans when you work for the public defenders office and that's why a lot of kids take the job after passing the bar exam.\n\nWhat I'm saying is public defenders get a lot of slack but truth is they are just understaffed and are just trying to help. We should cut them more slack sometimes even tho I know it's hard if you are looking at a lot of time and stuff.", "I don't know why everybody so excited about this car only rich people can afford it anyway", "Lol, I'm just gonna say this: HATRED BEGETS HATRED. Even the Muslim community needs to change people's mindsets. \nWhen a class of a religious sect bombs citizens who were neutral to its beliefs and values for (out of shear hate) - at least as far back as I can remember - since Bill Clinton's administration), then it is only expected that the inevitable response of hate builds up and begins to manifest at a time like this (the general you reap what you sow - suffering for the sins of the fathers).", "This is disgusting and she looks filthy, nasty, trifling, diseased and any other related synonym. Why would he even want to touch her or allow her to touch him?? Ugh", "Lmao ya mad asf if u listen to the radio at all beyonces horrible song about jay z cheatin on her wit \"becky that has good hair\" i dont think vivian was trying to even bash on the fact that she has good hair i mean whats there to bash on . \" haha u have good hair \" no just doesnt make sence", "Somebody come get yo grandma! \nShe's crossing her generation boundaries", "there's no black people in England, this shit is fake.", "Haven't read one messages posted over this vid but I'm sure the hate towards officer is legit and real.\n\n I'm sure the majority is celebrating an officer got hit by a car like thst.", "the only thing these fucker cops knows how to do is just shoot....", "This is actually gross as hell. Theres kids there and shes twerking.", "Becky Smith remember driving to school in the mornings in the mini van doing this I could hardly see lol", "Good grief! It is simple...show respect be kind  and show some tolerance...a lot of what is going is bullshit ...we need  change...there should be no racial war...we are one country...we need to unite..slaves ended centuries ago \nBand tohey", "Every fucken time coming back from taking big dabs while on my lunch break", "id sell them all 35$ a gram", "Andie Smith on the ride back from Kelowna and we got into that deep ass conversation about what will happen when we die hahaha", "For every stupid invention, there's a retarded buyer out there.", "You're just creating unnecessary CHAOS for the sake of your Ego. Cruel intentions.", "I'd curb stomp that fucking coward. That guy is such a big pussy, I'm surprised Trump isn't trying to grab him!", "Hope she didnt really birth the one with big lips. That shit looks like it hurt.", "Who gives a fuck. As much as these racist cops purposely killing our innocent black men, kids, teenagers & women because of the color of their skin & getting away with it. I ain't watching and looking for him. If anything I would help this brother. \"Street code I don't hear or see nothing\" Fuck the Police", "Seriously , its because of people like this is why Trump got elected ... SMH", "Uh...I noticed it was a pillow right off the bat. What are y'all smoking", "The tenant still ain't gonna get their deposit back.", "Roses are red \nViolets are blue\nIf it wasnt for\nThat kid\nHarambe would\nStill be here", "This pic don't show no difference. He look the same to me lol.", "a little too personal to blast on social media...am I wrong? opinions please", "Real talk he should have slammed his Bitch like that for opening her legs a man is only going to fuck if the female let's him", "This truly heart breaking. . you never know when its time to go home to god .. He would have never thought going to a funeral would end up killing him :,( but before he felt pain Jesus allready took him from his body. . and im sure his best friend was right there with him the whole time .. Jesus protect his soul and bless his family in Jesus name .... Amen", "I just wanna get some shit off my chest. First of all, Hillary Clinton claiming that she carries a bottle of hot sauce in her purse, obviously to get some black votes, was the most racist thing I saw in this whole election.\n\nSecond of all, all the Sanders supporters that wanted less politically motivated people to run our country are getting mad at Trump for putting people in place who aren't politically motivated. I don't support the man, but we gotta start somewhere. Who knows what will happen with his presidency? Yeah, he's a dumbass who doesn't think before he speaks, but what was Bush?\n\nYeah, Obama has lowered our unemployment rate and the economy is slightly better, but not by much. Plus, the healthcare act, so many people lost healthcare because they couldn't afford it. I'm one of them. Before, my job paid for it. Now I don't have it. So yeah. Nobody is perfect.", "They forgot my flow is accurate", "If the place came furnished, I don't see a problem.", "Girl gives head..man gives the ring.lol its the circle of life.", "I may not have shown it ... but you would've smelled it!!", "Helped me out too, I use to give a shit until I smoked that sticky green.", "No racist title? Is this worldstar still?", "lol everyone needs to get out of their feelings and understand a crime if passion constitutes manslaughter. It shakiness time and time again. He's gonna go to jail. Relax", "Diljeet Singh Harmon Singh Arun Singh Mann", "Omg stfu. They always say they got evidence but never provide it for us to see. They just trying to scare everyone. Fear big bad Russia. They want us to just take they word for it. Cuz the government always tells the truth right? Don't fall for the bullshit. And before ppl start with there trump Clinton bullshit I don't trust either of em. Just saying our government is full of liars. They count on everyone being gullible and won't do they own research. Knowledge is power.", "I went to the doctor and he gave me 2 months to live. So I shot him. Judge gave me 30 years.", "I'm gonna start my own news page and post stupid shit all the time, fuck it gets these people paid so why not?", "I am not a homophobe, but I would not fight a gay dude! They can throw hands! They have to know how to fight. Always defending themselves.", "That's why you should never be friends with a bitch that you want to hook up with and smash. It's either yall gonna smash or not and become best buds while holding hands and skipping down the yellow brick road. Nawww fuck that shit!", "So she's a whore.. A lot of you whores out here ain't getting paid a dime for doing the same thing", "My heart goes out to that child that got shot,imagine getting hit kicked or teased everyday,I don't see the color,I see a child in pain why can't these officers shoot legs arms,shoot to injure not kill because he probably want make it.I was bullied to, my situation was very similar to this one but thank God for my mother and brother who put a stop to the situation.prayers go out to that family.", "The Earth is flat. Aliens are real. The Earth is just a giant UFO. The Sun and Moon are the same size. We lived these lives already. The Sun is a giant disk. UFOS use the Sun for energy. Everyday we are being visited by other beings. Look up. Time is an illusion. God is an alien. You can teach yourself.", "I'd pour holy water on my dick, slide right in & say \"May the power of this dick compel you\"....3 times in a row.", "I love my two dogs I would my family to do me that favor when I'm about to go out like that.", "I hate when a man takes it out of the other man. It's your girl who opened up. I'll never understand. Bro hit your girl because you obviously ain't got it. It was fate homie, move on.", "Real shit, didn't even notice that dog until I read the end", "It's so obviously overwhelming not a single director of our intelligence agencies has publicly stated so nor provided the evidence to support this claim. It's also noteworthy to remind the public that our intelligence agencies all have separate functions and missions; therefore, I'd love to know which agency identified the hacking and then provide the evidence they supplied to every other agency to result in this absurd consensus.", "Fuck that. You arent gonna kill me because youre a lazy fuck and cant wake up for work.", "This is a challenge they didn't post all the conversation on there, after the moms response the child says it's a prank it was just for twitter & she replies \"YOU already know I ride for mines\" or something along those lines", "But can he dance like Westbrook?", "Nine times out of ten the raiders fans started that shit", "Somone gunna try to shake her and and see her broken arm, then go to shake her other hand and see another broken arm, and an awkward situation gunna follow real quick", "She ain't answering cause she had a heart attack when her grandchild saw the nip", "ok Shia, come and light this fairy up too and show him what talent is.", "Anyway, like I was sayin', shrimp is the fruit of the sea. You can barbecue it, boil it, broil it, bake it, saute it. Dey's uh, shrimp-kabobs, shrimp creole, shrimp gumbo. Pan fried, deep fried, stir-fried. There's pineapple shrimp, lemon shrimp, coconut shrimp, pepper shrimp, shrimp soup, shrimp stew, shrimp salad, shrimp and potatoes, shrimp burger, shrimp sandwich. That- that's about it.", "Buying 2 comforters would solve that problem quickly. #JustSayin", "So he got fired for trying to teach that punk some respect. And I know most of you on here will make this about race. But if you watch the whole video you see how nice he is towards the black kids and how he starts talking about basketball with them. And he's only a dick to the white kid that he's had previous run-ins with. He definitely shouldn't have been fired", "Pull out game strong in that one", "Nah not really this one didn't get me looks normal pic to me", "If a girl starts on a guy it's gonna be such a quick fuck and he doesn't even take the time to please since he's all horny it's better to start wit the girl then she can be horny and get into it then the head is better for the guy", "Where Can I find that shirt!?", "Dude there are so many whites here in flint. Yes more black than white but its not a fucking color based system you race baiting fuckers. There are white children here that have lead poisoning right along with black children so stfu trying to make this a race thing its far deeper than that. Racial divide is only a tool that help control america population.", "Damn im glad im starting to see more and more rappers being more lyrical again bringing back the real rap!", "White America can't refrain from racism, even when discussing an upcoming movie.....", "Chris Garza haha should've gotten yours while you still had the chance.", "What you gonna do when they come for you? Bad boys, bad boys.", "200 comments, 2 thousand likes, and not one of you realizes its fake and there isn't a tweet from her saying that. It's a screenshot of a single tweet, with someone writing  meme text over it, we don't know who wrote the text at the top saying \"you're like a big brother to me\". It certainly wasn't her, it doesn't have her twitter handle, a matching font size, or an @acefreethoughts tweet back.", "He murdered Joe in cold blood. Joe McKnight was a good kid. Everyone gets a bit ticked off after being cut off. This man knew the law and used it for murder not self defense.", "Calm down. People throw fits and try to drop to the ground all the time with cops. They didn't throw her or do anything crazy.", "Don't let this distract you from the fact that Russel Wilson threw an interception at the one yard line on 2nd and goal with :25 seconds remaining on the clock to cost Seattle the Super Bowl.", "My dog is coming with me when I die in my coffin.. he will probably go first tho", "Did you know a man that puts his hands with holes in his pockets usually feels cocky?", "Stupid for the people that bought. Genius for the person the created it.", "The Governement put crack in KFC to destroy our black communities .", "You can definitely puke while stoned, no matter how stoned. And being stoned aids your liver in dealing with excess alcohol consumption. \n\nThis video has made me happy. \n\nNo wait that's the weed", "Don't spit in someone else's face, that's the worse kind of disrespect there is, I've seen people lose their life over that, either of them should've walked away before the situation escalated to that point. Smh", "I take over the blanket or i get mad if the cover is off of me....", "This is so sad. Makes me so thankful that I grew up blessed, in a good environment. She clearly needs prayer. She is mentally unstable and needs drug treatment in JAIL!", "Man we don't know if they were rude which from the looks of it, they were..... shit we all know some females that be like that at they job with their bad ass attitudes..... and we've all felt like firing back. Shit I ain't mad at YT.", "Well lucky for you, no one gives a fuck, or requested to hear how you felt. LMAO", "It's a game kids are playing with their parents to see what type of reaction that they'll get from them, and the kid with the best prank put it on Facebook. I had got done the same way, not with a car accident.", "I use to get but now I don't I like my regular  mind I always wonderd why I got high don't get me wrong there is nothing wrong with it but when I was I stayed to lit", "Here's a great idea. Don't do shit that puts you in court to begin with. #lightbulb", "Sean Shizzy Bray the dr king thing got me thinking they did this cause of trump", "Quit saying bae , you ignorant/ illiterate fucks means poop in danish lol", "I believe Russia had a hand in the release of emails that were written by Clinton and her aides, not to support Trump but to discredit Hillary and show the American people how much of a snake she is. The Russians hate the Clintons. They were gonna do whatever it took to make sure she wasn't president regardless if it was Trump or anybody else.", "The man is clearly drunk. Why argue or fight with a man that is intoxicated? Had the man died hitting his head on the curb, he would be looking at some serious charges. Black men have to start thinking with their brains instead of acting on their emotions. He gets ZERO points for this. Learn to walk away from stupid shit instead of running towards it.", "I have to laugh at this these men Rob the Apple Store and they sell phones in the store with cameras on them five times better than the actual video surveillance overhead what's funny is they can't even afford a better video recording technology", "If the information they leaked is the truth there's nothing we can do about it, it's her own fault for covering it up in the first place. Why is the news always about \"how did this get out, it's not fair\" and never the corrupt shit that was just exposed", "Really??? Because she didn't learn the first time???", "***Insert when people say Donald Trump isnt my president but Zac Efrons holding his arms out saying he kinda is meme here***", "Looks like he was joining a gang or a crew you know where you have to get socked for a certain amount of seconds... or maybe they were just doing that for fun.", "2017 grab her by th pu**y.", "That's why i got my own Blanket and she got hers case closed.", "No McRib on Thanksgiving is like Christmas without snow. It just doesnt make sense.", "You clowns pulling race into this need to look up the definition of both manslaughter and murder. Murder would've been if it were premeditated, and it was not. I hope the fucker rots in prison, regardless. But the charge is correct according to the law. Has NOTHING to do with each persons race.", "Didn't they come out with one like 2 years ago?? I haven't even seen that one", "Wait, you didn't mention the race of the police and suspect in the title!", "Talk about bad luck shouldn't be trying to arm wrestle.", "Grow the fuck up already grown ass men fighting at football games smh", "All cops carry guns so wtf is the problem here i just see a bunch of youngstas with guns now if they had a body on the floor covered in blood and a big bag of pounds in the video then thats some dumb shit a bunch of dudes pointing guns is what you see when you get pulled over", "People could do this everywhere all the time if they wanted, retail always has a don't be a hero policy. It would take an armed customer to make any difference", "Here in America cops are \"forced\" to kill if you resist arrest.", "This is a normal thing for the cabals in Dubai- she just better make sure she follows all the rules or they'll be playing hacky sack with her head.", "Most of you people talk shit y'all don't know about smh , every fkin phone has a demo mode smh .. Stop acting like you people do know Everything b.c thats the reason America is all fucked up", "Im sure his salary is well beyond the means to install a damn good security system. Something in the milk aint clean here", "Shelley Ann deze is hopi lit", "Duh, it's for broke poor people who can't afford lawyers, it's not only a system that's racist, but it's Also a system that's class racist too, meaning if you rich most likely you gonna go home before the broke nigga does.", "I don't condone this at all but if society wasn't the way it is now days things like this wouldn't happen. People are barely surviving and doing what is necessary to get by, sadly this is one of the things they are doing to get by.", "He was never in harm duh its China, they can run on walls and glide though the wind......or is that Japan? Who cares. They all look the same.... probably feel the same about us Americans with big penis's", "Fucking idiots talking about how they inherited all this wealth and she was just the wife of a rich man. Do some fucking research. All you idiots crying about how she isn't qualified because she's only successful because of wrestling better check again. Stop being whiney little bitches crying about every move the president elect makes. I'll guarantee you right now she at one point in her life had less money than all you crying babies. Look at her now. Yes head of small business. Guess what morons, where do you think a multimillion dollar corporation starts! That's right, a small business.  Stick to something you plebeians know best, commenting on twerking videos and fights.", "They can steal all the iPhone they want but remember all the iPhone have tracking on it. It will show where, and when they turn on the phone. Probably dont even need to be turn on to track it..long as the battery still on.", "That dude probably need one of them Sam's Club size packs of toilet paper!", "Always smile more than you cry, give more than you take and love more than you hate.", "His ass is banned from Atlanta nigga can't even go back home he stay in LA so what the fuck he talkin bout and the nigga never lived the trap life so stop all that tough talk and quit saying you big Soulja nigga you so small look like you done got AIDS", "Why keep doing these movies and switching out the main character...just keep making it worse", "Why yall gotta do the kangaroo like that tho???!!! Leave my nigga alone", "Since I don't listen to the new music out please someone tell me how many albums he's got that went gold or platinum? Oh wait it's only 15k so he's got what 2 maybe 3 songs? Lmao gtfo here 1 album wonder", "Not new. Your whack. The Cowboys will lose in the first round of the playoffs.", "What no labeling and constantly pointing out the races? Jeez I wonder why", "Kardashian butts!!!  No one is original anymore. If that's what makes you happy then go for it. Fake boobs, fake noses, fake butts, your still insecure inside. Reconstructive surgery is wonderful for people that need it for different medical reasons. But it is starting way to early for teens and soon everyone will look the same.", "Awesome act of kindness poor little boy didn't even know how to act or what to do god bless his soul this is something he will never ever forget I'm glad to see there's amazing people out there still :)", "He is demanding to be released. Claims to be innocent. \nHe will be considered innocent in the state of Louisiana if the court says they believe he feared for his life. That state is so fucked up.", "Black women are still gonna give them all of their money for this fake ass designer clothing line. Wake up black people. Build your own business, stop giving these white racist bastards your money.", "Li Yuan Julie parfois dans la vie, ca arrive parfois, parce que c'est la vie", "if u don't know how to fight u shouldn't  be talking to anyone all crazy like ur about that life lmao poor gay dude got hes ass beat! It would of been worse if it wasn't for he's lil friend helping him out lmao shit was funny tho hahha I would of been like that one guy still eating hes food not giving a fuck hahahaha", "Nate Diaz the only one who beat him choked his ass out n tapped  rematch", "Dont dig the uniform, uhmm i kinda liked andrew garfield in amazing spiderman reminds me of the nostalgic cheesy punchliner hometown web slinging spider we all grew up with", "Was dope just seems like they took a lot from Miles Moralez ... looks good though", "This is a man that works for the government, he can't without authorization come out and make a statement like that without permission especially against Russia who we are almost at war with now...dah", "Worst proposal ever!!!! White cops & Black man doesn't match!!!", "She should have banged that hammer. She the law ain't she. The story should read Muslim female officer layed down a mother and son, she has been put on administrative duties until a full investigation has been conducted into their deaths.", "How the fuck this pussy ass nigga going to talk about some one being ugly. And got nappy hair. Has this bitch nigga looked at his ratchet, gutter trash daughter lately?? Lol!", "Man thats all papoose does is spit on ny radio shows", "Soon as I realized the government wasn't doing anything about Flint was when I put two n two together. And it's really sad stuff like this is going on still to this day. I am so sorry for humanity....", "Any of y'all watching out for the originals??", "She's probably a preschool teacher or babysitter taking pics with her students idk who knows lol", "Why does that beat sound like \"long live the chief\" by Jidenna? Oh cuz it is...", "Man, if those cops were white, that neighborhood would have been burnt and looted. Lol", "What would be priceless is if the Police Dept. Responded with their own mannequin challenge busting them all. All it takes is for these young kids is to go get licensed before they get caught illegally with a gun. It's a no brainer. Be legit and they won't fuck with you.", "Why must I feel like that, why must I chase the cat. Nothing but the dog in me.", "Kikie Bernstine watch this\n\"That dick ain't mine\" hahahaha", "I challenge people to stop doing challenges and focus on getting some lvl of education and to wake up to this fucked up mediocre society.", "I'm not fighting none of them \nOnce I show them pussies Mr. Glock\nThey'll be running home for mommy to change them", "I think it really depends on you and your tolerance. Can't speak for rappers but I can still shred on my guitar when I'm lit af", "White women have the messiest pussy I don't know why it be creamy and sloppy as hell gotta love America", "I guess people have more rocks in their heads than i thought was possible.", "Terriblememestar pop music is what this page should be called", "How can you call yourself hip hop and post bullshit like this. This that mumble fuck boy bullshit. Real Hip Hop is gang star,a tribe called quest,Wu tang,Pete Rock, big l, etc.", "Look dude, you can't spit on nobody and not expect to fight. And if u can't fight, you ass is like dude, with the bleeding nose. Trust me, I've spit on my brother because he slapped me in my face and it was a all out brawl from there", "No offense . But my ex- koochie be look like that. Plus dat bitch stank", "Breaking!: Kanye to release new album after Kim K break up...\nMe: Maybe he will be like the old Kanye...\nInner Me: This album is trash, Taylor Swift does it better Kanye!", "I can't stand the way this girl says McRib. She keeps saying \"MuhCrib\". I feel like I hate her even more now because of it", "Damn that's messed up. But for one to joke about another person dying smdh oh unless it's your kid or loved one then it's not funny. But remember tomorrow not promised and if you have kids I wouldn't be laughing so hard not knowing. Sandy hook parents wouldn't have thought that'll be the last moments with their kids. Smdh heartless", "All of the white people trying to say that a black person or someone of another race could have done it and wrote the racist stuff. Like OMG can never take responsibility EVER! !!!!!! Since some idiots can't understand my comment I'll break it down I CLEARLY SAID \"ALL WHITE PEOPLE TRYING TO SAYYYYYY) What does that mean you ask? Well that means that the white people I am talking about said something that caused me to put them in a group of the white people that said that specific thing. That is like if I said ALL PEOPLE TRYING TO SAY I am another talking about the human race as a whole am I?  No I am talking about a specific group of people that said a specific thing so now they are in a group together. If you did NOT SAY  \" it most likely was another minority \" and \"prove white people did it\" and you were  open to the fact that maybe a white person did do it because hate crimes are something that actually happens in America. And you didn't try to move the blame from your race like the other (MOSTLY WHITE ) idiots are trying to. And saying that if I  assume a white hate group did it I am \"racist\". So you took \"responsibility\" in a sense by accepting the fact that it could of been and most likely was a white American looking at America's history.", "Too bad he's not dead. Piece of shit. Black, white, yellow... always has something to do with color...? Lmmfao. NO ONE CARES!!!!!!", "Looked like a hemroid pillow around her neck immediately to me.", "name: Stephenny... hits the Henny starts calling her Heffeny Yelling Out #Oooooooouuuuuu", "They were jumping him in a gang. Just testing him. If they really wanted to beat his ass they would of easily.", "What's this dude name I know he make a lot of videos.", "I'm confused why all the different actor's to play Spiderman?", "smh...reminds me of this woman on Instagram @getbodiedbyj  (on FB too) . Had the whole world doing her workouts and buying her videos and talking about exercise and diet and going to her classes and then BOOM...admits she got her ass done, smfh. Deceitful liars and the poor bastards that fall in love with them.", "If you know anyone who works in print then you know that absolutely wasn't a mistake. Editors stress over every single detail that we normally overlook and the exact placement of his head perfectly under the M wasn't at all an oversight. They probably did it just to get people talking but still, it was on purpose", "This happens to poor people, poor communities. Perhaps if your communities didn't just drain tax dollars, this would not be happening.", "?? I just was all... dohhhh like homer Simpson but in a slow deep tone. This shit had me confused as hell. No way its real.", "Where are all these wack ass rappers coming from???", "Lmao it's fun and games until someone dies from eating peanut butter, thinking it was a skittle..", "gotta give credit.... man you know you are a another level when you the time magazine and still have haters lol", "Y'all are drooling over this girl, but if she was yours, you know damn well you'd be pissed off and want her to cover up. Guys look for girls like these knowing they aren't shit. Look for a girl who respects herself and has some sort of sex appeal without showing her ass to the world. This is someone's daughter, sister, cousin and friend. Bet you nasty fucks wouldn't be so excited if this was your sister. \n\n*Btw I'm patiently waiting for the asshole to comment that I'm fat and ugly and a hater.", "I'm impressed by the comments here.. Usually all I see is dumb shit in the WSHH comments. Glad adults are on here now speaking words of wisdom instead of glorifying the destructive lifestyle of today's youth.", "i didnt see black shirt spit.. but i saw red shirt spit.. sad part is the red shirt fighting.. I didnt see any rollerskatea or wer floor sign but maybe others saw how slippery the floor looked under red shirt feet", "Keep in mind that sometimes the wrong turn can bring you to the right place.", "I can see u guys are running out of shit to post", "Well I guess he told him that guy was one of trump supported lol", "Ill wait till its on VCR", "Cathal Nugent i think i should shift to a different level.. What do u think? Hahahah", "I guarantee you the reason Quavo not responding cause he moving in silence waiting to catch Soulja Girl at the right time like a real nigga and  not like attention seeking soulja girl  all the Internet making a damn fool outta himself tryna be hard , this fool day is coming smh .", "This is coming from the personal perspective of a Porn Chick. The guy. It makes more sense to get me off first so that once I get u hard we can have at it. That's not to say they don't be hard giving me head but doing it that way ensures a good time.....for me.", "That's why i don't fuck with waffle house..nasty food,nasty conditions, nasty crowd,and you wonder why white people call you animals and super predators.. They jumped his ass..bravo..you ain't no man to fight a fag. Especially if you sucker punch", "Hell naw!!! Have my lady box beat boxin for no damn reason!! Look like he would give a vagina Alzheimer's. Ol \"let my people go\" ass fingers!!! Lookin like Chicken George was his granddaddy!!!", "Where does the mark wahlberg planet of the apes fall in?", "Bullshit! Michigan's just a fucked-up state. Politicians did all that. Other than the water in Flint I've never heard of a mass poisoning in America let alone one directed at a black community. This guy is an idiot", "I don't know about everybody else, but personally I wouldn't take a DNA test because I'm afraid of getting cloned.", "Come on DC. Make yo money. Don't get involved with this irrelevant pest.", "Do Kevin gates, 21 savage and Kodak all have the same forehead tattoo?", "A man gets on a bus and sees a very attractive Nun sitting down. He goes up to the nun and asks if he can have sex with her. The Nun says \"No, I'm saving myself for God.\" She then gets off the bus. The man goes to the bus driver and asks for advice so he can have sex with the nun. The bus driver says \"Well every night at 8pm she goes to the cemetery to pray, maybe if you dressed up as God then you can convince her to have sex with you.\" That night he goes to the cemetery in his best God costume and he sees the Nun. The man says \"behold I am God here before you.\" The nun is very surprised and asks if she can go with him to heaven. The man tells her they must have sex to prove she is faithful She agrees but she tells him that she prefers anal sex and wants to keep her clothes on. So he agrees. After they have sex the man removes his costume and says \"HAHA I'm not God I'm the man on the bus\" and the nun takes off her clothes and says \"HAHA, I'm not the nun I'm the bus driver\"", "I'm lazy and deserve that perfect body she has. Even though she's constantly trying to better herself and image isn't the idea. She just wants to be healthy and now has to deal with your fat ass staring at her with a bitch face cause you're a hoe and think everything in life should be given to you.", "Dumb girls are always trying to get in the middle of a mans fight. Then they cry when they get hit blindly. Ignorant brother claiming to defend his sisters honor when really she only got hit because of her own stupidity.", "It's crazy how these kids got no respect for adults now a days, back in the days when we seen somebody pops coming we knew to stop fucking around.", "Don't let this distract you from the fact that Real Madrid failed to top the group stage of champion's league.....", "This shit is beyond garbage motherfucker should of kept his ass in jail and save the embarrassment", "I just lost faith in all humanity I really hope she is lying and this was meant as a joke for the camera. The parents if they care about their boy better better get him checked for stds.", "Dade County PD is a shitty department. City of miami PD however is very different they actually care about people and try to help you rather than have a shitty attitude and treat you like crap", "Suit and tie? That's school uniform...", "Bobby Rayburn was right,\nThe fans are like women!\nThey're with you when you're up, \nBut when u hit a slump, they shit on you!!!!\nFTW", "That's what is wrong with this generation. All these kids knowing that if they ever do something wrong all they have to do is call their parents and it's a get out of jail free card. My parents taught me to accept the consequences of my actions, learn from my mistakes, and GROW UP. That's not love that's making your kid weak.", "SMH not one could throw a decent punch on purpose all of'em were to worried about taking a hit than just squaring up and fighting. Not to mention that one was being jumped and the ones doing the jumping were still scared to fight when they clearly had the upper hand in the \"fight\". The weakest shit I've seen in a while lol", "Wow I can't believe that dog is not putting  it's nose right up in there.", "I need to find the video to #35", "Tahlia Francis if I were your neighbor", "What does hench mean, and why do they call fries chips?", "Yeah let's get mad cyber attacks told us the truth! We'd rather be lied to and think what they did was wrong! Russia isn't the bad guy here, the people trying to to say they are, they're the problem.", "She said \"Xmas without Snow\", as if more than 10% of this world experience snow on Xmas lol", "looks like George Lucas who created star wars", "This is why innocent cops get ambushed. Cuz of pigs like these!", "This has nothing to do with trump or Hilary it's bigger then that there just the puppets this a of a huge family that own the Richest bank in the world they are tring to skeem and figure out way of getting there hands on Russia and eventually China as well and guess what super power is being manipulated to do it and make up things to start another war the U.S. Trump is a small fry compare to this trillion dollar family they own a lot of countries there's just a few left there trying to get there hands in. It's funny how people think the presidents are running the show when there just lil blind puppets being strung along to what this family wants world domination. Look it up this isn't a conspiracy it's real live shit", "The chicken parmesan they only had once a couple years ago was amazing they should bring that back", "Soulja boy is a producer and has been making hits for artist since his debut. His beats is fire so I'm rocking wit him everyone can talk shit but he doin better then us whether we like it or not", "Cops think they have a cape on,wrong.a lota karma for cops for killing unarmed people", "I'm not a Donald Trump supporter.\n\nBut can yall answer me this question without using google.\n\nWhat exactly has he done to divide this country? \n\nName one. No google and no asking your mom.", "I mean, she was resisting, but that was uncalled for. What was she gonna do, roll over their toes. She clearly was not a flight risk. Idiots", "So, they say. Where's the footage?  I don't believe any black man is gonna just shoot a cop. Although, it happens to them daily.... We somehow still believe in rights. I pray they don't shoot him down before we know the story. Which I'm sure will happen. Don't trust the law or the system that oversee's it.", "Wow, I seriously didn't expect him to utilize the Magnus effect, but from a height like that I am sure you would have to :D Fucking impressive!", "This would be our house if we were your  neighbors Jessica Rivera.  Chelsea Tyler", "I would owe money to someone. Dont know who but I definitely would owe a good few hundred", "Trump got elected president.\nMad dog Mattis was nominated for Sec Def\nIphone 7", "Everytime this happens to me.... He gets me addicted every chance we get. And Vic versa.... My tears fall for him when I'm on my knees for him enjoying every.... Oh shit mybad y'all, then we smoke one roll another down some food nd then.... Hum. Addiction.. .", "Fuck this guy, initially he was more concerned about what he lost instead of the people who died", "I'm sorry but if you're not willing to throw down when the person you're talking shit about steps up, then don't say shit. When you say fuck the police then be prepared to fuck up a few boys in blue... Otherwise shut up.\n\nAnd no, I'm not condoning violence against officers. I'm saying don't start what you can't finish.", "That old ass titty prolly got hairs and old jerry curl juice still dried up around it.", "I listened as they called my President a Muslim. I listened as they called him and his family a pack of monkeys. I listened as they said he wasn't born here. I watched as they blocked every single path to progress that they could. I saw the pictures of him as Hitler.I watched them shut down the government and hurt the entire nation twice.I watched them turn their backs on every opportunity to open worthwhile dialog.I watched them say that they would not even listen to any choice for Supreme Court no matter who the nominee was. I listened as they openly said that they will oppose him at every turn. I watched as they did just that.I listened. I watched.I paid attention.Now, I'm being called on to be tolerant. To move forward. To denounce protesters. To \"Get over it.\" To accept this...I will not.I will do my part to make sure this great American mistake becomes the embarrassing footnote of our history that it deserves to be.I will do this as quickly as possible every chance I get.I will do my part to limit the damage that this man can do to my country. I will watch his every move and point out every single mistake and misdeed in a loud and proud voice.I will let you know in a loud voice every time this man backs away from a promise he made to them.Them. The people who voted for him.The ones who sold their souls and prayed for him to win.I will do this so that they never forget. And they will hear me.They will see it in my eyes when I look at them.They will hear it in my voice when I talk to them.They will know that I know who they are.They will know that I know what they are.Do not call for my tolerance. I've tolerated all I can. Now it's their turn to tolerate ridicule. Be aware, make no mistake about it, every single thing that goes wrong in our country from this day forward is now Trump's fault just as much as they thought it was Obama's.I find it unreasonable for them to expect from me what they were entirely unwilling to give.\" Author unknown.#TheResistance", "Congratulations too them on their engagement and big hand goes to the officer who helped him propose. They was all in on it cuz he talked to them about it helping him stage it.", "It seems to me that whole apartment is a \"Shity room\".That place looks like a roaches tourist attraction", "Kevin I found your Christmas present", "The identity of these guys is not even clear yet. Stop saying it was a refugee.\nSo many stupid people around here who believe everything.", "And when they get arrested it'll be because of racism, or sexism, or global warming, or something else retarded because we all know nobody can take responsibility for their own actions and has to blame someone else", "If this ain't some frying some fish on a hot summer day with the heat on ignorant ass shit ! Lmao. I", "That's what this generation needs. Here in the US we beat up our teachers. That's all you see on WorldStar \"Student fights teacher\" then we wonder why our education sucks. I'm not saying they should get slapped but some of these kids need to show some respect.", "Bro I know this is the internet, but really???? Are you so insecure that you have to say ridiculous things just to get attention on the net?", "Please. He won't and hasn't stopped shit you bunch of sheep. He should have had plans 8 years ago but he can't even control his own people", "Nothin big about beating on a drunk, you just lower yourself to his level", "Jessica Lynn this kid is awesome lol, would def watch his show!", "Look like her asshole is connected to her neck. She ain't got a torso. Head, asshole, and legs. Thats it, Thats all. Bahahahahahahaha. Stupid AF lookin.", "We have our own blankets. Problem solved. I couldn't imagine sharing one blanket to sleep.", "On live TV here in aus on \"the footy show\" they had a arm wrestling comp with former players and some big guys came in to compete also, in the grand finale it was two former forwards who both weigh in over 120kg easy, after a long battle one of their arms snapped straight in half like this and had some skin breaking. So shows it isnt just skinny guys or gals with weak bones that this happens to, the pressure of the 2 huge men with both wanting to win badly and neither giving up something had to give out.", "Sahar Afshan LMFAOOOOOOOO IF we bought houses side by side", "Found out how to make my dick 9 inches  fold it in half.", "Cop shouldn't have been fired, if you watch the whole video he's actually a nice guy trying to teach the kid some respect...definitely was hostile at first but who wouldn't be when your randomly provoked like that? Cops are humans too, stop treating them like there robots with badges.", "I thought you guys don't watch Fox News???", "Trying to figure out why World Star Hip Hop just loves propagating such a negative image of the black community. Going through this feed barely a positive thing. Black people aren't like this. We are so much more than this and what you see on BET...", "Who fucking cares? Its his gf/wife obviously", "Yeezy shoes and some food stamp malt-o-meal cereal. Ha! Fuck mountain dew I got that mountain blast homie and that new Fubu jean jacket.", "These fools better remember us black folks aren't the same like we were in the past. We will fuck your shit all up.", "Ive had a Public Pretender......and a Penitentiary delivery......but never actually a public defender", "She resisted alittle but she did not fall to the ground herself. The cops had both her arms and when they let her arms go she fell to the ground.", "I seen the neck pilow, it took me a while to see it as his hand grabbing her breast.", "In india we are beaten up by dusters and evry sort of things by teachers they are the real bully here not so surprised", "Everyone posting saying shit like 'fuck the cops' and 'They were probably attacking him for no reason and he was defending himself' makes me sick.\n\nAdmittedly there have been some disgusting behaviour shown by law enforcement officers in videos posted on social media but how can a few videos of a select few who are abusing they're power automatically entitle all Police Officers to be targeted and in this case shot dead?\n\nTell me, if your house was broken into or a family member was assaulted I'm pretty damn sure this page isn't filled with Liam Neeson's that would take the law into their own hands the reality is that you would phone the Police and despite all these attacks and calls for death they would still clock in everyday and come save your ass! \n\nAlso to answer the 'why is it a big deal of a Copper gets killed on duty?' question it's simple, these men and women are responsible for keeping you and your entire family safe day in and day out so when one is killed whilst PROTECTING each and everyone of us it is an outrage and in my opinion should be punishable by death in all countries.", "The mfs in these comments be straight up clowns.  He aint spit nothing but facts but yall would rather listen to young thug say hfhhdghfhgjgjdgg on a beat. My generation is simple minded as fuck", "I can resist looking at this or anything related, but I cannot resist my looking at my truck. This right here is not my weakness", "No you are all forgetting that blacks are in the same communities that they were in 150 years ago. Thanks to democrats after Lincoln was killed google it they took away there reparations there well deserved land. The only thing poisoning the black communities are democrats excluding very few such as john f Kennedy.", "Sadly, this looks like a mannequin challenge of a drive by which isn't anything to joke about. For these men it's probably a normal occurrence. No one should have to live like this with all the opportunity this country has to offer. This just made me sad.", "It was being more teretorial and did not want the dog to do stuff to him", "In the criminal justice system, sexually based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories .", "I find the video so sad. The boy looked like he had no idea what to do, as if no one had ever done anything nice for him, his entire life.", "Young man has to come to the American south for dome dope ass fried chicken! I grew up in California and didn't know what fried chicken was until i got to the south!", "Nick Cormier hey bro I need this hook up on some Lemon Filled! Lol", "I've seen three of his videos he's not really funny and they be way too long, making them even less funny", "\"I'll sink a ball in your hole, I'm Tiger Woods..\"-Jay-Z......or was it?", "Only a matter of time before Kanye morphs into a gayfish.", "The Kid looked shocked, but he might not want to go home or he's been telling his momma he been studying at the library or working. There goes that excuse! Gonna have to explain to momma where that WiiU came from....", "Maybe it's different where I live. But one cannot simply call another broke and say how he stays getting money, while you are both riding the bus. Maybe he had to ride the bus because his beemer or Ferrari is in the shop lol", "If it was a road rage incident and a crime of passion that wasnt planned technically its man slaughter which should still be more than enough time for this guy to rot in jail, they just better find him guilty", "There's a planet headed towards us called planet X and it's going to Fuck our day and if you can read this repeat fuckdonaldrightinthetrump", "Ppl cud post wtf they want. Respect the fact that they shared this. Dude is dying and yall hating for other ppl uploading his last minutes..whats wrong with you??", "But you loose points cause it was still in a box..", "So not cool! I'm not there so I don't know the circumstances but I was raised better than that and the parents of those teens should be ashamed of themselves for raising such hoodlums.", "Hahah OMG you might as well have William Regal on there too", "So you guys would rather killery be president so Russia can hate us more and potentially kill us all? Lol good thinkin Einstein. I don't like either of em (trump or Hillary) but I'd rather know WTF is goin on. Hillary probably wouldn't even tell us we are about to die at least with trump we'd get a warning", "The guy's friend did the dirt?? IDIOT..... \nHis friend should handled his own business, and should of be fucking his girl right.\n\nNever understand why guys go off on the other guy, he made you no promises to stay faithful, and don't even front that you wouldn't stab the guts of some fine ass girl if she had a man or not....\nBunch of drama queens.\nSatisfy your woman & she won't need the dick off another man.", "It's like when they used to give black women flu shot vaccines with medicine that made them infertile in it. Smh the US is always trying to get rid of the African Americans", "I'm sorry I'm for pets and there owners I truly am . But it's Christmas and it's supposed to be a happy time Saturday Holliday shopping . Why do people feel the need to post shit so fucking sad . Can't we ever just be happy even if just for one Saturday ????", "The 47 people that reacted with laughing, you're a piece of shit.", "God I love my white privilege.  I'm actually expecting my check from the government any day.  can't wait til the new year when I get my get out of jail free card.", "People are saying he should be charged with murder, but manslaughter would be easier to prove. You would have to prove his state of mind at that moment, which they can't & he would walk... He would have a better chance at doing time with the manslaughter charge. And it doesn't matter if he's racist or not. He murdered someone, because clearly he has a problem with anger, based on his past incident. Arguing about if it was about race is just a waste of time, because everyone's perception is different. But clearly this could have been avoided & a man was killed! Those are facts that everyone should be able to see. If not, you are part of the problem.", "Pretty sure all our ancestors no matter what color they were. Are disappointed at how week and scared we have all become. I wonder if one of the young men or boys back then would have had a hatchet or spear or knife thrown at them by a peer when they acted up for whatever reason. Or did they just have someone who was trained come in and teach them a lesson on acting crazy? Pretty sure in any case they were not stabbed in the back or speared. Not to one of there own. Just come in with that riot shield knock him in his ass and show him play time is over. Or pepper spray him at least then cheap shot the kid. Lol at least you didnt have to shoot anyone. And get more respect. I mean what's all that training for if all you have to do is shoot someone? Fuck cardio right?", "Dubai hopefully he pays for her trip too otherwise that $50k comes out to be a lot less jajaja smh is she even famous or is one of those \n\"IG fake models\" jajajajaja", "She's a ditto if those are her kids because they don't look anything like her but tiger and jay z", "Shit if they filled a stadium with girls like her and ones with bigger butts I'd show up fuck baseball even tho I like it haha", "No one is gonna mention the part where he said \"yeah nigga!!\" I looked around for some black people and seen none lmao", "You cant have blue or red lights in florida and especially flashing lights. Nice idea though", "Damn shame what people consider blessings in their lives...well... I'm fucking rich", "Damn guess I have to get my husband the knockoff version with the knitted sleeve ugh fml", "Can't be helped. We all just a bunch of animals.", "Don't blame the guy for trying to provide a home for people. Blame the 1% for not sharing their wealth so people don't have to live in poverty", "I was in a public toilet and had just sat down, when I heard a sweet female voice from the next cubicle, she said \"Hi!, how are you?\" Embarrassed, I said, \"I'm doing fine\". The voice said \"So what are you up to?\". I said, \"Just doing the same as you, sitting here!\". From next door, \"Can I come over?\". Annoyed, I said, \"rather busy right now\". The voice said, \"Listen, I will have to call you back, there's an idiot next door answering all my questions\"", "I'm just here waiting for someone to make this about race. Lol", "Shit...some of american students need they ass slapped around. Hitting teachers and grades all fucked up lol\n\nLMAO", "All these idiots saying cops killed an innocent man deserve this yet when an emergency happens they will call the police and ask for help. The ignorant stupid people of America think all cops are killers are pathetic! Wanting others to die cause they wear a uniform and don't look at individuals who have families, friends deserve no help from the police. Those ignorant fucks should commit suicide or shoot each other. Worthless people", "What if a girl just wants a bigger butt or boobs? Is that wrong of her? If there was dick enlargement surgeries us men would be carting our dicks around in wheel barrows haha", "What if she was your daughter ??? Not too funny now huh ??? I know yall just venting with your comments, but making fun of someone's appearance is fucked up. Karma is a bitch.....", "Right now as for as we know it's the people close to you steal you shit and use this to make it look as if it's some Racist person . It's the new trend", "Lmao bruh u can't be doing this mane cute lyrics and shit like u know u see all the dudes she be fucking if she liked your ass you'd never see or hear about those dudes.. This all on you partner take this L", "Happened to me in Philadelphia NHL All-Star game I think it was 1992. Player hand me the stick and a big old asshole behind me ripped it out of my hands", "There is no reason to have shot this man. \nWhat did he do? \nHave his plate lights out and for some reason want to flee.\nSo if you flee the police, that alone is a death sentence?\nOr a justification to be shot? \nNo, this officer failed to protect and serve.", "Wtf you all motherfuckers are commenting on the video and claiming those scumbags were \"Muslims/Immigrants\", what your fucking blind eyes can't see is a lady being kicked by a fucker! All of the sudden you go and say \"yea he's a Muslim or immigrant\"  what if she was the Muslim and got kicked by a fucking racist? Chill your asshole a little and leave your beer aside and stop throwing your bullshit here.", "This is what happens when you let homo DJ's in the design lab.", "Running would not of help man the lion missed out on a meal", "Never even heard of this dude but that sucks. Anytime anyone messed with your property or your family: shit gets real!", "Jacob Preece Tom Dodd when we get deep into convo with Wayne", "She embarrassed herself showing her nasty house, a dog shit room. She's the trifling one here and sucking on that cigarette ain't no better than a d**k. When they don't walk the dogs they let them go in a room and shit like it's outside. Who's the nasty one here?", "What would have been nicer if had they added Craven the Hunter to set up that Blade movie", "The only reason the boy with green hair got hits off cause the other one jumped in but no one stopped it but if it was them they'd want help fuck all that gay boy got his ass whooped cause he wanna be disrespectful", "Kanye's former head trauma is coming to light. All that hard partying and loud music is really bad for brain injuries. Dude's gonna be senile soon enough. He's already showing the signs. They're both frauds, narcissists and out of touch with reality, at the very least Kanye made some good music a long, long time ago.", "Crazy how they can go to jail for showing guns but an officer can't get convicted for murdering a man on camera .. this shit weird as fuck", "Yal females act like shit in the comment box acting like \"hell no\" and \"fuck that\" knowing damn well you let worse and uglier do a lot more nasty shit than finger your for some Newports, a zanny bar and a gram of some dirt weed foh #youaintgotnotype #wshh", "And I'm over here looking crazy when I ask people for 10 cents for the tax on my blunts.", "Bunch of Public Pretenders. They all go out for coffee during the day and agree to who they are going to let go and who they are going to prosecute. Then they go out for their poison of choice and 12 year old Chinese boys tied up in a dungeon at night.", "White Americans are the biggest immigrants like killed off most real native Americans and then complain about immigrants like remember ya ' ll was British to begin with aka British empire smh like what I would like to know is how whites became so powerful and why some complain about coloured ppl standing up for them self it's sad a minority of whites are still thinking they can be racist and shit like remember American is stolen land it wasn't ya birth land so should you lot go back to ya country lool but for real we all one family bleed red blood? shame on all sides there is now maybe too much tension because things where allowed to happen e.g kkk,  slavery,  theft and rape of native Americans,  white power and that anyone else is beneath it  like for those that ain't like that good on ya jus be human not a colour", "Kyara Meis heeft ook gewoon allemaal heel veel voordelen hoor hahha", "Luis Roman Cristian Gijon I straight up did this with y'all once! Haha", "Sadly there tons of home owners that rent out homes that are not safe.This is all around sad story for the familys and to the man.Some people don't really think about what could happen.If he is to blame so is the owner of the warehouse.", "Ignorance dude should of left store instead dump asses posted some ignorance on facebook what are world has come to should of just left store acting tough gets you no where honestly", "Every race love fried chicken so don't start with the blacks and chicken bs", "This kid has some major issues At home or bullied or something.. There is plenty of other ways the officer could've done but shooting him wasn't wrong either.. Should've just kicked him in the fucking head or something but the kid asked for it. Just thinking about what was going through that officers head is crazy!!!! What to do with this kid sheesh", "Wow this is just fucking disgusting! How the fuck can they go home to their own dads, and act like they haven't done anything! They need to be found and dealt with seriously!", "This doesn't matter, all that matters is keeping big pharma profits sky high so they can line the pockets of our crooked politicians.", "I'm gonna yell: \"Yeeeeah, cracker!\" really loud when two black dudes are fighting for no apparent reason, just to see how stupid I look. Smh.", "I'm seeding her up and hoping lucifer is my son", "Who ever put the laughing emoji at this; you are twisted. Nobody deserves to be treated like that for no reason", "Ahmed Spencer Aneesh LOL im dead lol", "It feels like every single comment on just about everything world star posts is race related. I just wish people would realize skin pigmentation has nothing to do with crime, violence, intelligence, or common sense etc. If you're stupid enough to believe skin color has anything to with anything other than just color, you should really consider reevaluating how you perceive things.", "Shorts bro: yea what now bihh\n\nBeat dude: Spits out a tooth\n\nWipes away some blood\n\nSlowly gets up, head spinning\n\n....\"still smashed tho\"", "i always wonder how come people like him dont make the NBA.. oh, he probably cant dribble without traveling lol", "Jon Connors basically what happened the other weekend with Courtney", "The raider's were just salty that an ex 49er qb put them on blast like that they already knew 49er fans were going to be on their heads bad lol so they just tried taking their frustrations out on who ever they could lmao", "Dirty little ripper. Will do anything for cash. And to top it off she says she'll sleep with he's 13yr old brother wtf... she says it like she does it on a regular as well.", "Dam somebody is about to lose their Dam M Fucking Jaw, The teacher should be probed ASAP", "The warriors blew a 3-1 lead \n\n3+1=4\n\nLebron james lost 4 nba finals", "Dudes garbage bro no skill I swear NO bars seriously #worldstar and #XXL should be embarrassed by the shit they post", "Imagine all smeared and shit cause its so damn big DX", "Next time they want to insult someone, please walk up and knock on their door and say it to their face.", "But could be teach Deandre Jordan how to make a free throw", "It would be sitting in the back pages of the phone, waiting for the day grandma try to talk some slick shit at the thanksgiving table", "This was out before future ended a marriage, this shit old", "Why do all these mainstream rappers today look like they got some kinda down syndrome or some shit they look retarded lol", "The life of the rich and famous... damn she's taking that ass away,  he might kill himself now,  Just to make a statement..", "I would not were the hell is yall self respect yall don't know we're his hands been all yall see is dollars signs. who raised you females so sad but I will pray for y'all to God be the glory.", "I been getting cross faded forever than. In fact I don't even like to drink if I can't smoke at the same time. I love that cross fade, shit be feeling right and I've never gotten sick.", "When i used to do that my freshman year i would pass the fuck out lmao", "Continue mission. I smashed a chick with swastika shit on her pillows. Did I stop? Hell no. Beat that shit up for my ancestors.", "People are so ugly and selfish these days this kid cant even believe that its real. Take advantage of every opportunity you get to help someone in need and yhis world will get a little brighter everyday.", "One time I saw two blind dudes try to fist fight and I yelled watch out he's got a knife! An they both took off running.. best day of my life", "That right there is super fresh she prolly tight af and the dog i didn't notice till i read the damn thang..", "Andrew Jung Matt Walters I have to tag Matt in this every time it pops up on my feed", "Nigga if you dont fuck with Quavo what makes you think Offest or Takeoff gone fuck witchu? They family. He obviously don't got time to beef witchu nigga. Time is money and if he give you any of his time he losing money! Period.", "look ik this is rude and i apologize on my remarks for this image.\nbut wtf is going on there? im not sure how this works.\nim pretty sure everyone will have at least one wtf in there minds. not saying everyone is a terrible person but we totally want to know whats going on.", "Mountains out of mole hills and ppl with too much time on their hands.\n\nTake a look into the past Time magazine covers. If you want to shut this down, post covers of all the ones showing others with the logo behind the person. Heck in this case even r2d2 from star wars is the devil", "Silly rabbit tricks or for kids. She's gonna get trapped over there and introduce to slave sex trafficking and treated worst then a dog. Having sex with everyone against her will, man thats crazy how money can make people do the craziest things...sad, sad, sad...Smdh", "just dont get why theyd give it to him knowing itd help and its still illegal. now hes gonna probably get locked up for trying to get it illegally cause he knows itll help him out.", "FINALLY!!! spittin like he had a gap...", "True. I could talk about politics for days. There's very few people my age who get it.", "Helllll i wldve started swinging on everybody if i was the dad....teens these days are built like grown ass people and talk shit like some so they should get slid like one...js", "Hell nawl she probably trynna trap me with some type of anti-Christ baby and the last thing i wanna tell my mom is.. hey ma im the father of the anti-Christ", "Its like egg nog. Only good for a season. You wouldn't buy eggnog in July. It wouldnt sell, just like the McRib. McDonalds knows what theyre doing. Its business and a great sale tactic.", "have some mercy; kill that chuleta-lipped piece of shit fucktard gay-z die a slow painful death while his immediate family watches", "If a real man felt disrespected, be would of checked them at the time that he felt that they were being rude.. Not Young Thug though, he'd rather take it to social media, make himself look like an arrogant asshole, and publicly embarrassed his own kind... Ignorance is bliss...smh...", "Hell nah, yaw stupid if you believe THAT .. that's just what the police said but they been bout to get a bean .. Lol! Believe anything they tell yaw bout technology .. It's all propaganda though!", "This takes great skill to do! \nPlease LIKE if you agree.", "I'm kind of tired seeing the rock in every movie he's starting to get played out", "People angry about the white boy comments... how harsh if it was a darker skinned individual you would shy being commented way harsher than white boy...", "They were having a party you idiot lol a bunch of djs are putting in there storeys because Markus Shultz bus tour manager is one of the people that died", "Stop with the hate promoting. Its not just black people. We are all in the same boat, they are poisoning ALL of us. The government dont see color. We are all one.", "When you're about to die but you remembered you left your phone unlocked at your girl's house..", "The guys should be blaming the girl. Yeah, I assume the guy knew she was taken but she also knew she was taken. Sex and relationships are two way deals unless it was by force. People need to realize that and get over themselves.", "He looks completely fucked... remember when rappers just wore a bandana and earrings? Now we got this scarecrow lookin mf", "Well there's a big shock. Run from your husband, when he needs you most. Yup she is a piece of shit person and mother", "Thought that was my grandmother for a min but I just remembered she doesn't have a phone.", "This is not cheerleader this is been a slut bicth", "Do your research. Some of these stupid broads get stuck over there because they take their passport and make them work to get back home. The middle east is a gold mine for human trafficking", "I'm drunk and high at the same time drinking champagne on the airplane.", "Gotta respect the hustle on that wish I would of came with that", "\"She said I'm a dog but it takes one to know one\"- Kevin Gates", "That's one ugly mutha fucker...ole trash ass music", "But why did EYE just say \"what the hell is that!??\"  Without even looking at the title as a first responders reaction!!! Her Mirror must have a crack DEAD in the middle. Ya know like the house of mirrors effect that makes YOU look smaller ONLY in the mirror.  #mylawd", "All these people saying its karma. You ever have something bad happen to you or a loved one? When these innocent people you're speaking on get shot or killed by police, was that karma? Think before you speak", "Just sad ... she just humiliated that poor girl. What's even sadder is the fact that you have a grown ass woman who's doing it,now what if that was ur daughter instead of someone else daughter would you humiliate her like that.. probably yes ratchet ass.", "What ever happened to that little black kid was like 9 used to hang around Andy Samberg and them was hilarious...", "This guy is responsible no questions asked. He was housing ppl in a warehouse that wasn't up to code. It is unfortunate but this is why there's a residential building code. I pray for this guy and all the families that were affected or lost loved ones by this fire.", "Especially if someone has a nut allergy haha", "Sick lyrics\n\nCould work on his delivery but hey, he was at a radio station and not actually recording, so to Hell with it", "\"You straight, my nigga?\" \n\"Hurry up fo' the police come.\"\n\nI'm so through with these white boys. LOL", "Sorry, but this scenario played upon my biggest fear and I was not appreciative of that kind of fear being evoked ... but glad SHE liked it.", "You ever wear something that's cute to you from the front  but you find out its not cute from the back later on then I feel stupid for not knowing you were walking around with some see through ass pants showing your whole ass? Or some similar shit?", "Don't let this distract you from the fact that the Warriors blew a 3-1 lead.", "Janet Gribbons except you the crush and you call everyone bro", "Oh man.. the cop suckers presence is strong on this thread. It's a fucking epidemic!  lol", "The biggest cunt was the one who dragged his girl away from trying to stop a fight from happening, disrespectful as fuck I'd of gone mad if I was at a restaurant paying money for a service and food and some retards had a bitch slap fight like this", "White folks are dead serious on defending trump's bullshit. I'll give him props on this decision tho. It's the only smart one he's made since he started his campaign", "Steve has earned the right to fuck shit up.", "Lol all these people hating bcuz they stuck in the past and cant keep up with the rest of the world lol u haters probably still waiting for your old washed up rappers to make a come back lol js", "How can a cop do such a thing? Or not even make sure it's in P!", "What is Cold blooded bout this it just takes a Idiot to kick a Woman downstairs but it takes a Cold blooded guy to Step up hd Knock the shit out of them bastards", "Pay a surgeon who knows what he's doing instead of some random guy on the streets with a syringe that would inject you with who knows what. And then regret it couple years after.", "That's right, bitches like to fuck with our heads why not give them a taste of they own medicine", "But yet still they say animals don't have souls..you can tell that dog is clearly heartbroken", "Was thinking the same thing watching his video. Too much money for the nonsense bro.", "The Public Pretender that's what we call them.... they all work for the DA... their job is to make sure you don't take it to the 12 in the box... you're better off with legal aid", "Anyone see that 7 week old human ape hybrid that they cloned. Shits getting real.", "Zach Abbott yes because you hogs all the damn blankets!!!", "The exact moment he became a savage.", "Funny part is how there's definitely a lot of mc rib advertisements in Santa Clarita now llamf", "I don't think anyone is falling for the big asses anymore lol", "Underage, in possesion of an illegal weapon, and brandishing it with convicted felons ... yet ppl are still saying the arrest are unjust. I swear this is why people don't take us seriously", "I lost my watch at a party once. An hour later I saw some guy stepping on it while he was harassing some woman at that party. Infuriated, I immediately went over, punched him and broke his nose. No one does that to a woman, not on my watch.", "The man goes first, then gets head, cause my shit might go limp lickin all that afterwards. Do it right and a full blown boner bout to wreck shop", "Sensed that you wanted breakfast but they messed it up because of they did send nudes instead of sensed", "Jake Forrest you want some cup cakes", "They both can't fight for shit! The brotha didn't even touch that other drink foo and he fell.. lol. But yes that dumb mofo shouldn't be running his chops, what a drunk fool!", "Jenn Marie Castillo but with the heat in this apartment lately", "BREAKING: Michigan man receives settlement of 3 pieces of gum and a nickleback album after police brutality case victory that happened early in December", "Made the best of it so far. Life is good but everything in life could be better. That's why you keep it moving. #positiveness&dedicatio", "Right, so American folks can get away with \"bomb your people, kill your people, send you're people to hell, you're a terrorist, you're people are terrorists \"", "Joby Edwards American sports need to recruit some of these girls!", "People should be glad that the officer did his duty and upheld his oath to protect those in his community... Or maybe those of you that disagree with me would rather the headline read student with knifes kills and injures dozens.", "That's the problem with rap today, y'all so caught up in a banging ass beat and a nice hook, but never focus on the lyrics. Hip hop,started on the day and life of our struggles. Our, sadness, our happiness, our failures, our success. Our harsh reality is told thru rap. Back than, rappers didn't sale out to the almighty dollar. It's crazy , it's a lot of black vanilla ices in the game", "Looks more like I wouldn't want to feed it after midnight...", "Matters the order you do it. Weed is a good hangover remedy", "President OBAMA created, armed and financed \"Isil\"... his \"strategies\" are nothing but lies, to keep the fools who believe in him, from discovering what is really going on.", "Don't let this distract you from the fact that Ray Finkle blew a 26 yard field goal in SuperBowl 17 Costing the Dolphins the game", "I heard that harambe will make a special appearance in the movie", "Harambe could have won an Oscar for this movie. At least he'll grace the red carpet in spirit...", "Yeah right..playa for the NFL and can't afford a better security alarm or does he still live in the hood?", "A cop was just fired for challenging a white kid to a fight. these guy probably got leave with pay.", "Wow... That's horrible.. I live in Alabama and i'm ashamed to say that this type of shit still happens in alot of these backwards ass towns.. I cant say i understand that feeling at all, and i hate that it happened.. Hope something was done to the management there..", "Trash trash trash , if you think this is fire you must be retarded in the mind", "Little dick, but came with a thunder orgasm. December all but 7 days old has been great...the other 11 months I couldn't feel a damn thang", "Don't let this distract you from the fact that Kevin Durant is a fuck boy", "I know I should be thankful for my life and all, but this year was fucked up 4real. Ain't no other way to cut it.", "The mentality of a little boy. And when you have a daughter she'll be the one to be ruined by a dude with the very same mentality. They have a word for that it's called Karma.", "If he get charged they need to charge the owner and the City too. Don't just go after the small guy or look for a scapegoat..", "Man, they need to take some damn boxing classes to prove to their selves. Mfs was swinging at air. All it would take is one counter shot on all of em. These mfs better go to the nearest academy and pick up a gun cus they'll die if they get in a real fight. This shit was more of a joke", "They charged him based on the evidence.  They probably don't have enough to charge him with murder.  But of course like usual people are quick to jump to conclusions.  Do ur own research and think before u speak.  Hasn't anyone learned from all the stupid protests that led to people being killed and injured and the millions of dollars of damage after jumping to conclusions without really knowing anything.  Then the truth comes out and then u realize those protest/riots were ridiculous.  Well most people would realize that but there are some stupid morons in this country.", "Yea let me quit my over 30k a year job for 15K. Ok sounds cool ( that's sarcasm for those of you who didn't get that ) while I WORK for something for the future you'll more than likely be either in jail or dead.", "Bro got bars. Y'all talkin delivery, but he spit at a radio station not on stage or in a booth. Ima check that album out fuck the bullshit", "how this shit new when I've had it on my playlist for weeks?!", "GARBAGE!!sounding like some gay ass canaries. up close in a bird cage ass niccughs.", "Any girl that would let a guy finger her just because he's got millions is a whore.. You letting a guy finger you for money.. Whore", "If I did the same thing, I would be shot too. .. it's a simple logical thought, the police are issued fire arms. Some (despite training) lack trigger discipline. But would you not comply with some one robbing you with a gun barrel digging at the side of your head??", "find that baby and get him tested fuck the dumb shit then lock her sick ass up smh", "If it had been my kid, I woulda told him to let dude have'em, they ugly as fuck anyway. Now had it been \"JORDAN\" signing his shoes and some raggedy muthafucka tried some shit like that, I'd beat the breaks off his punk ass.", "which translates to:  \"I went and bought icing and a frosting bag just so i could take this picture\"", "Ummmm there is another way of handling this type of situation without it possibly being lethal it's called a taser ! My god first and foremost remember this is a child and yes he did have weapons but also they were knives not a gun so a taser would've been ideal now I could see if he had a gun ok then there might b a probable clause to utilize a gun this child could've died then what excuse would pd use JS my opinion", "Nobody wants to work for what they have anymore, if you want to get it sucked out that's fine but don't be suprised when it comes back cause you can't stay away from McDonald's, go to the gym and lose that fat do some squats and get that ass, you'll appreciate it more when you can say you worked hard for it", "Considering he is an extremist he should have the low down on how to deal with it. But why break his own back? Don't worry Trump and Putin will ACTUALLY do something about the Obama funded and created Isis/Isil", "I can ruin her life in under 60 seconds.", "This is actually pretty good like one of those cooking shows you seen on tv", "A human being fucking judgemental fucks damn no one got love anymore", "He eats the whole ting fam, cartilege and all, no ting left but bone fam", "I'd give em a shoe alright, my size 8 1/2 Jordan's into his nose. Trying to steal from a kid at a basketball game, your such a coward and just a plain awful person.", "Says the rich ass nigga... He has no worries", "They ruining black men? You guys do know that these black men are the ones ruining themselves by putting themselves in these situations. And i half ass believe this story", "Shiiieeett. If my lady was straight paid. I'd take kid right back out the dumpster and milk that brat for18 years. #paid", "Skye Montgomery when your neighbors white asf hahah", "I don't understand why people even do this anymore. I see a new broken arm every week.", "Pretty fucked up to even kick her out without any proof at all corporate is gonna have a suit on them just a matter of a phone call to the right lawyer", "She should have shown some police brutality lmfao If was a Muslim and a cop all racist and trump supporter would have gotten it ..lol #justtwomoreyear", "On the real, i would have had to help the brotha, when the other fruit jumped in, im not letting no fruits get the W. I feel like its two white dudes jumping a brotha...", "Damn I know they did a good thing for the kid and everything but kinda seemed a bit rude to be like yo we got u this so u don't have to come here anymore u can stay at home lmao sounded like he was like yo we tired of your ass being here lol", "Wshh don't know shit about what good music is lol", "\"I like big butts and I can not lie...\" just not that kind \"Even white boy got to shout... baby get TF away from me\" more like back dat azz DOWN if ya ask me...", "To the 19 people that clicked the laugh emoji. I hope you all die slow painful deaths.", "I see cops pulling ppl over in the middle of the road when there's a safe place a few car lengths down. Hope this cop recovers but use your damn common sense and play safe and don't be a dick!", "I would just low key text my manager and be like \"yo, Ima give you 1k to come over here and play along. Don't ask questions until after\"", "this is the way community and police shoud act not kill each others respect to all", "This isn't messing with people, this is straight disrespect... Might as well just spit in their face instead of putting a sour ass taste in their mouth", "It's always \"black\" or \"white\" does this, but once rape nation Islam attacks a woman for exposing her forehead it's just \"man\" and \"woman\".", "Who ever does this to me is catching the hands", "Lmfao to funny I had to get mine court ordered cause I didn't want to do it I knew my daughter was mine shits expensive hahah heyyy atleast he trying to see his other kid hahaha", "he could of beat kobe record easy if he played 4th quarter", "I mean photoshop couldnt help that hair piece on his head. I mean for a billionaire why his weave looks like that? Yes I said it weave!", "I'll give a big clue that maybe no one has observed. On the second robbery video the first suspect running towards the exit door trying to get out is a female FYI and judging how she runs and that ugly ass she has theres no doubt in my mind she is African American.", "Why they do as he say? There is 15 student and they could jump him. Really stupid teatcher", "This nigga said he gotta purple gun the fuck you gonna do with that shot barney aint no body scared of your barney gangster wanna be ass", "That's how u do it Fa real bruh", "Well they did it to the Pope too then.  So stupid.  See what you want to see. It's the same type face they always use....and it's either behind the persons head or over it...they did it to Obama as well then too.....(I can't seem to post the picture, but just Google pope time magazine cover and he's got horns too!). Whatever!", "Yep last 3 mins are the best like usual.", "Nygai Stinson Oliver Stinson Vernon Mackey", "Soulja boy if u don't go somewhere with ur bitch ass someone's gonna slap the fuck outcho stupid ass for tryna be tough. G's move in silence , pussies make noises when they fucked", "This happened in my hometown , i dont get why people laugh at this or say it was dramatic ! the bitch was going way to fast and hit the cop car & the car hit the cop...i dont find it funny at all.", "Maybe telling her in person would have been a better choice.", "\"These new school rappers wack wish this was the 90s again , I hate this new music\" nigga you jus heard talent, not all new music is bad shut y'all old asses up and dig deeper for gems", "Doesn't matter if she slept with them or not she didn't biologically produce those kids. That's impossible.", "That wasn't even him asking to fight lol a cop kills someone and they get paid leave, a cop talks to someone they get fired, this is petty for firing him, just watch the whole video the kid even feels like an idiot", "Jake hahaha when I had a crush on you and you'd call me buddy every 5 mins", "Sick dirty fucking hoe no mercy for shitbags and whoever harms children.the parents of the 9yr old need to give they kid up. You clearly aint worthy of a child. Sick beast needs to be slaughtered.", "Hells yea cold hard justice at its finest. \n\nTelling a man who is that drunk to do anything is like asking a toddler to go pour his first bowl of cereal you shouldnt expect them to get it right away those pigs should know this", "He should of ended it with a thank u come again", "So worldstar, you purposely go out and look for any video that makes cops look bad? Your racist is showing.", "When he's broke by 35 it won't be so funny to call others peasants anymore lol", "Punk ass bitches. Jumping dude for wanting to help his son out of a bad situation, pathetic. Real brave in a pack they are, stupid pussies. Wish you all nothing, but the finest version of karma y'all deserve.", "And they are still locking niggas up over this shit smh", "More of Russel Wilson and the crack head who sweeps you local corner store for a pizza pocket", "Not their fault his posture is puss poor. Perhaps if he sat up straight this wouldn't happen but since he is not a gentleman he probably was not brought up properly.", "Freestyle + Reading lyrics from IPhone= not freestyle....", "You're really gonna grovel at the feet of this tyrant just bc he's black? Morons... Isis has been funded from the jump by the US government where do you think they got all those newer Toyotas? So How about posting about breaking  up these child sex trafficking rings that have been around for decades??? #pizzagate", "I love my skittles and Reese's are always my movie choice snack and I hate plain m&m's so I'm totally in #challengeaccepted", "Jeremy Burk china is nothing compared to kenessis lake road lol", "I don't understand why some people reacted with the laughing face, y'all so fucked up.", "Everybody is a rapper don't take much skills nowadays just get a nice beat and just say a bunch of bullshit with one decent bar and become a star", "bro fucking with the mans hunting dog, here if that was a coyote or any other animal ita been shot dead.", "Buy me a new bed, 1 years worth of free rent, and I won't say shit to nobody!", "She's nasty....but why is nobody mentioning that hairdo? Looks like her wig is on sideways!!! Or is that a hairstyle I am not aware of?", "what if I told you....... this is better than any DJ Khalid song", "Same experts and intelligence agencies told Americans that they weren't being spied on by the NSA, and Edward Snowden exposed that bullshit. Who's going to expose them this time. They just want us to hate Russia for the rnc mistake of allowing trump to run. FUCK them all", "I'd like to know how it got messed up and what it was originally spose to say. He flaky lol", "Its not our fault he wanted to take such a model creepy stare into our souls pose, and hey if the horns fit which they doo", "$3 is too much... I'd be in debt", "Its funny this piece of shit can't even say ISIS. He calls them ISIL like a lil puppet bitch. Thank God that shitstain on America is on his way out the door for good.", "Disgusting people out here raising disgusting kids. Even if it's a \"challenge\" this was the moms real reaction. She probably would have hopped up and done all that if her kid didn't tell her it was fake.", "Put on some pants, lose the purse. You see who's wearing the coat jacket and pants. Get yo thumb out of your waist line, since when you start modeling?", "This loud mouth ghetto bitch. \"Don't do it, please stop.\" I'd punch that bitch in the throat then join the fags at dropping elbows and knees into that fuckers kidneys until he pisses blood on himself.", "Keep people in your life that truly love you, motivate you, encourage you, inspire you, enhance you and make you happy.", "A wife is never to distance herself from her husband when he is down... If this is true she is really trash... At the end of the day Kanye is the one who will come out of it on top because he actually has talent... He might \"Ether\" that chick..", "When you ruin a perfectly fine pair of shoes to make a meme that isn't even funny.", "His woman is helping pay that child support for those 4 he have before Jr. Now that's Jr. right there making $10 an hour lol this is too funny.", "No bulshit black folks always crying racism. Racism doesn't exist if you ask white people.. We've been saying this for centuries. Not all white folks but the majority of Caucasian people are racist and they want to exterminate black folks from America", "We dont need kanye at all u see how cool music has been without hearing he called this person out and he did this on his elevated stage... let him just make music and put it out stay in the nuthouse nigga lol and ps imma fuck yo bitch too ( i aint got no manners for these sluts )", "What happens to me Is I eat everything in the fridge and snacks in sight until I'm literally in pain.. I do this often", "This is for guys who wrap their whole fist around the pencil.", "I mean people do sell bottles of water", "Mmm nope moms an awful person raising an awful child. She could have said I'll be up there in a minute we can switch cars I'll take the case and that would be a little commendable but you don't lie abt hurting someone and put them somewhere their own family can't find them fuck this braggy ass post.", "I would never fight a dude over some chick. Obviously if she opens her legs to another man she don't love you. Way too many women out there to get into a fight and risk going to jail for killing someone by mistake and all over some pussy. Hell no!", "Don't make friends state your purpose.Females just cause you put a man in the friend zone don't mean he will stay there especially if you put him there if you don't want to fuck with him like that then don't call him your friend at all.And dudes need to just move on to another female and act like the one who put you in the friend zone never existed", "Haidee G-Diaz this is how I want the house", "My father taught me to never hit a woman and to never attack anyone from behind or when they are sitting down. I can even remember him saying something along the lines of allowing a man with glasses the opportunity to remove his glasses before hitting him. These ppl have terrible fathers.", "Go back to where??? Muslim is a fuckin religion not a country!! Why are people so fuckin stupid??", "Here are the only three reasons a bitch would stay with a man\n\n1. Money\n\n2. Fame\n\n3. Talented Dick", "If he just would have obeyed he would have been fine, the reason for the stop was for both license plate lights out and one is obviously on", "I'm sorry, he lived up to his mistake, and it was a honest mistake. Leave him alone, he's one of the few good ones.", "FUCK YEAH I would have my kids back the same way!! No doubt", "These hoes so fake nowadays , from fake boobs to fake butts to fake faces with all that makeup. Then talk about how they wanna REAL man lol I doubt that when the forefathers thought about the future they imagined a time when people were obsessed with other people's asses ! Clearly we have went in the wrong direction lol", "It makes it look like his right arm is around her neck and his hand in the inside of her shirt on her left boobie.   Just looks like it.", "I'm just here to find the guy who can tell me about all the types of shrimp...", "hov lookin like a str8 hoe\nEven got the handbag", "Now this is where the people will fail again.\nThis is where they need to speak up. This is where the The scales do need to be balanced since most cases are resolved with pleas \n\nThe Defenders need cases with minor offenses restriction", "act of kindness my ass. act of get your monkey ass out the store we tired of seein you, the customers are complaining because you wont let their kids touch the fuckin nintendo is what that shit is. fuckin act of kindness. pfft.", "I would of flipped. I'm white, but really .. This is stupid.. Your telling me if a WHITE woman stold then all WHITE women would have to leave the store.. How freaking stupid.. I would have stood up for the other two woman..", "I noticed that lots of people in London wear Nike Airmax's nice shoes tho' :)", "She handed that well,like a classy women-leaving the store.I feel this women's pain!As a women I am so sorry she had to go through that.People are so ignorant I hope those women get free Victoria secret for a year for what they went through.Regardless of her training or whatever the stores excuse was for her being asked to leave that's no way to treat people and espically her being management ..im so mad.", "That's Baphomet..  not the \"devil\" \nThe original concept of baphomet was to represent total Balance of everything in existence, thus have the breast, male features, animal features, the 2 snakes running up the stomach area, one hand pointed up and one pointed down. One thing can not exist without the other.. ying/yang. The number 6 is supposed to represent humanity.", "This video is exactly the same as another i saw where what they say is \"stop resisting\" repeatedly in order to make it seem like the arrestee is fighting the cops and at the same time the cops are able to say that because he was resisting is why they were beating him and then be able to get away with it. Fkn Aholes!", "I don't care about anything that's not how you respect your fellow human man woman race religion has nothing to do with that fact that you can do that to another human being that's not right", "So what, Kobe's 81 is still the best until proven otherwise.", "So clinton campaign did this same shit to sanders and nothing was said. Now shes out of the picture its the russians? Gimme a break. How bad do you want to go to nuclear war with 1 of our greatest enemies.", "Stefanie Labudzki imma get you this with your coffee.", "Man, that was me that nigga called, i wasn't answering his crazy ass.........", "A situation that happens to occur... in the Twilight Zone.", "60 points - 29 mins = 31 , blew a 3-1 lead", "Jesus kept me alive throughout the year so i would have $1 for each day so its about $365 plus more", "Bitchessss! Just cos he is worth millions you will let it happen?\nHaha noone said he will give you shit! But you all jumping in like \"Hell yeah with gloves\"", "Man these Raider games be Lit asf! lol can't wait to go to one in LA. #Raiders4Life", "Only better if it was released the day harambe was killed #harambeneverforgotten", "Their kinda smalls ain't for black woman. Must be making them for ladies with no arse. Still that was disgraceful.", "Look at how these black thugs act in poor neighborhoods.....what's that you say? White? In a nice neighborhood? Nah can't be. Fox news says it's only the dark skin that can be ghetto like this. Lol. But for real these punk kids need a ass whopping. Pops needs to go get his crew and even the score.", "That house smell like newports and shit with NO curtains and blinds and that bitch sound like a DUDE!!! She is his example of women so of course he would have a chick sucking his dirty dick in a room full of shit WHEN HE LIVES IN A HOUSE FULL OF SHIT lmaoooo. Dirty ass house. She put her own nasty ass house on blast with them nasty ass black weed lips", "I'll be kinky about it and ask her if she wanted to be tied up. As soon as she's tied up i drop the holy water and whip out the bible and go Moses on that demon.", "to idiots thinking racial divide is only a tool. yes it is that but not ONLY THAT. here the story by Jodie Gregory on youtube about manganese and you tell me its not aimed to target blacks. do some research before bumpin your ignorant mouth", "Skittles have s's on them, and m&ms and reese are dank af together. Challenge accepted.", "Maya Mccloud honestly I'm just gonna always use my own blanket. It just works.", "I think a miracle is about to happen", "Annabelle Brousses mdr meuf tu l'as vu cette video du mec qui frappe le kangourou ??", "I have a serious question so black people are only allowed to buy food in black communities?i have never heard of that before and as far as the water problem in Michigan everyone was effected that was supplied that water not just black people.", "Soulja Boy is a spoiled rich b**** with two guns scared as hell. You ain't about that thug life n**** you Hollywood. N**** wats  your inmate number.", "Every company should make it mandatory that all staff including management and higher should have yearly meetings at least a couple times per year to address racism and have zero tolerance for it and embrace diversity.", "Be fucking serious how many of you trumptards even knew who she was or how succesful she was before trump chose her? Hes just doing pay for play since the mcmahon family contributed over 6 million dollars in campaign money. Throw your friends a bone huh.", "Na the male support to eat it first so that when she sucking she do it flame ass fuk trust me !!!! They go extra hard", "Some shit you would try to do Roger Garcia... try to get gilf tits", "I thought he was too lls", "Fuck her.. Especially seeing as how the whole 666 comes from the make up of melanin. 6 protrons 6 electrons 6 neutrons. Yall need to get off that white sky daddy shit given to u by your enslavers ad wake up to the game they running.", "No way! Spit in my face in addition to disrespect on the highest level, to me it also a bio attack. I will send you to the hospital w/o a doubt.", "That gay ass nigga need to take that Hello Kitty sweater off soldier girl get um", "looked to myself in the mirror and I had a boner\neven my dick knew I am a pussy.", "But could he do that in the nba 2016 finals", "Such a tragedy...I pray that God gives both of these families the strength to endure.", "Don't forget about his ugly shoes and the idiots who spend hundreds", "If the conditions that lead to this horrible tragedy could have been avoided, I hope whoever is responsible is brought to justice. \n\nNo action we take now will bring any lost lives back but I hope that other property owners, managers, or tenants that operate or know of these type of events will change, or help change, safety measures to ensure that this type of tragedy won't occur on their property.", "Dry your eyes baby girl. Because u entitled to a discrimination Lawsuit. The only tears you should be shedding is when u signing that settlement check. I'm so sick of these Racist bastards.", "Ruben Rodriguez who this remind you of?", "But everyone gonna overlook the other dude spitting in the manager face when he said PUT me out I know spit hit the store owner face it was a reaction the dude was wrong if your asked to leave the store just leave. now that's viewed as assault", "If judges get money for incarcerating ppl don't you think these public pretenders get incentives as well.", "#challenges... To many of them, ie mannequin", "Pro tip: if you always act high you'll never have to pretend like you're not", "Didn't 50 cent write a song about  people like him back in 02 called wanksta lol. If there was a definition in the dictionary that described a wanksta all they would have to do is put a picture of him next to it. Gtf outta here soulja boy my 2 year old daughter could beat your little soft ass", "Matheus John Bermejo HAHAHA ever since he messed up the names for Ms. America lmaooo", "The more there are cassa like this the less likely it will be legalized. Or they will legalize it while they do something fucked up behind closed doors.", "Lol Something like this happens in almost all medical and engineering colleges where instead of teacher our senior students ask us to do this drill if more than 1 person commit mistake as ragging.", "Poor thing. That's craziness. I love the fact that she stood professional and didn't stoop to their level. Even when recording and pointing out who was who, she didn't point her out by the color of her akin but the color of her shirt! Call corporate and get the justice you deserve. Fuck them.", "Fake, first question a real Black person gonna ask is \"How's the car\"...", "So he said as long as I don't take my eyes off of my hand that my shit want break.\nYeah ok what's your i.q.", "The wedding dress though!? As if banging on the tenants bed wasn't bad enough.  God help us.", "The saddest part is it Looks like it's his parents having to see their son die right before their eyes. I'd fucking lose my mind.", "Worldstar Hiphop is just a page that is filled with followers who are low classed and followers who are thugs. I wish you Facebook would stop suggesting me to this page that only increases the ignorance among each other in the Black community.", "Has a 21 jump street type of vibe to it...so I'm in. As long as the comedy is good it should be a solid movie. The Rock is everywhere these days making movies left n right.", "Remy Ma can get titty fucked real quick", "Ughhh enuff u damn white people not one black person in the fucking fight but nigga this Nigga that. Yalll stfuuuuuu", "Soooooo it's ok for the gay dude to disrespect the female cook, but when a real man steps in to her defense he get jumped by gays and noooooooo straight man come to help? Not even for the woman that was cooking? WOW. Susan B Anthony said it best. Women can't depend on the protection of man but we must learn to protect ourselves SMH", "The way i look at the picture. It's more like the girl trying to bring the boy to the friendzone world..", "I'm a firm believer that obsessive homophobic inviduals are usually undercover homos! \nWho cares who others are sexually involved with!? A woman who sleeps with every man that she meets isn't any better than a man who sleeps with other men! One sin isn't more or less than the other!\n\n#HYPOCRITES", "The fact that they nonchalently walked away is unsettling. We are in fucked up times", "Who are the experts, what is the evidence and where is the evidence? \n\nThe bankrupt party of wealthy white corporate Democrats and their minions have resorted to red baiting because they are a clueless and elitist organization. \n\nWhen identity politics fails, focus on \"the Russians.\"", "It's been what 2-4 years since the last movie to come out with this crap? This is not what I expected at all. And the dude looks 15. Looks like a toy. And out of every villain the vulture? WOW", "Dont give a shit if your bill gates fam. No man sticks there finger in there idc who you are. I dont like all that stupid pointless shit.", "Just to clear things up this car will never go to production due to a long list of obvious legal and financial reasons. Lexus, and pretty much every other car company does things like this to spark attention to their line up. So far they've made an entire car of cardboard, wheels cut of solid ice and put sriracha sauce in a steering wheel for some reason.", "Lol we was waiting on Steve to pull up after the election", "Ain't watching regarding caption sick bitch no wonder kids can't be kids shit look at the so called role models wonder if she's fucks her own youts if they ain't be taken away yet... Certain black folk in America make Black folks look grubby!! Could never entertain this kinda character round me or mine!", "anybody who dont think so is a weirdo..cause she sexy as fuck and i like the way she move..if it were slower it would of had me cumin 8times a minute. .lol", "I run these kindergarten streets , keep my chocolate milk un expired and loaded, refill my choc-o-chips  lady\"", "No thanks..im burned out on the Rock", "Man I know worldstar ain't tryna finesse Jeremiah Phillips like that", "Dam yall can at least pretend to have had a good year. Yall depressing as fuck lmao", "Fukn stupidest shit I've heard in awhile", "Whatever I did that shit in my dreams a few years back.", "Anyone else notice the play pen for an infant and she lights up a cigarette with dog shit in the floor...that's not just nasty as the lady said...it's also a health concern", "All them people there and not one person played dmx on the jukebox...side-note: this fight was about a 4 until that chair was involved and turned it to an 11", "Last time I check NewAtlanta? I think that's what it is. But anyways quavo n the gang had automatics with extensions not no lil pistoles.. he ain't pickin up the phone cuz he knows he will run your ass down.. don't fuck wit this generation. Bigger guns these days bigger then your bitch ass pistoles Soulja", "Teon Thomas Lmaoo we will talk about everythingggg. I swear", "That's photoshop. And enough ammo to bring out a bunch of idiots to argue with each other. Well played world star.", "ATTENTION PLEASE!!\nLadies and gentlemen Boys and Girls Brothers and sisters Uncles and aunties Nephews and nieces Doctors and nurses Neighbours and Colleagues Students and graduates. I really don't have anything to say. Thanks for your attention.", "Tomorrow is not promised to anyone. All of you making jokes about this, look out. Karma is a bitch and strikes at any time...", "All that Apple has to do is Turn on find my device . When they turn on the device they'll be  tracked. I'll feel bad for who ever buys it of from them. Cause they'll be the one going to jail.", "Every year will seem progressively worse if you watch TV and the news. Especially with how biased most news organizations are and will air race baiting trump hating crap non stop to keep views up.", "This guy sounds like a horse Geti Misini", "Bars .. Factz Remy the hottest female rapper, sheit, she better than most these new so called rappers ..", "She can worship satan or whatever all she wants but that shit is not centered on her stomach. My OCD is screaming", "I hope this photo was photoshopped. If not then double up the \"EEWwWWW\"", "I love how all you dick riders love to explain how some rapper yo ass has never even spoken to knows why he does shit what his motives are and how he feels. Yall are some sorry ass mufuckas man quit paying attention to this bullshit and check out whats going on with your country and what can be done to change it.", "Any nigga that wears whack ass fag snap backs deserves that curve and much more", "Alexandra Allman Incase ur looking for a good gift for Matt", "I like how folks take this fuck COMEDY to heart. Care Bears ass niggas I swear.", "Actually I think all the people who work and are paying taxes are the slaves of this country right now and the owners of the businesses or even slaves because of the taxes they pay no matter what color you are if you're working you're a Slave", "Maybe you have to know the darkness before you can appreciate the light.", "Jacob Lawson this happens often when u get a little of that Devils dandruff in ya lol", "To saves his dog was the right thing to do and that is what most people would of done,but no need for this other person to jump in and start  punching on this kanaroo.The owner took care of his dog.", "If surgery makes u feel better about yaself then do it. Don't let anyone else tell u ur something when ur not. Shit I'd get a butt lift a boob lift and a tummy tuck. Fuck what yall think smh.", "He wouldn't have had a chance anyways. Lol last thing you want to do is turn your back and run. Lol", "The guy who trained and funded isis to overthrow Qaddaffi is going to tell us how he is wiping out isis is hilarious.Then hillary will come and say with the help of the rebels that we funded to take down isis we were actually supplying the enemy on purpose to destroy the middle east.", "The whole world has been making fun of young thug for years but when he finally says something about someone else y'all lose your damn heads.", "i couldnt see shit \nall i heard was hey, hey, hey", "Lmao that's ridiculous.  Obviously since Trump kicked hillarys ass it must have happened w Russia's help??? Sore losers making up any excuse lol.  Sad", "Dubai.... smh\nExtreme islamics beat and kill women for things they say is indecency. And she wants to go there to be a international prostitute smh \nQue pendeja\nI know there r tons of women who go there an do the same thing so it's not the 1st an definitely not the last but hell nawh it ain't worth it", "This is why I carry. Any one who wants to swarm and attack someone deserves what should come to them. If some one beat my kid I'd go kick the shit out of their dad. If they didn't have one (like a majority of the participants in these videos on this site) then let it be known to those little shits next time they will feel the pain.", "Grandma on a late night creep. I would also be scarred for life and delete that text immediately.", "Barney: \"I love you, you love me...\"\n\nGirl: Bitch, no I don't.", "This would have been a good time to have been carrying a gun..  There'd be 2-3 less teenagers in that neighborhood, if I were that father.", "This is because Donald trump became elected,some people think they got the immunity card to commit hate crimes freely. Nah bruh", "Stupid for the people who bought it and genius for the people who are selling it. It's like the people who buy Kanye's hobo collection of raggity clothes, the people who buy it are stupid while the people who are selling it think you're stupid for buying it.", "Shit .. more like if I had a dollar for every bad thing !!! I'd be rich", "You need to hit the road & have someone there,turn off all the light & wait with a shotgun....that would clear up all the mystery.", "I'm so lucky to have a friend like you, thanks for the soup Celeste Schammer", "Weres the guy with the free movies? All i came here for.", "Amazing, people in the comments claim they know more about the topic than a scientist who's educated and did research and won awards. Great idea, listen to the retards in the comments who use Wikipedia.", "I would have fought that fat piece of shit! Lol stuff another fuckin donut down your throat pig! On a power trip much ya think? Its called freedom of speech dick wipe i can say whatever the fuck i want dont matter if he has a fuckin badge or not", "Its different we as blacks are tired of seeing our own kind getting killed but the pigs are killing all races now so u all should be tired as well fuck the police o well", "Fucked up part about this. Is there's another video of a group of white people who made a video of the mannequin challenge with automatic or semi automatic weapons in it as well. Not that I want the traffic on my page but I posted it yesterday. Lets see results of that one.", "Public defender eats lunch with the D.A. and discuss how they they going to fuck you,better take your ass to the law Library", "wow ,that bed is uncomfortable,they sleeping with light on", "Dumb ass black peoples would do some stupid shit like this and turn around and wounder why the fuck the world looks at them like idiots ..... O let's get the whole gang togather and take pictures with a bunch of guns knowing I'm black and I dress like a thug , but the world will think I'm cool right ? Right ? Fuxking idiots !", "Thats disrespectful.... Would Pac or BIG have ever done that?... No Way... imagine if an artist done that to his mom or aunt??... I hope the airline take action.. thats Bullying, harrasing, and offending Hard Working staff. Hes fuckin trash also.. This new era of music (i cant call it hip hop) has bastards for artists who have NO fuckin idea how to talk to people, and have a high level of disrespect.. Fuck Young Thug !!!!", "Now this this is one of them occasions\nWhere the homies not doin it right\nI mean he found him a hoe that he like\nBut you can't make a hoe a housewife\nAnd when it all boils down you gonna find in the end A bitch is a bitch, but a dogg is a man's best friend so what you found you a hoe that you like but you can't make a hoe a housewife", "When I had a public def..... oh wait I never needed one since I'm not a dumbass and does illegal shit. Don't do illegal shit and you won't need one. Problem solved.", "Dude had enough money for fucking zip loc brand bags. Fuck this post", "People wonder y there is racism. We divide our selves. Many different ways too. So its not only racism, but wat u stand for too. And dividing ourselves is wat makes us hate each other even more cuz u aint on \"my side\" or i aint or \"your side\".... but then again, ik im wasting my time. Im wise for a young age, and ik these sheep wont understand bcuz they think its \"whites\" or trump. Keep playin racism and the dividing game, u will see how far that gets u. Even if u dont wanna like us \"whites\" or watever, join us, and every other race who has, who has put aside there color and where they come from to rise. U may think its impossible, but merely a revolution is inevitable, and if u dont think sumthin is going on then u are a true sheep and they have gotten to u.. i find it odd how ALL media sites and sources and bs all post this kinda shit.... Everyone has a phone nowadays so everyone has a camera. If u arent expecting a fight or a cop to shoot u, then u wont film the whole fuckin thing,so of course u will miss info as to maybe y it happened. Jumpin to conclusions. Open your fuckin eyes", "People need to take their hoodies, jackets, and backpacks off before they get into a fight.....especially if you see the other person has none of that on.", "Side note- the man speaking is heavily biased and praised FBI director Comey for not recommending Hillary to be tried for mishandling classified information. In other words there was some truth in his speech somewhere but there was a lot of bullshit in there too.", "Honey you to damn beautiful to be trippin off that bullshit keep your head up and dont let no damn fool do that u better than them white bitches tellin you that u CANT when YOU CAN BABY GIRL KILL THE HATERS MUAH!", "some dumb people on this page I swear...just wait till it happens to one of your kids or family member. ..lets see if you guys still wanna crack jokes", "Lmao people get so serious like this was real. Y'all gotta be so miserable in life.", "Ex wanna talk? Shiiid. Unless we got kids or money together aint shit to talk about. And if you fall in either one of those. Theyd be talkin to the lawyer not me.", "Coco in the yee zees tho nah never that kinda no how 2 still be broke n look gud b4 all that im not eating shit if i put my foot in it 1st u feeeeeeeel me", "If you have to point out your success. You didn't succeed.....actions speak louder then words.", "Cchahaha fist and body was flying hahaha #wshh krazy like me the Gwap", "What happens is your wasting ya fucking weed", "I'd be SO pissed; she should've told her G'ma \"NEVER show yo face in a nude text\"", "Bryan Allen you are one dumb fuck there are a lot black women and men in London you stupid shit", "1st try or not, trick or not it's still impressive.", "Oral sex shouldnt feel like a \"chore\",  then it becomes boring and lame. I say, if you wanna go for it, go for it! If you don't know where the persons body part have been, just use a fucking condom. Oral sex is a part of foreplay, and women have to be wet in order to have a smooth transaction. Unlike men, women are much slower to get \" excited\"", "He's probably like \"damn but ya'll PS4 setup ain't never working \"\n\nAll jokes aside- it's great to see nice acts like this! Pay it forward", "dude it must be her form thats probably not where the leverage is supposed to come from so the pressure was taken bu her bones and not her muscles", "She's still an old women idc what she's doing... they should burn in hell", "Oh I get it she don't like chocolate duh people get with the program lol", "The guy should give the girl head first, so when she returns the favor he can slip it right in after. Plus it'll get her all worked up.", "\"Ronald Gasser, the white man who gunned down..\" world star is just as divisive as the rest of the media. Why is it relevant if anyone is black white or green during a news story", "Even listened to it before i labeled it trash, but daym that shit garbage", "It jst looked like like the fckn dog was jst sniffing him ?that shit was misleading i was over here experting the dog was  howl dramatically or sum or lick him start break down crying nd give him a hug lol something? But sniff is okay..", "This is the one and only time I don't want any extra sauce", "This type of treatment will not be tolerated and I'm so glad this woman has had such overwhelming support. The managers name is Faith Batchelor and she obviously doesn't follow company policy. Fire her!", "Reminds me of that Boondocks episode where Thugnificent instigated a rap beef to try and boost album sales. Uncle Sam must be coming for that ass!", "Man, you can't be disrespecting Waffle House like that.", "Rbrt. Mayo lang ara ko for the things you need hahaha. Chos", "she picks the nastiest shit to try and bring back to the nastiest restaurant. her hair dye must of seeped to her brain.", "It says valley stream, as in valley stream Long Island ny? IF this is the same valley stream in NYC  then yea the kid have a right to be shocked or in disbelief cause you hardly find nice people or people doing a good deed in Those parts lol I know cause that's where I'm from.", "Yooo those 3 dudes are ass. I'm over here thinking that big mothafucker gonna put some work in, but I guess you can't judge a book by its cover", "Daniela G Zarate this was me when i would go get you and my tio would be like si puede ver lmao", "lol Hillary gets fully exposed for rigging the primary, but it's \"overwhelming\" the evidence that says Russia exposed it through hacking and rigged the election. You have to be a real moron to believe this", "I hope she knows that unmarried sex is illegal in some of those areas. She's going to make the money get arrested and then need that money to get out of jail so basically she would be doing it for free. I said it first. It's a setup.", "Racist ass mf's and anyone who thinks it was rightbor justafid is a punk ass racist themselves and should be beat like thst or worse for defending that stupid ignorant piece of yardhouse dogshit act!!!", "Perfect scenario of cops. They continue to say we haven't done anything to ya. Yet they wrongfully stopped him and are detaining him and talking shit to him. Great to see what cops really do", "She spit in the guys face as they were getting off the train, apparently he was being overly obnoxious with his friends making lude comments towards her and other female passengers. The kick down the stairs is what ensued as a result. Oh and I have no idea what I'm talking about.", "They should charge his barber with manslaughter. Da fuck is that?", "Only takes one word to ruin a guy. \"Buddy\" that will kill any guy inside", "It takes a real man to stare at the dog and not the pussy", "They did the same with Obama. It's representing the fact that the United States government is and always will be ruled by devil worshipers.", "Don't get me wrong I love step Curry but gimmie a break people he's a human just like yourself!!!! My goodness people need to think !!!! I'd be more in tune of getting a school teachers autograph to be honest!!!", "Looks more like John Legend than tiger Woods to me.", "Hahahaha if you're wearing a guys name on the back of your shirt, that guy has the right to fuck you and you're a pussy. Sports fans have the smallest minds, I swear.", "So what,  cops kill regular people all the time, and it's not a wild man hunt on them. They need to stop cause no lives matter unless they involved in the U.S.A Corporation.", "Emma Pando us when we went to lunch after that brownie", "i think he just putting names on a piece of paper , placing them in a box , and picking people", "If it were a Walmart people would be going insane . Just because your a dirty Hippie it's no excuse . That place was a giant Hippie Trap House .", "them dudes in there do not be playing especially the ones in the hood", "What did she make two songs singing hook? More weak rappers is what we really needed!?!", "You're not gonna beat a lot of people up walking in flat footed with your shoulders squared up and your chin in the air. Just horrible, horrible technique", "If they're right... \nWell played Russia. \nYou pulled down the USA's pants and you stuck it right in there!\nThey even spread their ass cheeks for you!!\nWell played Russia. Well bloody played!", "Bitches would let him finger if he had a fake Gucci belt...", "Good thing the driver wasn't a fat fuck", "Stop shopping with these people just to let you know bath and Bodyworks are owned by the same company Victoria secrets Both of them just on a different name I did the research", "Is this considered white on white crime ?\nOr white violence ?\nThugs & criminals & punks ?\nWhat would these group of white ppl be labeled as ?\nJust wondering....", "Leah Reynolds this made me laugh way harder than i expected. Figured youd get a giggle too", "It's only stoopid if it don't work in these idiots...", "All those kids are fucking punks, he was already fucked up, the dad was just trying to defend his son, he even made a valid argument, \" what if it was your kid\"  . Fuck those kids.", "Big deal he owns the place. He was just hanging some brain", "I was wondering why this MF arm was doing a full 180, then I realized that pillow just lucky af", "the kangaroos was just trying to find out how to live in the house", "Right.....because senators and pther public offocials, while sittong in their high paid cushy offices, \"condoning\" an attack has EVER stopped it from happening again smh.....why dont YOU as public officials get out there on these trains, on the streets, in the buses and anywhere else these things are happening and PHYSICALLY stand up for the things they supposedly \"condone\"....but wait....that wont happen because they ACTUALLY think that by standing in front of a podium and saying a few words will actually make a difference....what a worthless practice and what a COMPLETE and utter waste of the use of the ability to actually MAKE a difference. Has it EVER worked before???? They wouldnt know, im sure, because theyre being driven around in their nice shiny bmws and lexus' while people are having this done to them.....whatever....shut up or put up....but they wont do that either...worthless....", "What the fuck is america coming too, it dosent matter what he/she/it was no person has the right to take an others life, this goes for those with a badge as well as those without.", "We the best? They couldve shouted it all at once in the end...", "World star please stop with the political post. We get it Obama was a black president, but he also left this country in shambles. Stick to the fights and other ratchet shit that helps me through the work day.", "Is this photo real? Meaning that's jay z wearing that shirt?", "Waiting for the \"Trump supporter\" scapegoat", "Nigga, please. Putin destoryed them. Not obama", "You didn't even mention that it's W2S's tweet. Shame on you WSHH", "Mom: what's wrong with those eyes? Me: are they laughing!  :D  lol", "He's gonna love this. Not only is it giving him praise and a flattering profile pic, but it has his last initial and the words \"I\" and \"ME\" on it.", "I almost died today someone was driving the wrong way on the road I barely swerved out the way and avoided a head on collision the dude went flying into the middle divider. Blessed to be alive. Life is precious as fuck u never know when your gonna go treat every day like it's your last I am grateful to be typing this my body is still in shock", "Don't let this distract you from the fact that lightning mcqueen blew a 1 lap lead in the piston cup", "This has been happening in Puerto Rico since 1930's by Dr Cornelius \"Dusty\" Rhodes under the Rockefeller Umbrella..... Look it up.  \n\nAll you have to do is listen", "dumming down the series for little kids .. all superhero movies do this eventually .. remember what they did to batman?", "Diarrhea = a lot of shit but wasn't as hard as it could have been.", "Samantha Hauss or you walk 20 miles on the beach and realize you have to walk back lmao", "hahahahhahahahaha that's some funny shit. Obamas administration shipped arms to ISIS, obamas administration CREATED ISIS and has assisted them in the Middle East since day one, allowed them access to oil, gave them tanks and advanced weaponry . Russia is the only real legit force trying to stop them. Man your American news is absolute bullshit.", "Damn!!! Bone about to get buried in the yard", "Seems like they are both assholes? Comments don't deserve being spat at like an animal, on the other hand I hope each of these Duche bags are jailed and taught a lesson by the HNIC In the slammer.", "The same as the rock and Zac Efrons last 4 movies but with a different name", "He could have broke Kobe Bryants record", "He just pretty much yelled out...fuck dude perfect", "Jacquelyn Farrington we are watching this!! Also props if you know the song in the trailer cuz it sounds dope!", "I don't want to be in a crew where I can beat everyone up by my damn self", "I want a woman to love me the way white people love their dogs", "why do people complain so much? i bet this shit would taste awesome and better when your high af.", "Soulja Boy listen listen: The reason why he ain't answer the phone is cause he's out actually making money, and being famous instead of spending his time making videos on Periscope lmfao you've had this L for almost a decade, with all the guns you rap about there's gotta be one you can off yourself with", "She was young once probly ate that D in the school bathroom...", "If you wanted to give us a new Spider-Man , with a different feel and new characters. why not give us Miles morales story line. Instead you fuck the fans by giving us no harry, Mj or gwen! And out of all the villains you chose the Vulture the MFUCKING VULTURE.....", "What's next?? Trump is gonna name ted dibiase the million dollar man as secretary of treasury, and all the trumptards will say oh he's a good pick he's a millionare he should know something about money. Don't forget he is very diverse he even owns a black butler in virgil (slave) oops i meant to say he employs a black butler lmao.", "It's all about race. I just watched a video of some white boys doin the same exact thing. They had all types of guns and they didn't get raided. I mean they're both dumb for having guns out like that , it's illegal. But if you're gonna punish one treat the other the same way.", "Whatever these hoes will eat a broke niggas ass damn sure will let a rich niggas strong hand get up in there....smh #stoplying", "Fool will eventually part ways from his fortune js so with that being said that the best idea God wouldn't have it any other way js but awesome idea lol", "When girls fucking scream and shout like that it only makes things seem more intense. And it also sounds like the bitch instigated the fight as well, saying stupid shit like \" I said not herrrre\". What did you really expect fucking lol", "Running away from a man when he's down... typical kardashian mentality.. ruining our women by the day.", "People use to buy pet rocks so this doesn't suprise me at all", "Not every cop is a bad cop. Just like not every white guy that has a confederate flag is racist. Just like not every black person is a gangsta thug. I could go on but if you don't get my point by now you likely never will", "His friend wanted him with him.", "my honest opinion! if the tables were turned McKnight would be probably face 2nd degree murder possible life in prison rather than slap on the wrist manslaughter with probation. Just sayn", "Wow, she openly admitted that she will fuck an underage kid. No shame.", "Cody Hauschild if this isn't you, i don't know what is", "If it ain't real then I can't deal.", "oh look another std riddled thot bouncing her fat ass", "Dog looks like the abominable snowmans bitchy grandma that smells like cigarettes & mentos", "In the criminal justice system, sexually-based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.", "Hit it from the back watch a nigga bless her", "He spoke out and now they are going to strip him of everything make him look crazy and then his death I hope he finds his Chicago ways again back to a humble but smart artist.", "Must be real hard to find a man out there, times are rough...", "Solider boy man brush that stuff off and make your money dude. But first you gotta get rid of that purple gun son.", "Why can I hear his voice saying this? XD", "Okay so is there any blacks in his cabin??? I'm not impressed at all make the cabin with different race groups that way most Americans will be satisfied. I'm just hoping that he get our jobs back and get shit back in order like he promised.", "A barber was arrested in my area because he sell drugs. I have been his customer for years and i dont even know he was a barber.", "I don't know where you fucking pussies are from but y'all fight like a bunch of hoes. Ill go back to back with one of my man's and Molly whop all 15 of you faggots LOL that's embarrassing dudes 55+ years old", "Why conduct the sobriety test in the middle of the damn road? Bad decision all together.", "Oh Ok lets reduce ourselvs now on every shit what happens on the world to our religion. Its not like not any Americans doing a crime or never did nooo angels on earth lol.", "Someone from london tell me wtf pengest and hench means? Lol", "fuck who wouldn't be scared i mean lets be honest even the hardest dude in the world would shit his undies in that situation", "Worldstar talk about real news like how young thug wears dresses. Enough of this dude going on about some bullshit.", "She heard competitive cheer just became an Olympic sport.", "Lenae Burchell our first lunch at the place we got buffalo chicken salads haha I can't remember the name!", "I've spent many night by the toilet, smoking when I drink. Not a good mix", "maybe instead of being lazy fat shits, you girls could go on a cut for a year or so to get rid of the flab, and then actually put some work into your diet and doing some real weight lifting so you could have a body that doesn't look like somebody took a shit into a condom.", "Forget what it says and just look at the picture lol Vincente T Trejo I bet you were behind this", "Money falling out his ass he got a lot of cash you can't be saying that s*** when you just got out of prison", "Y'all ever stop to think, maybe some black dudes did it, and wrote all that to kinda point the finger in the other direction ? You Never know ...", "Plot Twist theses were all stolen at a local store by Worldstar Hip Hop and now they selling it off on there website.", "if the teacher is late all the student from the class got to slap him or.... ?", "I don't know, anyone else feel like this kid was a pain in the ass and that's why they chipped in to buy the Wii for him? \"We bought this for you so you don't have to come in and play here everyday\", and \"here's the receipt we can walk out together\". Seems like they want to get rid of him, just sayin.", "Should show conor getting choked out haha and being saved by Diaz.", "They take it away so that we'll want it even more. But yea, they sell those in grocery stores now.", "This did not need to be news. It's sad and depressing we know dogs are our best friends and they love us unconditionally. I feel it is Inappropriate to show this.", "Blake Beard Jake Leonard I think this may be Yom and Joopymane's main drink haha", "That guy in the black jacket took and three guys then did a spider man roll like I'm outta here", "Yes, finally some sports action like the rest of the world. Football is way behind", "Who gives a shit if someone is under influence\n The black guy handled his shit because he wasn't drunk. Takes a fighter to stand up to someone's shit and who isn't scared. That Loco got his ass whooping he asked for.", "Sex is one of man's greatest downfall... It's sad that a quarter of these women get by through life just off their looks while taking advantage of these dudes insecure egos.. It's sad that men don't realize this and continue to allow themselves to be distracted and raped of their hard earned worth...", "Done with the politics and back to the twerking whores eh?", "I don't see how the order got messed up", "She won't be Manager for long. I give it till the end of the week it is racist and very bad judgment and managing that could be a lawsuit \"discrimination \" something like that I think.", "Fuck it, I'd drop the gimp too, off the back of a moving truck.", "I did this shit a few nights ago and got arrested for it and lost my job. Don't do this, just be late.", "Ofcourse its the male, While u undress her you go for it and stay there for a while, If u dont like pussy enough to go down everytime then u need to question your sexuality", "**looked at the picture first, sees nothing wrong**\n\n**Read the description, ooooh shiittt devil hwhabxisks**\n\nExactly what over thinking looks like.", "I know this is a challenge but who would be dumb enough to text the crime they did in a phone.....even if you erase the messages ....its still there.", "Kacie Babie smh lol that's why I don't fuck wit Henry like that hahaa", "I'm sure it would smell like a rest stop on I75 after those ole nastys got done. Makes my skin crawl.", "I'm smashing even harder. Then ask her what happened to Tupac", "The only thing hilaroiuous is watching black people talk british...", "Wasnt he in for sexual assault or something...how people gonna support him, but then get super pissed off at Trump. President or not, you some hypocrites.", "People that fallow stupid rules like this desirve to be slapped me i would of slapped the teacher and walked out", "It's called cross faded nothing better other then rolling snorting lines smoke weed and drinking all at the same time.", "i wish i had them editing skills..", "He will want that money back or once they quit he would probably be like nah I ain't giving you that! He ain't a good rapper so he won't always have money to do that with!", "Dudes against Recreational weed he can go fk hisself lol", "Lol i just had a deep conversation with a bunch of condescending assholes. None of them understood what they walked into. But the ones that saw walked right by out the way they came hitting their ass on every step on the way down. Lol \nI have had a very good night so far. Im getting better at this.\nXD", "Finished my courses, Met Sharon Jung, went traveling. BOOM.", "Carl Fawcett us lastnight trying to figure out how to open the new popcorn bowl bags in front of your mom lmfao", "Were is the N.R.A.. It's perfectly legal to have guns in these part of the country. Black floks please join the NRA and register your firearms..", "She being arrested and charged right ? Fucking pedophiles", "A black cop shoots a black unarmed man and nothing happens, but if he threatens a white boy to fight him he gets fired!!\n\nI see no equal treatment! There is definitely something wrong with your system of justice America.", "I hope Victoria secret publicly apologized and took care of this. Shame. And for all the people classifying all white people as racist, its that ignorance that is tearing us apart.", "Obama Might do some black people shit and Legalize it and dip tf out #Gangstashit lol", "Yay! We have a TV personality as a president. Now kanye and the rock might run for president.\n\nIts all made into a joke now", "Shaikh Rahiquzzaman didn't know your alias was Elbert", "Manslaughter? I might be wrong, but im pretty sure this is a slap on the wrist compared to actual murder. McKnight was MURDERED in cold blood over a traffic dispute, which he was apologizing for. The logic behind why he was shot for that is beyond me. Give this dickbag a real conviction: a seat on Death Row.", "The cops use the saying \"stop resisting\" as a reason to continuously beat a person. The saying is there way to justify any type of shit they pull.\nIt's the way they get away with this bullshit.", "This is my warm up. Time for that new J Cole", "Its funny how some people are blaming muslims and refugees without realizing you have to open a book to read it.", "I think they did this to truly be nice to the kid. And just recorded it to pass along encouragement. We have no idea who these employees are, we only saw one face so it's not like their trying to get famous. He probably comes in every day because he might not be able to afford a Wii. And he is in shock because it's rare people do this kind of thing, probably in his life as well.", "All I want to know is did she get her $20 lmao the bigger they are the harder they fall", "Are you the dog or are you under the tree Stephen Giles?", "I can already see how many accidents and seizures there will be due to drivers getting distracted by looking this", "That's when you delete the pic and smash all her female homies.", "Soulja Fraud don't know who to attack first they're coming from all angles lol", "Or when another chick be like he said you can move and you be like who is he next who is you.", "Throwing a ball from that height would a. Get taken by the winds and b. Kill someone. Didnt happen.", "\"Nothing but the dawg in me\"\n\"BOW WOW WOW YIBBYO YIBBYAY BOW WOW YIBBYO YIBBYAY\"", "This kind of stuff didn't happen when Harambe was around", "All these keyboard police officers on Here acting like they are experts lol", "Lmao silly little white boys calling each other a racist word created by their inbred cannibalistic thieving ancestors to belittle and dehumanize Africans lol BLACK GODS are so trend setting and cool they'll kill their own culture to be us", "To many different cultures too many different religions that's the problem in America this country will never get along because everybody is too scared to understand everybody's upbringing or culture.", "People can get plastic surgery done to feel good about themselves. Do I agree, no but I understand. At the end of the day, if you don't like that then don't comment and keep it moving. We all have our own flaws, so why judge the next MF.", "\"What's going on?\" - Chris Hansen\n\nOr ... as you catching hands on the subway the guy with his phone out yells \"world star nigga\"", "It amazes me that people don't know about throwing cold water on yo windows for the frost to come off I'm really amazed at this smh", "If it didn't make u feel happy n sad at the same time ur mama should of swallowed u", "Now watch, some dumb ass will step up saying that this is racist...", "This reminds me of the time I used to work in a zoo, circumcising elephants. The wages were crap, but the tips were big.", "This is what kills me about women you have a guy right in front of you willing to show you the most affection yet continue to talk to the asshole  that treats you like shit smh", "the real question is who stayed around to pick up the traces of this mans dignity off of the concrete?", "I am the one, don't weigh a ton, don't need a gun to get respect upon the streets. Under the sun the bastard son will pop the glock to feed himself and family, by any means your enemies my enemy we wet them up like a canteen, the yellow tape surrounds the fate, don't have to fake,  so now you're late ; open the gate.", "Recently liked this page for cool videos but looks like it's mainly another recycled meme page. Lame.", "This page confuses me... I thought you all hated cops anyway, or do you all just hate white people?", "\"Listen to the cops and you won't get shot\"- alot of ppl when the victim is drunk,  black and not listeningand loses an eye. \n\n\"Poor kid, he was bullied, stop bullying!! \"- alot of ppl when the victim is white and holding a knife and not listening and gets shot. \n\nNot trying to call the kettle black, but why is it this way. I don't choose one color and race baiting is dumb and immature. But let's have a serious conversation.", "I don't get it. You don't think that apple that's the serial number for each of those devices? You don't think each of those devices gets black listed from carriers? I just don't get why you would try to steal something that needs to be connected to the internet. Like it's not easy to find.", "Who even cares. If it was the russians they just did everyone a favor by exposing how crooked hillary is", "Baptize her in my holy water, back that ass up in the name of the father son and holy spirit, eyes roll back and head start spinnin not sure if it's from Satan or this dick. As I walk through the valley of the shadow of death I will fear no pussy", "See why you want to talk now,but when I wanted to talk,you want to argue,FOH !!!!!", "Looks like trump after his four years without a haircut.", "Soulja boy lol.That dude need to go crank some lyrics. Instead of thinking he can fight. Bro you can't fight or rap. How you get money. Being niggas bitches", "This is sickening. If anyone did that to my father I'd have a field day killing and murdering you bastards including the witnesses because NO ONE LEAVES ALIVE!", "This is sickening ! This video shouldn't went straight to the police , not uploaded too social media . I'm really sick of these ppl praising stupidity !", "Ella Teasdale you know the pair I'm talking about", "Skittles are more bigger, rounder or whatever, and m&m don't have orange colors I believe, so that leaves reeves just the rest lol.. I can tell them apart lol", "He caught that clean fade tho lmao that's what happens when you spit in someone's face. You don't do that, you just don't. I would have beat his ass far worse than that", "One she gently fell to the ground and two... don't resist she actually knocked herself on the ground why put her back in the chair if she's fighting.... so she can fall again? Nah she can stay there in time out", "But since wen do talkin shit while u got 911 on da line make u a savage all i seen was 2 bitchmade niggas runnin dey mouth", "My chigga trying to flip that in the black market so stop hating lol I", "Translation your ex still wants to smash", "I got nothing else to comment, so here's the recipe for a glass of water.\n\nIngredients:\n - Tap with water flowing\n - Glass\n\nMethod: \n - Turn on tap and pour water into glass\n\nEnjoy.", "TRUMP TO MIKE PENSE:  \"i want randy savage to be secretary of state,  Chris Jericho will take on boarder control (with the walls of Jericho of course), and with his decorated military background I want John Cena To be my head of military, OHHH!!! and I want stacey keibler in my office right  now so I can grab her p***y!\"", "Can someone give me advice Lately, I noticed that my girlfriend had lots of calls on her phone, and when I ask who is it, she always hungs it up quickly and she said it's one of her friends/business contacts. I also noticed that recently, she goes home in our rented apartment late, and when I ask why was she late, she always tell me that she went overtime because of her team building meet, although when I checked her slip, she had no overtime fee and I was a bit suprised since as far as I know, they didn't had any team building meets since 3 months ago. So, I went to her boss and asked about this, but her boss said that they only did team building meets only one time with her co-office mates a long time ago (which confirms that I was right), and as an extra, she's been absent on that meet, and her boss told me that she's been absent in her work a couple of days as well. The next day, she went out and told me she'll be attending her \"urgent team building meet\", so, keeping a distance, I followed her with my motorbike, and not far away from our place, a man fetched her on his car. I stopped my motorbike from a distance to make sure they won't hear me and observed them, and when they were going to drive out, I was about to follow then but when I start the engine, it died on me. So I want to ask for advice, where would the problem be? Is it the spark plug that caused the starting to fail, or is it on the main engine? The clutch, perhaps? Please give me a good advice.Thanks", "Well damn. Of course nobody deserves an ass whooping until your blind in one eye, but let's be honest here, the whole thing could of been avoided if he wasn't drunk driving in the first place. I'm just saying...", "Sorry guys. Just here looking for my friend Steve. Steve if you're in here, come home. Your mom is worried about you. And so is your cat Mittens.", "Im thinking on a million ways this s could be edited but he straight scored that s", "Knowing Kung fu has its advantages sometimes!", "They still didn't catch the guys that did this yet everyone assumes their Muslim...guilty before proven innocent when it comes to Muslims that's real sad", "Fuck this woman is severely mentally handicapped and insanely perverted. Even the guy holding the camera was freaking the fuck out...", "I give the black dude some major credit for several reasons, he sat there quiet listening to the dumbass say stupid shit for a long time, wasn't till the dumbass threatened violence then he reacted, knocked his ass on the ground and instead of kicking him when he was down he continued to walk outside to keep it off the bus, proceeds to knock his ass out with a single punch and walks away vs kicking the shit out of him once again while he was down. That's how a man fights imo, shut down the threat then walk away.", "The movie looks terrible...I'm watching for Priyanka Chopra", "Yea people don't like her because she is a real rapper.. Mumble rap or fake ass and titties bent over is the only thing people care about these days.. Gurantee most didn't even listen to her BARS", "She was willing to put herself in the line of fire, stood between the police and him. That right there is the reason why he is marrying her.", "#66 white boy was bout tht life lol", "Complete respect for that man! Gets off the bus, does the deed, walks away. No BS.", "In jail after drinking and driving, putting everyone's lives on the road in jeopardy. And it looks like he's about to get paid because he couldn't follow simple rules, don't drink and drive and don't resist.", "thats my life #CRAZY EX'S SMH", "It's gonna lead to the original planet of the apes and apes will own earth", "We elected him because he was black. There. I said it. Congratulations. We just found out he was even more fucked up then a white president. Funny how Ppl thot different. Smfh.", "Always blaming Raider fans....get a clue dumbasses...not ALL of us are hoodlums, give me a break . That's stereotypical  of you guys...Quefs started that shit and Raider finished it.", "This guy is the actual future of the game lol", "How high does China rank in education? We could probably learn a thing or two from them...", "Goes to show how dumb founded America is , they will buy anything !!!!!", "God damn mom teatch your kid better, the right way, gods way!", "\"It's very important to not show fear...feeyeeeaagghhh!\"\nThat's a king, doing king shit for sure.", "On the 7th day of Christmas my true love gave to me\n\n7 flashy dimes\n6 shots a swishing\n5 NBA memes\n4 poster dunks\nAnd the Warriors blew a 3 2 1 lead", "Hahaha she said that she's gonna have \"words\" with him, not about the girl but because he took her socks from her room and is wearing them?! Lmao!", "If you're driving by a construction site and you decide to yell \"fuck the construction workers\" they don't have the right to pull you out of your car and make you stand there listening to them bitch. Regardless of whether or not he was trying to be a nice guy it's not his place. Glad he's fired.", "From the looks, this Spider-Man finally looks and sounds like the one I grew up with...however they why did they choose a B-list Spidey villain like the Vulture?", "Don't people realize cellphones, tablets  like computers have IP address and and can be tracked. You will get caught and it can be remotely shut down. Seriously people grow up. If you can't afford something work for it!!", "Person of the year? How? He hasnt done anything. Im sure one of the thousands of people helping homeless people everyday would be deserving.", "Naw that's a 3 course dinner id bury ma face right in there", "No beauty shines brighter than that of a good heart.", "Bullying is no joke. I was bullied and I always thought about doing what he did. I ended up in therapy. Everyone is different. Stop bullying and fighting. It does nothing but cause bad situations", "People judge police from a few videos that show what you don't like. Yet you don't see all the good that's done. Helping the elderly, kids, etc. some calls that are made are pretty dumb and police still show up and find resolution or just make someone happy", "What's really sad is all the neg. comments,,,People it was a act of kindness,,,*Best Buy Employees Ur the Best!!! #Beautiful.... :)", "Even if it is photoshoped or whateva theres still the fact theres a chick fully clothed walking wit a chick showing all the goodies or not so goodies # why?", "I'm a father, I really feel for the guy. You can see the fear and embarrassment in him. It's tragic to watch. Poor guy. At least he had a go though. #TopDad", "The funny Thing is apple will be able to track down the devices by serial and anyone caught will get charge with grand theft", "Ian Kliewe lol fuckin dj khaled", "Question - was he absolutely piss drunk when he done this? He's slurring his words more than me after a massive skinful on a saturday night.......if not, I will be the internet's spokesman for today and say this is absolute DOGSHITE.", "It's unfortunate that the 2nd fence didn't break as well.", "Why can't i post memes in ur comment section?", "2/3 chance of eating something decent. I'll take those odds. Just eat one at a time", "That driver narc'd on his buddy, what a yellow piece of shit bad friend. \n\nAnd it's not that the kid didn't want to throw down with the coward cop, but if he did engage him, he wouldn't hesitate to pull out his weapon and shoot the kid.", "It ain't that bad I do it all the time, it just depends how fast u drink", "anyone who would support the killing of cops is an idiot", "WHERE WERE ALL YOU IDIOT'S COMMENTS when PRESIDENT OBAMA was screwing up?\n\nStick to twerking and mannequin challenges...\n\nAll your attention is good for.", "Warrior shit....I like the little guy, half the time fighting is just about not being scared of your opponent.... Them dudes knew he was finna sleep one of they ass eventually", "I thought about this concept years ago using led lights but since I'm poor as shit couldn't come up with it.", "Corina Garcia maybe grandma should have a smartphone to get back on the dating scene lol", "Racist white people are having one hell of a year. Can you imagine if another race was doing all this $hit to white people what the news would say smh", "why does he have Colonel Sanders on his jacket?", "I respect HER shit tho, she like na I'm his wife I got this y'all don't need to do NUN!", "Why is her hand bigger than his head? #yetihands", "If he don't tuck the shower curtain inside the tub, he's gonna be swimming in his bathroom.", "....DC needs to realize that he roasting a guy that looks just like him..lol", "Fucken cowards we live amogst so many racists people they are just not outspoken about it", "God has truly bless Me once again all in one week...There is a God", "What a fuckin pussy ass move, no matter what she may have done to him!! That guy is the biggest pussy ever", "Who let's a dog poop in their house just to leave it sitting there? You need to give your dog away to a loving home. I'm willing to bet that she doesn't even bathe herself. Disgusting,  ghetto, poor example of a mother!!!", "Damn!!!! Manz is blessed with the bars..... straight fire!", "I dont think he should have been fired and these other teens should do the right thing and stand up for him. This fucking punk ass kid is a little bitch. Cop was actually cool. These are the ones that get fired and look how he knows the other kids and is joking with them amd giving advice on how not to roll with pussies like this kid and he gets fired but the ass holes that would have knocked this kids teeth out off camera keep their jobs", "Let's get ready for the tears of those people who've never experienced any thing remotely racist a day in their privileged lives...", "\"hey guys, we really suck at rappin'..... TF should we do?.... Oh yeah, I'll pick beef with other rappers on social media, that's the only way I can get air play\" \n\nFucking clowns", "As a kid this happened to me at a local minor league baseball game where a top prospect handed me his bat.  An older teenager tried to take it away as he passed me the handle, but when the jerk pulled the bat towards him, I gripped that handle and knocked him in the head with the end of the bat.\nWill never forget the prospect's response, \"Hey, that's not your's...(crack)...whoa!  Nice hit, kid!\".\n#LeaveItForTheKids", "I like taking long walks in target.", "One time I saw these two blind dudes trying to fist fight I yelled watch out he's got a knife an they both took off runing.. best day of my life.", "Nicolas J Hamer\nThe most accurate thing il ever tag you in", "This pic is so old it might actually be Jay And Tiger.", "This is what happens when you live in a neighborhood with no hope either death or jail I can't see how people live like this smfh it's that poverty stricken mentality", "Soulja boy hasn't been relevant since 2007. Why is he talking shit?", "The guy doing the field sobriety payers were answered", "He deserve it that is justified shooting please cut out all the racism doesn't matter if you're black or white he put the cop life in danger", "Fucking pedophile would beat that 9 year old ass and this crack head", "That looked more like another kid trying to steal the shoe..", "Ruben Diaz dude stop giving them bad ideas just for your own pleasure lol", "That is the most disgusting thing to do is spit on another person. Just like Koreans, Muslims come into the black community and never contribute anything. The African American community should drive them out by not shopping in their stores. I am glad that dickhead got a beat down from hell. Muslims always wonder why their asses are always catching a beat down. If you want respect, then stop acting like a fucking piece of shit you you stupid store owner.", "Internet just be roasting mofo like no ones business...", "OlayinkaOyeBriseidy LMFAO first person I thought of was Yinka", "99% of the comments are negative. What does that say about americans", "She ain't shit for this.. I can't stand Kanye but leaving the man while he's down like this, is shameful.. Then again,  we are talking about Kim Kardashian.. She HAS NO SHAME..", "Soooooo check this out.... People always talk about how they hate racism, racism is wrong people who are racist  are wrong and should die so on so forth, but when they get baited by posts like this they seem to say racist things and get race charged arguments. So try this out if you are going to type something, change the word black to white or white to black and see if it would sound racist coming from someone else. If it does you probably shouldn't say it. One step at a time and we will stop things like this article from happening.", "Just because you're in a wheelchair doesn't mean you're not an asshole", "When i dont eat i get in a bad mood. Bad enough to get my nina or bat out the car and blow up some knees. When im hungry u dont play.", "Lil uchi chouchi and future make music for idiots.", "That's a prefect example of how black people give other black people a bad name why wasn't she addressing that black people who's not into all that bad shit get treated bad cause some goofy person decided to make a fucked up choice specially at a time like this when all this racism is going on", "He ain't given no money away... Simple case of social media flexing. Another rapper did the same recently. \nJust another way to floss money... He won't go do that at McDonalds", "I have a window ice scraper and i surely did scrap mostly off the front of the driver side and a little bit in the back and drive with window down stay in one lane until it melted... You can pass me cause I'm not driving to fast until I'm able to see clearly..", "That's wild maybe your bro never wanted you to leave his side life isn't even granted one second you can be gone jut by a blink of an eye dam R.i.p", "Some of the questions that you people are fucking asking is absolutely mind blowing \"how do they know if they're convicted felons\" you fucking idiot there's a video clip of them holding guns if they are convicted felon there prints dna and the main one PICTURES of them will be down at the station put two and two together people come on its not fucking rocket science now is it", "First of all: McDonald's is bad for you, and after all the hype of even some of my more retarded cousins praising this shitty seasonal food, I tried it myself last year for the first time and it was gross... AND secondly; I don't trust or take bitches with cotton candy hair color seriously so why should anyone in court. Cmon, first impressions are everything.. especially as superficial in court of law... geezuz damnit..", "All jokes aside Im from DR and can tell yall because of this vid everybody has been going all in on these baseball teams due to they are not giving a good example for the young kids that go to the ballpark, didn't think this video would go this far even tho wshh didn't put it with the social dabate that is going on here for the past few days but I understand that ass is fine and thats what matters", "This is why i don't fuck with people, they just lie out they ass for no reason", "Oooh hell yah cant wait till i watch this movie i always love the planet apes", "#SouljaBoy, yea nigga I tagged u. Lemme get that purple gun yo. That's for girls, ain't chu a boy?", "Spray bottle with rubbing alcohol or acetone gets that pesky ice every time. Hot water can crack the glass lol", "Man this is crazy, seems like it's becoming a daily routine. Living in Sacramento, California for a large portion of my life, I have never witnessed or ever heard of police brutality incidents in my city, the police here in Sacramento and the residents have a very strong relationship and I could never see police doing that out here. On the other hand, it seems like it's just a daily norm out there in the Northeast and East coast.", "I don't know why someone would even let her come out the house like that. She could be mentally challenged or anything could be wrong.  Sad.", "If England is known for anything, it is for having the worse food on the planet.", "It's gonna b wack without koba", "I wonder if they both have different fathers because the boys don't look alike at all", "He looks like he could kick your ass with one finger master style", "Why? I mean, I don't see his father so maybe you aren't the best example...just saying lady", "Fk I wish I didn't watch that video. If you're contemplating, don't do it", "Walked away like a real man would. . Mad respect for not stomping him out lol.", "I'm assuming the dumb bitch that wont shut the fuck up is the slut that caused the fight. \"Don't do it here, don't do it here\" that bitch needs to stfu. Why do girls constantly try to dictate how or what happens with a fight? Its mad annoying youre dumb as hell", "Whites did it. Blame those damn cocky Caucasians with the blue eyes ahhhhha", "If the dad would have fought back you would all be bitching that he hit underage kids. I would have put the little fuckers in the ground and went to their homes and beat their dads for allowing their kids to be hoodlums", "Everyone seems to miss the point that you're not supposed to do whatever the second phrase is.", "How big is feel like a big ass f****** a horse with no damn tail there's no way in hell that I will work with a woman that did and got on some f****** Thai stick look like that that is so disgusting but hey she feel confident enough to wish it like that and I'm quite sure if she had everybody is looking at her and laughing because that what she got on it then so don't feed her she is too damn big", "Haha if most of yall got millions handed to ya you'd be dead or flat broke by now. Lol. Smh. He was the better selection of money maker or criminal. PS....Donald Trump never called the black community \"super predators\". He didn't run against M.L.K. And Malcolm X either.  The Goldwater girl Hilary did though.  Get your mind right.", "I really dont understand why fleeing from the cops is a death sentence. Is that the actual law? If you run from the police they have legal right to execute you on the spot? They really should put that on the side of the cars as opposed to \"Protect and Serve.\" I dont feel protected or served by law enforcement. They do not do anything for me that I am unable to do for myself.", "More , we need more of this.", "Bitches been getting fake titties for decades!!! Now that they emulating a culturally African feature in the ass, it's a problem. Well yo I don't care if that ass fake, long as that ass shake!", "Ummmmmm she equated it to an Xmas without snow...\n\nWasn't this heifer in California!!!", "People actually listen to this garbage? Homeboy sounds like he got a dick in his mouth.", "I know when u work in a place like this they tell you to let them take the stuff but I would have made sure one of em got something up side the head lol", "There's an art to drinking and getting high.\nSmoke your weed and then you drink.\nDo it the other way around and you'll be fucked up and sick at the same time.", "That cop had bad judgment. First doing this in the middle of the street, then actually running in the direction of the on coming car? If he had just stood still he would have never been hit!", "I don't really like the mc rib i didnt even know they had a 50 piece i just go to McDonald's for breakfast on my way to work there or dunkin donuts if she's willing to go this far for a damn mc rib it must be important lol but for thanksgiving though that's just ridiculous u can damn near get a turkey for free lol whose her parents some stoners lol", "Thought it was Santa for a second. Like what have I been imaginating?", "I ain't even gon lie. I would eat them groceries", "When you smoke 2 more joints cuz the first one \"didnt work\"", "Too much of an eye sore", "You can't calm the storm, so stop trying. What you can do is calm yourself. The storm will pass.", "I'm praying that this was just a sick joke. She is so high off crack it's scary. Hope the kid is okay. Then again I hope the kid didn't think it's okay to be sexually active at his age. This is crazy.", "The fact that it is says medium troubles me how much is a large?", "He toe tagged it with no hesitation or doubt #Kemba I'm getting the album", "Hahaha Obama's \"fight against terrorism \" was/is a joke. He helped create the problem and did NOTHING but sympathize with extremists and tell all of us that we should do the same. Fuck Obama and this bullshit.", "Hell no ...u can see a cloud of dust around that big ole sucka hahahaha", "He made a \"ping payng\" sound when hit the road.", "Unless he sends it to the right woman who ain't boring lol", "Harambe is just a fucking gorilla", "So much for thicc and thin. Lol niggas gone learn to stop marrying these famous sluts and think its gone be forever. She proly know they fina kill him so she just makin sure she dont be around when he drown in a tub on his bacc.. With scuba diving gear. \n\nWatch this nigga death be another Whitney.", "Fuck that he murdered him but of course the system of white supermacy won't allow it's own to see the full extent of justice the DOJ is a joke it's totally racially biased this is the same country that had the audacity to talk down on Fidel Castro", "That's going to be you Estevan Ibon this weekend lol", "Heather Pirri I find this so funny .. Like I just started laughing in the middle of class", "Those \"peaceful refugees\" are assimilating quite nicely I see. Picking up right where they left off. Attacking and raping men, women, and children. Killing innocents, and forcing their culture down their host's throats. What's not to love? Sure is a shame Clinton didn't win, then we would have been able to bring all the loving, accepting,  tolerant refugees we wanted!", "Okay, any American/Mexican on this post who's blaming refugees should just sit his bitch ass down and get off the internet. America is the most violent place on earth.", "Why was the dad even trying to reason with these piece of shit punks? He had already been hit once. Man the second one of these little fuck boys touched him he should have knocked their asses into adulthood.\n\nThese kids deserve to get their ass beat and then their parents deserve to get their ass beat for raising such shitty humans.", "When you lack knowledge of self beauty...", "I'd rather do that to the people in the back who were less fortunate and couldnt afford to pay thousands for a ticket.", "They just cropped jayz and tigers faces and put em on these little kids heads", "05:00 sound like a fluffy plush animal tho", "I don't think white boy knows India isn't a middle East country .", "This is pre written and super garbage. Fire ? Huh? I literally can freestyle off the dome better then this.", "I'm sure they gave him attitude... probably because he wanted something done that couldn't be... that's how it is in retail, you tell a customer no and they run tell the manager about your \"attitude\". That's probably what happened.", "Every country needs more Muslim refugees. They have been known to quickly adapt. Also they really belive on women's rights, especially the right of a woman to refuse sex with them.", "Watching YC the Cynic evolve into Kemba is pure epicness.", "So you just letting the dog shit in the house wtf my stomach is hurting thinking of cigarettes and shit and you broke talking about I need my dollar back mannnn the first just passed smh I guess ur phone bill paid", "Hit him with the Mmm bop, bip a dop bop doowap bitty bop op doowap bip op a dooooooo yeahhh ee yeahhh!!!", "Serves him right leave the animals where they belong lol", "That's what's wrong with MY people. BLACK men always want to put down their own people. Get a life Young Thug!!!! They probably already deal with racism at  work. Help ya people, uplift them not put them down.", "I guess that was his stop!  HAHAHAHA  Words of advice...the ones that run their mouths are pussies....watch out for the quiet ones.", "Coincidentally looks like this went down somewhere near Texas A&M and who spoke there a few nights ago? This dude was probably front and center for Richard Spencer. He's got the two top qualities: white and dumb as fuck", "It's pretty sad that the Chinese school board knows how to do thighs right while over in America you got to shoot the kid in order to get them to listen", "This is the reason why so many African Americans fear for their life over petty crimes. I agree all criminals deserve to be served but they should all be served equally not like this.", "My high school,  graduation night.  Two cars, one leaving a party, one heading towards it collided.  7 kids from the senior class all died.", "I say self defense!!!!!! He was defending himself from the gangsters/thugs in the uniform with the little star badge on it he is innocent, they probably had guns pointed.at him I mean he was scared for his life can't blame him !", "Dude was pointing a gun at em lats sec of the vid.  Bet he selling this dude crack or sum n he a roudy customer haha.", "Tickets available for the HUSALAH OF THE MOB FIGAZ feat P-DIZZ for purchase. \"Like\" P-DIZZ and message him for ticket details", "My son did this shit to me, and I didn't find it funny, I was so scared for him! I was pissed when he was like it's a joke \" bad joke'  im a g but dam a body?", "Damn where is Tyler The Creator. Someone been listening to him. Not saying he stole his style or anything, but it reminds me of him.", "I think he should really chill b4 the migos get fed up n get rid of him i dnt understand y keep goin if a nigga aint tryna to fuk u, if a Nigga aint tryna fuk wit me shit ok bcuz its more important things in life then to beef with someone shit is old i dnt understand y some of these rappers do that nd especially for lil stupid lil baby ass reasons he should let them niggas b and keep doing wat he doing i mean he is just somewhat and i say somewhat relevant", "I'd have a 2 dollar bill, that the cashier would think was fake.", "Rochelle. More than 3 good things happened this year. You and your sister survived a terrible accident, friends and people we don't even know prayed for us and supported us, you were given a beautiful horse, you have new and strengthened friendships, you go to an incredible junior high school, and sisters and a Dad who will do anything for you out of love and caring. <3", "Just remember the reason for the season.  Merry CHRISTmas to you both.", "Oh well that's what happens when you bring weapons to school. These violent \"thugs\" need to be dealt with before they hurt someone right? Rolls eyes", "Everybody ratchet, from the girl sucking dick while smelling dog shit, to the boy getting sucked off bringing a girl home with dog shit everywhere, to the mom who recorded all this nasty shit, while acknowledging the dog shit and filth....", "Once I  bought a stranger's kid a soccer ball. Little man was begging his dad for the ball so bad that it reminded me of my childhood or when I would ask my old man for something. \n\nWhile waiting in line and seeing the kid crying I took out a twenty dollar and hang it over to the Kid's mother; and told her \" Para su hijo feliz navidad\". \n\nThat day I walked out of the store proud with a smile on my face. Not a day goes by regretting what I did for that kid.. \n\nMoral of the story open up your heart and give a little..", "Wrote stuff like\n\"Weeknd go get a haircut\" etc\n\nAm i the only one that think these two look the same??", "Wow this is major news? How about these so-called busy cops shooting unarmed people in the back? Do a piece on that motherfuckers !", "This post has some ppl thinking about the sins they committed and whether or not they are doing right by God smh", "Right hit by a \"drunk driver\". You ain't slick we know that's a cop that hit another cop.", "That's the son of the Late Bruce Lee", "Not one black person there, but you hear nigga several times! Somewhere a nigga is being blamed for teaching them to fight and yell nigga...smh", "Wonderful to see act of kindness just him wiping his tears in disbelief is just moving nice to see deserving ones get gifts they actually appreciate n u know they will use it unlike most kids who are use to having everything they don't appreciate it the gifts as much the next day the toys u baught them will be on The floor etc but this is just beautiful to watch xx", "Rocking vlone while I'm rocking off-white....that's too much sauce ayyy", "Look, wanting justice for people incorrectly shot by the police is correct, and what we all want, but wanting other cops to die who have nothing to do with it, that's immoral.", "Or Speak Of Old Rare Species Of The Albino Wookies Language", "Sad all you fucks being disrespectful but I guarantee you don't have anyone like that who will be by your side when you're about to die", "\"You yapping to Axle Foley\" lmao!! Just so happens I'm watching Beverly Hills cop at this very moment. Eddie Murphy plays the cop Axle, you yapping to the police!! Lol that's tight", "Lmao this mfer screamed like one of my ex tricks when I went in the back door", "That would be one rich ass baby momma. Think of all the extorting she could do.", "Why did he pull dude into it?", "There's always a fish out there dumb enough to take your bait , you can spit on s Canvas call it art and have it sell for millions.", "Omg ppl don't take this so serious this is a challenge going on social media where you text your parents that you hit someone so you can see what they will do. You tell them you can only text so you can screen shot the convo and post it.", "4 years for every body 36 lives might as well call it life allreddy a sorry dosent bring back lives and traped 1st floor dosent say its a safe place to make a party on the second floor sorry but its true lot of lives lost and he put his ego first of throwing a party while ppl told him not to let him learn  his lesson", "I bet he snapchatted that 2."]