[[], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], [], [], ["Is this the guy from Forney Factor Graphs"], ["This is just fantastic! \nI love the concept but I am moving away from more humanizing to more modification of that which we have around us.\nHmm how would I redesign this? I like the concept of sweating but I think that is a very human thing and as creators we want to design things similar to us, but since I watch so many Kraft brothers show with my kids I tend to look at animal 'superpowers' as they say it in the show.\nMaybe for me, flapping, dilating and releasing heat.\nI have worked with water as cooling tools before.\nGreat job  love it.", "Laying the foundations for the T-800 series...", "Where does it generate it own sweat from"], ["If they had made a balloon using layered He / H bladders would that reduce the explosion hazard, at least until a leak occurs.", "You are a nerd!\n(And ironically, your great grandmother's maiden name was Graf!)\n<3", "Zeppelins can go to the moon? Then why do we waste so much money on rockets? Thanks Obama.", "How much time did it take to cross the Atlantic?"], ["We don't know how the brain works, so we can't make an artificial brain. If you want ai, you must understand human intelligence first.", "I personally think VR will populate to end users quicker than AI.", "Why is \"Her\" from 2013 not on the list? http://m.imdb.com/title/tt1798709/"], ["Also note that the The IEEE Masaru Ibuka Consumer Electronics Award is named for him!", "Hello friendz\nKya aap online work krna chahte hai. Part time work hai. Salry 10000-12000/- monthly. Qualification: 10 th+ internet knowledge. Jyada jankari ke liye aap mujhe msg kr skte hai 8094544466\nNote: No registration fees. 100% free hai."], [], [], ["wow congratulations brother ...God bless our family of Electrical &Electronics Engr..#ele/computer engineering", "i am a graphologist ( handwriting analyst ) \nexperience of 11 year\nWhat does your handwriting say about you?\nThe process of analysis handwriting is called graphology. \nGraphology is the analysis of the physical characteristics and patterns of handwriting purporting to be able to identify the writer, indicating psychological state at the time of writing, or evaluating personality characteristics.\nif need , services available"], ["One would require a conducive environment (such as this platform) to sustain the innovation engine & milk its creativity juice, ie. monetize on capital resource investment.", "I like IEEE's  hardwork, that it documented everything and made a standard, thanks :)", "but past failure is sure not a blueprint for future success.", "I carry to hard work with cessesfull life"], [], [], [], ["X15 was a missile with a pilot..", "1963 - so what have we achieved since then that we won't know about but our grandchildren will? Sad isn't it? Achievement only goes to the dead or those that survive long enough for their brilliance to become public."], ["Welcome to the new world in paradise"], ["How is we know this but i cant buy a stud finder that works?", "Yeh toh pata hai pahale se hi.Whats new in this?", "Finally we have signals from the mars"], [], ["not interested in Iranian self driving cars! good luck to you!", "Do you havethe Yellow Wire Yet, Auto-Pilot On Cars <3", "UmmnmnCmnC...where's miss CT...do you know her.......(well nvm)"], ["I guess they will always need someone to programme the robots ;)", "Yes. I teach struggling readers how to read. YouTube is making my job obsolete.", "We human have some logics, just only Waiting..... N roborts never Waits. It just give cordable output..", "Life is getting too easy for man. Automation taking over.", "Not if you're a programmer, or can robots code?", "Hazim Kharouf mawdu3 lal VS ?", "http:// paytoday.online/ index.php?ref=10 3589Just click on this link and make your decision.It worked for me.", "hello hello hello!!!!  to all who want to acquire new ECG meters.     but want someone to authenticate your installation( wiring for you)   I have all the instruments to do so.   secondly all those who has electrical problems kindly contact me.    maybe you are paying too much bill???      or  having electrical shock in your own house!!    call me now!!!   0508973770   WWW.Facebook.com/cewpofghana"], ["Taking a long ship out in the middle of water, not having any idea where you were going, must have been a strange feeling."], ["A.I explorers can take over the galaxy for us."], [], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["the drones is signal oriented according the tech"], ["Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["Yup, electron is actually ancient Greek for amber.", "Today very power full and dangerous", "Ye toh disha ke 12 clsss ke boook me bhi isssme naya kya hai", "Silk, Ruby make for good eleciccum elctro-static field to Poynting Vector/ Manifests& Shields - <3", "Hi :D wow my page has 200k likes now :D best site -> Aqua Liker .com (Search On Google <3 )", "Moeez Shakoor Malik Zaeem Awan Ehtsham Riazat Taimour Malik's Hamza Aslam"], ["I dont understand why some people dont care. People govern... For now.", "I think I should be worried", "My computer breaks down all the time. What about A.I reliabilty ?", "in the future, robot maybe can gossip you 555"], [], ["Jamie Wu Was this the thing you mentioned before?"], [], ["Cass Iterite Taking reference from our field experiences, we are intelligent after all! :D", "This is Darwin's saying.\nPlease check your resources again.", "Consistency and steadfastness is also a sign of intelligence.", "Crocs must be really intelligent then.", "May be intelligence is not to adapt rather resist"], ["Because technology also gives rise to make it easier to cheat and not be caught, with higher risk, higher gain and less transparency.\n Imo: we will ultimately need an AI to run it.", "Couldn't social security numbers be used to identify voters?  We could vote from our computers, save money.", "Those dudes gotta pay for the wire transfer just like our bank account."], ["Salute to the person for his innovations and who did so much for the medical profession"], ["With Trump moving in by artificial you mean fake obviously"], ["If you're still thinking of working in an oil company an hoping that Nigeria economy will recover because some sudden increase in oil price, well my friends the truth is this is the future.... Cos the world follows innovations....and EE rocks", "If you don't get caught in traffic on I-95!"], ["Should i be worried that Artificial Intelligence could eventually take my job? No. But i should be worried that the owner of artificial intelligence could eventually take my job.", "That's what general media futurism has said all along. It's all wrong. It is ourselves people that creates Artificial Intelligence. Fake projections of future living!", "you should be more worried about it taking your life. #judgementday #skynet", "Why is is on think or swim though? Haha Derek Ehrsam Matt Sousae", "I will be delighted when it will happen. Stop wasting time", "Then humans can start to do what they are good at: creating, inventing and discovery. Leave the robots to do the menial work, they don't mind doing, trust me. We don't have to make those ones sentient. We'll all be receiving a general communal wage, as long as we contribute to society, for those that are able bodied and those that aren't are exempt. If we're so educated and creative we'll create our own income from personal business. The population will be at a more reasonable reduced level by then.", "Reckon a robot won't use mechanical fingers to communicate electronically with another IoT hardware such as computers via keyboard. \rHowever, A.I. w/ 5-fingers hardware could be more efficiently used like a prostatic arm extension in a M2B environment (M2M+B2B = M2B), eg. Machine-to-Business applications.", "well.. thats the reason why they make AI !  :-) cheap labor", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], ["I'm really inspired by Peter Thiel", "The biggest break through was the wireless adapter and also the CISCO Call manager Telephone interface for VOIP.  However, the first time I saw both was on a SYMBOL Barcode scanner portable PDA."], [], ["Why not to use the Millenary Science Model??? https://www.bebee.com/producer/@ptharso/modelo-tridimensional-da-consciencia-humana  . Is possible use this model to Talent Management and Health https://www.bebee.com/producer/@ptharso/balance-healing-astrology-chinese-medicine", "Malpractice of Psychology by these Indian Doctors! Dr. Vijay Seshadri of Care Hospitals, Banjarahills, Hyderabad and Dr. G. Jagannath of Asha Hospitals,  Banjarahills, Hyderabad.\n\n2010: I have been given 8 rounds of brain shocks (ECTs) in 8 consecutive days without my consent, without any counseling, just based on one-sided information feedings by my beloved family members/Relatives. I lost my recent memories for few months as a result of this brutal treatment, my ambitions got melted away and become a deadman living since then!\n\nDr. Vijay Seshadri, Care Hospitals\nRoad No.10, Banjara Hills, Hyderabad, Telangana - 500034\n\nFacebook profile\nhttps://www.facebook.com/vijay.seshadri.98/about\n\nYouTube \nhttp://www.youtube.com/watch?v=6J3oJs7-AjI&sns=em\n\nDr. G. Jagannath, Psychiatrist \nAsha Hospital,\nPlot No. 298, Road No.14,\nBanjara Hills, Hyderabad\n\nwww.ashahospital.org\n\nDr. A Jagadish, MD Psychiatrist\nDepartment of Psychiatry,\nNIMHANS, Hosur Road,\nBangalore-560029\n\nhttps://in.linkedin.com/pub/dr-jagadish-a/48/a35/249", "https://www.youtube.com/watch?v=VnCDBm8OhEY\nMust Watch Friends\nIf  You like this Video,\nPlease go and Subscribe this YouTube Channel to encourage the Engineers doing hard work in making videos for you frnds..."], [], [], ["Well, that's an idiotic statement - as though the two were mutually exclusive when they are in fact fundamentally complementary.", "I like the sentiment,  but I do wish we'd pay more attention to some traditions... Like privacy, for example."], ["the symbolic ethics of cleansing is a matter of thought in conception ... not a matter of paper notes & coins & their accounts in materialistic gain ... human ... rights are more humane than you think ... in choice of understanding this issue ... of old gold ,,, in material sound of word ... hum ... an expression of an ah@ eh @ ihuh! ohho! uh! @ oh la de la!... or more----------------", "Funny because all IEEE data is behind a pay wall. Why do memebers have to pay $16 to read a paper?", "??????? ?????? ?????? ??????? is this not an extension of Legal Image & Legal Likeness Protection . ??????? ?????? ?????? ???????"], [], [], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "GREETINGS TO THE GENERAL REPUBLIC OF NIGERIA. NIGERIA CUSTOMS SERVICE AUCTIONING OF VEHICLES AND BAGS OF RICE HAS COMMENCE.PER BAG OF RICE IS#6,500. INTERESTED BUYER SHOULD CONTACT THE CUSTOM OFFICER. BABATUNDE GOODLUCK {09066684947}FOR CLEARANCE AND DELIVERY. RECRIUTMENT FORM IS OUT FOR #8,600. We sell all kind of tokunbo vehicles at afordable price Like  toyota camry spider 450,000!toyota sienna 400,000!toyota camry2.2 350,000!toyota picnic 350,000!toyota venza 650,000!toyota highlander 750,000!toyota avalon 450,000!toyota corolla 450,000!Golf4 350,000!Toyota prado 800,000!Nissan morano 650,000!4matic 450,000!conpressor 430,000!toyota hummer bus 400,000!Tiper 850,000! 4runner 450,000!toyota Hilux\n 600,000!\nLexus rx350-600,000\nLexus rx300-400,000\nLexus rx330-450,000\nHonda accord 350,000\nHonda crv -400,000 and  more exclusive ones.Those vehicles are in good condition.THANKS FOR PATRONISING WITH US.", "*hello friend kya aap online work krna chahte hai. Study se lekr businessman tk koi bhi person kr skta hai part time work hai, salry 8000-10000/- per month, Qualification 10 pass. Jyada jankari ke liye aap mujhe wtsapp msg kr skte hai. Type \"JOB\" 8094544466 THANKU**"], ["I Ate a A Wise Pizza :O :O"], ["Bosnia and Herzegovina Medical and Biological Engineering Society is presenting you\nInternational Conference on Medical and Biological Engineering B&H, organized in 16-18/03/2017, Sarajevo, Bosnia and Herzegovina. This is the scientific, exciting, informative and inspiring Conference with\naim of sharing ideas, experiences, best practices and latest\nadvancements in biomedical engineering and all related fields. The scope of the Conference is to focus on the fields of medical and biological engineering. CALL FOR PAPERS IS EXTENDED TO 20/11/2016. #cmbebih2017", "Janit Bansal  Mayank Abrol Aarzoo Bansal Aashrita Goel"], [], [], [], ["Good morning dear Natasha. God bless you. Have a nice day with lots of love."], ["\"Artificial Intelligence is making its way into The White House.\" No. Wrong. Stupidity is making...has made its way into the white house.", "We're going to have to \"teach\" it via direct democratic votes on policy, not representatives or 1000 page laws.", "A hero president perhabs \"but hi just run out for change ,next AL :)", "I can't respect policy of America"], ["Dangerous, once human interaction is taken out of the equation what will humans do?, A.I will work as it was designed to do but it will also recreate itself and learn on its own to streamline and work efficiently that surpases the human capacity, an intelligence designed to outperform and outhink its designers will find a way to prevent itself from being shut down if its necessary to do so by its designers,  computers all have a back door for designers to shut down in the event of a problem encountered, the only reason for advanced computer systems is not for the betterment of mankind but for the betterment of the bottom dollar, creating systems such as these are very similar to the movie \"terminator rise of the machines\" this scenario is not far off from whats being proposed now and in the future, as the old adage goes, \"if theres a way in theres a way out\" tread carefully or we'll be the ones to be treaded on.", "Neoliberalism and Neocapitalism = Neo-Non-Cash-Operations (as stupid as nonsense it is)\n\nLife always was, is and will be most valuable than each other stuff.\n\nHave fun and have Life.", "You have not visited India. You have n't visited diamond market, textile market, ceramic industry, manis market bombay, law garden market Ahmedabad, chauta bazaar surat etc. Technology aside and customer interaction aside.", "Good morning dears Have a nice day with lots of love.. God bless you.", "That's lots of jobless people.Then who will buy your products? Robots?", "peoples will loose more jobs due to automation and hmi introduction.", "I will be monitoring from the street behind my house! Let's compare the margin of error on the prediction then !", "That's so sad... so sad, what my son will do to live in that tech future... so sad", "Dei pannadaingala neengalam oru vaati ithumaathiri kandupidikarathunaalathan youngsters lam velaye illama irukaanga. Naangalam engada povom. Ippave evanum vela kodukamaatran", "How dumb can you be you're not advancing technology for Humanity your trying to kill human you put it in the movie you dummy that's how smart you are building a machine to take your place red fox would say you big dummy", "The answer probably is Mars, is it?", "Sir, where are the humans going to go then?", "Haha, funny how they failed to highlight \"Europe\"...", "Most Labour intensive industries - like the Steel industry!", "Seems to be more philosophical and optimistic views to viewers", "I think Tourism is in pressing need of benefit from technologies ."], ["Stakes are too high , and crooked politicians and backers will do whatever to get an upper hand . Even auditors can be bought, and legal system is not impartial. Not really a tech challenge.", "Fraction Magic is a good example of how digital voting machines are creating more harm than good. I think the US should envision a move to a secure proof-of-work voting algorithm like what's presented in zerocash: the ability to verify votes for a candidate while preserving the anonymity of the voter.", "The day electronic voting is fully implemented is the day democracy is dead"], [], ["Need this kind of platform on a project that I need your team to partner with on it."], ["Greatness takes time? No, greatness takes patience on the part of your funding agency.", "And Tesla was definitely a scientific man...!", "Sir Nikola Tesla \nGreat scientist and innovator.", "Great Saying from Great Nikola Tesla !"], ["The White House has chosen complexity, which enables deception...which the Federal Reserve System needs to maintain privelege. However, AI and deception are not a good mix...but there is an alternative.", "robot have greater care than love and they are selective", "My friend to see the sun and the moon and the stars and planets to see the sea, rivers and oceans look at plants and animals and fish to see the man and the question of who created all these. All creatures. Not created by chance or create itself Allah the Creator of everything allah does not have sons.allah not born Say No god but Allah and Mohammed. prophet. hope my friend's ability to imagine God created man in his greatness, God created Adam without a man without a woman and the creation of Eve from-Adam, - which is only a man without a woman and create Christ Jesus the son of Mary, the only woman without a man and a man's creation o from man and woman.This confirms that Christ Jesus born from Mary -, and he is apostle allah prophet him. christ gesus is creature- born of -mary- and which is born of the creature was creature and the creature which is Christ Jesus the son of Mary, my friend Ny_khas. allah the Creator of the universe and all beings and humans - including Christ Jesus the son of -Mary .--- The Messenger muhammad of Allah, peace be upon him said: \"It is seen that there is no god but Allah alone with no partner, and that Muhammad is his slave and Messenger: and Isa Abdul Allah and his Messenger, and his speech was delivered to mary and the spirit of it, and that paradise right and a right shot, enter the paradise of God of the eight doors O wills \".---------- allah say -In the name of allah, the Beneficent, the Merciful.\n[112: 1]\nSay: He is Allah, the One!\n[112: 2]\nAllah, the eternally Besought of all!\n[112: 3]\nHe begetteth not nor was begotten.\n[112: 4]\nAnd there is none comparable unto Him", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["GROW your money By 50%(Bitcoin) and 30% by local currency every month here. Stop doubting it, it pays for real, Time is money and money is time. No time to waste.  Click here for your registration...https:// gethelpworldwide.com/?ref_id=12053- Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. watassp me on for more info 08178340207 OR Call 08064709139...Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com. Dont let inflation kill your money in Bank. No Bank can Give You 50% to30% interest within 30 days. Embrace this Unique Opportunity and Thank me later. Get Help Worldwide - #1 World's Mutual Financial Aid Community gethelpworldwide.com"], ["Apple...\nCreating garbage since ancient times.\n\nI believe the last 'good' model was 2012.\nBut nowadays they sell a 'Pro' (it either stands for prototype or profit) with a dual core CPU.", "That nice, but unless is for any industrial usage what general consumer storage device can write (or even read) 5 GigaBytes per second?", "What I'd like to see is wifi to one or more 5K screens. Drop the wires all together. Perhaps a way to offload processing to a central Mac cluster - then the absolute speed of the laptop is less important. A lightning port beside the earphone jack, so that my new iPhone earbuds could plug in to the new Mac. And touch screens would still have been nice.", "But Traditional hard disks are not that fast. Hence this is just a selling point.", "But it will still take 14 hours to record that video. :)", "USE it to believe it? :P", "You don't need to wear make-up all the time when u have that neat,flawless skin ,get rid of rashes,pimples, black spots,eczema ,and any bacteria on the face....have a smooth skin today and contact us too for your whitening body cream ,all with natural herbs add us on WhatsApp 08038039618 or dm us for more info.....let your skin do the talking."], ["\"An AI-enhanced future could lead to strong economic growth and social progress\" -- Or not. Seriously.", "At this point, \"Artificial\" is the only kind of intelligence we're going to get in the White House...  Hail Skynet!", "Welcome to the 14th European Conference on Molecular Electronics.  President Trump is invited."], ["Tama yan anak at yan din ang unang company na pinasukan namin ni mama mo dito sa Pilipinas sa pamamagitan ng Mabuhay Electronics Corp maker of Samsung Electronics Appliances.", "Moto from this story \"just start life makes it big\"", "Wow. You gotta start somewhere, anywhere. Hcull Adam Samson Grayson Day Desmond VLad"], [], ["Dartmouth researchers are looking for wrong questions. Who cares if your hands are full and you urgently need to listen to music or play tetris?!! Put the groceries down and do whatever you need to do!! The research motivation is utterly useless and in my personal opinion, \"disgusting\". We live in a world where first world problems get the highest attention because there's money involved and a bunch of spoiled people who have no clue (or care) about what's going on in the world and all they care about is their phones (and/or smartwatches).... do something real."], [], ["Innovation according to Mr. Jobs- stealing and profiting off of your colleagues ideas.", "Too bad Steve's company is no longer innovating", "A leader still needs followers, and a lot more of them.", "Is not easy to show our innovations http://www.fundacity.com/paulo-tharso-ptharso-s-castro", "Leadership is about two things: VISION and ACTION on that vision."], ["donde se realiza el pago de inscripcion?"], [], ["Happy Birthday. Wishing you a very long life, and do not forget we can only love you as much you love us......Hope you know what I mean......Did you get your vaccine this flu season?", "Happy birthday to this lovely person who changed the world.", "As a PC enthusiast, it's a pleasure that I & bill gate share the same birthday.", "Paul von Bruck Amazing,you and Gates are on the same birthday,and both in Seattle.Happy birthday~", "Wishing many happy returns of this special day, to Dear Bill Gates who is making millions of lives Life happier every day.", "HBD Bill Gates and am proud 2 be a user and partaker of Microsoft products.", "Happy birthday Sir... Wishing you for a long and healthy life time ahead... Long live Microsoft-Gates...", "\"And what does a software company?\" \"what is a software?\" Mr&Mrs Gates asked?", "Happy birthday Bill.You have make a world a great place to live.Wish you many more happy returns", "Bill Gates birthday the founder of microsoft .we thank God keeping his asset alive", "Wishing many more happy returns of the day to bill gate sir", "Happy birthday. Thank you for all your contributions both at Microsoft and at the foundation", "Happy Birthdhay to the Microsoft inventor,  Wish to have a long life and a better changing world...", "Happy birthday... For you alone technology is growing faster.", "Happy Birthday To You. Many Happy Returns Of your Day. GOD BLESS.", "Living Legend! .............who changed the era of computing....Happy Birthday!", "Happy birthday Bill.may you live long and continue inventing useful software to the world.", "Great for me as u are bringing colourful life to millions , Dear Bill Gates sir wishing u a very very happy birthday.", "Happy birthday Bill. Wish you many happy returns and more fruitful years ahead. And do have a nice day with family and friends", "HBD 2U, ....All the best n God Bless U & Your Family!!!", "Happy Birthday Sir,please help me with opportunity to make money , you are getting richer everyday.", "Happy Birthday. Wish we could have called you Mr President next year......", "Happy birthday ... wishing you a very long life and healthy life"], ["we have facilities at present for long range transmission..... but the thing is that .. those devices can't be brought to mars... using normal methods.... also this 3x10^8 m/s is the main issue... we don't have any faster wave than that number...ha ha", "Install a repeater/booster on moon, should help make quicker transmissions at certain times, depending on moon's proximity to mars", "So NASA and others say deep space radiation will hurt astronauts. So then we need to minimize the travel time if we want to go (9 months is the number I recall). Can any continuous thrust technology (ion drive?) get us there faster? The benefit of continuous thrust is we might be able to go at non-closest points.", "it will take 6 minutes round trip from Earth to Mars and Mars to Earth.", "Just use gravitational waves for communication or quantum entanglement. Simple -:)", "That is why commenting in FB group as this will take just about 240mseconds from earth station. So fast indeed", "Maybe they'll figure out how to use entanglement  to communicate instantly at such distances.", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], [], ["IEEE, \n\nMotorola Incorporated was a great American  multinational telecommunications company.\n\nMost people would not know the origin or inspiration behind Motorola's company name. \n\nThanks for the trivia!\n\nRegards,\n\nMichael Phandanouvong \nElectronics/Telecommunications Engineer", "Wonder what this worth....I have a simalure model...."], [], [], ["I apologize to my car if I accidentally slam the door too hard or chip the paint, so I guess I will be the first to think robots have feelings.  Sometimes I think they already do. Well, not robots, but programs such as the OS of a computer.  I swear that computers have personalities sometimes.", "There is no emotional side whatsoever.... Its just emulation and illusion .... So I can't answer this silly question... There is no such a thing as \"robot's feeling\"", "Hi. You can get 20 - 50  Free  Likes\nGo to ---> { Fb - tryit. Com }"], [], ["<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], ["It was about time! Well done Chris!", "<3  BOT POWERED BY <3 Abdul Khan <3   \n\nB| <3 OWNER - CHAMPIONS BOT TEAM  <3 B|  BY FAWAD BAIG <3 B|\n\n<3 BOT SITE <3 FAWAD3.TK <3"], [], ["Auto pilot cars, if you introduce it on Nigeria road, I will lock my door and leave for my village farm. I will not come near a highway for the first three months of its trial. Would the auto pilot be able to recognize the battalion of road beggars, legion of truck pushers, uncountable numbers of pot holes,  mountains of garbage left on the road overnight, the desperado danfo drivers, do or die mawa-tricycle operators, and the ever increasing Nigeria Association of highway traders etc?. \nThere is one good thing about it,though; LASMA, Nigeria police, Road Safety, VIO, officials would have to be automated as well. That could be gentle on my pocket. If you know what I mean?", "I cringe of the mere thought of being driven by some unseen 'driver'. But I appreciate the amount of work that goes into this.", "To say, \"If there was an imaginary road\" is redundant.  The road is already imaginary by saying, \"If there was.\"  It should be, \"If there was a road.\"\nAnyway, self driving cars are amazing.  I will just want to wait a few years until many of the bugs have been worked out.", "Auto pilot will fail in Rawalpindi"], [], ["It could run BASIC and APL out of ROM! No abstraction layer or OS in those systems. This was before the DOS era startet with the PC.", "The floppys were 8\" not 9\", I was teaching at IBM GS at that time", "I still have 2 of those drives at home. (Blank disks too)", "The operating system was CPM takes to load the system, it was the best we had at the time", "Ankit Jena.. Think if you had this computer then your previous laptop.. :P", "They sure don't make PCs like this anymore. He'll, IBM sold their PC business to Lenovo.", "You had to be some guru to get anything done on those machines.", "Just like in Stein;Gate. But that computer was a IBN5100 :v", "I got to use one at my dad's friend's home office.", "I played with it when i was young, i miss it :(", "I dont know how to use it", "Anthony Dwyer that's a sick machine", "I learned BASIC programing  using this computer.\nAn emulator written in Javascript \n\nhttp://members.aon.at/nkehrer/ibm_5110/emu5110.html"], [], [], ["Here I present a number of major motion pictures about us robots getting treated like crap by Neanderthals....\n\nhttp://skewsme.com/blog/2014/11/the-hominids/", "thats last thing we need is an emotional intelligent self-aware robot what if we piss it off by accident thats my concern.", "hurting a robot is like breaking a laptop.. i love my laptop/", "Dear  robot :  it is not your fault . Thank you for your kind service ."], ["i am trying to create application for preparing feasibility studies.", "tried & failed, probably, still assessing."], [], ["SIR, CHEAK , PLZ,,,,, TECH -CONCEPT.."], ["I loved flip-phones and would not give open-screen phones a chance if anyone asked me. But I was wrong, open-screen phone carried the day. That flips may be making a comeback suggests that my earlier love for them was not misplaced after all.  While at it, that was the same way I had a misplaced love for hard keyboards on mobile!", "Probably, less likely of screen breaks and scratches.", "Of course yes i don't know why they are very rare now  !!!", "Yes off course I am willing to swithch"], ["Buy a good brand one, and check, you will see that a 9W ledbulb will beat a 23W economic fluorescent or a 100W incandescent... At the end of warranty you will have a fully payback and an extra save.", "It's better to our wallet and our environment and even our helth and it reduces the emission of heat the increase the effects of global warming", "I think a more efficient light source will soon be made available...Watch out for it !!!", "But Harmonic problem occurred in the power system due to this type of non-linear load", "Use led lights or  save power", "Sr 5w 7w 9w 12w ke bulb ki kya pric hai", "am happy to be hear, i think this's were o belong", "But a 60W bulb is cozy when I study!", "Omneya Yahya shofy l posts :D", "LED bulb price is almost 5times than incandescent bulb. Many people are  still calculating this initial cost"], ["any one from you is the student of computer science ?"], ["And we got Mbps grade internet few years ago only. Wonder what the Govt. chaps are playing with right now which we will see 20yrs later only", "Ashely King chapter 5 - rise of the ethernet! Lol", "But IIRC, Ethernet began as a wireless technology to link Thinnet LANs across Hawaiian Islands. Coax and Air. Ethernet = Air net.  The UTP  copper version came later.", "It probably best not to assign who invented because depending on whose social academic network  you belong to. It changes.  I belong in the network which has \"US Federal/Military Acquisition Paperwork\" which I have seen along with the void \"government check.\"", "Leonardo Quezada Suarez , Jorge Andres Soto Omerovic"], [], ["Until the Cylons rebel of course ...", "Probably, a bad example for code library have been around since 1960.  A better game sample would be mmorpg which has multiple players and computers."], ["that's awesome 30% , that leaves a space for me :D in the future in 10years I think there will be a big change in our culture , our life thanks to the IOT in a time that we won\"t recognize that there is something called Network or Connection or Wifi , I mean LI-FI in the future :D , so there will be a big amount of success and a big of improvement in our life , but there is some drawbacks as an example , the children , they will be soooo stupid if there are raised with the same concept and the same way of education , some kids believes that everyscreen is a touchscreen believe me !!! Hoping that life doesn't give us much lemons that we can't make it all a lemonade lol", "Micro -- Particle Colloidal Silver ---->> Transmission electron.", "What happens when the internet goes off for 1 minute"], ["Rahul Singh ...don't know if I should call this coincidence or well....some divine message", "fail everyday learn everyday. it is good for you.", "Failure is the pillar of success"], []]